{
	"id": "89.37",
	"url": "https://www.revisor.mn.gov/statutes/cite/89.37",
	"title": "89.37 DISTRIBUTING PLANTING STOCK.",
	"text": "The commissioner of natural resources may supply planting stock produced or procured hereunder for use on any public or private lands within the state for the purposes herein authorized under such conditions as the commissioner may prescribe for planting, care, and maintenance in furtherance of such purposes.\nSuch planting stock may be supplied for use on any lands owned by or subject to an easement or right-of-way held by the state or by any political subdivision of the state upon payment of the cost of such stock and expenses of distribution, as the commissioner may determine. Such planting stock may be supplied under like conditions for use in any auxiliary forest owned and maintained by any corporation organized for religious, social, moral, educational, scientific, benevolent, charitable, fraternal, or reformatory purposes and not for profit.\nThe commissioner may supply seedlings, woody cuttings, and transplant material for use on private land, provided that such material must be sold in lots of not less than 250 for a sum determined by the commissioner to be equivalent to the cost of the materials and the expenses of their distribution. The commissioner may not directly or indirectly supply any other planting stock for use on private lands.\n(a) The commissioner of natural resources may supply tree planting stock to organized soil and water conservation districts for soil, water, wildlife and conservation purposes or as prescribed in section 89.35, subdivision 2, upon payment of the cost of the stock and expenses of distribution.\n(b) There is no minimum limitation on the number of trees going on an individual location. The district shall make the determination of the numbers of trees going to each location.\n(c) Resale of trees with roots attached by the districts to their cooperators is permitted if planted in accordance with conservation purposes set forth in section 89.35, subdivision 2.\n(d) The soil and water conservation districts are permitted to resell trees with an adequate amount added to defray costs of handling, grading, transportation, storage, salaries and other costs directly related to planting the stock.\n(e) The district shall keep a record of all trees planted and the locations of the plantings. A record of the plantings shall be sent to the commissioner of natural resources.\n(f) Soil and water conservation districts may establish joint distribution centers, if necessary, to facilitate distribution or improve quality of tree planting stock when approved by the commissioner of natural resources and the soil and water conservation districts so affected.\nTo promote the availability and use of native plant material, the commissioner may sell native tree seed to licensed, private Minnesota nurseries when supplies of seed from geographically adapted sources are not available from private Minnesota seed dealers. The commissioner may also sell native trees and shrubs in lots of ten or more to nonprofit groups and local units of government.\nAll money received in payment for tree planting stock supplied under this section shall be deposited in the state treasury and credited to a forest nursery account and are available to the commissioner of natural resources for the purposes of sections 89.35 to 89.37, including up to $250,000 per year for forestry education and technical assistance.\nIncome earned from the investment of funds in the forest nursery account beginning July 1, 1989, shall be credited to the account and are annually appropriated to the commissioner of natural resources for the purposes of sections 89.35 to 89.37.\nAll promotional materials for public cost-share programs for tree planting shall address the eligibility of private nursery planting stock.\nThe sale price of planting stock and native tree seeds distributed by the commissioner under this section is not subject to the rulemaking provisions of chapter 14, and section 14.386 does not apply. The commissioner may establish the sale price of planting stock and native tree seeds notwithstanding section 16A.1283.",
	"repealed": false
}