{
	"id": "256.014",
	"url": "https://www.revisor.mn.gov/statutes/cite/256.014",
	"title": "256.014 STATE AND COUNTY SYSTEMS.",
	"text": "(a) The commissioner of human services shall establish and enhance computer systems necessary for the efficient operation of medical assistance and other programs the commissioner supervises.\n(b) The commissioner's development costs incurred by computer systems for statewide programs administered by that computer system and mandated by state or federal law must not be assessed against county agencies. The commissioner may charge a county for development and operating costs incurred by computer systems for functions requested by the county and not mandated by state or federal law for programs administered by the computer system incurring the cost.\n(c) The commissioner shall distribute the nonfederal share of the costs of operating and maintaining the systems to the commissioner and to the counties participating in the system in a manner that reflects actual system usage, except that the nonfederal share of the costs of the MAXIS computer system for statewide programs administered by that system and mandated by state or federal law shall be borne entirely by the commissioner.\nThe commissioner may enter into contractual agreements with federally recognized Indian Tribes with a reservation in Minnesota to participate in state-operated computer systems related to the management and administration of the medical assistance program to the extent necessary for the Tribe to operate the medical assistance program or any other program under the supervision of the commissioner.\nA state systems account for the Department of Human Services is created in the state treasury. Money collected by the commissioner of human services for the programs in subdivision 1 must be deposited in the account. Money in the state systems account and federal matching money is appropriated to the commissioner of human services for purposes of this section.\n[Repealed, 2005 c 98 art 2 s 18]\nPayments to the commissioner from other governmental units and private enterprises for: services performed by the issuance operations center; or reports generated by the payment and eligibility systems must be deposited in the account created under subdivision 2. These payments are appropriated to the commissioner for the operation of the issuance center or system, according to the provisions of this section.",
	"repealed": false
}