{
	"id": "477A.17",
	"url": "https://www.revisor.mn.gov/statutes/cite/477A.17",
	"title": "477A.17 LAKE VERMILION-SOUDAN UNDERGROUND MINE STATE PARK; ANNUAL PAYMENTS.",
	"text": "(a) Except as provided in paragraph (b), in lieu of the payment amount provided under section 477A.12, subdivision 1, clause (1), the county shall receive an annual payment for state-owned land within the boundary of Lake Vermilion-Soudan Underground Mine State Park, established in section 85.012, subdivision 38a, equal to 1.5 percent of the appraised value of the state-owned land.\nFor the purposes of this paragraph, the appraised value of the land acquired for Lake Vermilion-Soudan Underground Mine State Park for the first five years after acquisition shall be the purchase price of the land, plus the value of any portion of the land that is acquired by donation. Thereafter, the appraised value of the state-owned land shall be as determined under section 477A.12, subdivision 3, except that the appraised value of the state-owned land within the park shall not be reduced below the 2010 appraised value of the land.\nThe annual payments under this paragraph shall be distributed to the taxing jurisdictions containing the property as follows: one-third to the school districts; one-third to the town; and one-third to the county. The payment to school districts is not a county apportionment under section 127A.34 and is not subject to aid recapture. Each of those taxing jurisdictions may use the payments for their general purposes.\n(b) Beginning with aids payable in 2022, for land within the boundary of Lake Vermilion-Soudan Underground Mine State Park designated as the Granelda Unit under section 85.012, subdivision 38a, the county shall receive an annual payment equal to 1.5 percent of the appraised value of all parcels comprising the Granelda Unit as determined for assessment year 2021. In each subsequent year, the county shall receive an annual payment equal to 1.5 percent of the appraised value of all parcels comprising the Granelda Unit for the most recent assessment year except that the appraised value of the parcels shall not be reduced below the assessment year 2021 appraised value of the parcels.\nThe annual payments under this paragraph shall be distributed to the taxing jurisdictions containing the property as follows: one-third to the school districts; one-third to the town; and one-third to the county, except that the annual payment distributed to the county on behalf of unorganized Township 63, Range 17, shall be transferred by the county to the governing body of the public safety facility located in Section 32 in Township 63, Range 17, to be used for ongoing operations and maintenance of the facility. The payment to school districts is not a county apportionment under section 127A.34 and is not subject to aid recapture. Unless otherwise noted, each of those taxing jurisdictions may use the payments for their general purposes.\n(c) Except as provided in this section, the payments shall be made as provided in sections 477A.11 to 477A.13.",
	"repealed": false
}