{
	"id": "508.71",
	"url": "https://www.revisor.mn.gov/statutes/cite/508.71",
	"title": "508.71 ALTERATIONS; COURT, EXAMINER'S ORDER; NEW CERTIFICATES.",
	"text": "No erasure, alteration, or amendment shall be made upon the register of titles after the entry of a certificate of title or of any memorial on it, and the attestation of the same by the registrar, except by order of the court or as otherwise provided in this chapter.\nThe registrar may correct clerical errors or omissions made by the registrar's staff in producing certificates of title. An error shall not be erased or obliterated. The registrar may sign and file a correction document and memorialize it upon the affected certificate of title, or may make a correction memorial without a correction document. The memorial shall show the date, time of entry, the nature of the error or omission, and the correct information. If the error or omission may adversely affect the interest of a party, the registrar shall refer the correction to the examiner of titles. The registrar shall prepare subsequent certificates correctly and omit the memorial of the correction.\nA registered owner or other person in interest may, at any time, apply by petition to the court, upon the ground that (1) registered interests of any description, whether vested, contingent, expectant, or inchoate, have terminated and ceased; (2) new interests have arisen or been created which do not appear upon the certificate of title; (3) any error or omission was made in entering a certificate of title or any memorial thereon; (4) the name of any person on the certificate of title has been changed; (5) the registered owner has married, or, if registered as married, that the marriage has been terminated; (6) a corporation which owned registered land and has been dissolved has not conveyed it within three years after its dissolution; or (7) upon any reasonable ground, that any other alteration or adjudication should be made. The court may hear and determine the petition after notice given to all parties in interest, as determined by the examiner of titles, by a summons issued in the form and served in the manner as in initial applications or by an order to show cause, as the court may deem appropriate. After notice has been given as ordered, the court may order the entry of a new certificate of title, the entry, amendment, or cancellation of a memorial upon a certificate of title, or grant any other relief upon the terms, requiring security if necessary, as it may consider proper. The provisions of this section shall not give the court authority to open the original decree of registration, and nothing shall be done or ordered by the court which shall impair the title or other interest of a purchaser who holds a certificate of title for value and in good faith, or of the purchaser's heirs or assigns without written consent of the purchaser or heirs or assigns. A certified copy of the petition may be filed as a memorial on any appropriate certificate of title which shall be notice forever to purchasers and encumbrancers of the pendency of the proceeding and all matters referred to in the court files and records pertaining to the proceeding.\nAt the request of a registered owner or other person in interest, the examiner of titles by a written directive may order (1) the amendment or cancellation of a memorial relating to racial restrictions, rights which are barred by a statute or rights which have expired by the terms of the instrument creating the rights, (2) upon the submission of evidence satisfactory to the examiner, the correction of the name or designation of a party who is a registered owner or who has an interest registered on a certificate of title, or (3) the deletion of easements or other nonfee interests which are terminated by their own terms or by written instrument satisfactory to the examiner. The registrar of titles may register the directives of the examiner of titles upon the certificates of title, and shall give full faith to the directives.\nWithout order of court or directive of the examiner, the registrar of titles may receive and register as memorials upon any certificate of title to which they pertain, the following instruments: receipt or certificate of county treasurer showing redemption from any tax sale or payment of any tax described in a certificate of title, a state deed issued to purchaser of tax-forfeited land, a certified copy of a marriage certificate showing the subsequent marriage of any party shown by a certificate of title to be unmarried, a certified copy of a final decree of divorce or dissolution of a marriage entered in the state of Minnesota, or in any state, territory or possession of the United States, or the District of Columbia to establish the dissolution of a marriage relationship of any party shown on the certificate of title to be married, and a certified copy of the death record of party listed in any certificate of title as being the spouse of the registered owner when accompanied by an affidavit satisfactory to the registrar identifying the decedent with the spouse. In all subsequent dealings with the land covered by the certificates of title, the registrar shall give full faith to these memorials.\nIn case of a certificate of title outstanding to two or more owners as joint tenants, upon the filing for registration of a record of death of one of the joint tenants and an affidavit of survivorship, the registrar without the order or directive shall issue a new certificate of title for the premises to the survivor in severalty or to the survivors in joint tenancy as the case may be.\nWhen instruments affecting registered land have been recorded in the office of any county recorder in this state, a certified copy thereof may be filed for registration and registered with like effect as the original instrument without the order or directive.\nMS 2000 [Repealed, 2001 c 50 s 37]",
	"repealed": false
}