{
	"id": "462C.16",
	"url": "https://www.revisor.mn.gov/statutes/cite/462C.16",
	"title": "462C.16 HOUSING TRUST FUNDS FOR LOCAL HOUSING DEVELOPMENT.",
	"text": "(a) For the purposes of this section, the following terms have the meanings given to them.\n(b) \"Commissioner\" means the commissioner of the Minnesota Housing Finance Agency.\n(c) \"Fund\" means a local housing trust fund or a regional housing trust fund.\n(d) \"Local government\" means any statutory or home rule charter city or a county.\n(e) \"Local housing trust fund\" means a fund established by a local government with one or more dedicated sources of public revenue for housing.\n(f) \"Regional housing trust fund\" means a fund established and administered under a joint powers agreement entered into by two or more local governments with one or more dedicated sources of public revenue for housing.\n(a) A local government may establish a local housing trust fund by ordinance or participate in a joint powers agreement to establish a regional housing trust fund.\n(b) A local or regional housing trust fund may be, but is not required to be, administered through a nonprofit organization. If administered through a nonprofit organization, that organization shall encourage private charitable donations to the fund.\nMoney in a local or regional housing trust fund may be used only to:\n(1) pay for administrative expenses, but not more than ten percent of the balance of the fund may be spent on administration;\n(2) make grants, loans, and loan guarantees for the development, rehabilitation, or financing of housing;\n(3) match other funds from federal, state, or private resources for housing projects; or\n(4) provide down payment assistance, rental assistance, and home buyer counseling services.\n(a) A local government may finance its local or regional housing trust fund with any money available to the local government, unless expressly prohibited by state law. Sources of these funds include, but are not limited to:\n(1) donations;\n(2) bond proceeds;\n(3) grants and loans from a state, federal, or private source;\n(4) appropriations by a local government to the fund;\n(5) investment earnings of the fund; and\n(6) housing and redevelopment authority levies.\n(b) The local government may alter a source of funding for the local or regional housing trust fund, but only if, once altered, sufficient funds will exist to cover the projected debts or expenditures authorized by the fund in its budget.\nA local or regional housing trust fund established under this section must report annually to the local government that created the fund. The local government or governments must post this report on its public website.\nA local or regional housing trust fund existing on July 1, 2017, is not required to alter the existing terms of its governing documents or take any additional authorizing actions required by subdivision 2.",
	"repealed": false
}