{
	"id": "153A.15",
	"url": "https://www.revisor.mn.gov/statutes/cite/153A.15",
	"title": "153A.15 PROHIBITED ACTS; ENFORCEMENT; AND PENALTY.",
	"text": "The commissioner may take enforcement action as provided under subdivision 2 against a dispenser of prescription hearing aids for the following acts and conduct:\n(1) dispensing a prescription hearing aid to a minor person 18 years or younger unless evaluated by an audiologist for hearing evaluation and prescription hearing aid evaluation;\n(2) being disciplined through a revocation, suspension, restriction, or limitation by another state for conduct subject to action under this chapter;\n(3) presenting advertising that is false or misleading;\n(4) providing the commissioner with false or misleading statements of credentials, training, or experience;\n(5) engaging in conduct likely to deceive, defraud, or harm the public; or demonstrating a willful or careless disregard for the health, welfare, or safety of a consumer;\n(6) splitting fees or promising to pay a portion of a fee to any other professional other than a fee for services rendered by the other professional to the client;\n(7) engaging in abusive or fraudulent billing practices, including violations of federal Medicare and Medicaid laws, Food and Drug Administration regulations, or state medical assistance laws;\n(8) obtaining money, property, or services from a consumer through the use of undue influence, high pressure sales tactics, harassment, duress, deception, or fraud;\n(9) performing the services of a certified hearing aid dispenser in an incompetent or negligent manner;\n(10) failing to comply with the requirements of this chapter as an employer, supervisor, or trainee;\n(11) failing to provide information in a timely manner in response to a request by the commissioner, commissioner's designee, or the advisory council;\n(12) being convicted within the past five years of violating any laws of the United States, or any state or territory of the United States, and the violation is a felony, gross misdemeanor, or misdemeanor, an essential element of which relates to prescription hearing aid dispensing, except as provided in chapter 364;\n(13) failing to cooperate with the commissioner, the commissioner's designee, or the advisory council in any investigation;\n(14) failing to perform prescription hearing aid dispensing with reasonable judgment, skill, or safety due to the use of alcohol or drugs, or other physical or mental impairment;\n(15) failing to fully disclose actions taken against the applicant or the applicant's legal authorization to dispense prescription hearing aids in this or another state;\n(16) violating a state or federal court order or judgment, including a conciliation court judgment, relating to the activities of the applicant in prescription hearing aid dispensing;\n(17) having been or being disciplined by the commissioner of the Department of Health, or other authority, in this or another jurisdiction, if any of the grounds for the discipline are the same or substantially equivalent to those in sections 153A.13 to 153A.18;\n(18) misrepresenting the purpose of hearing tests, or in any way communicating that the hearing test or hearing test protocol required by section 153A.14, subdivision 4b, is a medical evaluation, a diagnostic hearing evaluation conducted by an audiologist, or is other than a test to select a prescription hearing aid, except that the prescription hearing aid dispenser can determine the need for or recommend the consumer obtain a medical evaluation consistent with requirements of the United States Food and Drug Administration;\n(19) violating any of the provisions of sections 148.5195, subdivision 3, clause (20); 148.5197; 148.5198; and 153A.13 to 153A.18; and\n(20) aiding or abetting another person in violating any of the provisions of sections 148.5195, subdivision 3, clause (20); 148.5197; 148.5198; and 153A.13 to 153A.18.\nWhen the commissioner finds that a dispenser of prescription hearing aids has violated one or more provisions of this chapter, the commissioner may do one or more of the following:\n(1) deny or reject the application for a certificate;\n(2) revoke the certificate;\n(3) suspend the certificate;\n(4) impose, for each violation, a civil penalty that deprives the dispenser of any economic advantage gained by the violation and that reimburses the Department of Health for costs of the investigation and proceeding resulting in disciplinary action, including the amount paid for services of the Office of Administrative Hearings, the amount paid for services of the Office of the Attorney General, attorney fees, court reporters, witnesses, reproduction of records, advisory council members' per diem compensation, department staff time, and expenses incurred by advisory council members and department staff;\n(5) censure or reprimand the dispenser;\n(6) revoke or suspend the right to supervise trainees;\n(7) revoke or suspend the right to be a trainee;\n(8) impose a civil penalty not to exceed $10,000 for each separate violation; or\n(9) any other action reasonably justified by the individual case.\nIf the commissioner proposes to take action against the dispenser as described in subdivision 2, the commissioner must first notify the person against whom the action is proposed to be taken and provide the person with an opportunity to request a hearing under the contested case provisions of chapter 14. Service of a notice of disciplinary action may be made personally or by certified mail, return receipt requested. If the person does not request a hearing by notifying the commissioner within 30 days after service of the notice of the proposed action, the commissioner may proceed with the action without a hearing.\nThe commissioner shall establish, in writing, internal operating procedures for receiving and investigating complaints and imposing enforcement actions. The written internal operating procedures may include procedures for sharing complaint information with government agencies in this and other states. Procedures for sharing complaint information must be consistent with the requirements for handling government data under chapter 13.\nIn all matters relating to the lawful regulation activities under this chapter, the commissioner may issue subpoenas to require the attendance and testimony of witnesses and production of books, records, correspondence, and other information relevant to any matter involved in the investigation. The commissioner or the commissioner's designee may administer oaths to witnesses or take their affirmation. A subpoena may be served upon any person it names anywhere in the state by any person authorized to serve subpoenas or other processes in civil actions of the district courts. If a person to whom a subpoena is issued does not comply with the subpoena, the commissioner may apply to the district court in any district and the court shall order the person to comply with the subpoena. Failure to obey the order of the court may be punished by the court as contempt of court. All information pertaining to individual medical records obtained under this section is health data under section 13.3805, subdivision 1.\nExcept as provided in section 153A.14, subdivision 4, a person violating this chapter is guilty of a misdemeanor. The commissioner may impose an automatic civil penalty equal to one-fourth the renewal fee on each prescription hearing aid dispenser who fails to renew the certificate required in section 153A.14 by the renewal deadline.\nThe commissioner shall contract with the health professionals services program as authorized by sections 214.31 to 214.37 to provide these services to practitioners under this chapter. The health professionals services program does not affect the commissioner's authority to discipline violations of this chapter.",
	"repealed": false
}