{
	"id": "97A.151",
	"url": "https://www.revisor.mn.gov/statutes/cite/97A.151",
	"title": "97A.151 LEECH LAKE INDIAN RESERVATION AGREEMENT.",
	"text": "The purpose of this section is to give recognition and effect to the rights of the Leech Lake Band of Chippewa Indians that are preserved by federal treaty relating to hunting, fishing, and trapping, and to the gathering of wild rice on the Leech Lake Indian Reservation. These rights have been recognized and given effect by the decision of the United States District Court in the following entitled actions: Leech Lake Band of Chippewa Indians, et al. v. Robert L. Herbst, No. 3-69 Civ. 65; and United States of America v. State of Minnesota, No. 3-70 Civ. 228. The state of Minnesota desires to settle all outstanding issues and claims relating to the above rights.\nThe definitions in this subdivision apply to this section.\n(a) \"Band\" means the Leech Lake Band of Chippewa Indians.\n(b) \"Committee\" means the Reservation Business Committee of the Leech Lake Band of Chippewa Indians.\n(c) \"Reservation\" means the Leech Lake Indian Reservation described in the settlement agreement.\n(d) \"Settlement agreement\" means the document entitled \"Agreement and Settlement\" on file and of record in the United States District Court for the District of Minnesota, Third Division, in the following entitled actions: Leech Lake Band of Chippewa Indians, et al. v. Robert L. Herbst, No. 3-69 Civ. 65; and United States of America v. State of Minnesota, No. 3-70 Civ. 228.\nNotwithstanding the provisions of any other law to the contrary, the state of Minnesota by this section ratifies and affirms the agreement set forth in the settlement agreement.\n(a) Notwithstanding the provisions of any other law to the contrary, the commissioner, on behalf of the state of Minnesota, shall take all actions, by rule or otherwise, necessary to carry out the duties and obligations of the state of Minnesota arising from the agreement entered into by the parties to the settlement agreement.\n(b) These actions include but are not limited to the following:\n(1) the implementation of the exemption of members of the band and other members of the Minnesota Chippewa tribe from state laws relating to hunting, fishing, trapping, the taking of minnows and other bait, and the gathering of wild rice within the reservation, together with exemption from related possession and transportation laws, to the extent necessary to effectuate the terms of the settlement agreement;\n(2) the establishment of a system of special licenses and related license fees for persons who are not members of the Minnesota Chippewa tribe for the privilege of hunting, fishing, trapping, or taking minnows and other bait within the reservation. All money collected by the commissioner for special licenses shall be deposited in the state treasury and credited to the Leech Lake Band and White Earth Band special license account, which is hereby created. All money in the state treasury credited to the Leech Lake Band and White Earth Band special license account, less any deductions for administrative costs authorized by the terms of the settlement agreement, is appropriated to the commissioner who shall remit the money to the committee pursuant to the terms of the settlement agreement;\n(3) to the extent necessary to effectuate the terms of the settlement agreement, the promulgation of rules for the harvesting of wild rice within the reservation by non-Indians;\n(4) to the extent necessary to effectuate the terms of the settlement agreement, the establishment of policies and procedures for the enforcement by conservation officers of the Conservation Code adopted by the band; and\n(5) the arbitration of disputes arising under the terms of the settlement agreement.",
	"repealed": false
}