{
	"id": "352B.115",
	"url": "https://www.revisor.mn.gov/statutes/cite/352B.115",
	"title": "352B.115 REEMPLOYMENT.",
	"text": "(a) A member of the State Patrol retirement plan who has separated from service and is receiving an annuity under section 352B.08 or has applied to receive an annuity under section 352B.08 may return to employment in the same department and to a position covered by the State Patrol retirement plan as early as:\n(1) the second day after separation from service if the member is at least age 55; or\n(2) the 31st day after separation from service if the member is at least age 50 but not yet age 55.\n(b) The executive director must seek repayment of any annuity payments made to a member who returns to employment before the earliest day under paragraph (a), clause (1) or (2), as applicable. The executive director may waive the repayment requirement if the member's failure to comply with paragraph (a), clause (1) or (2), as applicable, was inadvertent or due to no fault of the member.\n(a) A member's return to employment under subdivision 1 does not impact the member's continued receipt of an annuity or commencement of annuity payments.\n(b) During the period of reemployment:\n(1) the amount of the annuity must not increase or decrease as a result of the reemployment;\n(2) the member must make member contributions as required under section 352B.02, subdivisions 1a and 1b, during the period of reemployment; and\n(3) the member's employer must make employer and supplemental contributions as required under section 352B.02, subdivision 1c.\nThe executive director must refund the member's contributions made during the period of reemployment, plus interest, following the member's separation from service after the period of reemployment.\n(a) Section 352.115, subdivision 10, does not apply to a member of the State Patrol retirement plan who returns to employment under this section.\n(b) Minnesota Rules, part 6700.0675, does not apply to a member of the State Patrol retirement plan who returns to employment under this section.\n(c) Minnesota Rules, part 6700.0670, does not apply to a member of the State Patrol retirement plan who returns to employment under this section, except that the member must be fingerprinted and the fingerprints must be forwarded by the employer to the Bureau of Criminal Apprehension and the Federal Bureau of Investigation.\nA member's right to reemployment under subdivision 1 does not extend or affect the application of the mandatory retirement age under section 43A.34.",
	"repealed": false
}