{
	"id": "514.661",
	"url": "https://www.revisor.mn.gov/statutes/cite/514.661",
	"title": "514.661 LIEN FOR RENTAL VALUE OF FARM MACHINERY DURING MEDIATION.",
	"text": "The definitions in this section apply to this section.\n(a) \"Reasonable rental value\" means an amount not more than the rental value of machinery of like capacity and age as determined by the director of the University of Minnesota Extension Service and is limited to the tachometer time during which or the acreage for which the machinery is used during the mediation period.\n(b) \"Seasonal use machinery\" means machinery, equipment, or implements used exclusively for planting, for row crop cultivating, or for harvesting. Seasonal use machinery does not include a tractor, tillage equipment, or utility implements used for general farm purposes.\n(a) A person or entity with a debt secured by a perfected or unperfected security interest in seasonal use machinery that is subject to mediation who engages in mediation under sections 583.20 to 583.32, as a result of a debtor's default on a purchase money loan or contract, has a lien limited to the lesser of: (1) the total of principal and interest amounts required to bring the debt current until the stay of the creditor's enforcement action is lifted; and (2) the reasonable rental value of seasonal use machinery that is used for field operation during mediation until the stay of the creditor's enforcement action is lifted.\n(b) The lien attaches to the crops produced by the debtor in the calendar year in which mediation occurs.\nTo perfect a lien under this section, the lien must attach and a person or entity entitled to the lien must file a lien statement in the appropriate filing office under section 336.9-501 during mediation or within 30 days after the conclusion of mediation.\nThe filing officer shall enter on the lien statement the time of day and date of filing. The filing officer shall file, amend, terminate, note the filing of a lien statement, and charge the fee for filing under this section in the manner provided by sections 336.9-501 to 336.9-527 for a financing statement. A lien statement is void and may be removed from the filing system 18 months after the date of filing. The lien statement may be physically destroyed after 30 months from the date of filing.\n(a) A perfected lien has priority over all other liens and security interests in crops produced by the debtor during the calendar year in which the mediation occurs.\n(b) An unperfected lien has the priority of an unperfected security interest under sections 336.9-317 and 336.9-322.\n(a) The holder of a lien under this section may enforce the lien in the manner provided in sections 336.9-601 to 336.9-628, subject to section 550.17. For enforcement of the lien, the lienholder is the secured party and the person leasing the property is the debtor, and each has the respective rights and duties of a secured party and a debtor under sections 336.9-601 to 336.9-628. If a right or duty under sections 336.9-601 to 336.9-628 is contingent upon the existence of express language in a security agreement or may be waived by express language in a security agreement, the requisite language does not exist.\n(b) The principal amount of debt secured by seasonal use machinery must be reduced by an amount equal to any amount paid in satisfaction of a lien created under this section, less interest accrued on the debt during mediation.\nAn action to enforce a lien under this section may be brought in district court in a county where the property is located after the lien is perfected. A lien statement may be amended, except the amount demanded, by leave of the court in the furtherance of justice. A lien is extinguished if an action to enforce the lien is not brought within 18 months after the date the lien statement is filed.\nA lien created and perfected under this section is exempt from sections 583.20 to 583.32 and is effective against crops growing or to be grown by the debtor in the calendar year.",
	"repealed": false
}