{
	"id": "256C.24",
	"url": "https://www.revisor.mn.gov/statutes/cite/256C.24",
	"title": "256C.24 REGIONAL SERVICE CENTERS.",
	"text": "The Deaf, DeafBlind, and Hard of Hearing State Services Division shall establish at least six regional service centers for persons who are deaf, persons who are deafblind, and persons who are hard-of-hearing. The centers shall be distributed regionally to provide access for persons who are deaf, persons who are deafblind, and persons who are hard-of-hearing in all parts of the state.\nEach regional service center shall:\n(1) employ qualified staff to work with persons who are deaf, persons who are deafblind, and persons who are hard-of-hearing;\n(2) establish connections and collaborations with other public and private entities providing services to persons who are deaf, persons who are deafblind, and persons who are hard-of-hearing in the region;\n(3) for those in need of services, assist in coordinating services between service providers and persons who are deaf, persons who are deafblind, and persons who are hard-of-hearing, and the persons' families, and make referrals to the services needed;\n(4) if adequate or accessible services are not available from another public or private service provider in the region, provide individual culturally and linguistically affirmative assistance with service supports and solutions to persons who are deaf, persons who are deafblind, and persons who are hard-of-hearing, and the persons' families;\n(5) identify regional training and resource needs and deliver training and resources for persons who are deaf, persons who are deafblind, and persons who are hard-of-hearing, and the persons' families, and other service providers about subjects including the persons' rights under the law, American Sign Language, and the impact of hearing loss and options for accommodating it;\n(6) have a mobile or permanent lab where persons who are deaf, persons who are deafblind, and persons who are hard-of-hearing can try a selection of assistive technology, telecommunications equipment, and other technology and equipment to determine what would best meet the persons' needs;\n(7) collaborate with the Department of Education and local school districts to provide information and resources to families with children who are deaf, children who are deafblind, or children who are hard-of-hearing and to school personnel serving these children;\n(8) provide training, resources, and consultation to human services providers about communication access and other needs of persons who are deaf, persons who are deafblind, and persons who are hard-of-hearing;\n(9) assess the ongoing need and supply of services for persons who are deaf, persons who are deafblind, and persons who are hard-of-hearing in all parts of the state; annually consult with the division's advisory committees to identify regional needs and solicit feedback on addressing service gaps; and collaborate with public and private service providers on service solutions;\n(10) provide culturally and linguistically affirmative mental health services to persons who are deaf, persons who are deafblind, and persons who are hard-of-hearing who:\n(i) use a visual language such as American Sign Language, another sign language, or a tactile form of a visual language; or\n(ii) otherwise need culturally and linguistically affirmative mental health services; and\n(11) establish partnerships with state and regional entities statewide to provide Minnesotans with virtual access to the division's services and training through technology.\nThe director of the Deaf, DeafBlind, and Hard of Hearing State Services Division shall appoint eight advisory committees of up to nine persons per advisory committee. Each committee shall represent a specific region of the state. The director shall determine the boundaries of each advisory committee region. The committees shall advise the director on the needs of persons who are deaf, persons who are deafblind, and persons who are hard-of-hearing and service gaps in the region of the state the committee represents. Members shall include persons who are deaf, persons who are deafblind, and persons who are hard-of-hearing, persons who have communication disabilities, parents of children who are deaf, parents of children who are deafblind, and parents of children who are hard-of-hearing, parents of children who have communication disabilities, and representatives of county and regional human services, including representatives of private service providers. At least 50 percent of the members must be deaf or deafblind or hard-of-hearing or have a communication disability. Committee members shall serve for a three-year term. Committee members shall serve no more than three consecutive terms and no more than nine years in total. Each advisory committee shall elect a chair. The director of the Deaf, DeafBlind, and Hard of Hearing State Services Division may assign staff to serve as nonvoting members of the committee. Members shall not receive a per diem. Otherwise, the compensation, removal of members, and filling of vacancies on the committee shall be as provided in section 15.0575.",
	"repealed": false
}