{
	"id": "256B.6903",
	"url": "https://www.revisor.mn.gov/statutes/cite/256B.6903",
	"title": "256B.6903 OMBUDSPERSON FOR MANAGED CARE.",
	"text": "(a) For purposes of this section, the following terms have the meanings given them.\n(b) \"Adverse benefit determination\" has the meaning provided in Code of Federal Regulations, title 42, section 438.400, subpart (b).\n(c) \"Appeal\" means an oral or written request from an enrollee to the managed care organization for review of an adverse benefit determination.\n(d) \"Commissioner\" means the commissioner of human services.\n(e) \"Complaint\" means an enrollee's informal expression of dissatisfaction about any matter relating to the enrollee's prepaid health plan other than an adverse benefit determination.\n(f) \"Data analyst\" means the person employed by the ombudsperson that uses research methodologies to conduct research on data collected from prepaid health plans, including but not limited to scientific theory; hypothesis testing; survey research techniques; data collection; data manipulation; and statistical analysis interpretation, including multiple regression techniques.\n(g) \"Enrollee\" means a person enrolled in a prepaid health plan under section 256B.69. When applicable, an enrollee includes an enrollee's authorized representative.\n(h) \"External review\" means the process described under Code of Federal Regulations, title 42, section 438.408, subpart (f); and section 62Q.73, subdivision 2.\n(i) \"Grievance\" means an enrollee's expression of dissatisfaction about any matter relating to the enrollee's prepaid health plan other than an adverse benefit determination that follows the procedures outlined in Code of Federal Regulations, title 42, part 438, subpart (f). A grievance may include but is not limited to concerns relating to quality of care, services provided, or failure to respect an enrollee's rights under a prepaid health plan.\n(j) \"Managed care advocate\" means a county or Tribal employee who works with managed care enrollees when the enrollee has service, billing, or access problems with the enrollee's prepaid health plan.\n(k) \"Prepaid health plan\" means a plan under contract with the commissioner according to section 256B.69.\n(l) \"State fair hearing\" means the appeals process mandated under section 256.045, subdivision 3a.\nThe commissioner must designate an ombudsperson to advocate for enrollees. At the time of enrollment in a prepaid health plan, the local agency must inform enrollees about the ombudsperson.\n(a) The ombudsperson must work to ensure enrollees receive covered services as described in the enrollee's prepaid health plan by:\n(1) providing assistance and education to enrollees, when requested, regarding covered health care benefits or services; billing and access; or the grievance, appeal, or state fair hearing processes;\n(2) with the enrollee's permission and within the ombudsperson's discretion, using an informal review process to assist an enrollee with a resolution involving the enrollee's prepaid health plan's benefits;\n(3) assisting enrollees, when requested, with prepaid health plan grievances, appeals, or the state fair hearing process;\n(4) overseeing, reviewing, and approving documents used by enrollees relating to prepaid health plans' grievances, appeals, and state fair hearings;\n(5) reviewing all state fair hearings and requests by enrollees for external review; overseeing entities under contract to provide external reviews, processes, and payments for services; and utilizing aggregated results of external reviews to recommend health care benefits policy changes; and\n(6) providing trainings to managed care advocates.\n(b) The ombudsperson must not charge an enrollee for the ombudsperson's services.\nIn exercising the ombudsperson's authority under this section, the ombudsperson may:\n(1) gather information and evaluate any practice, policy, procedure, or action by a prepaid health plan, state human services agency, county, or Tribe; and\n(2) prescribe the methods by which complaints are to be made, received, and acted upon. The ombudsperson's authority under this clause includes but is not limited to:\n(i) determining the scope and manner of a complaint;\n(ii) holding a prepaid health plan accountable to address a complaint in a timely manner as outlined in state and federal laws;\n(iii) requiring a prepaid health plan to respond in a timely manner to a request for data, case details, and other information as needed to help resolve a complaint or to improve a prepaid health plan's policy; and\n(iv) making recommendations for policy, administrative, or legislative changes regarding prepaid health plans to the proper partners.\n(a) The data analyst must review and analyze prepaid health plan data on denial, termination, and reduction notices (DTRs), grievances, appeals, and state fair hearings by:\n(1) analyzing, reviewing, and reporting on DTRs; grievances; appeals; and state fair hearings data collected from each prepaid health plan;\n(2) collaborating with the commissioner's partners and the Department of Health for the Triennial Compliance Assessment under Code of Federal Regulations, title 42, section 438.358, subpart (b);\n(3) reviewing state fair hearing decisions for policy or coverage issues that may affect enrollees; and\n(4) providing data required under Code of Federal Regulations, title 42, section 438.66 (2016), to the Centers for Medicare and Medicaid Services.\n(b) The data analyst must share the data analyst's data observations and trends under this subdivision with the ombudsperson, prepaid health plans, and commissioner's partners.\n(a) The ombudsperson must work in collaboration with the commissioner and the commissioner's partners when the ombudsperson's collaboration does not otherwise interfere with the ombudsperson's duties under this section.\n(b) The ombudsperson may act independently of the commissioner when:\n(1) providing information or testimony to the legislature; and\n(2) contacting and making reports to federal and state officials.\nThe ombudsperson is not civilly liable for actions taken under this section if the action was taken in good faith, was within the scope of the ombudsperson's authority, and did not constitute willful or reckless misconduct.",
	"repealed": false
}