{
	"id": "325F.6641",
	"url": "https://www.revisor.mn.gov/statutes/cite/325F.6641",
	"title": "325F.6641 DISCLOSURE OF VEHICLE DAMAGE.",
	"text": "(a) If a vehicle has sustained damage by collision or other occurrence which exceeds 80 percent of its actual cash value immediately prior to sustaining damage, the seller must disclose that fact to the buyer, if the seller has actual knowledge of the damage. The amount of damage is determined by the retail cost of repairing the vehicle based on a complete written retail repair estimate or invoice.\n(b) The disclosure required under this subdivision must be made in writing on the application for title and registration or other transfer document, in a manner prescribed by the registrar of motor vehicles. The registrar must design the certificate of title form, including the assignment by seller (transferor) and reassignment by licensed dealer sections of the form, the separate application for title forms, and other transfer documents to accommodate this disclosure.\n(a) If a motor vehicle dealer licensed under section 168.27 offers a vehicle for sale in the course of a sales presentation to any prospective buyer the dealer must provide a written disclosure and, except for sales performed online, an oral disclosure of:\n(1) prior vehicle damage as required under subdivision 1;\n(2) the existence or requirement of any title brand under section 168A.05, subdivision 3, 168A.151, 325F.6642, or 325F.665, subdivision 14, if the dealer has actual knowledge of the brand; and\n(3) if a motor vehicle, which is part of a licensed motor vehicle dealer's inventory, has been submerged or flooded above the bottom dashboard while parked on the dealer's lot.\n(b) If a person receives a flood disclosure as described in paragraph (a), clause (3), whether from a motor vehicle dealer or another seller, and subsequently offers that vehicle for sale, the person must provide the same disclosure to any prospective subsequent buyer.\n(c) Written disclosure under this subdivision must be signed by the buyer and maintained in the motor vehicle dealer's sales file in the manner prescribed by the registrar of motor vehicles.\n(d) The disclosure required in subdivision 1 must be made in substantially the following form: \"To the best of my knowledge, this vehicle has ..... has not ..... sustained damage in excess of 80 percent actual cash value.\"",
	"repealed": false
}