{
	"id": "308B.121",
	"url": "https://www.revisor.mn.gov/statutes/cite/308B.121",
	"title": "308B.121 ANNUAL RENEWAL.",
	"text": "Each cooperative governed by this chapter must file an annual renewal with the secretary of state in each calendar year after the calendar year in which the cooperative incorporated. The secretary of state may send annually to each cooperative, using the information provided by the cooperative pursuant to section 5.002 or 5.34 or the articles of organization, a notice announcing the need to file the annual renewal and informing the cooperative that the annual renewal may be filed online and that paper filings may also be made, and informing the cooperative that failing to file the annual renewal will result in an administrative dissolution.\nIn each calendar year in which a renewal is to be filed, a cooperative must file with the secretary of state by December 31 of that calendar year a renewal containing the items required by section 5.34.\n[Repealed, 2009 c 98 s 36]\n(a) A cooperative that has failed to file a registration under the requirements of this section must be dissolved by the secretary of state as described in paragraph (b).\n(b) If the cooperative has not filed the registration by December 31 of that calendar year, the secretary of state must issue a certificate of involuntary dissolution and the certificate must be filed in the Office of the Secretary of State. A cooperative dissolved in this manner is not entitled to the benefits of section 308B.971.\nA cooperative may retroactively reinstate its existence by filing a single annual registration and paying a $25 fee. Filing the annual registration with the secretary of state:\n(1) returns the cooperative to active status as of the date of the dissolution;\n(2) validates contracts or other acts within the authority of the articles and the cooperative is liable for those contracts or acts; and\n(3) restores to the cooperative all assets and rights of the cooperative and its shareholders or members to the extent they were held by the cooperative and its shareholders or members before the dissolution occurred, except to the extent that assets or rights were affected by acts occurring after the dissolution or sold or otherwise distributed after that time.",
	"repealed": false
}