{
	"id": "17.4992",
	"url": "https://www.revisor.mn.gov/statutes/cite/17.4992",
	"title": "17.4992 GAME FISH AND NATIVE ROUGH FISH.",
	"text": "Game fish and native rough fish sperm, viable game fish and native rough fish eggs, or live game fish and native rough fish may not be taken from public waters for aquaculture purposes, but may be purchased from the state or acquired from aquatic farms.\n(a) Except as provided in paragraph (b), species on the VHS-susceptible-species list must be free of viral hemorrhagic septicemia and species of the family salmonidae or ictaluridae, except bullheads, must be free of certifiable diseases if sold for stocking or transfer to another aquatic farm.\n(b) The following exceptions apply to paragraph (a):\n(1) eggs with enteric redmouth, whirling disease, or furunculosis may be transferred between licensed facilities or stocked following treatment approved by the commissioner;\n(2) fish with bacterial kidney disease or viral hemorrhagic septicemia may be transferred between licensed facilities or stocked in areas where the disease has been identified as being present; and\n(3) the commissioner may allow transfer between licensed facilities or stocking of fish with enteric redmouth or furunculosis when the commissioner determines that doing so would pose no threat to the state's aquatic resources.\n(a) Game fish brood stock and native rough fish brood stock may be sold to private fish hatcheries or aquatic farms by the state at fair wholesale market value. For brood stock development, up to 20 pair of adults of each species requested may be provided to a licensee once every three years, if available, by the state through normal operations.\n(b) If brood stock is not available by the June 1 following the request under paragraph (a) and a permit to take brood stock by angling is requested by the licensee, within 30 days of the request, the commissioner may issue a permit to the licensee to take, by angling, up to 20 pairs of each species requested. Game and fish laws and rules relating to daily limits, seasons, and methods apply to the taking of fish by angling pursuant to a permit issued under this paragraph.\nThe commissioner may offer for sale or barter as eggs or fry from the department's annual game fish egg harvest.\nLicensees may purchase game fish eggs or fry from the state at a rate based on the capacity of their facility to hatch and rear fish. Licensees may purchase walleye at a rate of no more than one-half quart of eggs or 5,000 fry for each acre or fraction of licensed surface water. This limitation may be waived if an aquatic farm is an intensive culture facility. The allowable purchase of trout or salmon eggs must be based on the capacity of rearing tanks and flow of water through the aquatic farm facility.\nWalleyes from outside of the area of the state north of marked State Highway 210 may not be stocked in waters of the state north of marked State Highway 210 without approval by the commissioner.",
	"repealed": false
}