{
	"id": "168.63",
	"url": "https://www.revisor.mn.gov/statutes/cite/168.63",
	"title": "168.63 INTERCITY BUS; REGISTRAR DUTIES.",
	"text": "It shall be the duty of the registrar of motor vehicles to administer and to enforce the terms and conditions of sections 168.61 to 168.65.\nThe registrar of motor vehicles shall determine the percentage of intercity buses to be registered in Minnesota by an owner or operator thereof. The registrar shall determine the total number of miles traveled by each intercity bus within the state of Minnesota and the total number of miles such intercity bus traveled both within and without the state of Minnesota. In making such determinations the registrar may use mileage records of operation of each owner or operator of intercity buses for such period of time as the registrar deems appropriate and during which operation existed. If there are no operations in Minnesota for any period of time so as to determine the mileage records of operation the registrar shall use such estimates as will fairly determine the percentage of intercity buses which any owner or operator thereof shall register in Minnesota.\nWhen increasing the fleet of intercity buses after the beginning of a calendar year in which a percentage of the fleet has been registered in Minnesota, the owner or operator of those intercity buses shall notify the registrar of motor vehicles thereof.\nWhenever substituting an intercity bus in the fleet as a result of new purchase or otherwise, the owner or operator of intercity buses shall likewise notify the registrar of motor vehicles thereof.\nAt the close of each calendar year and not later than February 15th of the next succeeding year, the registrar of motor vehicles shall recompute and redetermine the number of intercity buses required to have been registered in Minnesota for the prior year and the actual amount of tax liability for such previous year shall likewise be redetermined. Any additional tax which may be due by any owner or operator of intercity buses shall be paid forthwith. If it is determined as a result of such recomputation that there has been an overpayment of tax, the amount of such overpayment shall be credited to the amount of tax which may be due by the owner or operator of intercity buses in any subsequent year. In the event any owner or operator of intercity buses discontinues operations in Minnesota and has a tax credit due as a result of overpayment of motor vehicle taxes for any year, the amount of such overpayment shall be refunded. Such sums as are necessary to make the refunds herein are hereby appropriated annually from the highway user tax distribution fund.",
	"repealed": false
}