{
	"id": "176.521",
	"url": "https://www.revisor.mn.gov/statutes/cite/176.521",
	"title": "176.521 SETTLEMENT OF CLAIMS.",
	"text": "(a) An agreement between an employee or an employee's dependent and the employer or insurer to settle any claim for compensation under this chapter is valid where it has been executed in writing and signed by the parties and intervenors in the matter, and, where one or more of the parties is not represented by an attorney, the commissioner or a compensation judge has approved the settlement and made an award thereon. If the matter is upon appeal before the district court, the district court is the approving body. An agreement to settle any claim is not valid if a guardian or conservator is required under section 176.092 and an employee or dependent has no guardian or conservator.\n(b) If the matter is on appeal before the Workers' Compensation Court of Appeals, the proposed settlement shall be submitted for approval to a compensation judge at the Office of Administrative Hearings. Before the settlement is submitted to the compensation judge, the parties shall notify the Workers' Compensation Court of Appeals and request that it suspend further action on the appeal pending review of the settlement by the compensation judge. Within 14 days after the compensation judge's final approval or disapproval of the settlement, the parties shall notify the Workers' Compensation Court of Appeals of the compensation judge's action and shall request that the appeal be dismissed or reactivated.\nSettlements shall be approved only if the terms conform with this chapter.\nThe commissioner, a compensation judge, and the district court shall exercise discretion in approving or disapproving a proposed settlement.\nThe parties to the agreement of settlement have the burden of proving that the settlement is reasonable, fair, and in conformity with this chapter. A settlement agreement where both the employee or the employee's dependent and the employer or insurer are represented by an attorney shall be conclusively presumed to be reasonable, fair, and in conformity with this chapter except when the settlement purports to be a full, final, and complete settlement of an employee's right to medical compensation under this chapter or rehabilitation under section 176.102. A settlement which purports to do so must be approved by the commissioner or a compensation judge.\nThe conclusive presumption in this subdivision is not available in cases involving an employee or dependent with a guardian or conservator.\nThe conclusive presumption in this subdivision applies to a settlement agreement entered into on or after January 15, 1982, whether the injury to which the settlement applies occurred prior to or on or after January 15, 1982.\nWhen a settled case is not subject to approval, upon receipt of the stipulation for settlement, the commissioner or a compensation judge shall immediately sign the award and file it with the commissioner. Payment pursuant to the award shall be made within 14 days after it is filed with the commissioner. The commissioner may correct mathematical or clerical errors at any time.\n(a) The parties may file a partial stipulation for settlement which resolves the claims of the employee and reserves the claims of one or more intervenors. If the partial stipulation, or a letter of agreement attached to the partial stipulation, is not signed by an intervenor, the partial stipulation must include a statement that the parties were unable to:\n(1) obtain a response from the nonsigning intervenor regarding clarification or confirmation of its interest or an offer of settlement within a reasonable time despite good-faith efforts to obtain a response;\n(2) reach agreement with the nonsigning intervenor despite the belief that the parties negotiated with the intervenor in good faith and made a reasonable offer to settle the intervention claim; or\n(3) obtain the nonsigning intervenor's signature within a reasonable time after an agreement was reached with the intervenor.\nThe partial stipulation must include detailed and case-specific support for the parties' statements. In addition, the partial stipulation must reserve the nonsigning intervenor's interests to pursue its claim at a hearing on the merits, and must contain a statement that the employee will cooperate at the hearing.\n(b) Prior to filing the partial stipulation for approval, a copy of the partial stipulation must be served on all parties, including the nonsigning intervenor, together with a written notification that the settling parties intend to file the partial stipulation for approval by a compensation judge and of the nonsigning intervenor's right to request a hearing on the merits of the intervenor's claim.\n(c) Within ten days after service of a partial stipulation for settlement and notice of an intent to file for approval by a compensation judge, a nonsigning intervenor may serve and file a written objection to approval of the partial stipulation, which filing must provide a detailed and case-specific factual basis establishing that approval of the partial stipulation will adversely impact the rights of the intervenor.\n(d) After expiration of the ten-day period within which a nonsigning intervenor may serve and file its written objection, any party may file for approval a partial stipulation for settlement which conforms with this section. An affidavit of service must accompany the partial stipulation when it is filed for approval.\n(e) Unless the compensation judge has a reasonable belief that approval of the partial stipulation will adversely impact the rights of the nonsigning intervenor, the compensation judge shall immediately issue the award and file it with the commissioner. The issuance of the award shall be accompanied by notice to the intervenors and other parties of their right to request amended findings within a period of 30 days following the date of issuance in conformity with applicable law.\n(f) If the compensation judge has a reasonable belief that approval of the partial stipulation will adversely impact the rights of the intervenor, the compensation judge shall disapprove the stipulation by written order detailing a factual basis for the determination of adverse impact.\nNotwithstanding the provisions of subdivision 1, 2, or 2a, or any provision in the agreement of settlement to the contrary, upon the filing of a petition by any party to the settlement, the Workers' Compensation Court of Appeals may set aside an award made upon a settlement, pursuant to this chapter. In appropriate cases, the Workers' Compensation Court of Appeals may refer the matter to the chief administrative law judge for assignment to a compensation judge for hearing.",
	"repealed": false
}