{
	"id": "515B.3-110",
	"url": "https://www.revisor.mn.gov/statutes/cite/515B.3-110",
	"title": "515B.3-110 VOTING; PROXIES.",
	"text": "(a) At any meeting of the association an owner or the holder of the owner's proxy shall be entitled to cast the vote which is allocated to the unit. If there is more than one owner of a unit, only one of the owners may cast the vote. If the owners of a unit fail to agree and notify the association as to who shall cast the vote, the vote shall not be cast. Any provision in the articles of incorporation, bylaws, declaration, or other document restricting a unit owner's right to vote, or affecting quorum requirements, by reason of nonpayment of assessments, or a purported violation of any provision of the documents governing the common interest community, shall be void.\n(b) If permitted by the articles or bylaws, votes allocated to a unit may be cast pursuant to a proxy executed by the unit owner entitled to cast the vote for that unit. The board may specify the form of proxy and proxy rules, consistent with law.\n(c) If authorized by the statute under which the association is created, and to the extent not limited or prohibited by the articles of incorporation, bylaws, or declaration, the vote on any issue or issues may be taken by electronic means or by mailed ballots, in compliance with the applicable statute, in lieu of holding a meeting of the unit owners. Such a vote shall have the force and effect of a vote taken at a meeting; provided, that the total votes cast are at least equal to the votes required for a quorum. The board shall set a voting period within which the ballots or other voting response must be received by the association, which period shall be not less than 15 nor more than 45 days after the date of delivery of the notice of the vote and voting procedures to the unit owners. The board of directors shall provide notice of the results of the vote to the unit owners within 30 days after the expiration of the voting period. All requirements in this chapter, the declaration or the bylaws for a meeting of the unit owners, or being present in person, shall be deemed satisfied by a vote taken in compliance with the requirements of this section. The voting procedures authorized by this section shall not be used in combination with a vote taken at a meeting of the unit owners. However, voting by electronic means and mailed ballot may be combined if each is done in compliance with the applicable statute.\n(d) The articles of incorporation or bylaws may authorize class voting by unit owners for directors or on specified issues affecting the class. Class voting may only be used to address operational, physical, or administrative differences within the common interest community. A declarant shall not use class voting to evade any limit imposed on declarants by this chapter and units shall not constitute a class because they are owned by a declarant.\n(e) The declaration or bylaws may provide that votes on specified matters affecting the common interest community be cast by lessees or secured parties rather than unit owners; provided that (i) the provisions of subsections (a), (b), and (c) apply to those persons as if they were unit owners; (ii) unit owners who have so delegated their votes to other persons may not cast votes on those specified matters; (iii) lessees or secured parties are entitled to notice of meetings, access to records, and other rights respecting those matters as if they were unit owners, and (iv) the lessee or secured party has filed satisfactory evidence of its interest with the secretary of the association prior to the meeting. Unit owners must also be given notice, in the manner provided in section 515B.3-108(b), of meetings at which lessees or secured parties are entitled to vote.\n(f) No votes allocated to a unit owned by the association may be cast nor counted toward a quorum.",
	"repealed": false
}