{
	"id": "62J.581",
	"url": "https://www.revisor.mn.gov/statutes/cite/62J.581",
	"title": "62J.581 STANDARDS FOR MINNESOTA UNIFORM HEALTH CARE REIMBURSEMENT DOCUMENTS.",
	"text": "All group purchasers shall provide a uniform claim payment/advice transaction to health care providers when a claim is adjudicated. The uniform claim payment/advice transaction shall comply with section 62J.536, subdivision 1, paragraph (b), and rules adopted under section 62J.536, subdivision 2.\n(a) All group purchasers shall provide a uniform explanation of benefits document to health care patients when an explanation of benefits document is provided as otherwise required or permitted by law. The uniform explanation of benefits document shall comply with the standards prescribed in this section.\n(b) Notwithstanding paragraph (a), this section does not apply to group purchasers not included as covered entities under United States Code, title 42, sections 1320d to 1320d-8, as amended from time to time, and the regulations promulgated under those sections.\nFor purposes of sections 62J.50 to 62J.61, the uniform claim payment/advice transaction and uniform explanation of benefits document format specified in subdivision 4 shall apply to all health care services delivered by a health care provider or health care provider organization in Minnesota, regardless of the location of the payer. Health care services not paid on an individual claims basis, such as capitated payments, are not included in this section. A health plan company is excluded from the requirements in subdivisions 1 and 2 if they comply with section 62A.01, subdivisions 2 and 3.\nThe uniform explanation of benefits document shall be provided by use of a paper document conforming to the specifications in this section. The commissioner, after consulting with the Administrative Uniformity Committee, shall specify the data elements and definitions for the uniform explanation of benefits document. The commissioner and the Administrative Uniformity Committee must consult with the Minnesota Dental Association and Delta Dental Plan of Minnesota before requiring under this section the use of a paper document for the uniform explanation of benefits document or the uniform claim payment/advice transaction for dental care services.\nThe requirements in subdivisions 1 and 2 are effective June 30, 2007. The requirements in subdivisions 1 and 2 apply regardless of when the health care service was provided to the patient.",
	"repealed": false
}