{
	"id": "298.2216",
	"url": "https://www.revisor.mn.gov/statutes/cite/298.2216",
	"title": "298.2216 GIANTS RIDGE ACCOUNT.",
	"text": "The Giants Ridge account is established in the state treasury. The account consists of appropriations made by the state or funds dedicated by the Department of Iron Range Resources and Rehabilitation. The account may also receive private contributions, gifts, or grants under section 16A.013. Any interest or profit accruing from investment of these sums is credited to the account.\n(a) For the purposes of this section the following terms have the meanings given.\n(b) \"Commissioner\" means the commissioner of Iron Range resources and rehabilitation.\n(c) \"Income\" means the amount of interest or profit accruing from the investment of account funds.\n(d) \"Long-term maintenance\" means activities that would constitute substantial repairs or rehabilitation.\n(e) \"Routine maintenance\" means activities that are predictable and repetitive.\n(a) Income derived from the investment of principal in the account may be used by the commissioner for capital expenditures, facility operations, or routine or long-term maintenance of the commercial, state-owned assets within the Giants Ridge Recreation Area. No money from this account may be used for any purposes except those described in this section and no money from this account may be transferred to any other account in the state treasury without specific legislative authorization.\n(b) Investment management fees incurred by the State Board of Investment are eligible expenses for reimbursement from the account.\n(c) The commissioner has authority to approve or deny expenditures of funds in the account.\nIncome in the account derived from the investment of principal is appropriated upon request by the commissioner to the agency for the purposes described in this section. The commissioner may also request appropriations from the principal for capital expenditures when the commissioner determines such expenditures are in the best interest of the agency.\nFunds in the account shall be invested pursuant to law by the State Board of Investment.",
	"repealed": false
}