{
	"id": "144.0528",
	"url": "https://www.revisor.mn.gov/statutes/cite/144.0528",
	"title": "144.0528 COMPREHENSIVE DRUG OVERDOSE AND MORBIDITY PREVENTION ACT.",
	"text": "For the purpose of this section, \"drug overdose and morbidity\" means health problems that people experience after inhaling, ingesting, or injecting medicines in quantities that exceed prescription status; medicines taken that are prescribed to a different person; medicines that have been adulterated or adjusted by contaminants intentionally or unintentionally; or nonprescription drugs in amounts that result in morbidity or mortality.\nThe commissioner of health shall establish a comprehensive drug overdose and morbidity program to conduct comprehensive drug overdose and morbidity prevention activities, epidemiologic investigations and surveillance, and evaluation to monitor, address, and prevent drug overdoses statewide through integrated strategies that include the following:\n(1) advance access to evidence-based nonnarcotic pain management services;\n(2) implement culturally specific interventions and prevention programs with population and community groups in greatest need, including those who are pregnant and their infants;\n(3) enhance overdose prevention and supportive services for people experiencing homelessness. This strategy includes funding for emergency and short-term housing subsidies through the homeless overdose prevention hub and expanding support for syringe services programs serving people experiencing homelessness statewide;\n(4) equip employers to promote health and well-being of employees by addressing substance misuse and drug overdose;\n(5) improve outbreak detection and identification of substances involved in overdoses through the expansion of the Minnesota Drug Overdose and Substance Use Surveillance Activity (MNDOSA);\n(6) implement Tackling Overdose With Networks (TOWN) community prevention programs;\n(7) identify, address, and respond to drug overdose and morbidity in those who are pregnant or have just given birth through multitiered approaches that may:\n(i) promote medication-assisted treatment options;\n(ii) support programs that provide services in accord with evidence-based care models for mental health and substance abuse disorder;\n(iii) collaborate with interdisciplinary and professional organizations that focus on quality improvement initiatives related to substance use disorder; and\n(iv) implement substance use disorder-related recommendations from the maternal mortality review committee, as appropriate; and\n(8) design a system to assess, address, and prevent the impacts of drug overdose and morbidity on those who are pregnant, their infants, and children. Specifically, the commissioner of health may:\n(i) inform health care providers and the public of the prevalence, risks, conditions, and treatments associated with substance use disorders involving or affecting pregnancies, infants, and children; and\n(ii) identify communities, families, infants, and children affected by substance use disorder in order to recommend focused interventions, prevention, and services.\nThe commissioner of health may consult with sovereign Tribal nations, the Minnesota Departments of Human Services, Corrections, Public Safety, and Education, local public health agencies, care providers and insurers, community organizations that focus on substance abuse risks and recovery, individuals affected by substance use disorders, and any other individuals, entities, and organizations as necessary to carry out the goals of this section.\n(a) The commissioner of health may award grants, as funding allows, to entities and organizations focused on addressing and preventing the negative impacts of drug overdose and morbidity. Examples of activities the commissioner may consider for these grant awards include:\n(1) developing, implementing, or promoting drug overdose and morbidity prevention programs and activities;\n(2) community outreach and other efforts addressing the root causes of drug overdose and morbidity;\n(3) identifying risk and protective factors relating to drug overdose and morbidity that contribute to identification, development, or improvement of prevention strategies and community outreach;\n(4) developing or providing trauma-informed drug overdose and morbidity prevention and services;\n(5) developing or providing culturally and linguistically appropriate drug overdose and morbidity prevention and services, and programs that target and serve historically underserved communities;\n(6) working collaboratively with educational institutions, including school districts, to implement drug overdose and morbidity prevention strategies for students, teachers, and administrators;\n(7) working collaboratively with sovereign Tribal nations, care providers, nonprofit organizations, for-profit organizations, government entities, community-based organizations, and other entities to implement substance misuse and drug overdose prevention strategies within their communities; and\n(8) creating or implementing quality improvement initiatives to improve drug overdose and morbidity treatment and outcomes.\n(b) Any organization or government entity receiving grant money under this section must collect and make available to the commissioner of health aggregate data related to the activity funded by the program under this section. The commissioner of health shall use the information and data from the program evaluation to inform the administration of existing Department of Health programming and the development of Department of Health policies, programs, and procedures.\nIn fiscal years 2026 and beyond, the commissioner may spend up to 25 percent of the total funding appropriated for the comprehensive drug overdose and morbidity program in each fiscal year to promote, administer, support, and evaluate the programs authorized under this section and to provide technical assistance to program grantees.\nThe commissioner may accept contributions from governmental and nongovernmental sources and may apply for grants to supplement state appropriations for the programs authorized under this section. Contributions and grants received from the sources identified in this subdivision to advance the purpose of this section are appropriated to the commissioner for the comprehensive drug overdose and morbidity program.\nBeginning February 28, 2024, the commissioner of health shall report every even-numbered year to the legislative committees with jurisdiction over health detailing the expenditures of funds authorized under this section. The commissioner shall use the data to evaluate the effectiveness of the program. The commissioner must include in the report:\n(1) the number of organizations receiving grant money under this section;\n(2) the number of individuals served by the grant programs;\n(3) a description and analysis of the practices implemented by program grantees; and\n(4) best practices recommendations to prevent drug overdose and morbidity, including culturally relevant best practices and recommendations focused on historically underserved communities.\nNotwithstanding any law to the contrary, the commissioner of health shall assess and evaluate grants and contracts awarded using available data sources, including but not limited to the Minnesota All Payer Claims Database (MN APCD), the Minnesota Behavioral Risk Factor Surveillance System (BRFSS), the Minnesota Student Survey, vital records, hospitalization data, syndromic surveillance, and the Minnesota Electronic Health Record Consortium.",
	"repealed": false
}