{
	"id": "46.041",
	"url": "https://www.revisor.mn.gov/statutes/cite/46.041",
	"title": "46.041 BANK APPLICATIONS.",
	"text": "The incorporators of a bank proposed to be organized under the laws of this state shall execute and acknowledge a written application in the form prescribed by the commissioner of commerce. The application must be signed by two or more of the incorporators and request a certificate authorizing the proposed bank to transact business at the place and in the name stated in the application. The applicant shall file the application with the department with an $8,000 filing fee. The commissioner may waive the fee for a bank to be located in a low- or moderate-income area as defined in Code of Federal Regulations, title 12, part 25(1), (n)(1) and (n)(2), and where no other depository institution operates an office. If the proposed bank is being organized in connection with a reorganization or merger of an existing bank, the filing fee is $2,000. The fees must be turned over by the commissioner to the commissioner of management and budget and credited to the general fund. The application file must be public, with the exception of financial data on individuals which is private under the Minnesota Government Data Practices Act and data defined as trade secret information under section 13.37, subdivision 1, paragraph (b), which must be given nonpublic classification upon written request by the applicant.\nUpon notice of acceptance of an application as complete in all respects for filing, the applicant shall within 30 days of the receipt of the form prescribed by the commissioner, publish a notice of the filing of the application, in a qualified newspaper published in the municipality in which the proposed bank is to be located, and if there is no such newspaper, then in a qualified newspaper likely to give notice in the municipality in which the bank is proposed to be located. The notice must be in the form prescribed by the commissioner.\nWithin 15 days after the notice of application has been published, any person may submit to the commissioner either or both written comments on an application and a written request for a hearing on the application. The request must state the nature of the issues or facts to be presented and the reasons why written submissions would be insufficient to make an adequate presentation to the commissioner. Comments challenging the legality of an application should be submitted separately in writing.\nWritten requests for hearing must be evaluated by the commissioner who may grant or deny the request. A hearing must generally be granted only if it is determined that written submissions would be inadequate or that a hearing would otherwise be beneficial to the decision-making process. A hearing may be limited to issues considered material by the commissioner.\nIf a request for a hearing has been denied, the commissioner shall notify the applicant and all interested persons stating the reasons for denial. Interested parties may submit to the commissioner with simultaneous copies to the applicant additional written comments on the application within 14 days after the date of the notice of denial. The applicant shall be provided an additional seven days after the 14-day deadline has expired within which to respond to any comments submitted within the 14-day period. A copy of any response submitted by the applicant shall also be mailed simultaneously by the applicant to the interested parties. The commissioner may waive the additional seven-day comment period if so requested by the applicant.\nIn any case in which the commissioner grants a request for a hearing or makes the independent determination that a hearing is warranted on the basis of the conditions in subdivision 3, the commissioner shall fix a time for a hearing conducted pursuant to chapter 14 to decide whether or not the application will be granted. A notice of the hearing must be published by the applicant in the form prescribed by the commissioner in a newspaper published in the municipality in which the proposed bank is to be located, and if there is no such newspaper, then in a qualified newspaper likely to give notice in the municipality in which the bank is proposed to be located. The notice must be published once, at the expense of the applicants, not less than 30 days prior to the date of the hearing. At the hearing the commissioner shall consider the application and hear the applicants and witnesses that appear in favor of or against the granting of the application of the proposed bank. If an application is contested, 50 percent of an additional fee equal to the actual costs incurred by the Department of Commerce in approving or disapproving the application, payable to the Department of Commerce to be deposited in the general fund, must be paid by the applicant and 50 percent equally by the intervening parties.\nIf, upon the hearing or upon other information submitted, it appears to the commissioner that the application should be granted, the commissioner shall, not later than 90 days after the hearing, and after the applicants have otherwise complied with the provisions of law applicable to the organization of a bank, including the provisions herein contained, make and file in the commissioner's office a written order directing the issuance of a certificate of authorization as provided by law. If the certificate of authorization is not activated within a period of 12 months from date of issuance, the commissioner may upon written notice to the applicants request a new hearing. If the commissioner decides that the application should not be granted, the commissioner shall deny the application and make a written order to that effect, file it in the commissioner's office, and forthwith give notice thereof by certified mail to one of the incorporators named in the application for the proposed bank, addressed to the incorporator at the address stated in the application. Thereupon the commissioner shall refuse to issue the certificate of authorization to the proposed bank.",
	"repealed": false
}