{
	"id": "245A.11",
	"url": "https://www.revisor.mn.gov/statutes/cite/245A.11",
	"title": "245A.11 SPECIAL CONDITIONS FOR RESIDENTIAL PROGRAMS.",
	"text": "It is the policy of the state that persons shall not be excluded by municipal zoning ordinances or other land use regulations from the benefits of normal residential surroundings.\n(a) Residential programs with a licensed capacity of six or fewer persons shall be considered a permitted single-family residential use of property for the purposes of zoning and other land use regulations, except that a residential program whose primary purpose is to treat juveniles who have violated criminal statutes relating to sex offenses or have been adjudicated delinquent on the basis of conduct in violation of criminal statutes relating to sex offenses shall not be considered a permitted use. This exception shall not apply to residential programs licensed before July 1, 1995. Programs otherwise allowed under this subdivision shall not be prohibited by operation of restrictive covenants or similar restrictions, regardless of when entered into, which cannot be met because of the nature of the licensed program, including provisions which require the home's occupants be related, and that the home must be occupied by the owner, or similar provisions.\n(b) A community residential setting as defined in section 245D.02, subdivision 4a, with a licensed capacity of six or fewer persons that is actively serving residents for which it is licensed is exempt from rental licensing regulations imposed by any town, municipality, or county.\n(a) The commissioner shall issue adult foster care and community residential setting licenses with a maximum licensed capacity of four beds, including nonstaff roomers and boarders, except that the commissioner may issue a license with a capacity of five beds, including roomers and boarders, according to paragraphs (b) to (h).\n(b) The license holder may have a maximum license capacity of five if all persons in care are age 55 or over and do not have a serious and persistent mental illness or a developmental disability.\n(c) The commissioner may grant variances to paragraph (b) to allow a facility with a licensed capacity of up to five persons to admit an individual under the age of 55 if the variance complies with section 245A.04, subdivision 9, and approval of the variance is recommended by the county in which the licensed facility is located.\n(d) The commissioner may grant variances to paragraph (a) to allow the use of an additional bed, up to six, for emergency crisis services for a person with serious and persistent mental illness or a developmental disability, regardless of age, if the variance complies with section 245A.04, subdivision 9, and approval of the variance is recommended by the county in which the licensed facility is located.\n(e) The commissioner may grant a variance to paragraph (b) to allow for the use of an additional bed, up to six, for respite services, as defined in section 245A.02, for persons with disabilities, regardless of age, if the variance complies with sections 245A.03, subdivision 7, and 245A.04, subdivision 9, and approval of the variance is recommended by the county in which the licensed facility is located. Respite care may be provided under the following conditions:\n(1) staffing ratios cannot be reduced below the approved level for the individuals being served in the home on a permanent basis;\n(2) no more than two different individuals can be accepted for respite services in any calendar month and the total respite days may not exceed 120 days per program in any calendar year;\n(3) the person receiving respite services must have his or her own bedroom, which could be used for alternative purposes when not used as a respite bedroom, and cannot be the room of another person who lives in the facility; and\n(4) individuals living in the facility must be notified when the variance is approved. The provider must give 60 days' notice in writing to the residents and their legal representatives prior to accepting the first respite placement. Notice must be given to residents at least two days prior to service initiation, or as soon as the license holder is able if they receive notice of the need for respite less than two days prior to initiation, each time a respite client will be served, unless the requirement for this notice is waived by the resident or legal guardian.\n(f) The commissioner may issue an adult foster care or community residential setting license with a capacity of five adults if the fifth bed does not increase the overall statewide capacity of licensed adult foster care or community residential setting beds in homes that are not the primary residence of the license holder, as identified in a plan submitted to the commissioner by the county, when the capacity is recommended by the county licensing agency of the county in which the facility is located and if the recommendation verifies that:\n(1) the facility meets the physical environment requirements in the adult foster care licensing rule;\n(2) the five-bed living arrangement is specified for each resident in the resident's:\n(i) individualized plan of care;\n(ii) individual service plan under section 256B.092, subdivision 1b, if required; or\n(iii) individual resident placement agreement under Minnesota Rules, part 9555.5105, subpart 19, if required;\n(3) the license holder obtains written and signed informed consent from each resident or resident's legal representative documenting the resident's informed choice to remain living in the home and that the resident's refusal to consent would not have resulted in service termination; and\n(4) the facility was licensed for adult foster care before March 1, 2016.\n(g) The commissioner shall not issue a new adult foster care license under paragraph (f) after December 31, 2020. The commissioner shall allow a facility with an adult foster care license issued under paragraph (f) before December 31, 2020, to continue with a capacity of five adults if the license holder continues to comply with the requirements in paragraph (f).\n(h) The commissioner may issue an adult foster care or community residential setting license with a capacity of five or six adults to facilities meeting the criteria in section 245A.03, subdivision 7, paragraph (a), clause (5), and grant variances to paragraph (b) to allow the facility to admit an individual under the age of 55 if the variance complies with section 245A.04, subdivision 9, and approval of the variance is recommended by the county in which the licensed facility is located.\n(i) Notwithstanding Minnesota Rules, part 9520.0500, adult foster care and community residential setting licenses with a capacity of up to six adults as allowed under this subdivision are not required to be licensed as an adult mental health residential program according to Minnesota Rules, parts 9520.0500 to 9520.0670.\n[See Note.]\nAn adult foster care license holder licensed under the conditions in subdivision 2a may also provide family adult day care for adults age 18 or over. Family adult day services provided in a licensed adult foster care setting must be provided as specified under section 245A.143. Authorization to provide family adult day services in the adult foster care setting shall be printed on the license certificate by the commissioner. Adult foster care homes licensed under this section and family adult day services licensed under section 245A.143 shall not be subject to licensure by the commissioner of health under the provisions of chapter 144, 144A, 157, or any other law requiring facility licensure by the commissioner of health. A separate license is not required to provide family adult day services in a licensed adult foster care home.\nMS 2022 [Expired, 2022 c 98 art 4 s 13]\nUnless otherwise provided in any town, municipal, or county zoning regulation, a licensed residential program with a licensed capacity of seven to 16 persons shall be considered a permitted multifamily residential use of property for the purposes of zoning and other land use regulations. A town, municipal, or county zoning authority may require a conditional use or special use permit to assure proper maintenance and operation of a residential program. Conditions imposed on the residential program must not be more restrictive than those imposed on other conditional uses or special uses of residential property in the same zones, unless the additional conditions are necessary to protect the health and safety of the persons being served by the program. Nothing in this chapter shall be construed to exclude or prohibit residential programs from single-family zones if otherwise permitted by local zoning regulations.\nIn determining whether to grant a license, the commissioner shall specifically consider the population, size, land use plan, availability of community services, and the number and size of existing licensed residential programs in the town, municipality, or county in which the applicant seeks to operate a residential program. The commissioner shall not grant an initial license to any residential program if the residential program will be within 1,320 feet of an existing residential program unless one of the following conditions apply: (1) the existing residential program is located in a hospital licensed by the commissioner of health; (2) the town, municipality, or county zoning authority grants the residential program a conditional use or special use permit; (3) the program serves six or fewer persons and is not located in a city of the first class; or (4) the program is foster care, or a community residential setting as defined under section 245D.02, subdivision 4a.\n[Repealed, 2014 c 262 art 5 s 7]\nThe commissioner of human services shall seek input from counties and municipalities on methods for integrating all residential programs into the community.\nResidential programs located in hospitals shall be exempt from the provisions of this section.\n(a) The commissioner may grant a variance under section 245A.04, subdivision 9, to statute or rule parts requiring a caregiver to be present in an adult foster care home or a community residential setting during normal sleeping hours to allow for alternative methods of overnight supervision. The commissioner may grant the variance if the local county licensing agency recommends the variance and the county recommendation includes documentation verifying that:\n(1) the county has approved the license holder's plan for alternative methods of providing overnight supervision and determined the plan protects the residents' health, safety, and rights;\n(2) the license holder has obtained written and signed informed consent from each resident or each resident's legal representative documenting the resident's or legal representative's agreement with the alternative method of overnight supervision; and\n(3) the alternative method of providing overnight supervision, which may include the use of technology, is specified for each resident in the resident's: (i) individualized plan of care; (ii) support plan under section 256B.092, subdivision 1b, if required; or (iii) individual resident placement agreement under Minnesota Rules, part 9555.5105, subpart 19, if required.\n(b) To be eligible for a variance under paragraph (a), the adult foster care or community residential setting license holder must not have had a conditional license issued under section 245A.06, or any other licensing sanction issued under section 245A.07 during the prior 24 months based on failure to provide adequate supervision, health care services, or resident safety in the adult foster care home or a community residential setting.\n(c) A license holder requesting a variance under this subdivision to utilize technology as a component of a plan for alternative overnight supervision may request the commissioner's review in the absence of a county recommendation. Upon receipt of such a request from a license holder, the commissioner shall review the variance request with the county.\n(a) The commissioner may grant an applicant or license holder an adult foster care license for a residence that does not have a caregiver in the residence during normal sleeping hours as required under Minnesota Rules, part 9555.5105, subpart 37, item B, or section 245D.02, subdivision 33b, but uses monitoring technology to alert the license holder when an incident occurs that may jeopardize the health, safety, or rights of a foster care recipient. The applicant or license holder must comply with all other requirements under Minnesota Rules, parts 9555.5105 to 9555.6265, or applicable requirements under chapter 245D, and the requirements under this subdivision. The license printed by the commissioner must state in bold and large font:\n(1) that the facility is under electronic monitoring; and\n(2) the telephone number of the county's common entry point for making reports of suspected maltreatment of vulnerable adults under section 626.557, subdivision 9.\n(b) Applications for a license under this section must be submitted directly to the Department of Human Services licensing division. The licensing division must immediately notify the county licensing agency. The licensing division must collaborate with the county licensing agency in the review of the application and the licensing of the program.\n(c) Before a license is issued by the commissioner, and for the duration of the license, the applicant or license holder must establish, maintain, and document the implementation of written policies and procedures addressing the requirements in paragraphs (d) through (f).\n(d) The applicant or license holder must have policies and procedures that:\n(1) establish characteristics of target populations that will be admitted into the home, and characteristics of populations that will not be accepted into the home;\n(2) explain the discharge process when a resident served by the program requires overnight supervision or other services that cannot be provided by the license holder due to the limited hours that the license holder is on site;\n(3) describe the types of events to which the program will respond with a physical presence when those events occur in the home during time when staff are not on site, and how the license holder's response plan meets the requirements in paragraph (e), clause (1) or (2);\n(4) establish a process for documenting a review of the implementation and effectiveness of the response protocol for the response required under paragraph (e), clause (1) or (2). The documentation must include:\n(i) a description of the triggering incident;\n(ii) the date and time of the triggering incident;\n(iii) the time of the response or responses under paragraph (e), clause (1) or (2);\n(iv) whether the response met the resident's needs;\n(v) whether the existing policies and response protocols were followed; and\n(vi) whether the existing policies and protocols are adequate or need modification.\nWhen no physical presence response is completed for a three-month period, the license holder's written policies and procedures must require a physical presence response drill to be conducted for which the effectiveness of the response protocol under paragraph (e), clause (1) or (2), will be reviewed and documented as required under this clause; and\n(5) establish that emergency and nonemergency phone numbers are posted in a prominent location in a common area of the home where they can be easily observed by a person responding to an incident who is not otherwise affiliated with the home.\n(e) The license holder must document and include in the license application which response alternative under clause (1) or (2) is in place for responding to situations that present a serious risk to the health, safety, or rights of residents served by the program:\n(1) response alternative (1) requires only the technology to provide an electronic notification or alert to the license holder that an event is underway that requires a response. Under this alternative, no more than ten minutes will pass before the license holder will be physically present on site to respond to the situation; or\n(2) response alternative (2) requires the electronic notification and alert system under alternative (1), but more than ten minutes may pass before the license holder is present on site to respond to the situation. Under alternative (2), all of the following conditions are met:\n(i) the license holder has a written description of the interactive technological applications that will assist the license holder in communicating with and assessing the needs related to the care, health, and safety of the foster care recipients. This interactive technology must permit the license holder to remotely assess the well being of the resident served by the program without requiring the initiation of the foster care recipient. Requiring the foster care recipient to initiate a telephone call does not meet this requirement;\n(ii) the license holder documents how the remote license holder is qualified and capable of meeting the needs of the foster care recipients and assessing foster care recipients' needs under item (i) during the absence of the license holder on site;\n(iii) the license holder maintains written procedures to dispatch emergency response personnel to the site in the event of an identified emergency; and\n(iv) each resident's individualized plan of care, support plan under sections 256B.0913, subdivision 8; 256B.092, subdivision 1b; 256B.49, subdivision 15; and 256S.10, if required, or individual resident placement agreement under Minnesota Rules, part 9555.5105, subpart 19, if required, identifies the maximum response time, which may be greater than ten minutes, for the license holder to be on site for that resident.\n(f) Each resident's placement agreement, individual service agreement, and plan must clearly state that the adult foster care license category is a program without the presence of a caregiver in the residence during normal sleeping hours; the protocols in place for responding to situations that present a serious risk to the health, safety, or rights of residents served by the program under paragraph (e), clause (1) or (2); and a signed informed consent from each resident served by the program or the person's legal representative documenting the person's or legal representative's agreement with placement in the program. If electronic monitoring technology is used in the home, the informed consent form must also explain the following:\n(1) how any electronic monitoring is incorporated into the alternative supervision system;\n(2) the backup system for any electronic monitoring in times of electrical outages or other equipment malfunctions;\n(3) how the caregivers or direct support staff are trained on the use of the technology;\n(4) the event types and license holder response times established under paragraph (e);\n(5) how the license holder protects each resident's privacy related to electronic monitoring and related to any electronically recorded data generated by the monitoring system. A resident served by the program may not be removed from a program under this subdivision for failure to consent to electronic monitoring. The consent form must explain where and how the electronically recorded data is stored, with whom it will be shared, and how long it is retained; and\n(6) the risks and benefits of the alternative overnight supervision system.\nThe written explanations under clauses (1) to (6) may be accomplished through cross-references to other policies and procedures as long as they are explained to the person giving consent, and the person giving consent is offered a copy.\n(g) Nothing in this section requires the applicant or license holder to develop or maintain separate or duplicative policies, procedures, documentation, consent forms, or individual plans that may be required for other licensing standards, if the requirements of this section are incorporated into those documents.\n(h) The commissioner may grant variances to the requirements of this section according to section 245A.04, subdivision 9.\n(i) For the purposes of paragraphs (d) through (h), \"license holder\" has the meaning under section 245A.02, subdivision 9, and additionally includes all staff, volunteers, and contractors affiliated with the license holder.\n(j) For the purposes of paragraph (e), the terms \"assess\" and \"assessing\" mean to remotely determine what action the license holder needs to take to protect the well-being of the foster care recipient.\n(k) The commissioner shall evaluate license applications using the requirements in paragraphs (d) to (f). The commissioner shall provide detailed application forms, including a checklist of criteria needed for approval.\n(l) To be eligible for a license under paragraph (a), the adult foster care license holder must not have had a conditional license issued under section 245A.06 or any licensing sanction under section 245A.07 during the prior 24 months based on failure to provide adequate supervision, health care services, or resident safety in the adult foster care home.\n(m) The commissioner shall review an application for an alternative overnight supervision license within 60 days of receipt of the application. When the commissioner receives an application that is incomplete because the applicant failed to submit required documents or that is substantially deficient because the documents submitted do not meet licensing requirements, the commissioner shall provide the applicant written notice that the application is incomplete or substantially deficient. In the written notice to the applicant, the commissioner shall identify documents that are missing or deficient and give the applicant 45 days to resubmit a second application that is substantially complete. An applicant's failure to submit a substantially complete application after receiving notice from the commissioner is a basis for license denial under section 245A.05. The commissioner shall complete subsequent review within 30 days.\n(n) Once the application is considered complete under paragraph (m), the commissioner will approve or deny an application for an alternative overnight supervision license within 60 days.\n(o) For the purposes of this subdivision, \"supervision\" means:\n(1) oversight by a caregiver or direct support staff as specified in the individual resident's place agreement or support plan and awareness of the resident's needs and activities; and\n(2) the presence of a caregiver or direct support staff in a residence during normal sleeping hours, unless a determination has been made and documented in the individual's support plan that the individual does not require the presence of a caregiver or direct support staff during normal sleeping hours.\n(a) An adult foster care or community residential setting license holder who creates, collects, records, maintains, stores, or discloses any individually identifiable recipient data, whether in an electronic or any other format, must comply with the privacy and security provisions of applicable privacy laws and regulations, including:\n(1) the federal Health Insurance Portability and Accountability Act of 1996 (HIPAA), Public Law 104-1; and the HIPAA Privacy Rule, Code of Federal Regulations, title 45, part 160, and subparts A and E of part 164; and\n(2) the Minnesota Government Data Practices Act as codified in chapter 13.\n(b) For purposes of licensure, the license holder shall be monitored for compliance with the following data privacy and security provisions:\n(1) the license holder must control access to data on residents served by the program according to the definitions of public and private data on individuals under section 13.02; classification of the data on individuals as private under section 13.46, subdivision 2; and control over the collection, storage, use, access, protection, and contracting related to data according to section 13.05, in which the license holder is assigned the duties of a government entity;\n(2) the license holder must provide each resident served by the program with a notice that meets the requirements under section 13.04, in which the license holder is assigned the duties of the government entity, and that meets the requirements of Code of Federal Regulations, title 45, part 164.52. The notice shall describe the purpose for collection of the data, and to whom and why it may be disclosed pursuant to law. The notice must inform the individual that the license holder uses electronic monitoring and, if applicable, that recording technology is used;\n(3) the license holder must not install monitoring cameras in bathrooms;\n(4) electronic monitoring cameras must not be concealed from the residents served by the program; and\n(5) electronic video and audio recordings of residents served by the program shall be stored by the license holder for five days unless: (i) a resident served by the program or legal representative requests that the recording be held longer based on a specific report of alleged maltreatment; or (ii) the recording captures an incident or event of alleged maltreatment under section 626.557 or chapter 260E or a crime under chapter 609. When requested by a resident served by the program or when a recording captures an incident or event of alleged maltreatment or a crime, the license holder must maintain the recording in a secured area for no longer than 30 days to give the investigating agency an opportunity to make a copy of the recording. The investigating agency will maintain the electronic video or audio recordings as required in section 626.557, subdivision 12b.\n(c) The commissioner shall develop, and make available to license holders and county licensing workers, a checklist of the data privacy provisions to be monitored for purposes of licensure.\n(a) The commissioner shall establish provider standards for residential support services that integrate service standards and the residential setting under one license. The commissioner shall propose statutory language and an implementation plan for licensing requirements for residential support services to the legislature by January 15, 2012, as a component of the quality outcome standards recommendations required by Laws 2010, chapter 352, article 1, section 24.\n(b) Providers licensed under chapter 245B, and providing, contracting, or arranging for services in settings licensed as adult foster care under Minnesota Rules, parts 9555.5105 to 9555.6265; and meeting the provisions of section 245D.02, subdivision 4a, must be required to obtain a community residential setting license.\n(a) A resident receiving services must have a choice of roommate. Each roommate must consent in writing to sharing a bedroom with one another. The license holder is responsible for notifying a resident of the resident's right to request a change of roommate.\n(b) The license holder must provide a lock for each resident's bedroom door, unless otherwise indicated for the resident's health, safety, or well-being. A restriction on the use of the lock must be documented and justified in the resident's individual abuse prevention plan required by sections 245A.65, subdivision 2, paragraph (b), and 626.557, subdivision 14. For a resident served under chapter 256S, the case manager must be part of the interdisciplinary team under section 245A.65, subdivision 2, paragraph (b).\n(a) The license holder shall ensure that a resident and a resident's legal representative are given, at admission:\n(1) an explanation and copy of the resident's rights specified in paragraph (b);\n(2) a written summary of the Vulnerable Adults Protection Act prepared by the department; and\n(3) the name, address, and telephone number of the local agency to which a resident or a resident's legal representative may submit an oral or written complaint.\n(b) Adult foster care resident rights include the right to:\n(1) have daily, private access to and use of a non-coin-operated telephone for local and long-distance telephone calls made collect or paid for by the resident;\n(2) receive and send, without interference, uncensored, unopened mail or electronic correspondence or communication;\n(3) have use of and free access to common areas in the residence and the freedom to come and go from the residence at will;\n(4) have privacy for visits with the resident's spouse, next of kin, legal counsel, religious adviser, or others, according to section 363A.09 of the Human Rights Act, including privacy in the resident's bedroom;\n(5) keep, use, and access the resident's personal clothing and possessions as space permits, unless this right infringes on the health, safety, or rights of another resident or household member, including the right to access the resident's personal possessions at any time;\n(6) choose the resident's visitors and time of visits and participate in activities of commercial, religious, political, and community groups without interference if the activities do not infringe on the rights of another resident or household member;\n(7) if married, privacy for visits by the resident's spouse, and, if both spouses are residents of the adult foster home, the residents have the right to share a bedroom and bed;\n(8) privacy, including use of the lock on the resident's bedroom door or unit door. A resident's privacy must be respected by license holders, caregivers, household members, and volunteers by knocking on the door of a resident's bedroom or bathroom and seeking consent before entering, except in an emergency;\n(9) furnish and decorate the resident's bedroom or living unit;\n(10) engage in chosen activities and have an individual schedule supported by the license holder that meets the resident's preferences;\n(11) freedom and support to access food at any time;\n(12) have personal, financial, service, health, and medical information kept private, and be advised of disclosure of this information by the license holder;\n(13) access records and recorded information about the resident according to applicable state and federal law, regulation, or rule;\n(14) be free from maltreatment;\n(15) be treated with courtesy and respect and receive respectful treatment of the resident's property;\n(16) reasonable observance of cultural and ethnic practice and religion;\n(17) be free from bias and harassment regarding race, gender, age, disability, spirituality, and sexual orientation;\n(18) be informed of and use the license holder's grievance policy and procedures, including how to contact the highest level of authority in the program;\n(19) assert the resident's rights personally, or have the rights asserted by the resident's family, authorized representative, or legal representative, without retaliation; and\n(20) give or withhold written informed consent to participate in any research or experimental treatment.\n(c) A restriction of a resident's rights under paragraph (b), clauses (1) to (4), (6), (8), (10), and (11), is allowed only if determined necessary to ensure the health, safety, and well-being of the resident. Any restriction of a resident's right must be documented and justified in the resident's individual abuse prevention plan required by sections 245A.65, subdivision 2, paragraph (b) and 626.557, subdivision 14. For a resident served under chapter 256S, the case manager must be part of the interdisciplinary team under section 245A.65, subdivision 2, paragraph (b). The restriction must be implemented in the least restrictive manner necessary to protect the resident and provide support to reduce or eliminate the need for the restriction.\n(a) This subdivision applies to foster care services for a resident served under chapter 256S.\n(b) The foster care license holder must establish policies and procedures for service termination that promote continuity of care and service coordination with the resident and the case manager and with another licensed caregiver, if any, who also provides support to the resident. The policy must include the requirements specified in paragraphs (c) to (h).\n(c) The license holder must allow a resident to remain in the program and cannot terminate services unless:\n(1) the termination is necessary for the resident's health, safety, and well-being and the resident's needs cannot be met in the facility;\n(2) the safety of the resident or another resident in the program is endangered and positive support strategies were attempted and have not achieved and effectively maintained safety for the resident or another resident in the program;\n(3) the health, safety, and well-being of the resident or another resident in the program would otherwise be endangered;\n(4) the program was not paid for services;\n(5) the program ceases to operate; or\n(6) the resident was terminated by the lead agency from waiver eligibility.\n(d) Before giving notice of service termination, the license holder must document the action taken to minimize or eliminate the need for termination. The action taken by the license holder must include, at a minimum:\n(1) consultation with the resident's interdisciplinary team to identify and resolve issues leading to a notice of service termination; and\n(2) a request to the case manager or other professional consultation or intervention services to support the resident in the program. This requirement does not apply to a notice of service termination issued under paragraph (c), clause (4) or (5).\n(e) If, based on the best interests of the resident, the circumstances at the time of notice were such that the license holder was unable to take the action specified in paragraph (d), the license holder must document the specific circumstances and the reason the license holder was unable to take the action.\n(f) The license holder must notify the resident or the resident's legal representative and the case manager in writing of the intended service termination. The notice must include:\n(1) the reason for the action;\n(2) except for service termination under paragraph (c), clause (4) or (5), a summary of the action taken to minimize or eliminate the need for termination and the reason the action failed to prevent the termination;\n(3) the resident's right to appeal the service termination under section 256.045, subdivision 3, paragraph (a); and\n(4) the resident's right to seek a temporary order staying the service termination according to the procedures in section 256.045, subdivision 4a, or subdivision 6, paragraph (c).\n(g) Notice of the proposed service termination must be given at least 30 days before terminating a resident's service.\n(h) After the resident receives the notice of service termination and before the services are terminated, the license holder must:\n(1) work with the support team or expanded support team to develop reasonable alternatives to support continuity of care and to protect the resident;\n(2) provide information requested by the resident or case manager; and\n(3) maintain information about the service termination, including the written notice of service termination, in the resident's record.\n(a) Child foster care license holders must maintain the ability to care for a foster child and ensure a safe home environment for children placed in their care. License holders must immediately notify the licensing agency of:\n(1) any changes to the license holder or household member's physical or behavioral health that may affect the license holder's ability to care for a foster child or pose a risk to a foster child's health; or\n(2) changes related to the care of a child or vulnerable adult for whom the license holder is a parent or legally responsible, including living out of the home for treatment for physical or behavioral health, modified parenting time arrangements, legal custody, or placement in foster care.\n(b) The licensing agency may request a license holder or household member to undergo an evaluation by a specialist in areas such as physical or behavioral health to evaluate the license holder's ability to provide a safe environment for a foster child. Prior to assigning a specialist to evaluate, the licensing agency must tell the license holder or household member why the licensing agency has requested a specialist evaluation and request a release of information from the license holder or household member.",
	"repealed": false
}