{
	"id": "89.17",
	"url": "https://www.revisor.mn.gov/statutes/cite/89.17",
	"title": "89.17 LEASES AND PERMITS.",
	"text": "(a) Notwithstanding the permit procedures of chapter 90, the commissioner may grant and execute, in the name of the state, leases and permits for the use of any forest lands under the authority of the commissioner for any purpose that in the commissioner's opinion is not inconsistent with the maintenance and management of the forest lands, on forestry principles for timber production. Every such lease or permit is revocable at the discretion of the commissioner at any time subject to such conditions as may be agreed on in the lease. The approval of the commissioner of administration is not required upon any such lease or permit. No such lease or permit for a period exceeding 21 years shall be granted except with the approval of the Executive Council.\n(b) Public access to the leased land for outdoor recreation is the same as access would be under state management.\n(c) Notwithstanding section 16A.125, subdivision 5, after deducting the reasonable costs incurred for preparing and issuing the lease, all remaining proceeds from leasing school trust land and university land for roads on forest lands must be deposited into the respective permanent fund for the lands.\n(d) The commissioner may require a performance bond, security deposit, or other form of security for removing any improvements or personal property left on the leased premises by the lessee upon termination or cancellation of the lease.\n(e) In addition to other payments required by this section, the applicant must reimburse the state for costs incurred for cultural resources review, monitoring, or other services provided by the Minnesota Historical Society under contract with the commissioner of natural resources or the State Historic Preservation Office of the Department of Administration in connection with reviewing the lease request, preparing the lease terms, or monitoring construction of improvements on the leased premises.",
	"repealed": false
}