{
	"id": "609.321",
	"url": "https://www.revisor.mn.gov/statutes/cite/609.321",
	"title": "609.321 PROSTITUTION AND SEX TRAFFICKING; DEFINITIONS.",
	"text": "For the purposes of sections 609.321 to 609.325, the following terms have the meanings given.\n\"Business of prostitution\" means any arrangement between or organization of two or more persons, acting other than as prostitutes or patrons, who commit acts punishable under sections 609.321 to 609.324.\n[Repealed, 1998 c 367 art 2 s 33]\n\"Patron\" means an individual who engages in prostitution by hiring, offering to hire, or agreeing to hire another individual to engage in sexual penetration or sexual contact.\n\"Place of prostitution\" means a house or other place where prostitution is practiced.\n[Repealed, 1998 c 367 art 2 s 33]\n\"Promotes the prostitution of an individual\" means any of the following wherein the person knowingly:\n(1) solicits or procures patrons for a prostitute;\n(2) provides, leases or otherwise permits premises or facilities owned or controlled by the person to aid the prostitution of an individual;\n(3) owns, manages, supervises, controls, keeps or operates, either alone or with others, a place of prostitution to aid the prostitution of an individual;\n(4) owns, manages, supervises, controls, operates, institutes, aids or facilitates, either alone or with others, a business of prostitution to aid the prostitution of an individual;\n(5) admits a patron to a place of prostitution to aid the prostitution of an individual; or\n(6) transports an individual from one point within this state to another point either within or without this state, or brings an individual into this state to aid the prostitution of the individual.\n\"Sex trafficking\" means:\n(1) receiving, recruiting, enticing, harboring, providing, or obtaining by any means an individual to aid in the prostitution of the individual; or\n(2) receiving profit or anything of value, knowing or having reason to know it is derived from an act described in clause (1).\n\"Sex trafficking victim\" means a person subjected to the practices in subdivision 7a.\n\"Prostitute\" means an individual who engages in prostitution by being hired, offering to be hired, or agreeing to be hired by another individual to engage in sexual penetration or sexual contact.\n\"Prostitution\" means hiring, offering to hire, or agreeing to hire another individual to engage in sexual penetration or sexual contact, or being hired, offering to be hired, or agreeing to be hired by another individual to engage in sexual penetration or sexual contact.\n\"Sexual contact\" means any of the following acts, if the acts can reasonably be construed as being for the purpose of satisfying the actor's sexual impulses:\n(i) the intentional touching by an individual of a prostitute's intimate parts; or\n(ii) the intentional touching by a prostitute of another individual's intimate parts.\n\"Sexual penetration\" means any of the following acts, if for the purpose of satisfying sexual impulses: sexual intercourse, cunnilingus, fellatio, anal intercourse, or any intrusion however slight into the genital or anal openings of an individual's body by any part of another individual's body or any object used for the purpose of satisfying sexual impulses. Emission of semen is not necessary.\nA \"public place\" means a public street or sidewalk, a pedestrian skyway system as defined in section 469.125, subdivision 4, a hotel, motel, steam room, sauna, massage parlor, shopping mall and other public shopping areas, or other place of public accommodation, a place licensed to sell intoxicating liquor, wine, nonintoxicating malt beverages, or food, or a motor vehicle located on a public street, alley, or parking lot ordinarily used by or available to the public though not used as a matter of right and a driveway connecting such a parking lot with a street or highway.\n\"Place of public accommodation\" means a business, accommodation, refreshment, entertainment, recreation, or transportation facility of any kind, whether licensed or not, whose goods, services, facilities, privileges, advantages, or accommodations are extended, offered, sold, or otherwise made available to the public.\nA \"prior qualified human trafficking-related offense\" means a conviction or delinquency adjudication within the ten years from the discharge from probation or parole immediately preceding the current offense for a violation of or an attempt to violate section 609.322, subdivision 1 (solicitation, inducement, and promotion of prostitution; sex trafficking in the first degree); 609.322, subdivision 1a (solicitation, inducement, and promotion of prostitution; sex trafficking in the second degree); 609.282 (labor trafficking); or 609.283 (unlawful conduct with respect to documents in furtherance of labor or sex trafficking).\n\"Debt bondage\" has the meaning given in section 609.281, subdivision 3.\n\"Forced or coerced labor or services\" has the meaning given in section 609.281, subdivision 4.\n\"Labor trafficking victim\" has the meaning given in section 609.281, subdivision 6.",
	"repealed": false
}