{
	"id": "8.16",
	"url": "https://www.revisor.mn.gov/statutes/cite/8.16",
	"title": "8.16 ATTORNEY GENERAL; ADMINISTRATIVE SUBPOENAS.",
	"text": "The attorney general, or any deputy, assistant, or special assistant attorney general whom the attorney general authorizes in writing, has the authority in any county of the state to subpoena and require the production of any records of telephone companies, cellular phone companies, paging companies, subscribers of private computer networks including Internet service providers or computer bulletin board systems, electric companies, gas companies, water utilities, chemical suppliers, hotels and motels, pawn shops, airlines, buses, taxis, and other entities engaged in the business of transporting people, and freight companies, self-service storage facilities, warehousing companies, package delivery companies, and other entities engaged in the businesses of transport, storage, or delivery, and records of the existence of safe deposit box account numbers and customer savings and checking account numbers maintained by financial institutions and safe deposit companies. Subpoenas may only be issued for records that are relevant to an ongoing legitimate law enforcement investigation.\nThe attorney general may in any county of the state subpoena and require the production of any records relating to the location of a debtor or the assets of a debtor, as that term is defined in section 16D.02, subdivision 4. Subpoenas may be issued only for records that are relevant to an investigation related to debt collection and exclude the power to subpoena personal appearance of witnesses unless the attorney general is so authorized by other statute or court rule.\nThe subpoena shall be enforceable through the district court.\nThe person directed to produce the records must be paid reasonable expenses incurred in producing the records.\nThe subpoena must state that the person to whom the subpoena is directed may not disclose the fact that the subpoena was issued or the fact that the requested records have been produced except:\n(1) insofar as the disclosure is necessary to find and disclose the records; or\n(2) pursuant to court order.\nThe willful failure to produce the documents required by the subpoena is a misdemeanor.\nUpon the ex parte request of the attorney issuing the subpoena, the district court may issue an order directing the production of the records. It is not necessary for either the request or the order to be filed with the court administrator. Failure to comply with the court order subjects the person who fails to comply to civil or criminal contempt of court, or both.",
	"repealed": false
}