{
	"id": "447.045",
	"url": "https://www.revisor.mn.gov/statutes/cite/447.045",
	"title": "447.045 LIQUOR DISPENSARY FUND, COMMUNITY HOSPITAL APPROPRIATION.",
	"text": "If a home rule charter city of the fourth class operates an off-sale municipal liquor dispensary, its council may appropriate not more than $125,000 from the liquor dispensary fund to an incorporated nonprofit hospital association to build a community hospital in the city. The hospital must be governed by a board including two or more members of the city council and be open to all residents of the city on equal terms. The council must not appropriate the money unless the average net earnings of the off-sale municipal liquor dispensary have exceeded $18,000 for the last five completed fiscal years before the date of the appropriation.\nIf the voters of a statutory city operating an on-sale and off-sale municipal liquor store, at a general or special election, vote in favor of contributing from its liquor dispensary fund toward the construction of a community hospital, the city council may appropriate not more than $60,000 from the fund to any incorporated nonprofit hospital association to build a community hospital in the statutory city. The hospital must be governed by a board including two or more members of the statutory city council and be open to all residents of the statutory city on equal terms. This appropriation must not exceed one-half the total cost of construction of the hospital. The council must not appropriate the money unless the average net earnings of the on-sale and off-sale municipal liquor store have been at least $10,000 for the last five completed fiscal years before the date of the appropriation.\n(a) If a statutory city operates an off-sale, or an on- and off-sale municipal liquor store it may provide for a vote at a general or special election on the question of contributing from the city liquor dispensary fund to build, maintain, and operate a community hospital. If the vote is in favor, the city council may appropriate money from the fund to an incorporated hospital association for a period of four years. The appropriation must be from the net profits or proceeds of the municipal liquor store. It must not exceed $4,000 a year for hospital construction and maintenance or $1,000 a year for operation. The hospital must be open to all residents of the community on equal terms.\n(b) The council must not appropriate the money unless the average net earnings of the off-sale, or on- and off-sale municipal liquor store have been at least $8,000 for the last two completed years before the date of the appropriation.\nIf a city of the fourth class operates a municipal liquor store, it may provide for a vote at a general or special election on the question of contributing from the profit in the city liquor dispensary fund to build, equip, and maintain a community hospital within the city limits. If the vote is in favor, the city council may appropriate not more than $200,000 from profits in the fund for the purpose. The hospital must be open to all residents of the city on equal terms.\nThe city may issue certificates of indebtedness in anticipation of and payable only from profits from the operation of municipal liquor stores.\n(a) The council of a statutory city operating a municipal liquor store may appropriate funds from the store's net earnings annually to any incorporated nonprofit hospital association to help maintain and operate the hospital. The appropriation must not exceed 50 percent of the store's net earnings. Money may be appropriated if: (1) the hospital is governed by a board of directors including two or more members of the statutory city council; (2) the hospital grounds and buildings are owned by the municipality and leased to the hospital association; and (3) the hospital is open to all residents of the statutory city on equal terms.\n(b) The council must not appropriate the money unless the average net earnings of the municipal liquor store has been at least $8,000 for the last five completed fiscal years before the date of the appropriation.\nIf a fourth class statutory city operates a municipal liquor store, it may provide for a vote at a general or special election on the question of contributing from the city liquor dispensary fund not more than $15,000 a year for five years to build and maintain a community hospital. If the vote is in favor the council may appropriate the money from the fund to an incorporated community hospital association in the city.\nIf a statutory city operates a municipal liquor store, it may provide for a vote at a general or special election on the question of contributing from the statutory city liquor dispensary fund toward the acquisition, construction, improvement, maintenance, and operation of a community hospital. If the vote is in favor, the council may appropriate money from time to time out of the net profits or proceeds of the municipal liquor store to an incorporated nonprofit hospital association in the statutory city. The hospital association must be governed by a board of directors elected by donors of $50 or more, who each have one vote. The hospital must be open to all residents of the community on equal terms.",
	"repealed": false
}