{
	"id": "204C.12",
	"url": "https://www.revisor.mn.gov/statutes/cite/204C.12",
	"title": "204C.12 CHALLENGES TO VOTERS; PENALTY.",
	"text": "An election judge shall, and an authorized challenger or other voter may, challenge an individual based on personal knowledge that the individual is not an eligible voter.\nA challenger must be a resident of this state. The secretary of state shall prepare a form that challengers must complete and sign when making a challenge. The form must include space to state the ground for the challenge, a statement that the challenge is based on the challenger's personal knowledge, and a statement that the challenge is made under oath. The form must include a space for the challenger's printed name, signature, telephone number, and address.\nAn election judge shall administer to the challenged individual the following oath:\n\"Do you solemnly swear (or affirm) that you will fully and truly answer all questions put to you concerning your eligibility to vote at this election?\"\nThe election judge shall then ask the challenged individual sufficient questions to test that individual's residence and right to vote.\nIn determining the legal residence of a challenged individual, the election judges shall be governed by the principles contained in section 200.031. If the challenged individual's answers to the questions show ineligibility to vote in that precinct, the individual shall not be allowed to vote. If the individual has marked ballots but not yet deposited them in the ballot boxes before the election judges determine ineligibility to vote in that precinct, the marked ballots shall be placed unopened with the spoiled ballots. If the answers to the questions fail to show that the individual is not eligible to vote in that precinct and the challenge is not withdrawn, the election judges shall verbally administer the oath on the voter certificate to the individual. After taking the oath and completing and signing the voter certificate, the challenged individual shall be allowed to vote.\nA challenged individual who refuses to answer questions or sign a polling place roster or voter signature certificate as required by this section must not be allowed to vote. A challenged individual who leaves the polling place and returns later willing to answer questions or sign a polling place roster or voter signature certificate must not be allowed to vote.\nAn election judge who fails to carry out the duties prescribed by this section is guilty of a gross misdemeanor.",
	"repealed": false
}