{
	"id": "297A.64",
	"url": "https://www.revisor.mn.gov/statutes/cite/297A.64",
	"title": "297A.64 RENTAL MOTOR VEHICLE TAX IMPOSED; RATE.",
	"text": "(a) A tax is imposed on the lease or rental in this state for not more than 28 days of a passenger automobile as defined in section 168.002, subdivision 24, a van as defined in section 168.002, subdivision 40, or a pickup truck as defined in section 168.002, subdivision 26. The rate of tax is 9.2 percent of the sales price. The tax applies whether or not the vehicle is licensed in the state.\n(b) The provisions of paragraph (a) do not apply to the vehicles of a nonprofit corporation or similar entity consisting of individual or group members who pay the organization for the use of a motor vehicle if the organization:\n(1) owns, leases, or operates a fleet of vehicles of the type subject to the tax under this subdivision that are available to its members for use, priced on the basis of intervals of one hour or less;\n(2) parks its vehicles in the public right-of-way or at unstaffed, self-service locations that are accessible at any time of the day; and\n(3) maintains its vehicles, insures its vehicles on behalf of its members, and purchases fuel for its fleet.\n(a) A fee equal to five percent of the sales price is imposed on leases or rentals of vehicles subject to the tax under subdivision 1. The lessor on the invoice to the customer may designate the fee as \"a fee imposed by the State of Minnesota for the registration of rental cars.\"\n(b) The provisions of this subdivision do not apply to the vehicles of a nonprofit corporation or similar entity, consisting of individual or group members who pay the organization for the use of a motor vehicle, if the organization:\n(1) owns or leases a fleet of vehicles of the type subject to the tax under subdivision 1 that are available to its members for use, priced on the basis of intervals of one hour or less;\n(2) parks its vehicles in the public right-of-way or at unstaffed, self-service locations that are accessible at any time of the day; and\n(3) maintains its vehicles, insures its vehicles on behalf of its members, and purchases fuel for its fleet.\nThe retailer shall report and pay the tax imposed in subdivision 1 to the commissioner of revenue with the taxes imposed in this chapter. The tax imposed in subdivision 1 and the fee imposed in subdivision 2 are subject to the same interest, penalty, and other provisions provided for sales and use taxes under this chapter and chapter 289A. The audit, assessment, appeal, collection, enforcement, and administrative provisions of this chapter and chapters 270C and 289A, that apply to sales and use taxes, apply to the tax and fee.\n(a) The tax and the fee imposed by this section do not apply to a lease or rental of (1) a vehicle to be used by the lessee to provide a licensed taxi service; (2) a hearse or limousine used in connection with a burial or funeral service; or (3) a van designed or adapted primarily for transporting property rather than passengers. The tax and the fee imposed under this section do not apply when the lease or rental of a vehicle is exempt from the tax imposed under section 297A.62, subdivision 1.\n(b) The lessor may elect not to charge the fee imposed in subdivision 2 if in the previous calendar year the lessor had no more than 20 vehicles available for lease that would have been subject to tax under this section, or no more than $50,000 in gross receipts that would have been subject to tax under this section.\nOn the first sales tax return due following the end of a calendar year during which a lessor has imposed a fee under subdivision 2, the lessor shall report to the commissioner of revenue, in the form required by the commissioner, the amount of the fee collected during the previous year and the amount of motor vehicle registration taxes paid during the previous year by the lessor under chapter 168 on vehicles subject to the fee under this section. If the amount of the fees collected exceeds the amount of motor vehicle registration taxes paid, the lessor shall remit the excess to the commissioner of revenue at the time the report is submitted.",
	"repealed": false
}