{
	"id": "337.10",
	"url": "https://www.revisor.mn.gov/statutes/cite/337.10",
	"title": "337.10 BUILDING AND CONSTRUCTION CONTRACTS; PROHIBITED PROVISIONS.",
	"text": "Provisions contained in, or executed in connection with, a building and construction contract to be performed in Minnesota making the contract subject to the laws of another state or requiring that any litigation, arbitration, or other dispute resolution process on the contract occur in another state are void and unenforceable.\nProvisions contained in, or executed in connection with, a building and construction contract requiring a contractor, subcontractor, or material supplier to waive the right to a mechanics lien or to a claim against a payment bond before the person has been paid for the labor or materials or both that the person furnished are void and unenforceable. This provision shall not affect the validity of a waiver as to any third party who detrimentally relies upon the waiver.\nA building and construction contract shall be deemed to require the prime contractor and all subcontractors to promptly pay any subcontractor or material supplier contract within ten days of receipt by the party responsible for payment of payment for undisputed services provided by the party requesting payment, including payments under subdivision 4. The contract shall be deemed to require the party responsible for payment to pay interest of 1-1/2 percent per month to the party requesting payment on any undisputed amount not paid on time. The minimum monthly interest penalty payment for an unpaid balance of $100 or more is $10. For an unpaid balance of less than $100, the party responsible for payment shall pay the actual penalty due to the party requesting payment. A party requesting payment who prevails in a civil action to collect interest penalties from a party responsible for payment must be awarded its costs and disbursements, including attorney fees incurred in bringing the action. If an undisputed payment is not received within ten days, the prime contractor or subcontractor of any tier that has not received the undisputed payment may suspend work under the building and construction contract until the undisputed payment is received.\n(a) Unless the building and construction contract provides otherwise, the owner or other persons making payments under the contract must make progress payments monthly as the work progresses. Payments shall be based upon estimates of work completed as approved by the owner or the owner's agent. A progress payment shall not be considered acceptance or approval of any work or waiver of any defects therein.\n(b) Retainage on a building and construction contract may not exceed five percent. An owner or owner's agent may reduce the amount of retainage and may eliminate retainage on any monthly contract payment if, in the owner's opinion, the work is progressing satisfactorily. If the owner reduces the amount of retainage, the contractor must reduce retainage for any subcontractors at the same rate. Nothing in this subdivision is intended to require that retainage be withheld in any building or construction contract.\n(c) The owner or the owner's agent must release all retainage no later than 60 days after substantial completion subject to the terms of this subdivision. For purposes of this subdivision, \"substantial completion\" shall be determined as provided in section 541.051, subdivision 1, paragraph (a).\n(d) A contractor must pay all remaining retainage to its subcontractors no later than ten days after receiving payment of retainage, unless there is a dispute about the work under a subcontract, in which case the contractor must pay out retainage to any party whose work is not involved in the dispute. If there is a dispute about the work under a subcontract, the contractor must pay out retainage to any subcontractor whose work is not involved in the dispute, and must provide a written statement detailing the amount and reason for the withholding to the affected subcontractor.\n(e) After substantial completion, an owner or owner's agent may withhold no more than:\n(1) 250 percent of the cost to correct or complete work known at the time of substantial completion; and\n(2) one percent of the value of the contract or $500, whichever is greater, pending completion and submission of all final paperwork by the contractor or subcontractor. For purposes of this subdivision, \"final paperwork\" means documents required to fulfill contractual obligations, including, but not limited to, operation manuals, payroll documents for projects subject to prevailing wage requirements, and the withholding exemption certificate required by section 270C.66.\nIf the owner or the owner's agent withholds payment under this paragraph, the owner or the owner's agent must promptly provide a written statement detailing the amount and basis of withholding to the contractor. The owner or the owner's agent and the contractor must provide a copy of this statement to any subcontractor that requests it. Any amounts withheld under clause (1) must be paid within 60 days after completion of the work. Any amounts withheld under clause (2) must be paid within 60 days after submission of all final paperwork.\n(f) Withholding retainage for warranty work is prohibited. This provision does not waive any rights for warranty claims.\n(g) This subdivision does not apply to a public agency as defined in section 15.71, subdivision 3.\n(h) This subdivision does not apply to contracts for professional services as defined in sections 326.02 to 326.15.\n(i) Nothing in this section requires payment for a portion of a contract that is not complete or for which an invoice has not been submitted.\nFor the purpose of this section, \"building and construction contract\" has the meaning given the term in section 337.01.",
	"repealed": false
}