{
	"id": "18E.05",
	"url": "https://www.revisor.mn.gov/statutes/cite/18E.05",
	"title": "18E.05 AGRICULTURAL CHEMICAL RESPONSE COMPENSATION BOARD.",
	"text": "(a) The Agricultural Chemical Response Compensation Board is created to consist of the commissioner of agriculture, the commissioner of commerce, and three private industry members consisting of: one representative of agricultural chemical manufacturers and wholesalers; one representative of farmers; and one representative of dealers who sell the agricultural chemicals at retail. The governor shall appoint the private industry members. Appointment, vacancies, removal, terms, and payment of compensation and expenses of members, but not expiration of the board itself, are governed by section 15.0575.\n(b) The commissioner of agriculture shall provide staff to support the activities of the board.\n(c) The board shall adopt rules regarding its practices and procedures, the application form and procedures for determining eligibility for and the amount of reimbursement, and procedures for investigation of claims.\nThe board shall:\n(1) accept applications for reimbursement from the account;\n(2) determine the eligibility of applicants for reimbursement;\n(3) determine the amount of reimbursement due each eligible applicant and the reimbursement payment schedule where applicable; and\n(4) order reimbursement and notify the commissioner of the eligible person, the amount of reimbursement due, and the payment schedule, if any.\nThe board must receive a completed application at least 30 days before a board meeting in order for a request for reimbursement or payment to be considered at that meeting, unless the applicant and the commissioner agree to a longer time period. The board may waive the 30-day requirement if it determines that undue financial hardship to the applicant will result if action is delayed until the next regular meeting. The board must act upon a completed application request at the next regular board meeting, unless additional information is required from the applicant or the commissioner. If the board denies reimbursement or payment, its decision may be appealed in a contested case proceeding under chapter 14.",
	"repealed": false
}