{
	"id": "168A.11",
	"url": "https://www.revisor.mn.gov/statutes/cite/168A.11",
	"title": "168A.11 PURCHASE OF VEHICLE BY DEALER.",
	"text": "(a) A dealer who buys a vehicle and holds it for resale need not apply for a certificate of title. Upon transferring the vehicle to another person, other than by the creation of a security interest, the dealer must promptly execute the assignment and warranty of title by a dealer, showing the names and addresses of the transferee and of any secured party holding a security interest created or reserved at the time of the resale, and the date of the security agreement in the spaces provided on the certificate of title or secure reassignment.\n(b) If a dealer elects to apply for a certificate of title on a vehicle held for resale, the dealer need not register the vehicle but must pay one month's registration tax. If a dealer elects to apply for a certificate of title on a vehicle held for resale, the commissioner must not place any legend on the title that no motor vehicle sales tax was paid by the dealer but may indicate on the title whether the vehicle is a new or used vehicle.\n(c) With respect to motor vehicles subject to the provisions of section 325E.15, the dealer must also, in the space provided on the certificate of title or secure reassignment, state the true cumulative mileage registered on the odometer or that the exact mileage is unknown if the odometer reading is known by the transferor to be different from the true mileage.\n(d) The transferee must complete the application for title section on the certificate of title or separate title application form prescribed by the commissioner. The dealer must mail or deliver the certificate to the commissioner or deputy registrar with the transferee's application for a new certificate and appropriate taxes and fees, within the period specified under section 168A.10, subdivision 2.\n(e) With respect to vehicles sold to buyers who will remove the vehicle from this state, the dealer must remove any license plates from the vehicle, issue a 31-day temporary permit pursuant to section 168.091, and notify the commissioner within 48 hours of the sale that the vehicle has been removed from this state. The notification must be made in an electronic format prescribed by the commissioner. The dealer may contract with a deputy registrar for the notification of sale to an out-of-state buyer. The deputy registrar may charge a fee of $7 per transaction to provide this service.\nWithin 48 hours of acquiring a vehicle titled and registered in Minnesota, a dealer must:\n(1) notify the commissioner that the dealership is holding the vehicle for resale. The notification must be made electronically as prescribed by the commissioner. The dealer may contract this service to a deputy registrar and the registrar may charge a fee of $7 per transaction to provide this service; and\n(2) remove any plates from the vehicle and dispose of them as prescribed by the commissioner.\nEvery dealer must maintain for three years at an established place of business a record in the form the department prescribes of every vehicle bought, sold, or exchanged, or received for sale or exchange, which must be open to inspection by a representative of the department or peace officer during established inspection hours listed on the initial dealer license application or as noted on the dealer record. With respect to motor vehicles subject to the provisions of section 325E.15, the record must include either the true mileage as stated by the previous owner or the fact that the previous owner stated the actual cumulative mileage was unknown; the record also must include either the true mileage the dealer stated upon transferring the vehicle or the fact the dealer stated the mileage was unknown.\nTwo or more new motor vehicle dealers under common management or control may apply to the department in writing for permission to maintain the records required by this section and section 168.27, subdivision 10, paragraph (a), clause (1), item (i), at a single location. The department shall consent to the application unless it provides a reasonable basis for denial. The records must be open to inspection by a representative of the department or a peace officer during reasonable business hours. The location must be at the established place of business of one of the affiliated dealers or at a location within Minnesota not further than 25 miles from the established place of business of one of the affiliated dealers.",
	"repealed": false
}