{
	"id": "325B.01",
	"url": "https://www.revisor.mn.gov/statutes/cite/325B.01",
	"title": "325B.01 DEFINITIONS.",
	"text": "As used in sections 325B.01 to 325B.17 and unless otherwise required by the context, the terms defined in this section have the meanings given them.\n\"Agreement\" means one or more of the following:\n(a) a commercial relationship between a beer wholesaler and a brewer of a definite or indefinite duration, which is not required to be evidenced in writing;\n(b) a relationship whereby the beer wholesaler is granted the right to offer and sell a brand or brands of beer offered by a brewer;\n(c) a relationship whereby the beer wholesaler, as an independent business, constitutes a component of a brewer's distribution system;\n(d) a relationship whereby the beer wholesaler's business is substantially associated with a brewer's brand or brands, designating the brewer;\n(e) a relationship whereby the beer wholesaler's business is substantially reliant on a brewer for the continued supply of beer;\n(f) a written or oral arrangement for a definite or indefinite period whereby a brewer grants to a beer wholesaler a license to use a brand, trade name, trademark, or service mark, and in which there is a community of interest in the marketing of goods or services at wholesale or retail.\n\"Beer wholesaler\" shall mean any person importing or causing to be imported into this state or purchasing or causing to be purchased within this state, any beer for sale or resale to retailers or wholesalers, without regard to whether the business of the person is conducted under the terms of an agreement with a brewer.\n\"Brewer\" means every brewer or importer of beer located within or without the state of Minnesota, who enters into an \"agreement\" with any beer wholesaler doing business in the state of Minnesota.\n\"Person\" means a natural person, corporation, partnership, trust, agency, or other entity as well as the individual officers, directors or other persons in active control of the activities of each such entity. Person also includes heirs, assigns, personal representatives and guardians.\n\"Successor\" means a person who replaces a brewer, importer, or wholesaler with regard to the right to manufacture, sell, distribute, or import a brand or brands of beer.\n\"Territory\" or \"sales territory\" means the area of primary sales responsibility designated by any agreement between any beer wholesaler and brewer for the brand or brands of any brewer.",
	"repealed": false
}