{
	"id": "469.144",
	"url": "https://www.revisor.mn.gov/statutes/cite/469.144",
	"title": "469.144 ESTABLISHMENT; BOARD.",
	"text": "Any county or combination of counties by resolution of the county board or boards may establish a rural development financing authority as a public nonprofit corporation. An authority has the powers and duties conferred and imposed on a private nonprofit corporation by chapter 317A, except as otherwise or additionally provided herein. No such authority shall transact any business or exercise any powers until a certified copy of the resolutions of each participating county board has been submitted to the secretary of state and a certificate of incorporation issued pursuant to section 317A.155. Each resolution shall include all of the provisions required by section 317A.111, subdivision 1. Alternatively, a county may determine by resolution of the county board to exercise the powers granted in this chapter to a rural development finance authority. No filing is required.\nEach rural development financing authority shall be managed and controlled by a board of directors consisting of that number of persons equal to the number of counties establishing the authority, but in no case less than five. The directors shall be elected by the establishing county board or boards and each county board shall have one vote. The directors initially elected shall serve staggered terms designated by the electing board or boards. Thereafter, all directors shall be elected for five-year terms and until their successors are elected and qualify. Each vacancy in an unexpired term shall be filled in the manner in which the original appointment was made. Each director shall be a resident of the establishing county and no director shall hold any other public office or be an officer, employee, director, shareholder, or member of any corporation, firm, or association with which the authority has entered into any operating or lease agreement. Directors may be removed by the appointing board or boards for the reasons and in the manner prescribed by section 469.010, and shall receive no compensation other than reimbursement for expenses incurred in the performance of their duties. Directors shall have no personal liability for corporate obligations of the authority or the methods of enforcement and collection thereof.\nRural development financing authorities shall have no capital stock. Sections 469.142 to 469.151 shall constitute their articles of incorporation. An authority may adopt bylaws consistent with sections 469.142 to 469.151.",
	"repealed": false
}