{
	"id": "331A.04",
	"url": "https://www.revisor.mn.gov/statutes/cite/331A.04",
	"title": "331A.04 DESIGNATION OF A NEWSPAPER FOR OFFICIAL PUBLICATIONS.",
	"text": "The governing body of a political subdivision, when authorized or required by statute or charter to designate a newspaper for publication of its public notices, shall designate a qualified newspaper in the following priority.\nIf there are one or more qualified newspapers, the known office of issue of which are located within the political subdivision, one of them shall be designated.\nWhen no qualified newspaper has a known office of issue located in the political subdivision, but one or more qualified newspapers maintain a secondary office there, one of them shall be designated.\nWhen no qualified newspaper has its known office of issue or a secondary office located within the political subdivision, then a qualified newspaper of general circulation there shall be designated.\nIf a political subdivision is without an official newspaper, or if the publisher refuses to publish a particular public notice, matters required to be published shall be published in a newspaper designated as provided in subdivision 4. The governing body of a political subdivision with territory in two or more counties may, if deemed in the public interest, designate a separate qualified newspaper for each county.\n(a) Notwithstanding subdivisions 1 to 3, the governing body of a political subdivision may designate any newspaper for publication of its official proceedings and public notices, if the following conditions are met:\n(1) the newspaper is a qualified medium of official and legal publication;\n(2) the publisher of the newspaper furnishes a sworn statement, verified by a recognized independent circulation auditing agency, covering a period of at least one year ending no earlier than 60 days before designation of the newspaper, stating that the newspaper's circulation reaches not fewer than 75 percent of the households within the political subdivision;\n(3) the newspaper has provided regular coverage of the proceedings of the governing body of the political subdivision and will continue to do so; and\n(4) the governing body votes unanimously to designate the newspaper.\n(b) If the circulation of a newspaper designated under this subdivision falls below 75 percent of the households within the political subdivision at any time within the term of its designation as official newspaper, its qualification to publish public notices for the political subdivision terminates.\nA bid submitted jointly by two or more newspapers for the publication of public notices must not be considered anticompetitive or otherwise unlawful if the following conditions are met:\n(1) all of the qualified newspapers eligible for designation participate in the joint bid;\n(2) the existence of the joint bid arrangement is disclosed to the governing body of the political subdivision before or at the time of submission of the joint bid; and\n(3) the governing body is free to reject the joint bid and, if it does, individual qualified newspapers do not refuse to submit separate bids owing to the rejection of the joint bid.",
	"repealed": false
}