{
	"id": "149A.70",
	"url": "https://www.revisor.mn.gov/statutes/cite/149A.70",
	"title": "149A.70 BUSINESS PRACTICES.",
	"text": "Only a person holding a valid license to practice mortuary science issued by the commissioner may use the title of mortician, funeral director, or any other title implying that the licensee is engaged in the business or practice of mortuary science. Only the holder of a valid license to operate an alkaline hydrolysis facility issued by the commissioner may use the title of alkaline hydrolysis facility, water cremation, water-reduction, biocremation, green-cremation, resomation, dissolution, or any other title, word, or term implying that the licensee operates an alkaline hydrolysis facility. Only the holder of a valid license to operate a funeral establishment issued by the commissioner may use the title of funeral home, funeral chapel, funeral service, or any other title, word, or term implying that the licensee is engaged in the business or practice of mortuary science. Only the holder of a valid license to operate a crematory issued by the commissioner may use the title of crematory, crematorium, green-cremation, or any other title, word, or term implying that the licensee operates a crematory or crematorium. Effective July 1, 2025, only the holder of a valid license to operate a natural organic reduction facility issued by the commissioner may use the title of natural organic reduction facility, human composting, or any other title, word, or term implying that the licensee operates a natural organic reduction facility.\nA funeral establishment, alkaline hydrolysis facility, crematory, or, effective July 1, 2025, natural organic reduction facility shall not do business in a location that is not licensed as a funeral establishment, alkaline hydrolysis facility, crematory, or natural organic reduction facility and shall not advertise a service that is available from an unlicensed location.\nNo licensee, clinical student, practicum student, intern, or transfer care specialist shall publish or disseminate false, misleading, or deceptive advertising. False, misleading, or deceptive advertising includes, but is not limited to:\n(1) identifying, by using the names or pictures of, persons who are not licensed to practice mortuary science in a way that leads the public to believe that those persons will provide mortuary science services;\n(2) using any name other than the names under which the funeral establishment, alkaline hydrolysis facility, crematory, or, effective July 1, 2025, natural organic reduction facility is known to or licensed by the commissioner;\n(3) using a surname not directly, actively, or presently associated with a licensed funeral establishment, alkaline hydrolysis facility, crematory, or, effective July 1, 2025, natural organic reduction facility, unless the surname had been previously and continuously used by the licensed funeral establishment, alkaline hydrolysis facility, crematory, or natural organic reduction facility; and\n(4) using a founding or establishing date or total years of service not directly or continuously related to a name under which the funeral establishment, alkaline hydrolysis facility, crematory, or, effective July 1, 2025, natural organic reduction facility is currently or was previously licensed.\nAny advertising or other printed material that contains the names or pictures of persons affiliated with a funeral establishment, alkaline hydrolysis facility, crematory, or, effective July 1, 2025, natural organic reduction facility shall state the position held by the persons and shall identify each person who is licensed or unlicensed under this chapter.\nNo licensee shall directly or indirectly pay or cause to be paid any sum of money or other valuable consideration for the securing of business or for obtaining the authority to dispose of any dead human body.\nFor purposes of this subdivision, licensee includes a registered intern, transfer care specialist, or any agent, representative, employee, or person acting on behalf of the licensee.\nNo licensee, clinical student, practicum student, intern, or transfer care specialist shall offer, solicit, or accept a commission, fee, bonus, rebate, or other reimbursement in consideration for recommending or causing a dead human body to be disposed of by a specific body donation program, funeral establishment, alkaline hydrolysis facility, crematory, mausoleum, cemetery, or, effective July 1, 2025, natural organic reduction facility.\nNo funeral provider or whole body donation program may directly or indirectly:\n(1) call upon an individual at a grave site, in a hospital, nursing home, hospice, or similar institution or facility, or at a visitation, wake, or reviewal for the purpose of soliciting the sale of funeral goods, funeral services, burial site goods, or burial site services or for the purpose of making arrangements for a funeral or the final disposition of a dead human body, without a specific request for solicitation from that individual;\n(2) solicit the sale of funeral goods, funeral services, burial site goods, or burial site services from an individual whose impending death is readily apparent, without a specific request for solicitation from that individual; or\n(3) engage in solicitation of an individual who has the right to control the final disposition of a dead human body within ten days after the death of the individual whose body is being disposed, without a specific request for solicitation from that individual.\nThis subdivision does not apply to communications between an individual and a funeral provider who is related to the individual by blood, adoption, or marriage.\nExcept as otherwise provided in this chapter, a licensed funeral establishment may not employ unlicensed personnel to perform the duties of a funeral director or mortician. A licensee may be personally assisted by a nonlicensed employee when removing a dead human body from the place of death and in the lifting of a dead human body at the funeral establishment. The nonlicensed employee must be in the immediate physical presence of the licensee in charge at all times. The funeral establishment and the individual licensee are responsible for compliance and training of the nonlicensed employee outlined in sections 149A.90, subdivision 6, and 149A.92, subdivisions 7 and 10, and shall be fully accountable for all actions of the nonlicensed employee.\nNo licensee, intern, or transfer care specialist shall engage in or permit others under the licensee's, intern's, or transfer care specialist's supervision or employment to engage in unprofessional conduct. Unprofessional conduct includes, but is not limited to:\n(1) harassing, abusing, or intimidating a customer, employee, or any other person encountered while within the scope of practice, employment, or business;\n(2) using profane, indecent, or obscene language within the immediate hearing of the family or relatives of the deceased;\n(3) failure to treat with dignity and respect the body of the deceased, any member of the family or relatives of the deceased, any employee, or any other person encountered while within the scope of practice, employment, or business;\n(4) the habitual overindulgence in the use of or dependence on intoxicating liquors, prescription drugs, over-the-counter drugs, illegal drugs, or any other mood altering substances that substantially impair a person's work-related judgment or performance;\n(5) revealing personally identifiable facts, data, or information about a decedent, customer, member of the decedent's family, or employee acquired in the practice or business without the prior consent of the individual, except as authorized by law;\n(6) intentionally misleading or deceiving any customer in the sale of any goods or services provided by the licensee;\n(7) knowingly making a false statement in the procuring, preparation, or filing of any required permit or document; or\n(8) knowingly making a false statement on a record of death.\nAll funeral establishments and funeral providers must clearly state by whom they are owned on all price lists, business literature, stationery, websites, correspondence, and contracts. This subdivision does not apply to envelopes, business cards, newspaper advertisements, telephone book advertisements, billboard advertisements, or radio and television advertisements.\n(a) Within 15 days of a change in ownership of a funeral establishment or funeral provider, the funeral establishment or funeral provider shall notify all preneed consumers by first class mail of the change in ownership. The notification shall advise the preneed consumers of their right to transfer all preneed trust funds to a new funeral provider and shall advise all preneed consumers who have revocable preneed trusts of their right to terminate the trust and receive a refund of all principal paid into the trust, plus interest accrued.\n(b) For purposes of this subdivision:\n(1) \"change in ownership\" means:\n(i) the sale or transfer of 50 percent or more of the controlling interest or assets of a funeral establishment or funeral provider;\n(ii) the sale or transfer of a controlling interest of a funeral establishment or funeral provider; or\n(iii) the termination of the business of a funeral establishment or funeral provider where there is no transfer of assets or stock; and\n(2) \"controlling interest\" means:\n(i) an interest in a partnership of greater than 50 percent; or\n(ii) greater than 50 percent of the issued and outstanding shares of a stock of a corporation.",
	"repealed": false
}