{
	"id": "349.152",
	"url": "https://www.revisor.mn.gov/statutes/cite/349.152",
	"title": "349.152 DIRECTOR.",
	"text": "The governor shall appoint, with the advice and consent of the senate, a director from a list of one or more persons submitted by the board. The director serves in the unclassified service at the pleasure of the governor.\nThe director has the following duties:\n(1) to carry out gambling policy established by the board;\n(2) to employ and supervise personnel of the board;\n(3) to advise and make recommendations to the board on rules, policy, and legislative initiatives;\n(4) to approve or deny operational requests from licensees as delegated by the board;\n(5) to issue licenses and premises permits as authorized by the board;\n(6) to issue cease and desist orders;\n(7) to make recommendations to the board on license issuance, denial, censure, suspension and revocation, civil penalties, and corrective action the board imposes;\n(8) to ensure that board rules, policy, and decisions are adequately and accurately conveyed to the board's licensees;\n(9) to conduct investigations, inspections, compliance reviews, and audits under this chapter; and\n(10) to issue subpoenas to compel the attendance of witnesses and the production of documents, books, records, and other evidence relating to an investigation, compliance review, or audit the director is authorized to conduct.\n(a) Whenever it appears to the director that any person has engaged or is about to engage in any act or practice constituting a violation of this chapter or any board rule or order the director may issue and cause to be served upon the person an order requiring the person to cease and desist from violations of this chapter or board rule or order. The order must give reasonable notice of the rights of the person to request a hearing and must state the reason for the entry of the order. Unless otherwise agreed between the parties, a hearing shall be held not later than seven days after the request for the hearing is received by the board after which and within 20 days after the receipt of the administrative law judge's report and subsequent exceptions and argument the board shall issue an order vacating the cease and desist order, modifying it, or making it permanent as the facts require. If no hearing is requested within 30 days of the service of the order, the order becomes final and remains in effect until modified or vacated by the board or director. All hearings shall be conducted in accordance with the provisions of chapter 14. If the person to whom a cease and desist order is issued fails to appear at the hearing after being duly notified, the person shall be deemed in default, and the proceeding may be determined against the person upon consideration of the cease and desist order, the allegations of which may be deemed to be true.\n(b) Whenever it appears to the board that any person has engaged or is about to engage in any act or practice that violates this chapter or any board rule or order, the board may bring an action in the district court in the appropriate county to enjoin the acts or practices and to enforce compliance with this chapter or any board rule or order and may refer the matter to the attorney general. Upon a proper showing, a permanent or temporary injunction, restraining order, or writ of mandamus shall be granted. The court may not require the board to post a bond.\nThe director may appoint an executive assistant to the director, who is in the unclassified service.",
	"repealed": false
}