{
	"id": "153.24",
	"url": "https://www.revisor.mn.gov/statutes/cite/153.24",
	"title": "153.24 REPORTING OBLIGATIONS.",
	"text": "A person who has knowledge of any conduct constituting grounds for discipline under this chapter may report the violation to the board.\nAny hospital, clinic, prepaid medical plan, or other health care institution or organization located in this state shall report to the board any action taken by the institution or organization or any of its administrators or medical or other committees to revoke, suspend, restrict, or condition a podiatrist's privilege to practice or treat patients in the institution, or as part of the organization, any denial of privileges, or any other disciplinary action. The institution or organization shall also report the resignation of any podiatrists before the conclusion of any disciplinary proceeding, or prior to the commencement of formal charges but after the podiatrist had knowledge that formal charges were contemplated or in preparation. No report is required of a podiatrist voluntarily limiting practice at a hospital if the podiatrist notifies all hospitals at which the podiatrist has privileges of the voluntary limitation and the reasons for it.\nA licensed health professional shall report to the board personal knowledge of any conduct that the professional reasonably believes constitutes grounds for disciplinary action under this chapter by any podiatrist, including any conduct showing that the podiatrist may be medically incompetent, or may have engaged in unprofessional conduct or may be medically or physically unable to engage safely in the practice of podiatric medicine.\nFour times a year, by the first day of the months of February, May, August, and November of each year, each insurer authorized to sell insurance described in section 60A.06, subdivision 1, clause (13), and providing professional liability insurance to podiatrists shall submit to the board a report concerning the podiatrists against whom podiatric medical malpractice settlements or awards have been made to the plaintiff. The report must contain at least the following information:\n(1) the total number of podiatric malpractice settlements or awards made to the plaintiff;\n(2) the date the podiatric malpractice settlements or awards to the plaintiff were made;\n(3) the allegations contained in the claim or complaint leading to the settlements or awards made to the plaintiff;\n(4) the dollar amount of each podiatric malpractice settlement or award;\n(5) the regular address of the practice of the podiatrist against whom an award was made or with whom a settlement was made; and\n(6) the name of the podiatrist against whom an award was made or with whom a settlement was made.\nThe insurance company shall, in addition to the foregoing information, report to the board any information it has that tends to substantiate a charge that a podiatrist may have engaged in conduct violating the law as specified in this chapter.\nThe court administrators of the district courts or any other court of competent jurisdiction shall report to the board any judgment or other determination of the court that adjudges or includes a finding that a podiatrist is a person who is mentally ill, mentally incompetent, guilty of a felony, or guilty of a violation of federal or state narcotics laws or controlled substances act, guilty of an abuse or fraud under Medicare or Medicaid, appoints a guardian of the podiatrist under sections 524.5-101 to 524.5-502 or commits a podiatrist under chapter 253B.\nA podiatrist shall report to the board any personal action that would require that a report be filed with the board by any person, health care facility, business, or organization under subdivisions 2 to 5.\nReports required by subdivisions 2 to 6 must be submitted not later than 30 days after the occurrence of the reportable event or transaction. The board may provide forms for the submission of reports required by this section, may require that reports be submitted on the forms provided, and may adopt rules necessary to assure prompt and accurate reporting.\nOn or after August 1, 2012, any person, institution, or insurer that fails to report as required under subdivisions 2 to 5 shall be subject to civil penalties for failing to report as required by law.",
	"repealed": false
}