{
	"id": "88.38",
	"url": "https://www.revisor.mn.gov/statutes/cite/88.38",
	"title": "88.38 CONTRACTS FOR IMPROVEMENTS; DUTIES OF COUNTY AUDITOR; SEEDING OF CLEARED LANDS.",
	"text": "Within ten days after the filing in the office of the auditor of the order of the county board establishing and ordering any improvement under the provisions of sections 88.28 to 88.46, the auditor shall give notice of a time and place for receiving bids for the making of the improvement in accordance with the provisions of General Statutes 1923, section 6689, and the provisions of that section, so far as applicable, shall govern the receiving of bids and the letting of contracts for the making of the improvement. The auditor may let separate contracts for each separate tract upon which any part of the improvement is to be made, or may let one contract for the whole thereof, or for the clearing of land on the whole or on any number of such tracts. The contract shall specifically provide for the removal of the trees, brush, stumps, and other similar material located on the tracts of land covered by the contract, and shall specify what disposition shall be made of all such clearing debris in accordance with the direction of the county board. The county board may order and require that the contract shall contain provisions for the burning or destruction of all such debris or materials, or for the removal thereof, or for the use of that material where use can be made thereof. Where the material removed from any tract of land can be utilized for any purposes that will result in advantage to the owner of the land, the county board in the contract may provide for making such use of the trees or other products, and the assessments against such tract of land shall be lessened accordingly. To prevent the return of the land to its wild state and the consequent danger of forest fires, the county board may require that the land so cleared shall be seeded to grasses and clover, when it appears that the owner does not contemplate cropping the land so cleared at the next planting season following the completion of the clearing thereof.",
	"repealed": false
}