{
	"id": "123B.42",
	"url": "https://www.revisor.mn.gov/statutes/cite/123B.42",
	"title": "123B.42 TEXTBOOKS; INDIVIDUAL INSTRUCTION OR COOPERATIVE LEARNING MATERIAL; STANDARD TESTS.",
	"text": "The commissioner of education shall promulgate rules under the provisions of chapter 14 requiring that in each school year, based upon formal requests by or on behalf of nonpublic school pupils in a nonpublic school, the local districts or intermediary service areas must purchase or otherwise acquire textbooks, individualized instructional or cooperative learning materials, software or other educational technology, and standardized tests and loan or provide them for use by children enrolled in that nonpublic school. These textbooks, individualized instructional or cooperative learning materials, software or other educational technology, and standardized tests must be loaned or provided free to the children for the school year for which requested. The loan or provision of the textbooks, individualized instructional or cooperative learning materials, and standardized tests shall be subject to rules prescribed by the commissioner of education.\nA school district that provides curriculum to resident students that has both physical and electronic components must make the electronic component accessible to a resident student in a home school in compliance with sections 120A.22 and 120A.24 at the request of the student or the student's parent or guardian, provided that the district does not incur more than an incidental cost as a result of providing access electronically.\nThe title to textbooks, individualized instructional or cooperative learning materials, software or other educational technology, and standardized testing materials must remain in the servicing school district or intermediary service area, and possession or custody may be granted or charged to administrators of the nonpublic school attended by the nonpublic school pupil or pupils to whom the textbooks, individualized instructional or cooperative learning materials, or standardized tests are loaned or provided.\n(a) The cost per pupil of the textbooks, individualized instructional or cooperative learning materials, software or other educational technology, and standardized tests provided for in this section for each school year must not exceed the statewide average expenditure per pupil, adjusted pursuant to paragraph (b), by the Minnesota public elementary and secondary schools for textbooks, individualized instructional materials and standardized tests as computed and established by the department by February 1 of the preceding school year from the most recent public school year data then available.\n(b) The cost computed in paragraph (a) shall be increased by an inflation adjustment equal to the percent of increase in the formula allowance, pursuant to section 126C.10, subdivision 2, from the second preceding school year to the current school year.\n(c) The commissioner shall allot to the districts or intermediary service areas the total cost for each school year of providing or loaning the textbooks, individualized instructional or cooperative learning materials, software or other educational technology, and standardized tests for the pupils in each nonpublic school. The allotment shall not exceed the product of the statewide average expenditure per pupil, according to paragraph (a), adjusted pursuant to paragraph (b), multiplied by the number of nonpublic school pupils who make requests pursuant to this section and who are enrolled as of September 15 of the current school year.",
	"repealed": false
}