{
	"id": "89.001",
	"url": "https://www.revisor.mn.gov/statutes/cite/89.001",
	"title": "89.001 DEFINITIONS.",
	"text": "Unless the language or context clearly indicates that a different meaning is intended, the following terms for the purpose of this chapter shall have the meanings ascribed to them.\n\"Department\" means the Department of Natural Resources of the state of Minnesota.\n\"Commissioner\" means the commissioner of natural resources or agent of the commissioner.\n\"Forest land\" means land which is at least ten percent stocked by trees of any size and capable of producing timber, or of exerting an influence on the climate or on the water regime; land from which the trees described above have been removed to less than ten percent stocking and which has not been developed for other use; and afforested areas.\n\"Timber\" means trees that will produce forest products of value, whether standing or down, and including but not limited to logs, bolts, pulpwood, posts, poles, cordwood, lumber and decorative material.\n\"State forest lands\" means all land and waters owned by the state within state forests, including all lands set apart under the Constitution of the state of Minnesota, article XI, section 11, and laws enacted pursuant thereto, but excepting lands acquired by the state for other specific purposes or tax-forfeited lands held in trust for the taxing districts unless incorporated into state forests as otherwise provided by law.\n\"Reproduction\" means young stands of commercial tree species ranging from one foot high to 4.9 inches diameter at 4-1/2 feet above the ground and at least ten percent stocked.\n\"Forest resources\" means those natural assets of forest lands, including timber and other forest crops; biological diversity; recreation; fish and wildlife habitat; wilderness; rare and distinctive flora and fauna; air; water; soil; climate; and educational, aesthetic, and historic values.\n\"Multiple use\" means the principle of forest management by which forest resources are utilized in the combinations that will best meet the needs of the people of the state; including the harmonious and coordinated management of the forest resources, each with the other, without impairment of the productivity of the land and with consideration of the relative values of the resources, and not necessarily the combination of uses resulting in the greatest economic return or unit output.\n\"Sustained yield\" means the principle of forest management for the achievement and maintenance in perpetuity of a high-level annual or regular periodic output of forest resources without impairment of the productivity of the land; allowing for periods of intensification of management to enhance the current or anticipated output of one or more of the resources.\n\"Reforestation\" means the process of natural or artificial forest regeneration, including securing seed, growing seedlings, preparing sites, planting seed, planting trees, removing deleterious growth and underbrush and other activities related to forest regeneration.\n\"Extractive use\" means the removal of sand, gravel, peat or any mineral from beneath the surface of the land.\n\"Forest lands under the authority of the commissioner\" means state forest lands and other forest lands managed by the commissioner outside of state forests, except for tax-forfeited lands held in trust for the taxing districts and for the following units of the outdoor recreation system as defined in section 86A.04: state parks, state trails, state wildlife management areas, state scientific and natural areas, state water-access sites, state historic sites, state rest areas, and state wilderness areas.\n\"State forest road\" means a road constructed, acquired, maintained, or administered by the commissioner for the purpose of carrying out forest resource management policy as set forth in section 89.002.\n\"Forest pest\" means any vertebrate or invertebrate animal, plant pathogen, or plant that is determined by the commissioner to be harmful, injurious, or destructive to forests or timber.\n\"Shade tree pest\" means any vertebrate or invertebrate animal, plant pathogen, or plant that is determined by the commissioner to be harmful, injurious, or destructive to shade trees or community forests.\n\"Community forest\" has the meaning given under section 88.01, subdivision 27.\n\"Shade tree\" means a woody perennial grown primarily for aesthetic or environmental purposes.",
	"repealed": false
}