{
	"id": "428B.03",
	"url": "https://www.revisor.mn.gov/statutes/cite/428B.03",
	"title": "428B.03 SERVICE CHARGE AUTHORITY; NOTICE; HEARING REQUIREMENT.",
	"text": "A municipality may impose service charges authorized under section 428B.02, subdivision 4, to finance an activity or improvement in the tourism improvement district that is provided by the municipality if the activity or improvement is provided in the tourism improvement district at an increased level of service. The service charges may be imposed in the amount needed to pay for the increased level of service provided by the activity or improvement.\nBeginning one year after the establishment of the tourism improvement district, the municipality must hold an annual public hearing regarding continuation of the service charges in the tourism improvement district. The municipality must provide notice of the hearing by publication in the official newspaper at least seven days before the hearing. The municipality must mail, or deliver by electronic means, notice of the hearing to business owners subject to the service charge at least seven days before the hearing. At the hearing, a person affected by the proposed district may testify on issues relevant to the proposed district. Within six months of the hearing, the municipality may adopt a resolution to continue imposing service charges within the district not exceeding the amount or rate expressed in the notice. For purposes of this section, the notice must include:\n(1) a map showing the boundaries of the district;\n(2) the time and place of the hearing;\n(3) a statement that all interested persons will be given an opportunity to be heard at the hearing regarding the proposed service charge;\n(4) a brief description of the proposed activities and improvements;\n(5) the estimated annual amount of proposed expenditures for activities and improvements;\n(6) the rate of the service charge for the district during the year and the nature and character of the proposed activities and improvements for the district during the year in which service charges are collected;\n(7) the number of years the service charge will be in effect; and\n(8) a statement that the petition requirement of section 428B.07 has either been met or does not apply to the proposed service charge.",
	"repealed": false
}