{
	"id": "518A.38",
	"url": "https://www.revisor.mn.gov/statutes/cite/518A.38",
	"title": "518A.38 MINOR CHILDREN; SUPPORT.",
	"text": "Upon a decree of dissolution, legal separation, or annulment, the court shall make a further order which is just and proper concerning the maintenance of the minor children as provided by this chapter, and for the maintenance of any child of the parties as defined in section 518A.26, as support money. The court may make any child support order a lien or charge upon the property of the obligor, either at the time of the entry of the judgment or by subsequent order upon proper application.\nThe court shall establish the annual support of an obligor with a seasonal income so that the obligor makes either the same monthly payments throughout the year or monthly payments that reflect variations in income.\nThe court may conclude that an obligor has satisfied a child support obligation by providing a home, care, and support for the child while the child is living with the obligor, if the court finds that the child was integrated into the family of the obligor with the consent of the obligee and child support payments were not assigned to the public agency under section 518A.81.\nIf a child resides with a person other than a parent and the court approves of the custody arrangement, the court may order child support payments to be made to the custodian regardless of whether the person has legal custody.\nA support order issued under this section may provide that during any period of time of 30 consecutive days or longer that the child is residing with the obligor, the amount of support otherwise due under the order may be reduced.\nSection 518.145, subdivision 2, applies to awards of child support.\n(a) The court may allocate income tax dependency exemptions for a child and require a party who has the child in the party's physical custody for more than one-half of the calendar year to provide a properly executed declaration that releases the party's claim to the child as a dependent under section 152(e) of the Internal Revenue Code of 1986, as amended, to the other parent.\n(b) In determining the allocation under paragraph (a), the court shall consider the following:\n(1) the financial resources of each party;\n(2) if not awarding the dependency exemption negatively impacts a parent's ability to provide for the needs of the child;\n(3) if only one party or both parties would receive a tax benefit from the dependency exemption; and\n(4) the impact of the dependent exemption on either party's ability to claim a premium tax credit or a premium subsidy under the federal Patient Protection and Affordable Care Act, Public Law 111-148, as amended, including the federal Health Care and Education Reconciliation Act of 2010, Public Law 111-152, and any amendments to, and any federal guidance or regulations issued under, these acts.\n(c) The court may place reasonable conditions on a party's right to claim an exemption, including a requirement that the party remains in compliance with a child support obligation.\n(d) A party with less than ten percent of court-ordered parenting time shall not be entitled to receive a dependency exemption except by agreement of the parties.\n(e) The court may issue an order to modify a prior allocation of an income tax dependency exemption upon a showing of substantial change in the factors under paragraph (b).\n(f) If allocation of an exemption is contested, the court must make findings supporting its decision on the allocation.\n(g) When a party has claimed an income tax dependency exemption in violation of a court order or applicable law, or has failed or refused to provide a properly executed written declaration that releases the party's claim to a child as a dependent to the other party as required by a court order, the court may issue an order requiring compensation in the amount of the lost benefit and costs and reasonable attorney fees, to the party who was wrongfully deprived of the income tax dependency exemption. A motion for such relief must be brought within a reasonable time, but in no event later than three years from the date of the filing of the return in which the exemption was claimed or could have been claimed. A party who brings a meritless motion for such relief may be ordered to pay costs and reasonable attorney fees to the other party.",
	"repealed": false
}