{
	"id": "90.041",
	"url": "https://www.revisor.mn.gov/statutes/cite/90.041",
	"title": "90.041 COMMISSIONER POWERS AND DUTIES.",
	"text": "The commissioner shall make thorough inquiry into the extent, character, and value of the timber on all state lands and shall take such measures as will protect the timber from damage or loss by fire, trespass, or otherwise; and make such rules, in conformity with the other provisions of this chapter, for the care and control of the lands and for the sale of the timber thereon, as will best protect the interests of the state.\nThe commissioner may compromise and settle, upon terms the commissioner deems just, any claim of the state for casual and involuntary trespass upon state lands or timber; provided that no claim shall be settled for less than the full value of all timber or other materials taken in casual trespass or the full amount of all actual damage or loss suffered by the state as a result. Upon request, the commissioner shall advise the Executive Council of any information acquired by the commissioner concerning any trespass on state lands, giving all details and names of witnesses and all compromises and settlements made under this subdivision.\n[Repealed, 2005 c 141 s 14]\n[Repealed, 2005 c 141 s 14]\nThe commissioner may contract as part of the timber sale with the purchaser of state timber at either informal or auction sale for forest improvement work to be done on the land included within the sale area. Forest improvement work may include activities relating to preparation of the site for seeding or planting of seedlings or trees, seeding or planting of seedlings or trees, and other activities related to forest regeneration or deemed necessary by the commissioner to accomplish forest management objectives, including those related to water quality protection, trail development, and wildlife habitat enhancement. A contract issued under this subdivision is not subject to the competitive bidding provisions of chapter 16C and is exempt from the contract approval provisions of section 16C.05, subdivision 2. The bid value received in the sale of the timber and the contract bid cost of the improvement work may be combined and the total value may be considered by the commissioner in awarding forest improvement contracts under this section. The commissioner may refuse to accept any and all bids received and cancel a forest improvement contract sale for good and sufficient reasons.\nThe commissioner may sell at public auction timber that has been damaged by fire, windstorm, flood, insect, disease, or other natural cause on notice that the commissioner considers reasonable when there is a high risk that the salvage value of the timber would be lost.\nThe commissioner may declare an emergency in the event of a catastrophe caused by fire, windstorm, flood, insect, disease, or other natural cause. In the event of an emergency declaration, the commissioner may grant an extension, without penalty or interest, on an existing permit for standing timber if the permit holder has entered into a purchase agreement to harvest timber damaged by the natural catastrophe.\nThe commissioner may declare an emergency in the event of widespread abnormal surface conditions that prevent the proper and timely harvest of existing permits for standing timber. In the event of an emergency declaration, the commissioner may grant extensions, without penalty or interest, and may modify the terms and conditions of existing permits for standing timber to allow for the harvest of the standing timber in an environmentally sound manner under favorable surface conditions.\nThe commissioner may reoffer timber tracts remaining unsold under the provisions of section 90.101 below appraised value at public auction with the required 30-day notice under section 90.101, subdivision 2.\n(a) The commissioner may establish a fee schedule that covers the commissioner's cost of issuing, administering, and processing various permits, permit modifications, transfers, assignments, amendments, and other transactions necessary to the administration of activities under this chapter.\n(b) A fee established under this subdivision is not subject to the rulemaking provisions of chapter 14 and section 14.386 does not apply. The commissioner may establish fees under this subdivision notwithstanding section 16A.1283.\nThe commissioner may debar a permit holder if the holder is convicted in Minnesota at the gross misdemeanor or felony level of criminal willful trespass, theft, fraud, or antitrust violation involving state, federal, county, or privately owned timber in Minnesota or convicted in any other state involving similar offenses and penalties for timber owned in that state. The commissioner shall cancel and repossess the permit directly involved in the prosecution of the crime. The commissioner shall cancel and repossess all other state timber permits held by the permit holder after taking from all security deposits money to which the state is entitled. The commissioner shall return the remainder of the security deposits, if any, to the permit holder. The debarred permit holder is prohibited from bidding, possessing, or being employed on any state timber permit during the period of debarment. The period of debarment is not less than one year nor greater than three years. The duration of the debarment is based on the severity of the violation, past history of compliance with timber permits, and the amount of loss incurred by the state arising from violations of timber permits.",
	"repealed": false
}