{
	"id": "115A.1314",
	"url": "https://www.revisor.mn.gov/statutes/cite/115A.1314",
	"title": "115A.1314 MANUFACTURER REGISTRATION FEE.",
	"text": "(a) Each manufacturer who registers under section 115A.1312 must, by August 15 each year, pay to the commissioner of revenue an annual registration fee, on a form and in a manner prescribed by the commissioner of revenue. The commissioner of revenue must deposit the fee in the state treasury and credit the fee to the environmental fund.\n(b) The registration fee for manufacturers that sell 100 or more video display devices to households in the state during the previous calendar year is $2,500, plus a variable recycling fee. The registration fee for manufacturers that sell fewer than 100 video display devices in the state during the previous calendar year is a variable recycling fee. The variable recycling fee is calculated according to the formula:\n[A - (B + C)] x D, where:\nA = the manufacturer's recycling obligation as determined under section 115A.1320;\nB = the number of pounds of covered electronic devices that a manufacturer recycled or arranged to have collected and recycled from households during the immediately preceding program year, as reported under section 115A.1316, subdivision 1;\nC = the number of phase I or phase II recycling credits a manufacturer elects to use to calculate the variable recycling fee; and\nD = the estimated per-pound cost of recycling, initially set at $0.50 per pound for manufacturers who recycle less than 50 percent of the manufacturer's recycling obligation; $0.40 per pound for manufacturers who recycle at least 50 percent but less than 90 percent of the manufacturer's recycling obligation; $0.30 per pound for manufacturers who recycle at least 90 percent but less than 100 percent of the manufacturer's recycling obligation; and $0.00 per pound for manufacturers who recycle 100 percent or more of the manufacturer's recycling obligation.\n(c) A manufacturer may petition the agency to waive the per-pound cost of recycling fee, element D in the formula in paragraph (b), required under this section. The agency shall direct the commissioner of revenue to waive the per-pound cost of recycling fee if the manufacturer demonstrates to the agency's satisfaction a good faith effort to meet its recycling obligation as determined under section 115A.1320. The petition must include:\n(1) documentation that the manufacturer has met at least 75 percent of its recycling obligation as determined under section 115A.1320;\n(2) a list of political subdivisions and public and private collectors with whom the manufacturer had a formal contract or agreement in effect during the previous program year to recycle or collect covered electronic devices;\n(3) the total amounts of covered electronic devices collected from both within and outside of the 11-county metropolitan area, as defined in subdivision 2;\n(4) a description of the manufacturer's best efforts to meet its recycling obligation as determined under section 115A.1320; and\n(5) any other information requested by the agency.\n(d) A manufacturer may retain phase I and phase II recycling credits to be added, in whole or in part, to the actual value of C, as reported under section 115A.1316, subdivision 2, during any succeeding program year, provided that no more than 25 percent of a manufacturer's recycling obligation A for any program year may be met with phase I and phase II recycling credits, separately or in combination, generated in a prior program year. A manufacturer may sell any portion or all of its phase I and phase II recycling credits to another manufacturer, at a price negotiated by the parties, who may use the credits in the same manner.\n(e) For the purpose of determining B in calculating a manufacturer's variable recycling fee using the formula under paragraph (b), starting with the program year beginning July 1, 2019, and continuing each year thereafter, the weight of covered electronic devices that a manufacturer recycled or arranged to have collected and recycled from households located outside the 11-county metropolitan area, as defined in subdivision 2, paragraph (b), is calculated at 1.5 times their actual weight.\n(a) Registration fees may be used by the commissioner for:\n(1) implementing sections 115A.1312 to 115A.1330, including transfer to the commissioner of revenue to carry out the department's duties under section 115A.1320, subdivision 2, and transfer to the commissioner of administration for responsibilities under section 115A.1324; and\n(2) grants to counties outside the 11-county metropolitan area, as defined in paragraph (b), and to private entities that collect for recycling covered electronic devices in counties outside the 11-county metropolitan area, where the collection and recycling is consistent with the respective county's solid waste plan, for the purpose of carrying out the activities under sections 115A.1312 to 115A.1330. In awarding competitive grants under this clause, the commissioner must give preference to counties and private entities that are working cooperatively with manufacturers to help them meet their recycling obligations under section 115A.1318, subdivision 1.\n(b) The 11-county metropolitan area consists of the counties of Anoka, Carver, Chisago, Dakota, Hennepin, Isanti, Ramsey, Scott, Sherburne, Washington, and Wright.",
	"repealed": false
}