{
	"id": "383A.281",
	"url": "https://www.revisor.mn.gov/statutes/cite/383A.281",
	"title": "383A.281 DEFINITIONS.",
	"text": "Unless the language or context indicates that a different meaning is intended, the following terms, for the purpose of sections 383A.281 to 383A.301 and rules adopted under sections 383A.281 to 383A.301, have the meanings given them in this section.\n\"Allocation\" means the assignment of an individual position to an appropriate class on the basis of the kind, difficulty, and responsibility of the work performed in the position.\n\"Applicant\" means a person who has completed an application for employment and has submitted it to the department of human resources or other appointing authority who has been delegated the authority to recruit and examine individuals for positions in the county personnel system.\n\"Appointing authority\" means an elected official, the head of a board, department, division, or commission, or person or group of persons who by law, rule, or resolution of the county board has been granted the authority to make appointments to positions in the county personnel system.\n\"Appointment\" means the act of filling a vacancy by placement of a person in the county personnel system through selection from an eligible list or a noncompetitive or qualifying process including transfer, demotion, or reinstatement.\n\"Certification\" means the referral of names from an eligible list to an appointing authority to fill vacant positions in the classified service.\n\"Class\" means one or more positions sufficiently similar with respect to duties and responsibilities that the same descriptive title may be used with clarity to designate each position allocated to the class, that the same general qualifications are needed for performance of the duties of the class, that the same tests of fitness may be used to recruit employees, and that the same schedule of pay can be applied with equity to all positions in the class under the same or substantially the same employment conditions.\n\"Classification\" means the process of grouping positions into classes with respect to similar duties and responsibilities of the positions.\n\"Classified service\" means all positions existing on the effective date of sections 383A.281 to 383A.301 or subsequently created in the county personnel system and not specifically designated as unclassified positions pursuant to section 383A.286.\n\"Competitive open examination\" means that eligibility to compete in an examination is extended to all interested qualified persons.\n\"Competitive promotional examination\" means that eligibility to compete in an examination is limited to qualified county employees by department.\n\"County board\" means the Ramsey County Board of Commissioners.\n\"County personnel system\" means all employees in the departments or agencies of county government or joint city and county agencies which receive their funding in whole or in part from the county board, including employees of:\n(a) elected officials;\n(b) the Saint Paul-Ramsey Medical Center Commission; and\n(c) the court administrator of district court;\nbut not including:\n(1) district court judges;\n(2) court reporters, law clerks, referees employed by the district court, and the Second Judicial District administrator's office;\n(3) court commissioners;\n(4) the public defender;\n(5) employees of the Examiner of Titles, Agricultural Extension Service, Humane Society, Historical Society, and Soil and Water Conservation District; and\n(6) other employees not subject to a county personnel system because of state law.\n\"Director\" means the director of the department of human resources or the director's delegated representative.\n\"Eligible\" means a person whose name is on an eligible list.\n\"Eligible list\" means a list of candidates eligible for employment in a specific class.\n\"Employee\" means any person currently occupying, or on leave from, a county personnel system position.\n\"Layoff list\" means an eligible list by class of former permanent or probationary employees who have been terminated from positions in the class because of a shortage of funds or curtailment of service or for any other reason beyond their control not reflecting discredit on the employee.\n\"Permanent status\" means the state or condition achieved by an employee in the classified service who has successfully completed an initial probationary period or a probationary period required following reinstatement or reemployment.\n\"Human Resources Department\" means the department charged with the administration of the county personnel system under the supervision of the Human Resources Department director.\n\"Personnel Review Board\" means the body charged with review responsibilities pursuant to section 383A.287.\n\"Position\" means a group of duties and responsibilities assigned or delegated by the appointing authority, requiring the full-time or less than full-time employment of one person.\n\"Probationary period\" means a period of time following appointment to a position in the classified service, during which the employee is required to demonstrate ability to perform the duties and fulfill the responsibilities of the position.\n\"Reclassification\" means changing the allocation of a position to a different class.\n\"Reemployment list\" means an eligible list by class of current or former permanent or probationary employees laid off, demoted in lieu of layoff, or separated in good standing from the class, and whose written applications for consideration for reemployment in the class have been approved by the human resources director.\n\"Transfer\" means a change of an employee in one position within a department to a position of comparable class in another department.\n\"Unclassified service\" means all positions which are not within the classified service as defined by section 383A.285.\n\"Permanent tenure\" means the state or condition achieved by an employee in the classified service who has successfully completed an initial probationary period.\n\"Protected groups\" means the groups defined by section 43A.02, subdivision 33.",
	"repealed": false
}