{
	"id": "570.025",
	"url": "https://www.revisor.mn.gov/statutes/cite/570.025",
	"title": "570.025 PRELIMINARY ATTACHMENT ORDER UPON EXTRAORDINARY CIRCUMSTANCES.",
	"text": "A claimant seeking a preliminary attachment order in extraordinary circumstances to secure property prior to the hearing specified in section 570.026 shall proceed by written application. The application shall be accompanied by affidavits or by oral testimony if allowed by the court, or both, setting forth in detail:\n(1) the basis and the amount of the claim in the civil action;\n(2) the facts which constitute the grounds for attachment as specified in subdivision 2; and\n(3) a good faith estimate, based on facts known to the claimant, of any harm that would be suffered by the respondent if a preliminary attachment order is entered.\nA preliminary attachment order may be issued before the hearing specified in section 570.026 only if the following conditions are met:\n(1) the claimant has made a good faith effort to inform the respondent of the application for a preliminary attachment order or that informing the respondent would endanger the ability of the claimant to recover upon a judgment subsequently awarded;\n(2) the claimant has demonstrated the probability of success on the merits;\n(3) the claimant has demonstrated the existence of one or more of the grounds specified in section 570.02, subdivision 1, clause (1), (2), (3), or (6); and\n(4) due to extraordinary circumstances, the claimant's interests cannot be protected pending a hearing by an appropriate order of the court, other than by directing a prehearing seizure of property.\nAll preliminary attachment orders shall:\n(1) state the names and addresses of all affiants whose affidavits were submitted to the court and of all witnesses who gave oral testimony;\n(2) contain specific findings of fact, based upon competent evidence presented either in the form of affidavits or oral testimony, if the court permits, supporting the conclusion that each of the conditions in subdivision 2 have been met;\n(3) be narrowly drafted to minimize any harm to the respondent as a result of the seizure of the respondent's property; and\n(4) to the extent possible, specify the property to be seized.\nIf the court issues a preliminary attachment order, the order must establish a date for a hearing at which the respondent may be heard. The subsequent hearing shall be conducted at the earliest practicable time. At the hearing, the burden of proof shall be on the claimant.\nThe hearing held pursuant to subdivision 4 shall be conducted in accordance with the standards established in section 570.026. In addition, if the court finds that the motion for a prehearing attachment order was made in bad faith, the court shall award respondent the actual damages, including reasonable attorney's fees, suffered by reason of seizure of the property.\nThe respondent shall be served with a copy of the preliminary attachment order issued pursuant to this section together with a copy of all pleadings and other documents not previously served, including any affidavits upon which the claimant intends to rely at the subsequent hearing and a transcript of any oral testimony given at the preliminary hearing upon which the claimant intends to rely and a notice of hearing. Service shall be in the manner prescribed for personal service of a summons unless that service is impracticable or would be ineffective and the court prescribes an alternative method of service calculated to provide actual notice to the respondent.\nThe notice of hearing served upon the respondent shall be signed by claimant or the attorney for claimant and shall provide, at a minimum, the following information in substantially the following language:\nNOTICE OF HEARING\nTo: (the respondent)\nThe (insert name of court) Court has ordered the sheriff to seize some of your property. The court has directed the sheriff to seize the following specific property: (insert list of property). (List other action taken by the court). Some of your property may be exempt from seizure. See the exemption notice below.\nThe Court issued this Order based upon the claim of (insert name of claimant) that (insert name of claimant) is entitled to a court order for seizure of your property to secure your payment of any money judgment that (insert name of claimant) may later be obtained against you and that immediate action was necessary.\nYou have the legal right to challenge (insert name of claimant) claims at a court hearing before a judge. The hearing will be held at the (insert place) on (insert date) at (insert time). You may attend the court hearing alone or with an attorney. After you have presented your side of the matter, the court will decide what should be done with your property until the lawsuit against you is finally decided.\nIF YOU DO NOT ATTEND THIS HEARING, THE COURT MAY ORDER THE SHERIFF TO KEEP PROPERTY THAT HAS BEEN SEIZED.\nEXEMPTION NOTICE\nAn order of attachment is being served upon you. Some of your property is exempt and cannot be seized. The following is a list of some of the more common exemptions. It is not complete and is subject to section 550.37, and other state and federal laws. If you have questions about an exemption, you should obtain competent legal advice.\n1. A homestead or the proceeds from the sale of a homestead.\n2. Household furniture, appliances, phonographs, radios, and televisions up to a total current value of $4,500 at the time of attachment.\n3. A manufactured (mobile) home used as your home.\n4. One motor vehicle currently worth less than $2,000 after deducting any security interests.\n5. Farm machinery used by someone principally engaged in farming, or tools, machines, or office furniture used in your business or trade. This exemption is limited to $5,000.\n6. Relief based on need. This includes Minnesota Family Investment Program (MFIP), Emergency Assistance (EA), Work First Program, Supplemental Security Income, Minnesota Supplemental Assistance, and General Assistance.\n7. Social Security benefits.\n8. Unemployment benefits, workers' compensation, or veterans' benefits.\n9. An accident disability or retirement pension or annuity.\n10. Life insurance proceeds or the earnings of your minor child and any child support paid to you.\n11. Money from a claim for damage or destruction of exempt property such as household goods, farm tools, business equipment, a manufactured mobile home, or a car.",
	"repealed": false
}