{
	"id": "3.842",
	"url": "https://www.revisor.mn.gov/statutes/cite/3.842",
	"title": "3.842 REVIEW OF RULES BY COMMISSION OR COMMITTEE.",
	"text": "The commission shall promote adequate and proper rules by agencies and an understanding upon the part of the public respecting them.\nThe jurisdiction of the commission includes all rules as defined in section 14.02, subdivision 4. The commission also has jurisdiction of rules filed with the secretary of state in accordance with sections 14.38, subdivision 11; 14.386; and 14.388.\nThe commission may periodically review statutory exemptions to the rulemaking provisions of this chapter.\nThe commission may hold public hearings to investigate complaints with respect to rules if it considers the complaints meritorious and worthy of attention. If the rules that are the subject of the public hearing were adopted without a rulemaking hearing, it may request the Office of Administrative Hearings to hold the public hearing and prepare a report summarizing the testimony received at the hearing. The Office of Administrative Hearings shall assess the costs of the public hearing to the agency whose rules are the subject of the hearing.\n[Repealed, 1997 c 98 s 17]\n(a) For purposes of this subdivision, \"committee\" means the house of representatives policy committee or senate policy committee with primary jurisdiction over state governmental operations. The commission or a committee may object to a rule as provided in this subdivision. If the commission or a committee objects to all or some portion of a rule because the commission or committee considers it to be beyond the procedural or substantive authority delegated to the agency, including a proposed rule submitted under section 14.15, subdivision 4, or 14.26, subdivision 3, paragraph (c), the commission or committee may file that objection in the Office of the Secretary of State. The filed objection must contain a concise statement of the commission's or committee's reasons for its action. An objection to a proposed rule submitted by the commission or a committee under section 14.15, subdivision 4, or 14.26, subdivision 3, paragraph (c), may not be filed before the rule is adopted.\n(b) The secretary of state shall affix to each objection a certification of the date and time of its filing and as soon after the objection is filed as practicable shall transmit a certified copy of it to the agency issuing the rule in question and to the revisor of statutes. The secretary of state shall also maintain a permanent register open to public inspection of all objections by the commission or committee.\n(c) The commission or committee shall publish and index an objection filed under this section in the next issue of the State Register. The revisor of statutes shall indicate the existence of the objection adjacent to the rule in question when that rule is published in Minnesota Rules.\n(d) Within 14 days after the filing of an objection by the commission or committee to a rule, the issuing agency shall respond in writing to the objecting entity. After receipt of the response, the commission or committee may withdraw or modify its objection.\n(e) After the filing of an objection by the commission or committee that is not subsequently withdrawn, the burden is upon the agency in any proceeding for judicial review or for enforcement of the rule to establish that the whole or portion of the rule objected to is valid.\n(f) The failure of the commission or a committee to object to a rule is not an implied legislative authorization of its validity.\n(g) In accordance with sections 14.44 and 14.45, the commission or a committee may petition for a declaratory judgment to determine the validity of a rule objected to by the commission or committee. The action must be started within two years after an objection is filed in the Office of the Secretary of State.\n(h) The commission or a committee may intervene in litigation arising from agency action. For purposes of this paragraph, agency action means the whole or part of a rule, or the failure to issue a rule.\n[Repealed, 1997 c 98 s 17]\n[Repealed, 1997 c 98 s 17]\n[Repealed, 1997 c 98 s 17]",
	"repealed": false
}