{
	"id": "609.528",
	"url": "https://www.revisor.mn.gov/statutes/cite/609.528",
	"title": "609.528 POSSESSION OR SALE OF STOLEN OR COUNTERFEIT CHECK; PENALTIES.",
	"text": "(a) As used in this section, the following terms have the meanings given them in this subdivision.\n(b) \"Direct victim\" means any person or entity described in section 611A.01, paragraph (b), from whom a check is stolen or whose name or other identifying information is contained in a counterfeit check.\n(c) \"Indirect victim\" means any person or entity described in section 611A.01, paragraph (b), other than a direct victim.\n(d) \"Loss\" means value obtained, as defined in section 609.52, subdivision 1, clause (3), and expenses incurred by a direct or indirect victim as a result of a violation of this section.\nA person who sells, possesses, receives, or transfers a check that is stolen or counterfeit, knowing or having reason to know the check is stolen or counterfeit, is guilty of a crime and may be punished as provided in subdivision 3.\nA person who violates subdivision 2 may be sentenced as follows:\n(1) if the offense involves a single direct victim and the total, combined loss to the direct victim and any indirect victims is $250 or less, the person may be sentenced as provided in section 609.52, subdivision 3, clause (5);\n(2) if the offense involves a single direct victim and the total, combined loss to the direct victim and any indirect victims is more than $250 but not more than $500, the person may be sentenced as provided in section 609.52, subdivision 3, clause (4);\n(3) if the offense involves two or three direct victims or the total, combined loss to the direct and indirect victims is more than $500 but not more than $2,500, the person may be sentenced as provided in section 609.52, subdivision 3, clause (3); and\n(4) if the offense involves four or more direct victims, or if the total, combined loss to the direct and indirect victims is more than $2,500, the person may be sentenced as provided in section 609.52, subdivision 3, clause (2).",
	"repealed": false
}