{
	"id": "507.31",
	"url": "https://www.revisor.mn.gov/statutes/cite/507.31",
	"title": "507.31 RAILROAD LANDS.",
	"text": "Every railroad company to whom lands have been or shall be conveyed by the state to aid in the construction of its road shall prepare, at its own expense, separate lists of such lands lying within the several counties, according to the government surveys, which lists shall be compared by the commissioner of management and budget with the original lists in the commissioner's office received from the Interior Department of the general government; and each list when corrected by the commissioner shall have appended thereto a certificate that the same is a correct and complete list of the lands in the county certified to the state and by it conveyed to such company. Such lists so certified shall be filed by the companies with the county recorders of the respective counties where such lands lie, who shall keep the same as public records, and they shall be prima facie evidence of the title of such companies. In all cases where any railroad company has failed to comply with the provisions of this section, the board of county commissioners of any county in this state is hereby authorized to direct the county recorder of the county to transcribe directly from the original patents or approved lists from the United States government to the state of Minnesota and the record of deeds from the state of Minnesota to the railroad company receiving such lands. Such original patents and record of deeds being on file in the commissioner of management and budget's office, the commissioner of management and budget shall offer the needed conveniences to any county recorder who desires to make a transcript as herein provided. The county board shall furnish the county recorder with the necessary books and records. It shall be the duty of the commissioner of management and budget to carefully compare such transcribed copies of patents, approved lists or deeds with the original instruments and records on file in the commissioner's office, and when compared to so duly certify to each instrument. Such transcribed records duly certified by the commissioner of management and budget when deposited with the county recorder of any county shall be prima facie evidence of the facts therein set forth and of the original instruments so recorded; and an official transcript therefrom shall be admissible as evidence in all the courts of the state. The commissioner of management and budget shall receive no fees for services rendered. The county recorder shall receive the same fees as allowed by law for recording original instruments in the county recorder's office, which sum shall be paid by the county upon the approval of the board of county commissioners.\nMS 1982 [Repealed, 1984 c 618 s 61]",
	"repealed": false
}