{
	"id": "148F.03",
	"url": "https://www.revisor.mn.gov/statutes/cite/148F.03",
	"title": "148F.03 RECIPROCITY.",
	"text": "(a) An individual who holds a current license or national certification as an alcohol and drug counselor from another jurisdiction must file with the board a completed application for licensure by reciprocity containing the information required in this section.\n(b) The applicant must request the credentialing authority of the jurisdiction in which the credential is held to send directly to the board a statement that the credential is current and in good standing, the applicant's qualifications that entitled the applicant to the credential, and a copy of the jurisdiction's credentialing laws and rules that were in effect at the time the applicant obtained the credential.\n(c) The board shall issue a license if the board finds that the requirements which the applicant met to obtain the credential from the other jurisdiction were substantially similar to the current requirements for licensure in this chapter and that the applicant is not otherwise disqualified under section 148F.09.\n(a) An individual who holds a current license or national certification as an alcohol and drug counselor from another jurisdiction must file with the board a completed application for licensure by reciprocity containing the information required in this section.\n(b) The applicant must request the credentialing authority of the jurisdiction in which the credential is held to send directly to the board a statement that the credential is current and in good standing.\n(c) The board may issue a license if the board finds that the applicant has been in active practice in good standing for a minimum of five years after receiving licensure or other credential.\n(d) The board shall determine, based on the applicant's experience and qualifications, whether the applicant is granted the licensed alcohol and drug counselor license or other credential regulated by the board.",
	"repealed": false
}