{
	"id": "124E.08",
	"url": "https://www.revisor.mn.gov/statutes/cite/124E.08",
	"title": "124E.08 CHARTER SCHOOL AND SCHOOL DISTRICT COLLABORATION.",
	"text": "(a) A charter school board may voluntarily enter into a two-year, renewable collaboration agreement with a school district in which the charter school is geographically located to enhance the achievement of the students in the district and the students in the charter school.\nA school district does not need to be either an approved authorizer or the authorizer of the charter school to enter into a collaboration agreement under this section.\nA charter school authorizer is prohibited from requiring a collaboration agreement as a condition of entering into or renewing a charter contract as defined in section 124E.10, subdivision 1.\n(b) The collaboration agreement may include, but is not limited to, collaboration regarding facilities, transportation, training, student achievement, assessments, mutual performance standards, and other areas of mutual agreement.\n(c) For purposes of student assessment and reporting to the state under section 120B.36, the school district may include the academic performance of the students of a collaborative charter school site under paragraph (a).\nDistricts, authorizers, or charter schools entering into a collaborative agreement are equally and collectively subject to the same state and federal accountability measures for student achievement, school performance outcomes, and school improvement strategies. The collaborative agreement and all accountability measures must be posted on the district, charter school, and authorizer websites.\n(d) Nothing in this section or in the collaboration agreement may impact in any way the authority or autonomy of the charter school.\n(e) Nothing in this section or in the collaboration agreement shall cause the state to pay twice for the same student, service, or facility or otherwise impact state funding or payment to the school district or the charter school.",
	"repealed": false
}