{
	"id": "115D.03",
	"url": "https://www.revisor.mn.gov/statutes/cite/115D.03",
	"title": "115D.03 DEFINITIONS.",
	"text": "The definitions in this section apply to this chapter.\n\"Commission\" means the Emergency Response Commission under section 299K.03.\n\"Commissioner\" means the commissioner of the Pollution Control Agency.\n[Repealed, 1Sp2005 c 1 art 2 s 162]\n\"Eligible recipients\" means persons who use, generate, or release toxic pollutants, hazardous substances, or hazardous wastes, or individuals or organizations that provide assistance to these persons.\n\"Facility\" means all buildings, equipment, structures, and other stationary items that are located on a single site or on contiguous or adjacent sites and that are owned or operated by the same person, or by any person who controls, is controlled by, or is under common control with such person.\n\"Officer of the company\" means one of the following:\n(1) an owner or sole proprietor;\n(2) a partner;\n(3) for a corporation incorporated under chapter 300, the president, secretary, treasurer, or other officer as provided for in the corporation's bylaws or certificate of incorporation;\n(4) for a corporation incorporated under chapter 302A, an individual exercising the functions of the chief executive officer or the chief financial officer under section 302A.305 or another officer elected or appointed by the directors of the corporation under section 302A.311;\n(5) for a corporation incorporated outside this state, an officer of the company as defined by the laws of the state in which the corporation is incorporated;\n(6) for a limited liability company organized under chapter 322B, the chief manager or treasurer; or\n(7) for a limited liability company organized under chapter 322C, a member of a member-managed company, a manager of a manager-managed company, or any other officer provided for in the limited liability company's operating agreement.\n\"Person\" means any individual, partnership, association, public or private corporation or other entity including the United States government, any interstate body, the state and any agency, department or political subdivision of the state.\n\"Pollution prevention\" or \"prevent pollution\" means eliminating or reducing at the source the use, generation, or release of toxic pollutants, hazardous substances, and hazardous wastes.\n\"Reduce,\" \"reducing,\" or \"reduction\" means lessening the quantity or toxicity of toxic pollutants, hazardous substances, and hazardous wastes used, generated, or released at the source. Methods of reducing pollution include, but are not limited to, process modification, inventory control measures, feedstock substitutions, various housekeeping and management practices, and improved efficiency of machinery. Decreases in quantity or toxicity are not reductions where the decrease is solely the result of a decrease in the output of the facility.\n\"Release\" means any spilling, leaking, pumping, pouring, emitting, emptying, discharging, injecting, escaping, leaching, dumping, or disposing into the environment which occurred at a point in time or which continues to occur.\n\"Release\" does not include:\n(1) emissions from the engine exhaust of a motor vehicle, rolling stock, aircraft, watercraft, or pipeline pumping station engine;\n(2) release of source, by-product, or special nuclear material from a nuclear incident, as those terms are defined in the Atomic Energy Act of 1954, under United States Code, title 42, section 2014, if the release is subject to requirements with respect to financial protection established by the federal Nuclear Regulatory Commission under United States Code, title 42, section 2210;\n(3) release of source, by-product, or special nuclear material from any processing site designated pursuant to the Uranium Mill Tailings Radiation Control Act of 1978, under United States Code, title 42, section 7912(a)(1) or 7942(a); or\n(4) any release resulting from the application of fertilizer or agricultural or silvicultural chemicals, or disposal of emptied pesticide containers or residues from a pesticide as defined in section 18B.01, subdivision 18.\n\"Toxic pollutant\" means a chemical identified in United States Code, title 42, section 11023(c).",
	"repealed": false
}