{
	"id": "626.892",
	"url": "https://www.revisor.mn.gov/statutes/cite/626.892",
	"title": "626.892 PEACE OFFICER GRIEVANCE ARBITRATION SELECTION PROCEDURE.",
	"text": "(a) For the purposes of this section, the terms defined in this section have the meanings given them.\n(b) \"Commissioner\" means the commissioner of the Bureau of Mediation Services.\n(c) \"Employer\" means a political subdivision or law enforcement agency employing a peace officer.\n(d) \"Grievance\" means a dispute or disagreement regarding any written disciplinary action, discharge, or termination decision of a peace officer arising under a collective bargaining agreement covering peace officers.\n(e) \"Grievance arbitration\" means binding arbitration of a grievance under the grievance procedure in a collective bargaining agreement covering peace officers, as required by this section or sections 179A.04, 179A.20, and 179A.21, subdivision 3, to the extent those sections are consistent with this section.\n(f) \"Grievance procedure\" has the meaning given in section 179A.20, subdivision 4, except as otherwise provided in this section or to the extent inconsistent with this section.\n(g) \"Peace officer\" means a licensed peace officer or part-time peace officer subject to licensure under sections 626.84 to 626.863.\n(a) Notwithstanding any contrary provision of law, home rule charter, ordinance, or resolution, the arbitrator selection procedure established under this section shall apply to all peace officer grievance arbitrations for written disciplinary action, discharge, or termination heard on or after September 1, 2020.\n(b) The grievance procedure for all collective bargaining agreements covering peace officers negotiated on or after July 24, 2020, must include the arbitrator selection procedure established in this section.\n(c) This section does not authorize arbitrators appointed under this section to hear arbitrations of public employees who are not peace officers.\nAll fees charged by arbitrators under this section shall be in accordance with a schedule of fees established by the commissioner on an annual basis.\nThe commissioner, in consultation with community and law enforcement stakeholders, shall appoint a roster of six persons suited and qualified by training and experience to act as arbitrators for peace officer grievance arbitrations under this section. In making these appointments, and as applicable, the commissioner may consider the factors set forth in Minnesota Rules, parts 5530.0600 and 5530.0700, subpart 6, as well as a candidate's familiarity with labor law, the grievance process, and the law enforcement profession; or experience and training in cultural competency, racism, implicit bias, and recognizing and valuing community diversity and cultural differences. The appointments are effective immediately upon filing with the secretary of state. Arbitrators on the roster created by this subdivision shall not serve as an arbitrator in a labor arbitration other than a grievance arbitration as defined in this section.\nThe secretary of state shall solicit and accept applications in the same manner as for open appointments under section 15.0597.\n(a) Initial appointments to the roster of arbitrators shall be made as follows:\n(1) two appointments to expire on the first Monday in January 2023;\n(2) two appointments to expire on the first Monday in January 2024; and\n(3) two appointments to expire on the first Monday in January 2025.\n(b) Subsequent appointments to the roster of arbitrators shall be for three-year terms to expire on the first Monday in January, with the terms of no more than two arbitrators to expire in the same year.\n(c) An arbitrator may be reappointed to the roster upon expiration of the arbitrator's term. If the arbitrator is not reappointed, the arbitrator may continue to serve until a successor is appointed, but in no case later than July 1 of the year in which the arbitrator's term expires.\nTo the extent consistent with this section, the following provisions of Minnesota Rules apply to arbitrators on the roster of arbitrators established under this section:\n(1) Minnesota Rules, part 5530.0500 (status of arbitrators);\n(2) Minnesota Rules, part 5530.0800 (arbitrator conduct and standards);\n(3) Minnesota Rules, part 5510.5220 (arbitrator responsibilities);\n(4) Minnesota Rules, part 5510.5230, subpart 4 (hearing transcripts and recordings);\n(5) Minnesota Rules, part 5510.5260 (briefs); and\n(6) Minnesota Rules, part 5510.5295 (arbitrator fees and costs).\nTo the extent applicable, the commissioner shall track the performance measures set forth in Minnesota Rules, part 5530.1200.\nAn arbitrator appointed to the roster of arbitrators may be removed from the roster only by the commissioner in accordance with the procedures set forth in Minnesota Rules, part 5530.1300. A vacancy on the roster caused by a removal, a resignation, or another reason shall be filled by the commissioner as necessary to fill the remainder of the arbitrator's term. A vacancy on the roster occurring with less than six months remaining in the arbitrator's term shall be filled for the existing term and the following three-year term.\n(a) A person appointed to the arbitrator roster under this section must complete training as required by the commissioner during the person's appointment. At a minimum, an initial training must include:\n(1) at least six hours on the topics of cultural competency, racism, implicit bias, and recognizing and valuing community diversity and cultural differences; and\n(2) at least six hours on topics related to the daily experience of peace officers, which may include ride-alongs with on-duty officers or other activities that provide exposure to the environments, choices, and judgments required of officers in the field.\n(b) The commissioner may adopt rules establishing training requirements consistent with this subdivision.\n(c) An arbitrator appointed to the roster of arbitrators after 2020 must complete the required initial training within six months of the arbitrator's appointment.\n(d) The Bureau of Mediation Services must pay for all costs associated with the required training.\nThe commissioner shall assign or appoint an arbitrator or panel of arbitrators from the roster to a peace officer grievance arbitration under this section on rotation through the roster alphabetically ordered by last name. The parties shall not participate in, negotiate for, or agree to the selection of an arbitrator or arbitration panel under this section. The arbitrator or panel shall decide the grievance, and the decision is binding subject to the provisions of chapter 572B.\n(a) Sections 179A.21, subdivision 2, and 572B.11, paragraph (a), and rules for arbitrator selection promulgated pursuant to section 179A.04 shall not apply to discipline-related grievance arbitrations involving peace officers governed under this section.\n(b) Notwithstanding any contrary provision of law, home rule charter, ordinance, or resolution, peace officers, through their certified exclusive representatives, shall not have the right to negotiate for or agree to a collective bargaining agreement or a grievance arbitration selection procedure with their employers that is inconsistent with this section.\n(c) The arbitrator selection procedure for peace officer grievance arbitrations established under this section supersedes any inconsistent provisions in chapter 179A or 572B or in Minnesota Rules, chapters 5500 to 5530 and 7325. Other arbitration requirements in those chapters remain in full force and effect for peace officer grievance arbitrations, except as provided in this section or to the extent inconsistent with this section.",
	"repealed": false
}