{
	"id": "14.091",
	"url": "https://www.revisor.mn.gov/statutes/cite/14.091",
	"title": "14.091 PETITION; UNIT OF LOCAL GOVERNMENT.",
	"text": "(a) The elected governing body of a statutory or home rule city, a county, or a sanitary district may petition for amendment or repeal of a rule or a specified portion of a rule. The petition must be adopted by resolution of the elected governing body and must be submitted in writing to the agency and to the Office of Administrative Hearings, must specify what amendment or repeal is requested, and must demonstrate that one of the following has become available since the adoption of the rule in question:\n(1) significant new evidence relating to the need for or reasonableness of the rule; or\n(2) less costly or intrusive methods of achieving the purpose of the rule.\n(b) Within 30 days of receiving a petition, an agency shall reply to the petitioner in writing stating either that the agency, within 90 days of the date of the reply, will give notice under section 14.389 of intent to adopt the amendment or repeal requested by the petitioner or that the agency does not intend to amend or repeal the rule and has requested the Office of Administrative Hearings to review the petition. If the agency intends to amend or repeal the rule in the manner requested by the petitioner, the agency must use the process under section 14.389 to amend or repeal the rule. Section 14.389, subdivision 5, applies.\n(c) Upon receipt of an agency request under paragraph (b), the chief administrative law judge shall assign an administrative law judge, who was not involved when the rule or portion of a rule that is the subject of the petition was adopted or amended, to review the petition to determine whether the petitioner has complied with the requirements of paragraph (a). The petitioner, the agency, or any interested person, at the option of any of them, may submit written material for the assigned administrative law judge's consideration within ten days of the chief administrative law judge's receipt of the agency request. The administrative law judge shall dismiss the petition if the judge determines that:\n(1) the petitioner has not complied with the requirements of paragraph (a);\n(2) the rule is required to comply with a court order; or\n(3) the rule is required by federal law or is required to maintain authority to administer a federal program.\n(d) If the administrative law judge assigned by the chief administrative law judge determines that the petitioner has complied with the requirements of paragraph (a), the administrative law judge shall conduct a hearing and issue a decision on the petition within 120 days of its receipt by the Office of Administrative Hearings. The agency shall give notice of the hearing in the same manner required for notice of a proposed rule hearing under section 14.14, subdivision 1a. At the public hearing, the agency shall make an affirmative presentation of facts establishing the need for and reasonableness of the rule or portion of the rule in question. If the administrative law judge determines that the agency has not established the continued need for and reasonableness of the rule or portion of the rule, the rule or portion of the rule does not have the force of law, effective 90 days after the administrative law judge's decision, unless the agency has before then published notice in the State Register of intent to amend or repeal the rule in accordance with paragraph (e).\n(e) The agency may amend or repeal the rule in the manner requested by the petitioner, or in another manner that the administrative law judge has determined is needed and reasonable. Amendments under this paragraph may be adopted under the expedited process in section 14.389. Section 14.389, subdivision 5, applies to this adoption. If the agency uses the expedited process and no public hearing is required, the agency must complete the amendment or repeal of the rule within 90 days of the administrative law judge's decision under paragraph (d). If a public hearing is required, the agency must complete the amendment or repeal of the rule within 180 days of the administrative law judge's decision under paragraph (d). A rule or portion of a rule that is not amended or repealed in the time prescribed by this paragraph does not have the force of law upon expiration of the deadline. A rule that is amended within the time prescribed in this paragraph has the force of law, as amended.\n(f) The chief administrative law judge shall report the decision under paragraph (d) within 30 days to the chairs of the house of representatives and senate committees having jurisdiction over governmental operations and the chairs of the house of representatives and senate committees having jurisdiction over the agency whose rule or portion of a rule was the subject of the petition.\n(g) The chief administrative law judge shall assess a petitioner half the cost of processing a petition and conducting a public hearing under paragraph (d).",
	"repealed": false
}