{
	"id": "16A.28",
	"url": "https://www.revisor.mn.gov/statutes/cite/16A.28",
	"title": "16A.28 TREATMENT OF UNUSED APPROPRIATIONS.",
	"text": "Agencies may carry forward unexpended and unencumbered nongrant operating balances from the first year of a biennium into the second year of the biennium.\nNo money shall be carried forward without the approval of the commissioner of management and budget.\nAny portion of any appropriation not carried forward and remaining unexpended and unencumbered at the close of a fiscal year lapses to the fund from which it was originally appropriated. Any appropriation amounts not carried forward and remaining unexpended and unencumbered at the close of a biennium lapse to the fund from which the appropriation was made.\nThe commissioner may reinstate a lapsed appropriation within three months of the lapse. A reinstated appropriation lapses again no later than three months after it first lapsed. A payment under a reinstated appropriation may be made only under section 16A.15, subdivision 3.\nAn appropriation to acquire or better public land or buildings or other public improvements of a capital nature, including the acquisition of real property does not lapse until the purposes of the appropriation are determined by the commissioner, after consultation with the affected agencies, to be accomplished or abandoned. This subdivision also applies to any part of an appropriation for a fiscal year that has been requisitioned to acquire real property or construct permanent improvements. An appropriation to pay moving expenses lapses at the end of the third fiscal year during which it was made available.\nOn October 15 all allotments and encumbrances for the last fiscal year shall be canceled unless an agency head certifies to the commissioner that there is an encumbrance for services rendered, goods ordered, or grants issued in the last fiscal year, or certifies that funding will be carried forward under subdivision 1. Encumbrances for grants issued by June 30 may be certified for a period of one year beyond the year in which the funds were originally appropriated. Services rendered under grant contracts may occur during the certification period. The commissioner may reinstate the part of the cancellation needed to meet the certified encumbrance or charge the certified encumbrance against the current year's appropriation.\nExcept as otherwise expressly provided by law, subdivisions 1 to 6 apply to every appropriation of a stated sum for a specified purpose or purposes heretofore or hereafter made, but do not, unless expressly provided by law, apply to any fund or balance of a fund derived wholly or partly from special taxes, fees, earnings, fines, federal grants, or other sources that are by law appropriated for special purposes by standing, continuing, or revolving appropriations.\nExcept as provided by law, an appropriation made to the Minnesota Historical Society, if not spent during the first year, may be spent during the second year of a biennium. An unexpended balance remaining at the end of a biennium lapses and shall be returned to the fund from which appropriated. An appropriation made to the society for all or part of a biennium may be spent in either year of the biennium.\n(a) The commissioner of management and budget must transfer the unexpended and unencumbered balance of a general fund disaster assistance appropriation that expires as provided under this section or as otherwise provided by law to the disaster assistance contingency account in section 12.221, subdivision 6.\n(b) Expired disaster assistance transferred to the disaster assistance contingency account is appropriated as provided under section 12.221, subdivision 6, regardless of the specific disaster event or purpose for which the expired disaster assistance was originally appropriated.\n(c) The commissioner must report each transfer to the chairs of the house of representatives Ways and Means Committee and the senate Finance Committee.\n(d) For the purposes of this subdivision, \"disaster assistance appropriation\" means an appropriation from the general fund to provide cost-share required for federal disaster assistance or to provide other state disaster assistance under chapter 12A or 12B.",
	"repealed": false
}