{
	"id": "121A.201",
	"url": "https://www.revisor.mn.gov/statutes/cite/121A.201",
	"title": "121A.201 MTSS AND COLLABORATIVE MINNESOTA PARTNERSHIPS TO ADVANCE STUDENT SUCCESS (COMPASS).",
	"text": "Beginning July 1, 2023, all Minnesota school districts and charter schools must be offered training and support in implementing MTSS through the Department of Education COMPASS team and the Department of Education's regional partners, the Minnesota Service Cooperatives. COMPASS is the state school improvement model providing a statewide system through which all districts and schools may receive support in the areas of literacy, math, social-emotional learning, and mental health within the MTSS framework. The MTSS framework is the state's systemic, continuous school improvement framework for ensuring positive social, emotional, behavioral, developmental, and academic outcomes for every student. MTSS provides access to layered tiers of culturally and linguistically responsive, evidence-based practices. The MTSS framework relies on the understanding and belief that every student can learn and thrive, and it engages an anti-bias and socially just approach to examining policies and practices and ensuring equitable distribution of resources and opportunity. The MTSS systemic framework requires:\n(1) a district-wide infrastructure consisting of effective leaders, collective efficacy among staff, positive school climate, linked teams, and professional learning that supports continuous improvement;\n(2) authentic engagement with families and communities to develop reciprocal relationships and build new opportunities for students together;\n(3) multilayered tiers of culturally and linguistically responsive instruction and support that allows every student the support they need to reach meaningful and rigorous learning standards. Tiers of support include core (Tier 1), supplemental (Tier 2), and intensive (Tier 3) instruction levels;\n(4) valid and reliable assessment tools and processes to assess student and system performance and inform necessary changes; and\n(5) a data-based decision-making approach in which problems are precisely defined and analyzed, solutions address root causes, and implementation is monitored to ensure success. The data-based problem-solving component of the MTSS framework consists of three major subcomponents: accessible and integrated data, decision-making process, and system performance.",
	"repealed": false
}