{
	"id": "62V.03",
	"url": "https://www.revisor.mn.gov/statutes/cite/62V.03",
	"title": "62V.03 MNSURE; ESTABLISHMENT.",
	"text": "MNsure is created as a board under section 15.012, paragraph (a), to:\n(1) promote informed consumer choice, innovation, competition, quality, value, market participation, affordability, suitable and meaningful choices, health improvement, care management, reduction of health disparities, and portability of health plans;\n(2) facilitate and simplify the comparison, choice, enrollment, and purchase of health plans for individuals purchasing in the individual market through MNsure and for employees and employers purchasing in the small group market through MNsure;\n(3) assist small employers with access to small business health insurance tax credits and to assist individuals with access to public health care programs, premium assistance tax credits and cost-sharing reductions, and certificates of exemption from individual responsibility requirements;\n(4) facilitate the integration and transition of individuals between public health care programs and health plans in the individual or group market and develop processes that, to the maximum extent possible, provide for continuous coverage; and\n(5) establish and modify as necessary a name and brand for MNsure based on market studies that show maximum effectiveness in attracting the uninsured and motivating them to take action.\n(a) MNsure must be reviewed by the legislative auditor under section 3.971. The legislative auditor shall audit the books, accounts, and affairs of MNsure once each year or less frequently as the legislative auditor's funds and personnel permit. Upon the audit of the financial accounts and affairs of MNsure, MNsure is liable to the state for the total cost and expenses of the audit, including the salaries paid to the examiners while actually engaged in making the examination. The legislative auditor may bill MNsure either monthly or at the completion of the audit. All collections received for the audits must be deposited in the general fund and are appropriated to the legislative auditor. Pursuant to section 3.97, subdivision 3a, the Legislative Audit Commission is requested to direct the legislative auditor to report by March 1, 2014, to the legislature on any duplication of services that occurs within state government as a result of the creation of MNsure. The legislative auditor may make recommendations on consolidating or eliminating any services deemed duplicative. The board shall reimburse the legislative auditor for any costs incurred in the creation of this report.\n(b) Board members of MNsure are subject to sections 10A.07 and 10A.09. Board members and the personnel of MNsure are subject to section 10A.071.\n(c) All meetings of the board and of the Minnesota Eligibility System Executive Steering Committee established under section 62V.055 shall comply with the open meeting law in chapter 13D.\n(d) The board and the website are exempt from chapter 60K. Any employee of MNsure who sells, solicits, or negotiates insurance to individuals or small employers must be licensed as an insurance producer under chapter 60K.\n(e) Section 3.3005 applies to any federal funds received by MNsure.\n(f) A MNsure decision that requires a vote of the board, other than a decision that applies only to hiring of employees or other internal management of MNsure, is an \"administrative action\" under section 10A.01, subdivision 2.\n(a) Nothing in this chapter shall be construed to prohibit: (1) a health carrier from offering outside of MNsure a health plan to a qualified individual or qualified employer; and (2) a qualified individual from enrolling in, or a qualified employer from selecting for its employees, a health plan offered outside of MNsure.\n(b) Nothing in this chapter shall be construed to restrict the choice of a qualified individual to enroll or not enroll in a qualified health plan or to participate in MNsure. Nothing in this chapter shall be construed to compel an individual to enroll in a qualified health plan or to participate in MNsure.\n(c) For purposes of this subdivision, \"qualified individual\" and \"qualified employer\" have the meanings given in section 1312 of the Affordable Care Act, Public Law 111-148, and further defined through amendments to the act and regulations issued under the act.",
	"repealed": false
}