{
	"id": "383A.13",
	"url": "https://www.revisor.mn.gov/statutes/cite/383A.13",
	"title": "383A.13 PARAMEDICS.",
	"text": "As used in this section, \"paramedic\" means a person who:\n(1) is an employee of the county of Ramsey;\n(2) has been specially trained in emergency cardiac and noncardiac care by a licensed physician in a training program certified by the commissioner of the state Department of Health or the State Board of Medical Practice and is certified as qualified to render the emergency lifesaving services enumerated in this section.\nThe county of Ramsey may maintain a staff of paramedics.\nParamedics may do any of the following:\n(a) perform regular rescue, first aid and resuscitation services;\n(b) during training administer parenteral medications under the direct supervision of a licensed physician, a registered nurse, or a licensed physician assistant;\n(c) perform cardiopulmonary resuscitation and defibrillation in a pulseless, nonbreathing patient;\n(d) administer intravenous saline or glucose solutions;\n(e) administer parenteral injections in any of the following classes of drugs;\n(i) antiarrhythmic agents;\n(ii) vagolytic agents;\n(iii) chronotropic agents;\n(iv) analgesic agents;\n(v) alkalinizing agents;\n(vi) vasopressor agents;\n(vii) diuretics;\n(f) administer, perform and apply all other procedures, drugs and skills in which they have been trained and are certified to give, apply and dispense.\nAt all times before undertaking the actions authorized by subdivision 3, clauses (c), (d), (e), and (f), paramedics shall try and, during the course of an emergency, continue to try to establish voice communications with and receive instructions from a licensed physician who has been associated with the dispensing of emergency cardiac and noncardiac medical care.\nAdditionally, during the course of what the paramedics believe to be a cardiac emergency, they shall try to telemeter an electrocardiogram of the person being treated to a licensed physician, who has been associated with the dispensing of cardiac medical care.\nNothing contained in this section changes existing law as it relates to delegation by a licensed physician of acts, tasks or functions to persons other than paramedics.\nNo licensed physician, registered nurse, or licensed physician assistant, who in good faith and in the exercise of reasonable care gives emergency instructions to a certified paramedic at the scene of an emergency, or while in transit to and from the scene of such emergency, shall be liable for any civil damages as a result of issuing such instructions.\nNo certified paramedic, who in good faith and in the exercise of reasonable care renders emergency lifesaving care and treatment as set forth in this section, is liable for any civil damages because of rendering such care and treatment.",
	"repealed": false
}