{
	"id": "142B.30",
	"url": "https://www.revisor.mn.gov/statutes/cite/142B.30",
	"title": "142B.30 STANDARDS FOR COUNTY AGENCIES AND PRIVATE AGENCIES.",
	"text": "(a) County agencies and private agencies that have been designated or licensed by the commissioner to perform licensing functions and activities under section 142B.10; to recommend denial of applicants under section 142B.15; to issue correction orders, to issue variances, and to recommend a conditional license under section 142B.16; or to recommend suspending or revoking a license or issuing a fine under section 142B.18, shall comply with rules and directives of the commissioner governing those functions and with this section. The following variances are excluded from the delegation of variance authority and may be issued only by the commissioner:\n(1) dual licensure of family child care and family child foster care;\n(2) child foster care maximum age requirement;\n(3) variances regarding disqualified individuals;\n(4) variances to requirements relating to chemical use problems of a license holder or a household member of a license holder; and\n(5) variances to section 142B.74 for a time-limited period. If the commissioner grants a variance under this clause, the license holder must provide notice of the variance to all parents and guardians of the children in care.\n(b) The commissioners of human services and children, youth, and families must both approve a variance for dual licensure of family child foster care and family adult foster care or family adult foster care and family child care. Variances under this paragraph are excluded from the delegation of variance authority and may be issued only by both commissioners.\n(c) Except as provided in section 142B.41, subdivision 4, paragraph (e), a county agency must not grant a license holder a variance to exceed the maximum allowable family child care license capacity of 14 children.\n(d) A county agency that has been designated by the commissioner to issue family child care variances must:\n(1) publish the county agency's policies and criteria for issuing variances on the county's public website and update the policies as necessary; and\n(2) annually distribute the county agency's policies and criteria for issuing variances to all family child care license holders in the county.\n(e) Before the implementation of NETStudy 2.0, county agencies must report information about disqualification reconsiderations under sections 245C.25 and 245C.27, subdivision 2, paragraphs (a) and (b), and variances granted under paragraph (a), clause (5), to the commissioner at least monthly in a format prescribed by the commissioner.\n(f) For family child care programs, the commissioner shall require a county agency to conduct one unannounced licensing review at least annually.\n(g) A license issued under this section may be issued for up to two years.\n(h) A county agency shall report to the commissioner, in a manner prescribed by the commissioner, the following information for a licensed family child care program:\n(1) the results of each licensing review completed, including the date of the review, and any licensing correction order issued;\n(2) any death, serious injury, or determination of substantiated maltreatment; and\n(3) any fires that require the service of a fire department within 48 hours of the fire. The information under this clause must also be reported to the state fire marshal within two business days of receiving notice from a licensed family child care provider.\n(a) The county or private agency shall conduct timely investigations of allegations of license violations in programs for which the county or private agency is the commissioner's designated representative and record a disposition of each complaint in accordance with applicable law or rule.\n(b) If an investigation conducted under paragraph (a) results in evidence that the commissioner should deny an application or suspend, revoke, or make conditional a license, the county or private agency shall make that recommendation to the commissioner within ten working days.\nThe county or private agency shall not make recommendations to the commissioner regarding licensure without first conducting an inspection. The county or private agency must forward its recommendation to the commissioner regarding the appropriate licensing action within 20 working days of receipt of a completed application.\nThe county or private agency shall enforce the orders of the commissioner of children, youth, and families under sections 142B.18 and 142B.20, subdivision 6, and the orders of the commissioner of human services under chapter 245C, according to the instructions of the commissioner of children, youth, and families. The county attorney shall assist the county agency in the enforcement and defense of the orders of the commissioner of children, youth, and families under sections 142B.18 and 142B.20, subdivision 6, and the orders of the commissioner of human services under chapter 245C, according to the instructions of the commissioner of children, youth, and families, unless a conflict of interest exists between the county attorney and the commissioner. For purposes of this section, a conflict of interest means that the county attorney has a direct or shared financial interest with the license holder or has a personal relationship or family relationship with a party in the licensing action.\n(a) The commissioner shall provide instruction and technical assistance to county and private agencies that are subject to this section. County and private agencies shall cooperate with the commissioner in carrying out this section by ensuring that affected employees participate in instruction and technical assistance provided by the commissioner.\n(b) The commissioner shall provide training to county agencies that perform child care licensing functions on identifying and preventing fraud relating to provider reimbursement in the child care assistance program.\nThe commissioner shall ensure that rules are uniformly enforced throughout the state by reviewing each county and private agency for compliance with this section and other applicable laws and rules at least every four years. County agencies that comply with this section shall be certified by the commissioner. If a county agency fails to be certified by the commissioner, the commissioner shall certify a reduction of state administrative aids in an amount up to 20 percent of the county's state portion of Vulnerable Children and Adults Act funding.\nOnly county staff trained by the commissioner on the family child care licensing standards in this chapter and Minnesota Rules, chapter 9502, shall perform family child care licensing functions under subdivision 1. Training must occur within 90 days of a staff person's employment.\nThe county or private agency shall provide written notice to the license holder when the agency recommends a licensing action to the commissioner under subdivision 2 or 3. The written notice shall inform the license holder about the process for determining a licensing action and how the license holder will be notified of a licensing action determination. The notice shall include the following:\n(1) that the county or private agency made a recommendation to the commissioner to deny an application or suspend, revoke, or make conditional a license;\n(2) that the commissioner will review the recommendation from the county or private agency and then determine if a licensing action will be issued;\n(3) that the license holder will receive written notice from the commissioner indicating the reasons for the licensing action issued; and\n(4) instructions on how to request reconsideration or appeal, if a licensing action is issued.\nCounty or private agency recommendations under this section are classified as confidential data under chapter 13 and may only be disclosed as permitted by law.\n(a) Before recommending to grant a license, deny a license under section 142B.15, or revoke a license under section 142B.18 for nondisqualifying background study information received under section 245C.05, subdivision 4, paragraph (a), clause (3), for a licensed family foster setting, a county agency or private agency that has been designated or licensed by the commissioner must review the following for the license holder, the applicant, and an individual living in the household where the licensed services are provided or who is otherwise subject to a background study:\n(1) the type of offenses;\n(2) the number of offenses;\n(3) the nature of the offenses;\n(4) the age of the individual at the time of the offenses;\n(5) the length of time that has elapsed since the last offense;\n(6) the relationship of the offenses and the capacity to care for a child;\n(7) evidence of rehabilitation;\n(8) information or knowledge from community members regarding the individual's capacity to provide foster care;\n(9) any available information regarding child maltreatment reports or child in need of protection or services petitions, or related cases, in which the individual has been involved or implicated, and documentation that the individual has remedied issues or conditions identified in child protection or court records that are relevant to safely caring for a child;\n(10) a statement from the study subject;\n(11) a statement from the license holder; and\n(12) other aggravating and mitigating factors.\n(b) For purposes of this section, \"evidence of rehabilitation\" includes but is not limited to the following:\n(1) maintaining a safe and stable residence;\n(2) continuous, regular, or stable employment;\n(3) successful participation in an education or job training program;\n(4) positive involvement with the community or extended family;\n(5) compliance with the terms and conditions of probation or parole following the individual's most recent conviction;\n(6) if the individual has had a substance use disorder, successful completion of a substance use disorder assessment, substance use disorder treatment, and recommended continuing care, if applicable, demonstrated abstinence from controlled substances, as defined in section 152.01, subdivision 4, or the establishment of a sober network;\n(7) if the individual has had a mental illness or documented mental health issues, demonstrated completion of a mental health evaluation, participation in therapy or other recommended mental health treatment, or appropriate medication management, if applicable;\n(8) if the individual's offense or conduct involved domestic violence, demonstrated completion of a domestic violence or anger management program, and the absence of any orders for protection or harassment restraining orders against the individual since the previous offense or conduct;\n(9) written letters of support from individuals of good repute, including but not limited to employers, members of the clergy, probation or parole officers, volunteer supervisors, or social services workers;\n(10) demonstrated remorse for convictions or conduct, or demonstrated positive behavior changes; and\n(11) absence of convictions or arrests since the previous offense or conduct, including any convictions that were expunged or pardoned.\n(c) An applicant for a family foster setting license must sign all releases of information requested by the county or private licensing agency.\n(d) When licensing a relative for a family foster setting, the commissioner shall also consider the importance of maintaining the child's relationship with relatives as an additional significant factor in determining whether an application will be denied.\n(e) When recommending that the commissioner deny or revoke a license, the county or private licensing agency must send a summary of the review completed according to paragraph (a), on a form developed by the commissioner, to the commissioner and include any recommendation for licensing action.\nUpon implementation of the provider licensing and reporting hub, county staff who perform licensing functions must use the hub in the manner prescribed by the commissioner.\nCounty and private agency staff who perform delegated licensing functions must use the commissioner's electronic licensing checklist in the manner prescribed by the commissioner.\n(a) A licensed child-placing agency must have an individual designated on staff or contract who supervises the agency's casework. Supervising an agency's casework includes but is not limited to:\n(1) reviewing and approving each written home study the agency completes on prospective foster parents or applicants to adopt;\n(2) ensuring ongoing compliance with licensing requirements; and\n(3) overseeing staff and ensuring they have the training and resources needed to perform their responsibilities.\n(b) The individual who supervises the agency's casework must meet at least one of the following qualifications:\n(1) is a licensed social worker, licensed graduate social worker, licensed independent social worker, or licensed independent clinical social worker;\n(2) is a trained culturally competent professional with experience in a relevant field; or\n(3) is a licensed clinician with experience in a related field, including a clinician licensed by a health-related licensing board under section 214.01, subdivision 2.\n(c) The commissioner may grant a variance under section 142B.10, subdivision 16, to the requirements in this section.",
	"repealed": false
}