{
	"id": "604A.40",
	"url": "https://www.revisor.mn.gov/statutes/cite/604A.40",
	"title": "604A.40 AGRITOURISM; IMMUNITY FROM LIABILITY.",
	"text": "(a) For the purposes of this section, the terms in paragraphs (b) to (g) have the meanings given them.\n(b) \"Agricultural products\" means livestock, aquacultural, poultry, horticultural, floricultural, viticultural, silvicultural, or other products of a farm or ranch.\n(c) \"Agritourism activity\" means activity carried out on a farm or ranch that allows organizations or members of the general public, for recreational, entertainment, charitable, or educational purposes, to view, enjoy, or participate in rural activities, including, but not limited to: farming; viticulture; winemaking; ranching; and historical, cultural, farm stay, gleaning, harvest-your-own, or natural activities and attractions. An activity is an agritourism activity whether or not the participant pays to participate in the activity.\n(d) \"Agritourism professional\" means a person who is engaged in providing one or more agritourism activities, whether or not for compensation.\n(e) \"Farm or ranch\" means one or more areas of land used for the production, cultivation, growing, harvesting, or processing of agricultural products.\n(f) \"Inherent risks of agritourism activity\" means dangers or conditions that are an integral part of an agritourism activity including but not limited to:\n(1) natural hazards and conditions of land, vegetation, and waters including surface and subsurface conditions;\n(2) the behavior of wild or domestic animals; and\n(3) ordinary dangers of structures or equipment ordinarily used in farming or ranching operations.\n(g) \"Participant\" means a person, other than an agritourism professional, who engages in an agritourism activity and who has the capacity to understand the inherent risks of agricultural tourism.\n(a) Except as provided in paragraphs (b) and (c), an agritourism professional is not liable for injury, damage, or death of a participant resulting from the inherent risks of agritourism activities.\n(b) Nothing in paragraph (a) prevents or limits the liability of an agritourism professional if the agritourism professional:\n(1) commits an act or omission that constitutes negligence or willful or wanton disregard for the safety of the participant, and that act or omission proximately causes injury, damage, or death of the participant;\n(2) has actual knowledge or reasonably should have known of a dangerous condition on the land or in the facilities or equipment used in the activity, or the dangerous propensity of a particular animal used in such activity;\n(3) intentionally injures the participant; or\n(4) fails to comply with the notice requirement of subdivision 3.\n(c) Nothing in paragraph (a) affects a claim under chapter 340A, or a claim arising out of the sale or use of alcohol at an agritourism facility.\nAn agritourism professional shall post plainly visible signs at one or more prominent locations in the premises where the agritourism activity takes place that include a warning of the inherent risks of agritourism activity.",
	"repealed": false
}