{
	"id": "582.30",
	"url": "https://www.revisor.mn.gov/statutes/cite/582.30",
	"title": "582.30 DEFICIENCY JUDGMENTS BY MORTGAGE HOLDER.",
	"text": "(a) Except as provided in this section, a person holding a mortgage may obtain a deficiency judgment against the mortgagor if the amount a person holding a mortgage receives from a foreclosure sale is less than:\n(1) the amount remaining unpaid on the mortgage under chapter 580; or\n(2) the amount of the judgment entered under chapter 581.\n(b) Except as provided in subdivisions 3 and 5, the judgment may not be for more than the difference between the amount received from the foreclosure sale less expenses and costs and:\n(1) for a foreclosure by advertisement, the total amount that attaches to the sale proceeds under chapter 580; or\n(2) for a foreclosure by action, the amount of the judgment entered under chapter 581.\n(c) Subdivisions 3 to 9 do not apply to mortgages entered or amended on or after May 22, 1999, if the mortgaged property is used in agricultural production only by a tenant who is not the mortgagor.\nA deficiency judgment is not allowed if a mortgage is foreclosed by advertisement under chapter 580, and has a redemption period of six months under section 580.23, subdivision 1, or five weeks under section 582.032.\n(a) If a mortgage entered after March 22, 1986, on property used in agricultural production is foreclosed and sold, a deficiency judgment may only be obtained by filing an action for a deficiency judgment and a determination of the fair market value of the property within 90 days after the foreclosure sale. In the action all issues of fact, including determination of the fair market value of the property, shall be tried by a jury unless a jury trial is waived as provided in Minnesota district court rules. A court may allow a deficiency judgment only if it determines that the sale of the property was conducted in a commercially reasonable manner.\n(b) The amount of the deficiency judgment is limited to the difference of the fair market value of the property, and the amount remaining unpaid on the mortgage if the foreclosure is under chapter 580 or the amount of the judgment if the foreclosure is under chapter 581. The property may not be presumed to be sold for its fair market value. A party adversely affected by a deficiency judgment may submit evidence relevant to establishing the fair market value of the property. Notice of the time and place where the action for the deficiency judgment and the determination of fair market value of the property is to be heard must be given to all parties adversely affected by the judgment.\nA personal judgment may not be executed against a mortgagor liable on a mortgage note entered after March 22, 1986, secured by real property used in agricultural production, unless the fair market value of the property is determined in a proceeding as provided in subdivision 3. The personal judgment on the mortgage note may not be for more than the difference of the amount due on the note and the fair market value of the property.\n(a) If a mortgage entered on or before March 22, 1986, on property used in agricultural production is foreclosed and sold, a deficiency judgment may only be obtained by filing an action for a deficiency judgment and a determination of the fair market value of the property within 90 days after the foreclosure sale. In the action all issues of fact, including determination of the fair market value of the property, shall be tried by a jury unless a jury trial is waived as provided in Minnesota District Court Rules. A court may allow a deficiency judgment only if it determines that the sale of the property was conducted in a commercially reasonable manner.\n(b) The amount of the deficiency judgment is limited to the difference of the fair market value of the property, and the amount remaining unpaid on the mortgage if the foreclosure is under chapter 580 or the amount of the judgment if the foreclosure is under chapter 581. The property may not be presumed to be sold for its fair market value. A party adversely affected by a deficiency judgment may submit evidence relevant to establishing the fair market value of the property. Notice of the time and place where the action for the deficiency judgment and the determination of fair market value of the property is to be heard must be given to all parties adversely affected by the judgment.\nA personal judgment may not be executed against a mortgagor liable on a mortgage note entered on or before March 22, 1986, secured by real property used in agricultural production, unless the fair market value of the property is determined in a proceeding as provided in subdivision 5. The personal judgment on the mortgage note may not be for more than the difference of the amount due on the note and the fair market value of the property.\nA deficiency judgment or personal judgment obtained to enforce a mortgage debt on property used in agricultural production may be enforced by execution, but the judgment may not be executed after three years from the date judgment was entered.\nFor a mortgage on property used in agricultural production entered on or before March 22, 1986, a deficiency judgment or personal judgment to enforce the mortgage debt may not be executed on real or personal property used for agricultural production until one year after March 22, 1986.\nA deficiency judgment or personal judgment obtained to enforce a mortgage debt on property used in agricultural production does not attach to real or personal property that is acquired by the mortgagor or debtor after the judgment is entered.",
	"repealed": false
}