{
	"id": "148E.070",
	"url": "https://www.revisor.mn.gov/statutes/cite/148E.070",
	"title": "148E.070 LICENSE RENEWALS.",
	"text": "(a) If a license is renewed, the license must be renewed for a two-year renewal term. The renewal term is the period from the effective date of an initial or renewed license to the expiration date of the license.\n(b) The effective date of a renewed license is the day following the expiration date of the expired license.\n(c) The expiration date of a renewed license is the last day of the licensee's birth month in the second calendar year following the effective date of the renewed license.\nThe board must send a notice for license renewal to a licensee at least 45 days before the expiration date of the license. The board may send the renewal notice to the licensee's last known mailing address or electronically. Failure to receive the renewal notice does not relieve a licensee of the obligation to renew a license and to pay the renewal fee.\n(a) In order to renew a license, a licensee must submit:\n(1) a completed, signed application for license renewal; and\n(2) the applicable renewal fee specified in section 148E.180.\nThe board must receive the completed, signed application and renewal fee prior to midnight on the day of the license expiration date. For electronic renewals, a \"signed application\" means providing an attestation that the board has specified.\n(b) An application that the applicant has not completed and signed, or that is not accompanied by the correct fee, is void. The board must return the incomplete application and any fee to the applicant.\n(c) The completed, signed application must include documentation that the licensee has met the continuing education requirements specified in sections 148E.130 to 148E.145 and, if applicable, the supervised practice requirements specified in sections 148E.100 to 148E.125.\n(d) By submitting a renewal application, an applicant authorizes the board to:\n(1) investigate any information provided or requested in the application. The board may request that the applicant provide additional information, verification, or documentation;\n(2) conduct an audit to determine if the applicant has met the continuing education requirements specified in sections 148E.130 to 148E.145; and\n(3) if applicable, conduct an audit to determine whether the applicant has met the supervision requirements specified in sections 148E.100 to 148E.125.\nAn application that is received after the license expiration date must be accompanied by the renewal late fee specified in section 148E.180 in addition to the applicable renewal fee. The application, renewal fee, and renewal late fee must be received by the board within 60 days of the license expiration date, or the license automatically expires.\n(a) A licensee whose license has expired may restore a license to active status by meeting the requirements in section 148E.080 or may be relicensed by meeting the requirements specified in section 148E.055.\n(b) The board may take action according to sections 148E.255 to 148E.270 based on a licensee's conduct before the expiration of the license.\n(c) An expired license may be reactivated within one year of the expiration date specified in section 148E.080. After one year of the expiration date, an individual may apply for a new license according to section 148E.055.",
	"repealed": false
}