{
	"id": "62L.16",
	"url": "https://www.revisor.mn.gov/statutes/cite/62L.16",
	"title": "62L.16 ADMINISTRATION OF ASSOCIATION.",
	"text": "The association shall contract with a qualified entity to operate and administer the association. If there is no available qualified entity, or in the event of a termination under subdivision 2, the association may directly operate and administer the reinsurance program. The administrator shall perform all administrative functions required by this chapter. The board of directors shall develop administrative functions required by this chapter and written criteria for the selection of an administrator. The administrator must be selected by the board of directors, subject to approval by the commissioner.\nThe administrator shall serve for a period of three years, unless the administrator requests the termination of its contract and the termination is approved by the board of directors. The board of directors shall approve or deny a request to terminate within 90 days of its receipt after consultation with the commissioner. A failure to make a final decision on a request to terminate within 90 days is considered an approval.\nThe association shall enter into a written contract with the administrator to carry out its duties and responsibilities. The administrator shall perform all administrative functions required by this chapter including the:\n(1) preparation and submission of an annual report to the commissioner;\n(2) preparation and submission of monthly reports to the board of directors;\n(3) calculation of all assessments and the notification thereof of members;\n(4) payment of claims to health carriers following the submission by health carriers of acceptable claim documentation; and\n(5) provision of claim reports to health carriers as determined by the board of directors.\nThe association shall issue a request for proposal for administration of the reinsurance association and shall solicit responses from health carriers participating in the small employer market and from other qualified entities. Methods of compensation of the administrator must be a part of the bid process. The administrator shall substantiate its cost reports consistent with generally accepted accounting principles.\nThe board of directors may conduct periodic audits to verify the accuracy of financial data and reports submitted by the administrator. The board may establish in the plan of operation a uniform audit program. All costs of the uniform audit program and any additional audits conducted by the board to verify the accuracy of claims submissions are the responsibility of the health carrier. Failure of a health carrier to comply with the requirements of the audit program, including the failure to pay the costs of an audit, may subject the health carrier to the penalties described in section 62L.11.\nThe association shall maintain appropriate records and documentation relating to the activities of the association. All individual patient-identifying claims data and information are confidential and not subject to disclosure of any kind, except that a health carrier shall have access upon request to individual claims data relating to eligible employees and dependents covered by a health benefit plan issued by the health carrier. All records, documents, and work product prepared by the association or by the administrator for the association are the property of the association. The commissioner shall have access to the data for the purposes of carrying out the supervisory functions provided for in this chapter.\nThe association shall indemnify members, directors, officers, employees, and agents to the same extent that persons may be indemnified by corporations under section 317A.521.",
	"repealed": false
}