{
	"id": "168E.01",
	"url": "https://www.revisor.mn.gov/statutes/cite/168E.01",
	"title": "168E.01 DEFINITIONS.",
	"text": "As used in this chapter, the following terms have the meanings given.\n\"Accessories and supplies\" has the meaning given in section 297A.67, subdivision 7a.\n\"Baby products\" means breast pumps, baby bottles and nipples, pacifiers, teething rings, infant syringes, baby wipes, cribs and bassinets, crib and bassinet mattresses, crib and bassinet sheets, changing tables, changing pads, strollers, car seats and car seat bases, baby swings, bottle sterilizers, and infant eating utensils.\n\"Clothing\" has the meaning given in section 297A.67, subdivision 8.\n\"Commissioner\" means the commissioner of revenue.\n\"Drugs and medical devices\" has the meaning given in section 297A.67, subdivision 7.\n\"Food and beverage service establishment\" has the meaning given in section 157.15, subdivision 5.\n\"Food and food ingredients\" has the meaning given in section 297A.67, subdivision 2.\n\"Marketplace provider\" has the meaning given in section 297A.66, subdivision 1, paragraph (d).\n\"Person\" has the meaning given in section 297A.61, subdivision 2.\n\"Prepared food\" has the meaning given in section 297A.61, subdivision 31.\n(a) \"Retail delivery\" means a delivery to a person located in Minnesota of the following items as part of a retail sale:\n(1) tangible personal property that is subject to taxation under chapter 297A; and\n(2) clothing, as defined under section 297A.67, subdivision 8, excluding cloth and disposable child and adult diapers.\n(b) Retail delivery does not include pickup at the retailer's place of business, including curbside delivery.\n\"Retail delivery fee\" means the fee imposed under section 168E.03 on retail deliveries.\n\"Retail sale\" has the meaning given in section 297A.61, subdivision 4.\n\"Retailer\" means any person making sales, leases, or rental of personal property or services within or into the state of Minnesota. Retailer includes a:\n(1) retailer maintaining a place of business in this state;\n(2) marketplace provider maintaining a place of business in this state, as defined in section 297A.66, subdivision 1, paragraph (a);\n(3) retailer not maintaining a place of business in this state; and\n(4) marketplace provider not maintaining a place of business in this state, as defined in section 297A.66, subdivision 1, paragraph (b).\n\"Tangible personal property\" has the meaning given in section 297A.61, subdivision 10.\n\"Threshold amount\" means $100, before application of the tax imposed under section 297A.62, subdivisions 1 and 1a, and any applicable local sales and use taxes, and excluding exempt items under section 168E.05.",
	"repealed": false
}