{
	"id": "604A.11",
	"url": "https://www.revisor.mn.gov/statutes/cite/604A.11",
	"title": "604A.11 VOLUNTEER ATHLETIC COACHES AND OFFICIALS; PHYSICIANS AND TRAINERS; IMMUNITY FROM LIABILITY.",
	"text": "(a) No individual who provides services or assistance without compensation as an athletic coach, manager, official, physician, or certified athletic trainer for a sports team that is organized or performing under a nonprofit charter or as a physician or licensed athletic trainer for a sports team or athletic event sponsored by a public or private educational institution, and no community-based, voluntary nonprofit athletic association, or any volunteer of the nonprofit athletic association, is liable for money damages to a player, participant, or spectator as a result of an individual's acts or omissions in the providing of that service or assistance either at the scene of the event or, in the case of a physician or athletic trainer, while the player, participant, or spectator is being transported to a hospital, physician's office, or other medical facility.\n(b) This section applies to organized sports competitions and practice and instruction in that sport.\n(c) For purposes of this section, \"compensation\" does not include reimbursement for expenses.\nSubdivision 1 does not apply:\n(1) to the extent that the acts or omissions are covered under an insurance policy issued to the entity for whom the coach, manager, official, physician, or certified athletic trainer serves;\n(2) if the individual acts in a willful and wanton or reckless manner in providing the services or assistance;\n(3) if the acts or omissions arise out of the operation, maintenance, or use of a motor vehicle;\n(4) to an athletic coach, manager, or official who provides services or assistance as part of a public or private educational institution's athletic program;\n(5) to a public or private educational institution for which a physician or certified athletic trainer provides services; or\n(6) if the individual acts in violation of federal, state, or local law.\nThe limitation in clause (1) constitutes a waiver of the defense of immunity to the extent of the liability stated in the policy, but has no effect on the liability of the individual beyond the coverage provided. The limitation in clause (5) does not affect the limitations on liability of a public educational institution under section 3.736 or chapter 466.",
	"repealed": false
}