{
	"id": "260C.307",
	"url": "https://www.revisor.mn.gov/statutes/cite/260C.307",
	"title": "260C.307 PROCEDURES IN TERMINATING PARENTAL RIGHTS.",
	"text": "Any reputable person, including but not limited to any agent of the commissioner of children, youth, and families, having knowledge of circumstances which indicate that the rights of a parent to a child should be terminated, may petition the juvenile court in the manner provided in section 260C.141, subdivisions 4 and 5.\nThe termination of parental rights under the provisions of section 260C.301, shall be made only after a hearing before the court, in the manner provided in section 260C.163.\nThe court shall have notice of the time, place, and purpose of the hearing served on the parents, as defined in sections 257.51 to 257.74 or 259.49, subdivision 1, clause (2), and upon the child's grandparent if the child has lived with the grandparent within the two years immediately preceding the filing of the petition. Notice must be served in the manner provided in sections 260C.151 and 260C.152, except that personal service shall be made at least ten days before the day of the hearing. Published notice shall be made for three weeks, the last publication to be at least ten days before the day of the hearing; and notice sent by certified mail shall be mailed at least 20 days before the day of the hearing. A parent who consents to the termination of parental rights under the provisions of section 260C.301, subdivision 1, clause (a), may waive in writing the notice required by this subdivision; however, if the parent is a minor or incompetent the waiver shall be effective only if the parent's guardian ad litem concurs in writing.\nNo parental rights of a minor or incompetent parent may be terminated on consent of the parents under the provisions of section 260C.301, subdivision 1, clause (a), unless the guardian ad litem, in writing, joins in the written consent of the parent to the termination of parental rights.",
	"repealed": false
}