{
	"id": "115.58",
	"url": "https://www.revisor.mn.gov/statutes/cite/115.58",
	"title": "115.58 ALTERNATIVE DISCHARGING SEWAGE SYSTEMS; GENERAL PERMITS.",
	"text": "(a) The definitions in this subdivision apply to this section.\n(b) \"Alternative discharging sewage system\" means a sewage treatment system serving one or more dwellings and other establishments that discharges less than 10,000 gallons of water per day and uses any treatment and disposal methods other than subsurface soil treatment and disposal.\n(c) \"Permit\" means a national pollutant discharge elimination system permit or state disposal system permit granted to any person for the installation, ownership, management, or control of alternative discharging sewage systems whose operations, emissions, activities, discharges, or facilities are the same or substantially similar.\n(d) \"Water quality cooperative\" means an association of persons organized under chapter 308A to install, own, manage, and control subsurface sewage treatment systems or alternative discharging sewage systems and provide water quality treatment and management services for its members within a defined geographical area.\n(e) \"Water quality treatment and management services\" means the monitoring and control of alternative discharging sewage systems to eliminate or reduce water pollution from point and nonpoint sources; the management, use, reuse, recycling, or reclamation of land, water, or wastewater for water supply; geothermal heating and cooling; fire protection; irrigation; drainage; open space or green belt preservation; stormwater management and control; flood management and control or other purposes that are part of a comprehensive plan to reduce, prevent, or eliminate water pollution.\n[Repealed, 2014 c 258 s 4]\nAny system which is permitted under subdivision 2 is exempt from the requirements of any local ordinance adopted to conform with section 115.55 if the system complies with the applicable standards for discharges and treatment of sewage effluents.",
	"repealed": false
}