{
	"id": "142G.75",
	"url": "https://www.revisor.mn.gov/statutes/cite/142G.75",
	"title": "142G.75 FAMILY STABILIZATION SERVICES.",
	"text": "Family stabilization services serve families who are not making significant progress within the regular employment and training services track of the Minnesota family investment program (MFIP) due to a variety of barriers to employment.\nThe terms used in this section have the meanings given them in paragraphs (a) and (b).\n(a) \"Family stabilization services\" means programs, activities, and services provided by or through the county agency or through the employment services agency to participating families. Services include, but are not limited to, assessment as defined in section 142G.56, subdivision 1, referrals, and assistance in the preparation and implementation of a family stabilization plan under subdivision 4.\n(b) \"Family stabilization plan\" means a plan developed with the participant, which identifies the participant's most appropriate path to unsubsidized employment, family stability, and barrier reduction, taking into account the family's circumstances.\n(a) The following MFIP participants are eligible for the services under this section:\n(1) a participant who meets the requirements for or has been granted a hardship extension under section 142G.42, subdivision 3 or 4, except that it is not necessary for the participant to have reached or be approaching 60 months of eligibility for this section to apply;\n(2) a participant who is applying for Supplemental Security Income or Social Security disability insurance;\n(3) a participant who is a noncitizen who has been in the United States for 12 or fewer months; and\n(4) a participant who is age 60 or older.\n(b) A participant under paragraph (a), clause (3), must be provided with English as a second language opportunities and skills training for up to 12 months. After 12 months, the case manager and participant must determine whether the participant should continue with English as a second language classes or skills training, or both, and continue to receive family stabilization services.\n(c) If a county agency or employment services provider has information that an MFIP participant may meet the eligibility criteria set forth in this subdivision, the county agency or employment services provider must assist the participant in obtaining the documentation necessary to determine eligibility.\n(a) The county agency or employment services provider shall provide a family stabilization plan for each participating family. Once a participant has been determined eligible for family stabilization services, the county agency or employment services provider must attempt to meet with the participant to develop a plan within 30 days.\n(b) If a participant is already assigned to a county case manager or a county-designated case manager in social services, disability services, or housing services that case manager already assigned may be the case manager for purposes of these services.\n(c) Participants determined eligible for family stabilization services must have access to employment and training services under this section and sections 142G.51 to 142G.53, 142G.55 to 142G.59, 142G.71, to the extent these services are available to other MFIP participants.\nA participant who is eligible for family stabilization services shall engage in family stabilization services for the appropriate number of hours per week based on the needs of the participant and the participant's family, unless good cause exists for not doing so, as defined in section 142G.71, subdivision 1. The county agency or employment services agency shall review the participant's progress toward the goals in the family stabilization plan every six months to determine whether conditions have changed, including whether revisions to the plan are needed.\n(a) The county agency or employment services provider must follow the requirements of this subdivision at the time the county agency or employment services provider has information that an MFIP recipient may meet the eligibility criteria in subdivision 3.\n(b) The financial assistance grant of a participating family is reduced according to section 142G.70, if a participating adult fails without good cause to comply or continue to comply with the family stabilization plan requirements in this subdivision, unless compliance has been excused under subdivision 5, paragraph (d).\n(c) Given the purpose of the family stabilization services in this section and the nature of the underlying family circumstances that act as barriers to both employment and full compliance with program requirements, there must be a review by the county agency prior to imposing a sanction to determine whether the plan was appropriated to the needs of the participant and family. There must be a current assessment by a behavioral health or medical professional confirming that the participant in all ways had the ability to comply with the plan.\n(d) Prior to the imposition of a sanction, the county agency or employment services provider shall review the participant's case to determine if the family stabilization plan is still appropriate and meet with the participant face-to-face. The county agency or employment services provider must inform the participant of the right to bring an advocate to the face-to-face meeting.\nDuring the face-to-face meeting, the county agency shall:\n(1) determine whether the continued noncompliance can be explained and mitigated by providing a needed family stabilization service, as defined in subdivision 2, paragraph (d);\n(2) determine whether the participant qualifies for a good cause exception under section 142G.71, or if the sanction is for noncooperation with child support requirements, determine if the participant qualifies for a good cause exemption under section 518A.81, subdivision 10;\n(3) determine whether activities in the family stabilization plan are appropriate based on the family's circumstances;\n(4) explain the consequences of continuing noncompliance;\n(5) identify other resources that may be available to the participant to meet the needs of the family; and\n(6) inform the participant of the right to appeal under section 142G.45.\nIf the lack of an identified activity or service can explain the noncompliance, the county shall work with the participant to provide the identified activity.\n(e) If the participant fails to come to the face-to-face meeting, the case manager or a designee shall attempt at least one home visit. If a face-to-face meeting is not conducted, the county agency shall send the participant a written notice that includes the information under paragraph (d).\n(f) After the requirements of paragraphs (d) and (e) are met and prior to imposition of a sanction, the county agency shall provide a notice of intent to sanction under section 142G.71, subdivision 2, and, when applicable, a notice of adverse action under section 142G.21.\n(g) Section 142G.71 applies to this section except to the extent that it is modified by this subdivision.\n(a) The commissioner of children, youth, and families shall treat MFIP expenditures made to or on behalf of any minor child under this section, who is part of a household that meets criteria in subdivision 3, as expenditures under a separately funded state program. These expenditures shall not count toward the state's maintenance of effort requirements under the federal TANF program.\n(b) A family is no longer part of a separately funded program under this section if the caregiver no longer meets the criteria for family stabilization services in subdivision 3.",
	"repealed": false
}