{
	"id": "144E.04",
	"url": "https://www.revisor.mn.gov/statutes/cite/144E.04",
	"title": "144E.04 LABOR AND EMERGENCY MEDICAL SERVICE PROVIDERS ADVISORY COUNCIL.",
	"text": "The Labor and Emergency Medical Service Providers Advisory Council is established and consists of the following members:\n(1) one emergency medical service provider of any type from each of the designated regional emergency medical services systems, appointed by their respective regional emergency services boards;\n(2) one emergency medical technician instructor, appointed by an employee organization representing emergency medical service providers;\n(3) two members with experience working as an employee organization representative representing emergency medical service providers, appointed by an employee organization representing emergency medical service providers;\n(4) one emergency medical service provider based in a fire department, appointed jointly by the Minnesota State Fire Chiefs Association and the Minnesota Professional Fire Fighters Association; and\n(5) one emergency medical service provider not based in a fire department, appointed by the League of Minnesota Cities.\nCompensation and reimbursement for expenses for members appointed under subdivision 1; removal of members; filling of vacancies of members; and, except for initial appointments, membership terms are governed by section 15.059. Notwithstanding section 15.059, subdivision 6, the Labor and Emergency Medical Service Providers Advisory Council does not expire.\n(a) The Labor and Emergency Medical Service Providers Advisory Council must elect a chair and vice-chair from among its membership and may elect other officers as the advisory council deems necessary.\n(b) The Labor and Emergency Medical Service Providers Advisory Council must meet quarterly or at the call of the chair.\n(c) Meetings of the Labor and Emergency Medical Service Providers Advisory Council are subject to chapter 13D.\nThe Labor and Emergency Medical Service Providers Advisory Council must review and make recommendations to the director and deputy director of emergency medical service providers on the laws, rules, and policies assigned to the Emergency Medical Service Providers Division and other topics as directed by the director.",
	"repealed": false
}