{
	"id": "53B.56",
	"url": "https://www.revisor.mn.gov/statutes/cite/53B.56",
	"title": "53B.56 RECEIPTS.",
	"text": "For purposes of this section, \"receipt\" means a paper receipt, electronic record, or other written confirmation.\nThis section does not apply to:\n(1) money received for transmission that is subject to the federal remittance rule under Code of Federal Regulations, title 12, part 1005, subpart B, as amended or recodified from time to time;\n(2) money received for transmission that is not primarily for personal, family, or household purposes;\n(3) money received for transmission pursuant to a written agreement between the licensee and payee to process payments for goods or services provided by the payee; or\n(4) payroll processing services.\nFor a transaction conducted in person, the receipt may be provided electronically if the sender requests or agrees to receive an electronic receipt. For a transaction conducted electronically or by telephone, a receipt may be provided electronically. All electronic receipts must be provided in a retainable form.\n(a) Every licensee or the licensee's authorized delegate must provide the sender a receipt for money received for transmission.\n(b) The receipt must contain, as applicable:\n(1) the name of the sender;\n(2) the name of the designated recipient;\n(3) the date of the transaction;\n(4) the unique transaction or identification number;\n(5) the name of the licensee, NMLS Unique ID, the licensee's business address, and the licensee's customer service telephone number;\n(6) the transaction amount, expressed in United States dollars;\n(7) any fee the licensee charges the sender for the transaction; and\n(8) any taxes the licensee collects from the sender for the transaction.\n(c) The receipt required by this section must be provided in (1) English, and (2) the language principally used by the licensee or authorized delegate to advertise, solicit, or negotiate, either orally or in writing, for a transaction conducted in person, electronically, or by telephone, if the language principally used is a language other than English.",
	"repealed": false
}