{
	"id": "61A.02",
	"url": "https://www.revisor.mn.gov/statutes/cite/61A.02",
	"title": "61A.02 FORMS OF POLICY.",
	"text": "So-called coupon policies shall not be issued or delivered by any company to any residents of this state.\nExcept as otherwise authorized pursuant to subdivision 2a, no policy or certificate of life insurance or annuity contract, issued to an individual, group, or multiple employer trust, nor any rider of any kind or description which is made a part thereof shall be issued or delivered in this state, or be issued by a life insurance company organized under the laws of this state, until the form of the same has been approved by the commissioner. In making a determination under this section, the commissioner may require the insurer to provide rates and advertising materials related to policies or contracts, certificates, or similar evidence of coverage issued or delivered in this state.\nSubdivisions 1 to 5 apply to a policy, certificate of insurance, or similar evidence of coverage issued to a Minnesota resident or issued to provide coverage to a Minnesota resident. Subdivisions 1 to 5 do not apply to a certificate of insurance or similar evidence of coverage that meets the conditions of section 61A.093, subdivision 2.\n(a) An insurer may file a life or annuity contract, rates, or forms and all related riders of any kind or description with the commissioner for a review under this subdivision. Any review must be completed within 60 days of receipt of a completed filing. The cost of any actuarial review must be paid by the insurer submitting the filing under this subdivision.\n(b) If a filing has been disapproved and is resubmitted, the cover letter must note the disapproval and any changes made since the earlier filing, with an explanation of why the new filing should be approved. Resubmission of disapproved forms should, where possible, be made within 90 days of disapproval.\n(c) The filer may request a hearing within ten days of receiving a final disapproval. Within 20 days of the receipt of the request, the commissioner shall schedule a date for the hearing, which must occur within 30 days of the scheduling. At least ten days' written notice of the hearing must be given to all interested parties. All hearings must be conducted in accordance with chapter 14.\n(d) The hearing officer may order a prehearing conference for the resolution or simplification of issues, to be held no less than three days before the scheduled date of a hearing.\n(e) All actuaries used by the commissioner to review filings submitted by insurers pursuant to this subdivision, whether employed by the department or secured by contract, must be members of the American Academy of Actuaries. The commissioner may contract with actuaries to review filings submitted by insurers under this subdivision, and shall assess the applicant for the costs of this review. Payments received by the commissioner under this subdivision shall be deposited in the revolving fund established under section 60A.03.\n(f) Except for the change in timing for the review of completed filings found in paragraph (a) and the expedited hearing procedures found in paragraph (c), nothing in this subdivision shall be construed as changing the statutory and regulatory standards for approval or disapproval of filings.\n(a) The commissioner shall, within 60 days after the filing of any form, disapprove the form:\n(1) if the benefits provided are unreasonable in relation to the premium charged;\n(2) if the safety and soundness of the company would be threatened by the offering of an excess rate of interest on the policy or contract;\n(3) if it contains a provision or provisions which are unlawful, unfair, inequitable, misleading, or encourages misrepresentation of the policy; or\n(4) if the form, or its provisions, is otherwise not in the public interest. It shall be unlawful for the company to issue any policy in the form so disapproved. If the commissioner does not within 60 days after the filing of any form, disapprove or otherwise object, the form shall be deemed approved.\n(b) When an insurer or the Minnesota Comprehensive Health Association fails to respond to an objection or inquiry within 60 days, the filing is automatically disapproved. A resubmission is required if action by the Department of Commerce is subsequently requested. An additional filing fee is required for the resubmission.\n(c) For purposes of paragraph (a), clause (2), an excess rate of interest is a rate of interest exceeding the rate of interest determined by subtracting three percentage points from Moody's corporate bond yield average as most recently available.\nThe commissioner may at any time withdraw approval of any policy or form upon the grounds stated in subdivision 3. It is unlawful for the insurer to issue the form or use it in connection with any policy after the effective date of the withdrawal of approval.\nNotification of disapproval or withdrawal of approval must be made to the insurer in writing, specifying the grounds for the disapproval. Upon written request made by the insurer, the commissioner shall grant a hearing within 30 days after receipt of the request. All hearings must be conducted in accordance with chapter 14. Following the hearing, the commissioner may affirm, reverse, or modify the previous determination made with respect to the subject policy or form.\nA domestic insurer may file with the commissioner for informational purposes only a policy, certificate of insurance, or annuity contract that is not intended to be offered or sold within this state. This subdivision only applies to the filing in Minnesota of a policy, certificate of insurance, or annuity contract issued to an insured, certificate holder, or annuitant located outside of this state when the filing is for the express purpose of complying with the law of the state in which the insured, certificate holder, or annuitant resides. In no event may a policy, certificate of insurance, or annuity contract filed under this subdivision for out-of-state use be issued or delivered in Minnesota unless and until the policy, certificate of insurance, or annuity contract is approved under subdivision 2.\n(a) Notwithstanding any provision of this section, the commissioner may authorize certain long-term care coverage to be sold as part of or in conjunction with a life insurance product, where that type of product:\n(1) is not already permitted;\n(2) represents an innovative and reasonable approach to provide both life insurance and long-term care protection;\n(3) provides reasonable coverage; and\n(4) is in the best interest of insureds.\n(b) The insurer filing the product must demonstrate that the proposed new policy satisfies the criteria in paragraph (a), clauses (1) to (4).",
	"repealed": false
}