{
	"id": "173.13",
	"url": "https://www.revisor.mn.gov/statutes/cite/173.13",
	"title": "173.13 PERMIT TO ADVERTISE ALONG INTERSTATE AND PRIMARY HIGHWAYS.",
	"text": "No advertising device shall be erected or maintained in any adjacent area without a permit therefor being first obtained from the commissioner, except that permit systems of legitimate local zoning authorities shall take precedence inside a business area.\nThe commissioner of transportation may adopt, modify, amend, or repeal rules governing the issuance of permits or renewals therefor for the erection and maintenance of advertising devices adjacent to the interstate and primary system of highways, provided that such rules shall not be more restrictive than the provisions of sections 173.13 to 173.231.\nNo size limitation shall apply to any advertising device otherwise legally in place on June 8, 1971.\nThe annual fee for each such permit or renewal thereof shall be as follows:\n(a) If the advertising area of the advertising device does not exceed 50 square feet, the fee shall be $30.\n(b) If the advertising area exceeds 50 square feet but does not exceed 300 square feet, the fee shall be $60.\n(c) If the advertising area exceeds 300 square feet, the fee shall be $120.\n(d) No fee shall be charged for a permit for official signs and notices as they are defined in section 173.02.\nThe provisions of this section shall be effective on July 1, 1971, and the provisions relating to permits and fees shall apply to then legally existing devices as well as devices that may be erected and maintained thereafter.\nPermits shall expire on the last day of June of each year. They may be renewed upon payment of the annual fee and filing of a renewal application form to be provided by the commissioner, but without the filing of a new permit application. There shall be proration of the fee for the year in which the permit is first obtained. There shall be no additional fee or permit required for change in advertising copy.\nA penalty equal to one-half the annual fee shall be charged upon failure to pay the annual permit fee for renewal on or before July 1 of each year.\nThere shall be submitted, together with the fee for the annual renewal, a statement by the applicant that the owner or occupant of the property has consented to the continued use of the property for such advertising device.\nThe commissioner of transportation shall be notified in writing by the assignor of any such assignment.\nThe commissioner may revoke any permit granted herein for cause upon 30 days' written notice of such hearing to the permittee. Such notice and hearing and all rules with respect thereto shall be in accordance with chapter 14. The commissioner within ten days after hearing shall notify the permittee what the permittee must do to retain the permit and the permittee shall have 30 days therefrom in which to comply with the order of the commissioner.\nAdvertising devices erected or maintained after June 8, 1971, not complying with this chapter may be removed by the commissioner upon 60 days prior written notice by certified mail to the owner of the advertising device and to the owner of the real property on which the advertising device is located. No notice is required to be given to the owner of an advertising device whose name is not stated upon the advertising device or the structure on which it is displayed, unless the name of the owner is otherwise reasonably known to the commissioner. The owner of the removed device is liable to the state for the costs of removal. The period of notice is computed from the date of mailing to both the owner of the advertising device and the owner of the real property where the device is located. The department must store a removed outdoor advertising device for a minimum of 30 days prior to disposal. If the outdoor advertising device is not retrieved by the owner within 30 days of removal, the department may dispose of the outdoor advertising device. The state is not liable for trespass actions or sign costs for outdoor advertising devices removed under this subdivision if proper notice has been served.",
	"repealed": false
}