{
	"id": "216B.6851",
	"url": "https://www.revisor.mn.gov/statutes/cite/216B.6851",
	"title": "216B.6851 UTILITY OPTION.",
	"text": "A public utility with less than 200,000 customers subject to sections 216B.68 to 216B.688 that owns two wet scrubbed units at a qualifying facility may opt to be regulated under this section for those units in lieu of section 216B.682. Plans under this section are subject to section 216B.682, subdivision 3. Except where otherwise provided, all other provisions of sections 216B.68 to 216B.688 apply.\n\"Supplemental unit\" means a coal-fired electric generation unit at an electric generating power plant in Minnesota at which mercury emissions-reduction measures are taken as part of an emissions-reduction plan under this section.\nA public utility that elects to be regulated under this section must file a mercury emissions-reduction plan that is designed to achieve total mercury reduction at targeted and supplemental units owned by the utility equivalent to a goal of 90 percent reduction of mercury emissions at the utility's targeted units by December 31, 2018.\nThe utility shall also submit one or more alternatives to the 90 percent reduction plan required under subdivision 3. Alternative plans must be designed to come as near as technically possible to achieving the goal established in subdivision 3 without imposing excessive costs on the utility's customers.\n(a) The utility electing for regulation under this section shall file an initial plan for mercury emissions reduction at one of its two wet scrubbed units on or before December 31, 2007. The plan must provide for mercury emissions reduction to be implemented at that unit by December 31, 2010. If the plan is approved by the commission, and implemented by the utility, the utility may have until July 1, 2015, to file its plans for reduction at its other wet scrubbed unit at the qualifying facility, and may have until December 31, 2018, to implement mercury emissions reduction at that unit.\n(b) Until the utility files its plans for the other wet scrubbed unit, the utility must submit to the commission and agency, by July 1 each year, beginning in 2011, a report containing the following information:\n(1) mercury control plans for units subject to this section, including how elements of the plans may affect the performance and cost-effectiveness of emission controls for air pollutants other than mercury;\n(2) an assessment of the impacts of federal laws regulating various air pollutants emitted by coal-fired power plants that can reasonably be expected to be enacted by 2018 on the utility's units subject to this section, and potential utility responses to those laws, including, but not limited to:\n(i) installing pollution control equipment;\n(ii) using pollution allowances to achieve regulatory compliance; and\n(iii) retiring or repowering the plant that is the subject of the filing with cleaner fuels considering the costs of complying with state and federal environmental regulations.\nFor each potential response, the report must include an analysis of the impacts on ratepayers, the utility's financial position, and utility operations, including the impacts on the service life of affected units.\n(c) The utility shall consult with the agency, the Department of Commerce, and other interested stakeholders to determine which future federal laws to assess under paragraph (b), clause (2), and the scope of the assessment of the impact of those laws.\n(a) The agency shall review the utility's plans as provided in section 216B.684.\n(b) The Public Utilities Commission shall review and evaluate a utility's mercury emissions-reduction plans submitted under this section. In its review, the commission shall consider the environmental and public health benefits, the agency's determination of technical feasibility, competitiveness of customer rates, and cost-effectiveness of the utility's proposed mercury-control initiatives in light of the Pollution Control Agency's review under paragraph (a). Within 180 days of receiving the agency's report, the commission shall approve a utility's mercury emissions-reduction plan that the commission reasonably expects will come closest to achieving total mercury reductions at targeted and supplemental units owned by the utility equivalent to a goal of 90 percent reduction of mercury emissions at the utility's targeted units by December 31, 2018, in a manner that provides for increased environmental and public health benefits without imposing excessive costs on the utility's customers. If the commission is unable to approve the utility's 90 percent reduction plan filed under subdivision 3, the commission, in consultation with the Pollution Control Agency, shall order the utility to implement the most stringent mercury-control alternative proposed by the utility under this section that provides for increased environmental and public health benefits without imposing excessive costs on the utility's customers.\n(c) At each targeted and supplemental unit included in a plan under this section, a utility shall propose to implement mercury emissions-control measures that will result in the greatest reduction of mercury emitted from that unit that is technically feasible without imposing excessive costs.",
	"repealed": false
}