{
	"id": "290C.07",
	"url": "https://www.revisor.mn.gov/statutes/cite/290C.07",
	"title": "290C.07 CALCULATION OF INCENTIVE PAYMENT.",
	"text": "(a) An approved claimant under the sustainable forest incentive program is eligible to receive an annual payment for each acre of enrolled land, excluding any acre improved with a paved trail under easement, lease, or terminable license to the state of Minnesota or a political subdivision. The payment shall equal a percentage of the property tax that would be paid on the land determined by using the previous year's statewide average total tax rate for all taxes levied within townships and unorganized territories, the estimated market value per acre as calculated in section 290C.06, and a class rate of one percent as follows: (1) for claimants enrolling land that is subject to a conservation easement funded under section 97A.056 or a comparable permanent easement conveyed to a governmental or nonprofit entity before May 31, 2013, 25 percent; (2) for claimants enrolling land that is not subject to a conservation easement under an eight-year covenant, 65 percent; (3) for claimants enrolling land that is not subject to a conservation easement under a 20-year covenant, 90 percent; and (4) for claimants enrolling land that is not subject to a conservation easement under a 50-year covenant, 115 percent.\n(b) The calculated payment must not increase or decrease by more than ten percent relative to the payment received for the previous year. In no case may the payment be less than the amount paid to the claimant for the land enrolled in the program in 2017. If an eligible claimant elects to change the length of the covenant on enrolled land on or before May 15, 2019, the limits under this paragraph do not apply and the claimant must receive payment in the amount corresponding to the new covenant length as calculated under paragraph (a).\n(c) In addition to the payments provided under this section, a claimant enrolling more than 1,920 acres shall be allowed an additional payment per acre equal to the amount prescribed in paragraph (a), clause (1), for all acres of enrolled land on which public access is allowed, as required under section 290C.03, paragraph (a), clause (6), excluding any land subject to a conservation easement funded under section 97A.056, or a permanent easement conveyed to a governmental or nonprofit entity that is required to allow for public access under section 290C.03, paragraph (a), clause (6).",
	"repealed": false
}