{
	"id": "16B.281",
	"url": "https://www.revisor.mn.gov/statutes/cite/16B.281",
	"title": "16B.281 SALE AND DISPOSITION OF SURPLUS STATE-OWNED LAND.",
	"text": "All tracts or lots of real property belonging to the state or that may hereafter accrue to the state, including tracts or lots that have escheated to the state, may be disposed of according to sections 16B.281 to 16B.287. Sections 16B.281 to 16B.287 do not apply to school or other trust fund lands belonging to the state, or that may hereafter accrue to the state, under and by virtue of any act of Congress or to any other state-owned lands the sale or disposition of which is provided for under sections 94.09 to 94.16 or other law.\n[Repealed, 2008 c 318 art 1 s 16; 2008 c 368 art 1 s 72]\nThe commissioner of administration shall send written notice to all state departments, agencies, and the University of Minnesota describing any lands or tracts that may be declared surplus. If a department or agency or the University of Minnesota desires custody of the lands or tracts, it shall submit a written request to the commissioner, no later than four calendar weeks after mailing of the notice, setting forth in detail its reasons for desiring to acquire and its intended use of the land or tract. The commissioner shall then determine whether any of the lands described should be declared surplus and offered for sale or otherwise disposed of by transferring custodial control to other requesting state departments or agencies or to the Board of Regents of the University of Minnesota for educational purposes, provided however that transfer to the Board of Regents shall not be determinative of tax exemption or immunity. If the commissioner determines that any of the lands are no longer needed for state purposes, the commissioner shall make findings of fact, describe the lands, declare the lands to be surplus state land, and state the reasons for the sale or disposition of the lands.\n[Repealed, 2008 c 318 art 1 s 16; 2008 c 368 art 1 s 72]\n[Repealed, 2008 c 318 art 1 s 16; 2008 c 368 art 1 s 72]\nThe state department or agency holding custodial control shall maintain the state-owned lands until the lands are sold or otherwise disposed of as provided for in sections 16B.281 to 16B.287.",
	"repealed": false
}