{
	"id": "507.24",
	"url": "https://www.revisor.mn.gov/statutes/cite/507.24",
	"title": "507.24 RECORDABLE, WHEN.",
	"text": "To entitle any conveyance, power of attorney, or other instrument affecting real estate to be recorded, it shall be legible and archivable, it shall be executed, acknowledged by the parties executing the same, and the acknowledgment certified, as required by law. All such instruments may be recorded in every county where any of the lands lie. If the conveyance, power of attorney, or other instrument affecting real estate is executed out of state, it shall be entitled to record if executed as above provided or according to the laws of the place of execution so as to be entitled to record in such place.\n(a) Unless otherwise provided by law, an instrument affecting real estate that is to be recorded as provided in this section or other applicable law must contain the original signatures of the parties who execute it and of the notary public or other officer taking an acknowledgment. However, a financing statement that is recorded as a filing pursuant to section 336.9-502(b) need not contain: (1) the signatures of the debtor or the secured party; or (2) an acknowledgment. An instrument acknowledged in a representative capacity as defined in section 358.52 on behalf of a corporation, partnership, limited liability company, or trust that is otherwise entitled to be recorded shall be recorded if the acknowledgment made in a representative capacity is substantially in the form prescribed in chapter 358, without further inquiry into the authority of the person making the acknowledgment.\n(b) Any electronic instruments, including signatures and seals, affecting real estate may only be recorded in conformance with standards implemented by the Electronic Real Estate Recording Commission created under the Minnesota Real Property Electronic Recording Act, sections 507.0941 to 507.0948. The Electronic Real Estate Recording Commission created under the Minnesota Real Property Electronic Recording Act may adopt or amend standards set by the task force created in Laws 2000, chapter 391, and the Electronic Real Estate Recording Task Force created under Laws 2005, chapter 156, article 2, section 41, and may set new or additional standards to the full extent permitted in section 507.0945. Documents recorded in conformity with the standards created as part of a pilot project for the electronic filing of real estate documents implemented by the task force created in Laws 2000, chapter 391, or by the Electronic Real Estate Recording Task Force created under Laws 2005, chapter 156, article 2, section 41, are deemed to meet the requirements of this section.\n(c) Notices filed pursuant to section 168A.1412, subdivisions 2, 3, and 6, need not contain an acknowledgment.",
	"repealed": false
}