{
	"id": "245I.20",
	"url": "https://www.revisor.mn.gov/statutes/cite/245I.20",
	"title": "245I.20 MENTAL HEALTH CLINIC.",
	"text": "Certified mental health clinics provide clinical services for the treatment of mental illnesses with a treatment team that reflects multiple disciplines and areas of expertise.\n(a) \"Clinical services\" means services provided to a client to diagnose, describe, predict, and explain the client's status relative to a condition or problem as described in the: (1) current edition of the Diagnostic and Statistical Manual of Mental Disorders published by the American Psychiatric Association; or (2) current edition of the DC: 0-5 Diagnostic Classification of Mental Health and Development Disorders of Infancy and Early Childhood published by Zero to Three. Where necessary, clinical services includes services to treat a client to reduce the client's impairment due to the client's condition. Clinical services also includes individual treatment planning, case review, record-keeping required for a client's treatment, and treatment supervision. For the purposes of this section, clinical services excludes services delivered to a client under a separate license and services listed under section 245I.011, subdivision 5.\n(b) \"Competent\" means having professional education, training, continuing education, consultation, supervision, experience, or a combination thereof necessary to demonstrate sufficient knowledge of and proficiency in a specific clinical service.\n(c) \"Discipline\" means a branch of professional knowledge or skill acquired through a specific course of study, training, and supervised practice. Discipline is usually documented by a specific educational degree, licensure, or certification of proficiency. Examples of the mental health disciplines include but are not limited to psychiatry, psychology, clinical social work, marriage and family therapy, clinical counseling, and psychiatric nursing.\n(d) \"Treatment team\" means the mental health professionals, mental health practitioners, and clinical trainees who provide clinical services to clients.\n(a) A mental health clinic location must be an entire facility or a clearly identified unit within a facility that is administratively and clinically separate from the rest of the facility. The mental health clinic location may provide services other than clinical services to clients, including medical services, substance use disorder services, social services, training, and education.\n(b) The certification holder must notify the commissioner of all mental health clinic locations. If there is more than one mental health clinic location, the certification holder must designate one location as the main location and all of the other locations as satellite locations. The main location as a unit and the clinic as a whole must comply with the minimum staffing standards in subdivision 4.\n(c) The certification holder must ensure that each satellite location:\n(1) adheres to the same policies and procedures as the main location;\n(2) provides treatment team members with face-to-face or telephone access to a mental health professional for the purposes of supervision whenever the satellite location is open. The certification holder must maintain a schedule of the mental health professionals who will be available and the contact information for each available mental health professional. The schedule must be current and readily available to treatment team members; and\n(3) enables clients to access all of the mental health clinic's clinical services and treatment team members, as needed.\n(a) A certification holder's treatment team must consist of at least four mental health professionals. At least two of the mental health professionals must be employed by or under contract with the mental health clinic for a minimum of 35 hours per week each.\n(b) The treatment team must include:\n(1) a physician qualified as a mental health professional according to section 245I.04, subdivision 2, clause (4), or a nurse qualified as a mental health professional according to section 245I.04, subdivision 2, clause (1); and\n(2) a psychologist qualified as a mental health professional according to section 245I.04, subdivision 2, clause (3).\n(c) The staff persons fulfilling the requirement in paragraph (b) must provide clinical services at least:\n(1) eight hours every two weeks if the mental health clinic has over 25.0 full-time equivalent treatment team members;\n(2) eight hours each month if the mental health clinic has 15.1 to 25.0 full-time equivalent treatment team members;\n(3) four hours each month if the mental health clinic has 5.1 to 15.0 full-time equivalent treatment team members; or\n(4) two hours each month if the mental health clinic has 2.0 to 5.0 full-time equivalent treatment team members or only provides in-home services to clients.\n(d) The certification holder must maintain a record that demonstrates compliance with this subdivision.\nA mental health professional must remain responsible for each client's case. The certification holder must document the name of the mental health professional responsible for each case and the dates that the mental health professional is responsible for the client's case from beginning date to end date. The certification holder must assign each client's case for assessment, diagnosis, and treatment services to a treatment team member who is competent in the assigned clinical service, the recommended treatment strategy, and in treating the client's characteristics.\n(a) In addition to the policies and procedures required by section 245I.03, the certification holder must establish, enforce, and maintain the policies and procedures required by this subdivision.\n(b) The certification holder must have a clinical evaluation procedure to identify and document each treatment team member's areas of competence.\n(c) The certification holder must have policies and procedures for client intake and case assignment that:\n(1) outline the client intake process;\n(2) describe how the mental health clinic determines the appropriateness of accepting a client into treatment by reviewing the client's condition and need for treatment, the clinical services that the mental health clinic offers to clients, and other available resources; and\n(3) contain a process for assigning a client's case to a mental health professional who is responsible for the client's case and other treatment team members.\n(d) Notwithstanding the requirements under section 245I.10, subdivisions 5 to 9, for the required elements of a diagnostic assessment and a treatment plan, psychiatry billed as evaluation and management services must be documented in accordance with the most recent current procedural terminology as published by the American Medical Association.\nIf necessary treatment for a client or treatment desired by a client is not available at the mental health clinic, the certification holder must facilitate appropriate referrals for the client. When making a referral for a client, the treatment team member must document a discussion with the client that includes: (1) the reason for the client's referral; (2) potential treatment resources for the client; and (3) the client's response to receiving a referral.\nFor the certification holder's telephone numbers that clients regularly access, the certification holder must include the contact information for the area's mental health crisis services as part of the certification holder's message when a live operator is not available to answer clients' calls.\n(a) At a minimum, a certification holder must develop a written quality assurance and improvement plan that includes a plan for:\n(1) encouraging ongoing consultation among members of the treatment team;\n(2) obtaining and evaluating feedback about services from clients, family and other natural supports, referral sources, and staff persons;\n(3) measuring and evaluating client outcomes;\n(4) reviewing client suicide deaths and suicide attempts;\n(5) examining the quality of clinical service delivery to clients; and\n(6) self-monitoring of compliance with this chapter.\n(b) At least annually, the certification holder must review, evaluate, and update the quality assurance and improvement plan. The review must: (1) include documentation of the actions that the certification holder will take as a result of information obtained from monitoring activities in the plan; and (2) establish goals for improved service delivery to clients for the next year.\n(a) The applicant for certification must submit any documents that the commissioner requires on forms approved by the commissioner. Upon implementation of the provider licensing and reporting hub, applicants must use the hub in the manner prescribed by the commissioner.\n(b) Upon submitting an application for certification, an applicant must pay the application fee required by section 245A.10, subdivision 3.\n(c) The commissioner must act on an application within 90 working days of receiving a completed application.\n(d) When the commissioner receives an application for initial certification that is incomplete because the applicant failed to submit required documents or is deficient because the submitted documents do not meet certification requirements, the commissioner must provide the applicant with written notice that the application is incomplete or deficient. In the notice, the commissioner must identify the particular documents that are missing or deficient and give the applicant 45 days to submit a second application that is complete. An applicant's failure to submit a complete application within 45 days after receiving notice from the commissioner is a basis for certification denial.\n(e) The commissioner must give notice of a denial to an applicant when the commissioner has made the decision to deny the certification application. In the notice of denial, the commissioner must state the reasons for the denial in plain language. The commissioner must send or deliver the notice of denial to an applicant by certified mail, by personal service, or through the provider licensing and reporting hub. In the notice of denial, the commissioner must state the reasons that the commissioner denied the application and must inform the applicant of the applicant's right to request a contested case hearing under chapter 14 and Minnesota Rules, parts 1400.8505 to 1400.8612. The applicant may appeal the denial by notifying the commissioner in writing by certified mail, by personal service, or through the provider licensing and reporting hub. If mailed, the appeal must be postmarked and sent to the commissioner within 20 calendar days after the applicant received the notice of denial. If an applicant delivers an appeal by personal service, the commissioner must receive the appeal within 20 calendar days after the applicant received the notice of denial. If the order is issued through the provider hub, the request must be received by the commissioner within 20 calendar days from the date the commissioner issued the order through the hub.\n(a) When the commissioner is exercising the powers conferred to the commissioner by this chapter, if the mental health clinic is in operation and the information is relevant to the commissioner's inspection or investigation, the certification holder must provide the commissioner access to:\n(1) the physical facility and grounds where the program is located;\n(2) documentation and records, including electronically maintained records;\n(3) clients served by the mental health clinic;\n(4) staff persons of the mental health clinic; and\n(5) personnel records of current and former staff of the mental health clinic.\n(b) The certification holder must provide the commissioner with access to the facility and grounds, documentation and records, clients, and staff without prior notice and as often as the commissioner considers necessary if the commissioner is investigating alleged maltreatment or a violation of a law or rule, or conducting an inspection. When conducting an inspection, the commissioner may request and must receive assistance from other state, county, and municipal governmental agencies and departments. The applicant or certification holder must allow the commissioner, at the commissioner's expense, to photocopy, photograph, and make audio and video recordings during an inspection.\n(a) The commissioner may conduct a certification review of the certified mental health clinic every two years to determine the certification holder's compliance with applicable rules and statutes.\n(b) The commissioner must offer the certification holder a choice of dates for an announced certification review. A certification review must occur during the clinic's normal working hours.\n(c) The commissioner must make the results of certification reviews and the results of investigations that result in a correction order publicly available on the department's website.\n(a) If the applicant or certification holder fails to comply with a law or rule, the commissioner may issue a correction order. The correction order must state:\n(1) the condition that constitutes a violation of the law or rule;\n(2) the specific law or rule that the applicant or certification holder has violated; and\n(3) the time that the applicant or certification holder is allowed to correct each violation.\n(b) If the applicant or certification holder believes that the commissioner's correction order is erroneous, the applicant or certification holder may ask the commissioner to reconsider the part of the correction order that is allegedly erroneous. An applicant or certification holder must make a request for reconsideration in writing. The request must be postmarked and sent to the commissioner or submitted in the provider licensing and reporting hub within 20 calendar days after the applicant or certification holder received the correction order; and the request must:\n(1) specify the part of the correction order that is allegedly erroneous;\n(2) explain why the specified part is erroneous; and\n(3) include documentation to support the allegation of error.\n(c) A request for reconsideration does not stay any provision or requirement of the correction order. The commissioner's disposition of a request for reconsideration is final and not subject to appeal.\n(d) If the commissioner finds that the applicant or certification holder failed to correct the violation specified in the correction order, the commissioner may decertify the certified mental health clinic according to subdivision 14.\n(e) Nothing in this subdivision prohibits the commissioner from decertifying a mental health clinic according to subdivision 14.\n(f) The commissioner may issue a correction order to the applicant or certification holder through the provider licensing and reporting hub. If the order is issued through the provider hub, the request must be received by the commissioner within 20 calendar days from the date the commissioner issued the order through the hub.\n(a) The commissioner may decertify a mental health clinic if a certification holder:\n(1) failed to comply with an applicable law or rule; or\n(2) knowingly withheld relevant information from or gave false or misleading information to the commissioner in connection with an application for certification, during an investigation, or regarding compliance with applicable laws or rules.\n(b) When considering decertification of a mental health clinic, the commissioner must consider the nature, chronicity, or severity of the violation of law or rule and the effect of the violation on the health, safety, or rights of clients.\n(c) If the commissioner decertifies a mental health clinic, the order of decertification must inform the certification holder of the right to have a contested case hearing under chapter 14 and Minnesota Rules, parts 1400.8505 to 1400.8612. The commissioner may issue the order through the provider licensing and reporting hub. The certification holder may appeal the decertification. The certification holder must appeal a decertification in writing and send or deliver the appeal to the commissioner by certified mail, by personal service, or through the provider licensing and reporting hub. If the certification holder mails the appeal, the appeal must be postmarked and sent to the commissioner within ten calendar days after the certification holder receives the order of decertification. If the certification holder delivers an appeal by personal service, the commissioner must receive the appeal within ten calendar days after the certification holder received the order. If the order is issued through the provider hub, the request must be received by the commissioner within 20 calendar days from the date the commissioner issued the order through the hub. If a certification holder submits a timely appeal of an order of decertification, the certification holder may continue to operate the program until the commissioner issues a final order on the decertification.\n(d) If the commissioner decertifies a mental health clinic pursuant to paragraph (a), clause (1), based on a determination that the mental health clinic was responsible for maltreatment, and if the certification holder appeals the decertification according to paragraph (c), and appeals the maltreatment determination under section 260E.33, the final decertification determination is stayed until the commissioner issues a final decision regarding the maltreatment appeal.\nA certification issued under this section is only valid for the premises and the individual, organization, or government entity identified by the commissioner on the certification. A certification is not transferable or assignable.\n(a) A certification holder must notify the commissioner, in a manner prescribed by the commissioner, and obtain the commissioner's approval before making any change to the name of the certification holder or the location of the mental health clinic. Upon implementation of the provider licensing and reporting hub, certification holders must enter and update information in the hub in a manner prescribed by the commissioner.\n(b) Changes in mental health clinic organization, staffing, treatment, or quality assurance procedures that affect the ability of the certification holder to comply with the minimum standards of this section must be reported in writing by the certification holder to the commissioner within 15 days of the occurrence. Review of the change must be conducted by the commissioner. A certification holder with changes resulting in noncompliance in minimum standards must receive written notice and may have up to 180 days to correct the areas of noncompliance before being decertified. Interim procedures to resolve the noncompliance on a temporary basis must be developed and submitted in writing to the commissioner for approval within 30 days of the commissioner's determination of the noncompliance. Not reporting an occurrence of a change that results in noncompliance within 15 days, failure to develop an approved interim procedure within 30 days of the determination of the noncompliance, or nonresolution of the noncompliance within 180 days will result in immediate decertification.\n(c) The mental health clinic may be required to submit written information to the department to document that the mental health clinic has maintained compliance with this section and mental health clinic procedures.",
	"repealed": false
}