{
	"id": "524.5-205",
	"url": "https://www.revisor.mn.gov/statutes/cite/524.5-205",
	"title": "524.5-205 JUDICIAL APPOINTMENT OF GUARDIAN: PROCEDURE.",
	"text": "(a) A person interested in the welfare of a minor may petition for appointment of a guardian.\n(b) After a petition is filed, the court shall set a date for hearing, and the petitioner shall give notice of the time and place for hearing the petition, together with a copy of the petition, to:\n(1) the minor, if the minor has attained 14 years of age and is not the petitioner;\n(2) any person alleged to have had the primary care and custody of the minor during the 60 days before the filing of the petition;\n(3) each living parent of the minor or, if there is none, the adult nearest in kinship that can be found;\n(4) any person nominated as guardian by the minor if the minor has attained 14 years of age;\n(5) any appointee of a parent whose appointment has not been prevented or terminated under section 524.5-203; and\n(6) any guardian or conservator currently acting for the minor in this state or elsewhere.\n(c) Any documents or information disclosing or pertaining to health or financial information shall be filed as confidential documents, consistent with the bill of particulars under section 524.5-121.\n(d) The court, upon hearing, shall make the appointment if it finds that a qualified person seeks appointment, venue is proper, the required notices have been given, the conditions of section 524.5-204, paragraph (a), have been met, and the best interest of the minor will be served by the appointment. In other cases, the court may dismiss the proceeding or make any other disposition of the matter that will serve the best interest of the minor.\n(e) If the court determines at any stage of the proceeding, before or after appointment, that the interests of the minor are or may be inadequately represented, it may appoint a lawyer to represent the minor, giving consideration to the choice of the minor if the minor has attained 14 years of age, provided that such appointment shall expire upon the expiration of the appeal time for the order appointing guardian or the order dismissing a petition or upon such other time or event as the court may direct.\n(f) Within 14 days after an appointment, a guardian shall send or deliver to the minor person subject to guardianship, and counsel if represented at the hearing, a copy of the order of appointment accompanied by a notice which advises the minor person subject to guardianship of the right to appeal the guardianship appointment in the time and manner provided by the Rules of Appellate Procedure.",
	"repealed": false
}