{
	"id": "193.29",
	"url": "https://www.revisor.mn.gov/statutes/cite/193.29",
	"title": "193.29 CONTROL OF NEW ARMORY.",
	"text": "The adjutant general may delegate authority for the control, operation, and use of each armory building and grounds occupied by any of the military forces of the state to an armory board consisting of officers, warrant officers, or enlisted personnel representing the organization or organizations quartered therein, as hereinafter provided, except that the commission-owned armories which have been or may be constructed or acquired and operated under the provisions of sections 193.139 to 193.149, and acts supplementary thereto shall be controlled and operated as provided therein.\nFor each armory occupied by a single company or other unit the armory board shall consist of senior officers, warrant officers, or enlisted personnel of the unit quartered therein.\nIn all cases in which more than one company or other unit of the military forces shall occupy the same armory, the armory board shall consist of military personnel assigned to the units or organizations quartered therein. The adjutant general shall designate by order from time to time the representatives of each unit quartered therein to comprise the armory board for each armory. In the discretion of the adjutant general, the membership of the board may be comprised of officers, warrant officers, and enlisted personnel and may be changed from time to time so as to give the several organizations quartered therein proper representation on the board.\nThe armory board may rent an armory to entities or individuals under terms and conditions as determined by the adjutant general, but rentals may not conflict with the use of the armory for military purposes. The proceeds of rentals and all other income accruing to each armory constitutes the armory fund and must be applied by the armory board of each armory, as the adjutant general shall direct, for its maintenance, extension, improvement, and equipment, but all armory funds and all allowances from the state accruing to commission-owned armories must be paid to the commission.",
	"repealed": false
}