{
	"id": "485.018",
	"url": "https://www.revisor.mn.gov/statutes/cite/485.018",
	"title": "485.018 WITHHOLDING SALARY; COLLECTION OF FEES.",
	"text": "[Repealed, 1999 c 60 s 3]\n[Repealed, 2006 c 260 art 5 s 54]\nUpon certification by the state court administrator that the court administrator of district court has failed to perform any of the duties assigned by law or by rule of court, the county board shall withhold the salary of the court administrator, and shall not pay the salary until receipt of notice from the state court administrator that the court administrator has performed the duties assigned by law or by rule of court.\nNothing in this subdivision shall be construed to prohibit the judges of the district court from removing a court administrator of district court from office.\n[Repealed, 1975 c 301 s 16]\n[Repealed, 1999 c 60 s 3]\nThe court administrator of district court shall charge and collect all fees as prescribed by law and all such fees collected by the court administrator as court administrator of district court shall be paid to the Department of Management and Budget. Except for those portions of forfeited bail paid to victims pursuant to existing law, the court administrator shall forward all revenue from fees and forfeited bail collected under chapters 357, 487, and 574 to the commissioner of management and budget for deposit in the state treasury and credit to the general fund, unless otherwise provided in chapter 611A or other law, in the manner and at the times prescribed by the commissioner of management and budget, but not less often than once each month. If the defendant or probationer is located after forfeited bail proceeds have been forwarded to the commissioner of management and budget, the commissioner of management and budget shall reimburse the county, on request, for actual costs expended for extradition, transportation, or other costs necessary to return the defendant or probationer to the jurisdiction where the bail was posted, in an amount not more than the amount of forfeited bail. The court administrator of district court shall not retain any additional compensation, per diem or other emolument for services as court administrator of district court, but may receive and retain mileage and expense allowances as prescribed by law.\n[Repealed, 2006 c 260 art 5 s 54]\n[Repealed, 1990 c 571 s 49]\n[Repealed, 2006 c 260 art 5 s 54]",
	"repealed": false
}