{
	"id": "244.198",
	"url": "https://www.revisor.mn.gov/statutes/cite/244.198",
	"title": "244.198 PARTICIPATING IN SANCTIONS CONFERENCE.",
	"text": "If an individual on probation elects to participate in the sanctions conference, the individual's probation officer must inform the individual:\n(1) orally, in writing, and in a language and manner that the individual can understand of the probation violation sanction that the probation officer is recommending for the technical violation; and\n(2) that the probation violation sanction becomes effective when confirmed by a district court judge.\n(a) At a sanctions conference for a nonviolent controlled substance offender, a probation agency must identify community options to address and correct an offender's technical violation only if:\n(1) the offender does not present a risk to the public; and\n(2) the offender is amenable to continued supervision in the community.\n(b) If the probation agency determines that community options are appropriate and available in the state, the probation officer must recommend a probation violation sanction that incorporates the community options.\n(c) For purposes of this subdivision, \"nonviolent controlled substance offender\" means an individual who meets the criteria under section 244.0513, subdivision 2, clauses (1), (2), and (5).\n(a) If an individual on probation elects to participate in the sanctions conference, the probation officer conducting the sanctions conference must provide a report to the district court containing:\n(1) the specific nature of the technical violation;\n(2) the notice provided to the individual under section 244.197, subdivision 2;\n(3) a copy of the individual's signed stipulation and declaration under section 244.197, subdivision 3; and\n(4) the recommended probation violation sanction under subdivision 1 or 1a.\n(b) The recommended probation violation sanction is effective when confirmed by a judge, and the order of the court is proof of confirmation.\n(a) If a probation officer receives a judge's confirmed order, the officer must notify both the individual on probation and the prosecuting authority in writing that the court has approved the probation violation sanction.\n(b) If the court does not confirm the officer's recommendation:\n(1) the probation violation sanction does not go into effect;\n(2) the probation officer must notify the individual on probation that the court has not confirmed the sanction; and\n(3) the probation officer may ask the court to initiate revocation proceedings under section 609.14.\nAn individual on probation may appeal the judge's confirmation of the probation violation sanction as provided in rule 28.05 of the Rules of Criminal Procedure.",
	"repealed": false
}