{
	"id": "347.38",
	"url": "https://www.revisor.mn.gov/statutes/cite/347.38",
	"title": "347.38 REVOCATION OF LICENSE.",
	"text": "The Board of Animal Health may as hereinafter set forth revoke or suspend the license of any person, firm, or corporation, for violation of sections 346.55 and 347.31 to 347.40 or the rules issued pursuant to sections 347.31 to 347.40.\nUpon written complaint made to the board by any person, firm, or corporation alleging any violation of sections 347.31 to 347.40 or any rules pursuant thereto by any licensee, the board may cause an investigation to be made upon matters related in said complaint.\nThereupon the board shall in its discretion either dismiss the complaint or require the kennel or dealer against whom the complaint is made to correct the conditions or violations complained of within ten days after receipt of written notice of the same. If upon termination of the ten-day period the licensee has failed to correct or to remedy the violation or violations of sections 346.55 or 347.31 to 347.40 or any rules pursuant thereto, or if the board considers it appropriate under the circumstances the board shall, upon a minimum of 30 days' notice to the licensee, conduct a hearing for the purpose of determining whether the license to operate a kennel or as a dealer should be revoked or temporarily suspended. If after notice and hearing the board finds that any provision of sections 346.55 or 347.31 to 347.40 has been violated by the licensee or any rule issued by the board has been violated by the licensee, the board may revoke and suspend the license. The possession or transfer of a dog or cat by a dealer to an institution, without the permission of the owner, failure of a dealer or kennel to keep accurate data as required in section 347.35, or failure of a dealer or kennel to permit access to its premises as required in section 347.37, is grounds for license revocation. The licensee whose license is revoked or suspended may within 20 days after the board's decision appeal to the district court. The district court shall upon 20 days' notice to the board hear the appeal within 45 days after the filing of the appeal. On the hearing of the appeal the court shall review the decision of the board in a manner as though reviewed by certiorari, except that new or additional evidence may be taken, if in the opinion of the court additional evidence is necessary or proper to the disposition of the case.",
	"repealed": false
}