{
	"id": "302A.626",
	"url": "https://www.revisor.mn.gov/statutes/cite/302A.626",
	"title": "302A.626 MERGER TO EFFECT A HOLDING COMPANY REORGANIZATION.",
	"text": "(a) For purposes of this section, the terms defined in this subdivision have the meanings given them.\n(b) \"Holding company\" means the corporation that is or becomes the direct parent of the surviving corporation of a merger accomplished under this section.\n(c) \"Parent constituent corporation\" means the parent corporation that merges with or into the subsidiary constituent corporation.\n(d) \"Subsidiary constituent corporation\" means the subsidiary corporation that the parent constituent corporation merges with or into in the merger.\nUnless its articles expressly provide otherwise, and subject to subdivision 3, a parent constituent corporation may merge with or into a subsidiary constituent corporation without a vote of the shareholders of the parent constituent corporation.\nA merger may be accomplished under this section only if each of the following requirements is met:\n(1) the holding company and the constituent corporations to the merger are each organized under this chapter;\n(2) at all times following the issuance of shares until the consummation of a merger under this section, the holding company was a direct wholly owned subsidiary of the parent constituent corporation;\n(3) immediately before the consummation of a merger under this section, the subsidiary constituent corporation is an indirect wholly owned subsidiary of the parent constituent corporation and a direct wholly owned subsidiary of the holding company;\n(4) the parent constituent corporation and the subsidiary constituent corporation are the only constituent corporations to the merger;\n(5) immediately after the merger becomes effective, the surviving corporation becomes or remains a direct wholly owned subsidiary of the holding company;\n(6) each share or fraction of a share of the parent constituent corporation outstanding immediately before the effective time of the merger is converted in the merger into a share or equal fraction of a share of the holding company having the same designation and relative rights and preferences, and the same restrictions thereon, as the share or fraction of a share of the parent constituent corporation being converted in the merger;\n(7) the articles and bylaws of the holding company immediately following the effective time of the merger contain provisions identical to the articles and bylaws of the parent constituent corporation immediately before the effective time of the merger, other than provisions, if any, regarding the incorporator or incorporators, the corporate name, the registered office and agent, the initial board of directors, and the initial subscribers for shares and the provisions contained in any amendment to the articles of the parent constituent corporation that were necessary to effect an exchange, reclassification, or cancellation of shares, if the exchange, reclassification, or cancellation has become effective;\n(8) the articles and bylaws of the surviving corporation immediately following the effective time of the merger are identical to the articles and bylaws of the parent constituent corporation immediately before the effective time of the merger, other than provisions, if any, regarding the incorporator or incorporators, the corporate name, the registered office and agent, the initial board of directors, and the initial subscribers for shares and the provisions contained in any amendment to the articles of the parent constituent corporation that were necessary to effect an exchange, reclassification, or cancellation of shares, if the exchange, reclassification, or cancellation has become effective, except that:\n(i) the articles of the surviving corporation shall be amended in the merger to contain a provision requiring that any act or transaction by or involving the surviving corporation, other than the election or removal of directors of the surviving corporation, that requires for its adoption under this chapter or its articles the approval of the shareholders of the surviving corporation shall, by specific reference to this section, require, in addition, the approval of the shareholders of the holding company, or any successor by merger, by the same vote as is required by this chapter and/or by the articles of the surviving corporation; and\n(ii) the articles of the surviving corporation may be amended in the merger to reduce the number of classes, series, and shares that the surviving corporation is authorized to issue;\n(9) the directors of the parent constituent corporation become or remain the directors of the holding company immediately after the merger becomes effective;\n(10) the board of directors of the parent constituent corporation determines that the shareholders of the parent constituent corporation will not recognize gain or loss for United States federal income tax purposes; and\n(11) a resolution approved by the affirmative vote of a majority of the directors of the parent constituent corporation present adopts a plan of merger that contains provisions addressing the requirements of clauses (1) to (10).\nNeither subdivision 3, clause (8), item (i), nor any provisions of the surviving corporation's articles required by that item may be construed to require approval of the shareholders of the holding company to elect or remove directors of the surviving corporation.\nTo the extent restrictions under section 302A.671 or 302A.673 applied to the parent constituent corporation or any of its shareholders at the effective time of the merger, those restrictions apply to the holding company and its shareholders immediately after the merger becomes effective as though the holding company were the parent constituent corporation. No shareholder who, immediately before the merger becomes effective, was not an acquiring person or an interested shareholder of the parent constituent corporation shall, solely by reason of the merger, become an acquiring person or interested shareholder of the holding company.\nIf the name of the holding company at the time the merger takes effect is the same as the name of the parent constituent corporation immediately before that time, the shares of the holding company into which the shares of the parent constituent corporation are converted in the merger must, unless new certificates are issued, be represented by the share certificates that previously represented shares of the parent constituent corporation.\n(a) Articles of merger must be prepared that contain:\n(1) the plan of merger; and\n(2) a statement that the plan of merger was adopted under this section.\n(b) The articles of merger must be signed on behalf of the parent constituent corporation and filed with the secretary of state.\nThe secretary of state shall issue a certificate of merger to the surviving corporation or its legal representative.\nA merger between a parent and a subsidiary may be accomplished under sections 302A.611, 302A.613, and 302A.615, or section 302A.621 instead of this section, in which case this section does not apply.",
	"repealed": false
}