{
	"id": "151.191",
	"url": "https://www.revisor.mn.gov/statutes/cite/151.191",
	"title": "151.191 LICENSING MEDICAL GAS FACILITIES; FEES; PROHIBITIONS.",
	"text": "(a) No person shall act as a medical gas manufacturer without first obtaining a license from the board and paying any applicable fee specified in section 151.065.\n(b) Application for a medical gas manufacturer license under this section must be made in a manner specified by the board.\n(c) A license must not be issued or renewed for a medical gas manufacturer unless the applicant agrees to operate in a manner prescribed by federal and state law and according to Minnesota Rules.\n(d) A license must not be issued or renewed for a medical gas manufacturer that is required to be licensed or registered by the state in which it is physically located unless the applicant supplies the board with proof of licensure or registration. The board may establish standards for the licensure of a medical gas manufacturer that is not required to be licensed or registered by the state in which it is physically located.\n(e) The board must require a separate license for each facility located within the state at which medical gas manufacturing occurs and for each facility located outside of the state at which medical gases that are shipped into the state are manufactured.\n(f) Prior to the issuance of an initial or renewed license for a medical gas manufacturing facility, the board may require the facility to pass an inspection conducted by an authorized representative of the board. In the case of a medical gas manufacturing facility located outside of the state, the board may require the applicant to pay the cost of the inspection, in addition to the license fee in section 151.065, unless the applicant furnishes the board with a report, issued by the appropriate regulatory agency of the state in which the facility is located, of an inspection that has occurred within the 24 months immediately preceding receipt of the license application by the board. The board may deny licensure unless the applicant submits documentation satisfactory to the board that any deficiencies noted in an inspection report have been corrected.\n(g) A duly licensed medical gas manufacturing facility may also wholesale or dispense any medical gas that is manufactured by the licensed facility, or manufactured or wholesaled by another properly licensed medical gas facility, without also obtaining a medical gas wholesaler license or medical gas dispenser registration.\n(h) The filling of a medical gas into a final use container, at the point of use and by liquid to liquid transfer, is permitted as long as the facility used as the base of operations is duly licensed as a medical gas manufacturer.\n(a) No person shall act as a medical gas wholesaler without first obtaining a license from the board and paying any applicable fee specified in section 151.065.\n(b) Application for a medical gas wholesaler license under this section must be made in a manner specified by the board.\n(c) A license must not be issued or renewed for a medical gas wholesaler unless the applicant agrees to operate in a manner prescribed by federal and state law and according to Minnesota Rules.\n(d) A license must not be issued or renewed for a medical gas wholesaler that is required to be licensed or registered by the state in which it is physically located unless the applicant supplies the board with proof of licensure or registration. The board may establish standards for the licensure of a medical gas wholesaler that is not required to be licensed or registered by the state in which it is physically located.\n(e) The board must require a separate license for each facility located within the state at which medical gas wholesaling occurs and for each facility located outside of the state from which medical gases that are shipped into the state are wholesaled.\n(f) Prior to the issuance of an initial or renewed license for a medical gas wholesaling facility, the board may require the facility to pass an inspection conducted by an authorized representative of the board. In the case of a medical gas wholesaling facility located outside of the state, the board may require the applicant to pay the cost of the inspection, in addition to the license fee in section 151.065, unless the applicant furnishes the board with a report, issued by the appropriate regulatory agency of the state in which the facility is located, of an inspection that has occurred within the 24 months immediately preceding receipt of the license application by the board. The board may deny licensure unless the applicant submits documentation satisfactory to the board that any deficiencies noted in an inspection report have been corrected.\n(g) A duly licensed medical gas wholesaling facility may also dispense any medical gas that is manufactured or wholesaled by another properly licensed medical gas facility.\n(a) A person or establishment not licensed as a pharmacy, practitioner, medical gas manufacturer, or medical gas dispenser must not engage in the dispensing of medical gases without first obtaining a registration from the board and paying the applicable fee specified in section 151.065. The registration must be displayed in a conspicuous place in the business for which it is issued and expires on the date set by the board.\n(b) Application for a medical gas dispenser registration under this section must be made in a manner specified by the board.\n(c) A registration must not be issued or renewed for a medical gas dispenser located within the state unless the applicant agrees to operate in a manner prescribed by federal and state law and according to the rules adopted by the board. A license must not be issued for a medical gas dispenser located outside of the state unless the applicant agrees to operate in a manner prescribed by federal law and, when dispensing medical gases for residents of this state, the laws of this state and Minnesota Rules.\n(d) A registration must not be issued or renewed for a medical gas dispenser that is required to be licensed or registered by the state in which it is physically located unless the applicant supplies the board with proof of the licensure or registration. The board may establish standards for the registration of a medical gas dispenser that is not required to be licensed or registered by the state in which it is physically located.\n(e) The board must require a separate registration for each medical gas dispenser located within the state and for each facility located outside of the state from which medical gases are dispensed to residents of this state.\n(f) Prior to the issuance of an initial or renewed registration for a medical gas dispenser, the board may require the medical gas dispenser to pass an inspection conducted by an authorized representative of the board. In the case of a medical gas dispenser located outside of the state, the board may require the applicant to pay the cost of the inspection, in addition to the license fee in section 151.065, unless the applicant furnishes the board with a report, issued by the appropriate regulatory agency of the state in which the facility is located, of an inspection that has occurred within the 24 months immediately preceding receipt of the license application by the board. The board may deny licensure unless the applicant submits documentation satisfactory to the board that any deficiencies noted in an inspection report have been corrected.\n(g) A facility holding a medical gas dispenser registration must not engage in the manufacturing or wholesaling of medical gases, except that a medical gas dispenser may transfer medical gases from one of its duly registered facilities to other duly registered medical gas manufacturing, wholesaling, or dispensing facilities owned or operated by that same company, without requiring a medical gas wholesaler license.",
	"repealed": false
}