{
	"id": "504B.113",
	"url": "https://www.revisor.mn.gov/statutes/cite/504B.113",
	"title": "504B.113 SERVICE AND SUPPORT ANIMAL DOCUMENTATION.",
	"text": "(a) For purposes of this section, the following terms have the meanings given.\n(b) \"Service animal\" has the meaning given in Code of Federal Regulations, title 28, section 36.104, as amended.\n(c) \"Support animal\" means an animal that: (1) provides emotional support that alleviates one or more identified symptoms or effects of a person's disability; and (2) does not need to be trained to perform a specific disability-related task.\n(d) \"Tenant\" means a current tenant or a prospective tenant.\n(e) \"Licensed professional\" means a provider of care who is:\n(1) a person licensed by the Board of Medical Practice under chapter 147;\n(2) a physician assistant licensed under chapter 147A;\n(3) a nurse, as defined in section 148.171, subdivision 9, licensed under chapter 148;\n(4) a psychologist licensed under chapter 148;\n(5) a mental health professional licensed under chapter 148B;\n(6) a social worker licensed under chapter 148E;\n(7) a counselor licensed under chapter 148F; or\n(8) any professional listed in clauses (1) to (7) who holds a valid license in any other state, provided the professional has an existing treatment relationship with the tenant requesting a reasonable accommodation.\nA licensed professional does not include any person who operates primarily to provide certification for a service or support animal.\n(f) \"Reasonable accommodation\" means the granting of a waiver by a landlord of a no-pets or pet-fee policy for a person with a disability consistent with the Fair Housing Act, United States Code, title 42, sections 3601 to 3619, as amended, and section 504 of the Rehabilitation Act of 1973, United States Code, title 29, section 701, as amended.\n(g) \"Disability\" has the meaning given in section 363A.03, subdivision 12.\n(a) A landlord may require a tenant to provide supporting documentation for each service or support animal for which the tenant requests a reasonable accommodation under any provision of law. A landlord must not require supporting documentation from a tenant if the tenant's disability or disability-related need for a service or support animal is readily apparent or already known to the landlord.\n(b) Upon a landlord's request, the tenant must provide supporting documentation from a licensed professional confirming the tenant's disability and the relationship between the tenant's disability and the need for a service or support animal. A landlord must not require the tenant to disclose or provide access to medical records or medical providers or provide any other information or documentation of a person's physical or mental disability.\n(a) A landlord must not require a tenant with a reasonable accommodation under this section to pay an additional fee, charge, or deposit for the service or support animal. A tenant is liable to the landlord for any damage to the premises caused by the service or support animal.\n(b) If a landlord requires an additional fee, charge, or deposit pursuant to a pet policy, the landlord must disclose in the lease the prohibition on additional fees, charges, or deposits for service or support animals under this section.\n(c) A tenant may bring an action to recover any fees, charges, or deposits paid to a landlord pursuant to a pet policy if:\n(1) the landlord fails to provide the disclosure required in paragraph (b); and\n(2) the tenant demonstrates that the tenant would have requested a reasonable accommodation and would likely have received a reasonable accommodation had the landlord provided the disclosure under paragraph (b).\nA tenant must not, directly or indirectly through statements or conduct, knowingly:\n(1) misrepresent themselves as a person with a disability that requires the use of a service or support animal; or\n(2) provide fraudulent supporting documentation under this section.\nIf a tenant violates this section, the landlord may deny the tenant's rental application or request for a service or support animal. Nothing in this section shall be construed to prohibit an eviction action based on a breach of the lease.",
	"repealed": false
}