{
	"id": "244.33",
	"url": "https://www.revisor.mn.gov/statutes/cite/244.33",
	"title": "244.33 COMMUNITY SUPERVISION; TARGETED INNOVATION GRANTS.",
	"text": "(a) The community supervision targeted innovation grant account is established in the special revenue fund in the state treasury. Appropriations and transfers to the account are credited to the account. Earnings, such as interest, dividends, and any other earnings arising from assets of the account, are credited to the account. Money remaining in the account at the end of the fiscal year is not canceled to the general fund but remains in the account until expended. Money in the account is annually appropriated to the commissioner.\n(b) The commissioner must award grants to applicants that operate, or intend to operate, innovative programs that target specific aspects of community supervision that align with risk, need, and responsivity principles. When awarding grants, the commissioner must seek to ensure geographical and equitable representation across the state. The programs may include but are not limited to:\n(1) access to community treatment options to address and correct behavior that is, or is likely to result in, a technical violation of the conditions of supervision or release;\n(2) reentry services;\n(3) restorative justice;\n(4) juvenile diversion;\n(5) family-centered approaches to supervision;\n(6) funding the cost to implement programming and support services that decrease an individual's level of risk for continued recidivism or revocation based on interventions found effective through research-guided practices; and\n(7) alternatives to incarceration programs.\n(c) Grant recipients must provide an annual report to the commissioner that includes:\n(1) the services provided by the grant recipient;\n(2) the number of individuals served in the previous year and their supervision and risk assessment levels;\n(3) measurable outcomes of the recipient's program; and\n(4) any other information required by the commissioner.\n(d) By January 15, 2025, and each year thereafter, the commissioner must report to the chairs and ranking minority members of the legislative committees with jurisdiction over criminal justice policy and finance on how the grant funding in this section was used. The report must detail the impact that the funding had on improving community supervision practices and outcomes.\n(e) For any appropriation under this section, the commissioner may use up to five percent of the appropriation to administer the grants.",
	"repealed": false
}