{
	"id": "299D.03",
	"url": "https://www.revisor.mn.gov/statutes/cite/299D.03",
	"title": "299D.03 STATE PATROL.",
	"text": "(a) The commissioner is hereby authorized to employ and designate a chief supervisor, a chief assistant supervisor, and such assistant supervisors, sergeants and officers as are provided by law, who shall comprise the Minnesota State Patrol.\n(b) The members of the Minnesota State Patrol shall have the power and authority:\n(1) as peace officers to enforce the provisions of the law relating to the protection of and use of trunk highways;\n(2) at all times to direct all traffic on trunk highways in conformance with law, and in the event of a fire or other emergency, or to expedite traffic or to insure safety, to direct traffic on other roads as conditions may require notwithstanding the provisions of law;\n(3) to serve search warrants related to criminal motor vehicle and traffic violations and arrest warrants, and legal documents anywhere in the state;\n(4) to serve orders of the commissioner of public safety or the commissioner's duly authorized agents issued under the provisions of the Driver's License Law, the Safety Responsibility Act, or relating to authorized brake- and light-testing stations, anywhere in the state and to take possession of any license, permit, or certificate ordered to be surrendered;\n(5) to inspect official brake and light adjusting stations;\n(6) to make appearances anywhere within the state for the purpose of conducting traffic safety educational programs and school bus clinics;\n(7) to exercise upon all trunk highways the same powers with respect to the enforcement of laws relating to crimes, as sheriffs and police officers;\n(8) to cooperate, under instructions and rules of the commissioner of public safety, with all sheriffs and other police officers anywhere in the state, provided that said employees shall have no power or authority in connection with strikes or industrial disputes;\n(9) to assist and aid any peace officer whose life or safety is in jeopardy;\n(10) as peace officers to provide security and protection to the governor, governor elect, either or both houses of the legislature, and state buildings or property in the manner and to the extent determined to be necessary after consultation with the governor, or a designee. Pursuant to this clause, members of the State Patrol, acting as peace officers have the same powers with respect to the enforcement of laws relating to crimes, as sheriffs and police officers have within their respective jurisdictions;\n(11) to inspect school buses anywhere in the state for the purposes of determining compliance with vehicle equipment, pollution control, and registration requirements;\n(12) as peace officers to make arrests for public offenses committed in their presence anywhere within the state. Persons arrested for violations other than traffic violations shall be referred forthwith to the appropriate local law enforcement agency for further investigation or disposition; and\n(13) to enforce the North American uniform out-of-service criteria and issue out-of-service orders, as defined in Code of Federal Regulations, title 49, section 383.5.\n(c) After consultation with the governor or a designee, the commissioner may require the State Patrol to provide security and protection to supreme court justices, legislators, and constitutional officers other than the governor, for a limited period and within the limits of existing resources, in response to a credible threat on the individual's life or safety.\n(d) The state may contract for State Patrol members to render the services described in this section in excess of their regularly scheduled duty hours and patrol members rendering such services shall be compensated in such amounts, manner and under such conditions as the agreement provides.\n(e) Employees thus employed and designated shall subscribe an oath.\nFor the purposes of this section, the term \"commissioner\" means the commissioner of public safety.\n(a) Each employee other than the chief supervisor, lieutenant colonel, majors, captains, corporals, and sergeants hereinafter designated shall be known as patrol troopers.\n(b) There may be appointed one lieutenant colonel; and such majors, captains, corporals, sergeants, and troopers as the commissioner deems necessary to carry out the duties and functions of the State Patrol. Persons in above-named positions shall be appointed by law and have such duties as the commissioner may direct and, except for troopers, shall be selected from the patrol troopers, corporals, sergeants, captains, and majors who shall have had at least five years' experience as either patrol troopers, corporals, sergeants, or supervisors.\n(c) The salary rates for all State Patrol troopers, corporals, and sergeants shall be deemed to include $6 per day reimbursement for shift differential, meal and business expenses incurred by State Patrol troopers, corporals, and sergeants in the performance of their assigned duties in their patrol areas; business expenses include, but are not limited to: uniform costs, home garaging of squad cars, and maintenance of home office.\n(a) By January 1 of 2021, 2024, 2027, and 2030, the legislative auditor must conduct a compensation and benefit survey of law enforcement officers in every police department:\n(1) in a city with a population in excess of 25,000, located in a metropolitan county, as defined in section 473.121, subdivision 4, that is represented by a union certified by the Bureau of Mediation Services; or\n(2) in a city of the first class.\nThe State Patrol must also be included in the survey.\n(b) The legislative auditor must base the survey on compensation and benefits for the past completed calendar year. The survey must be based on full-time equivalent employees. The legislative auditor must calculate compensation using base salary, overtime wages, and premium pay. Premium pay is payment that is received by a majority of employees and includes but is not limited to education pay and longevity pay. The legislative auditor must not include any payments made to officers or troopers for work performed for an entity other than the agency that employs the officer or trooper, regardless of who makes the payment. The legislative auditor must also include in the survey all benefits, including insurance, retirement, and pension benefits. The legislative auditor must include contributions from both the employee and employer when determining benefits.\n(c) The legislative auditor must compile the survey results into a report. The report must show each department separately. For each department, the survey must include:\n(1) an explanation of the salary structure, and include minimum and maximum salaries for each range or step; and\n(2) an explanation of benefits offered, including the options that are offered and the employee and employer contribution for each option.\nWherever possible, the report must be designed so that the data for each department is in the same table or grid format to facilitate easy comparison.\n(d) By January 15 of 2021, 2024, 2027, and 2030, the legislative auditor must transmit the survey report to the chairs and ranking minority members of the house of representatives and senate committees with jurisdiction over the State Patrol budget.\n(e) It is the legislature's intent to use the information in this study to compare salaries between the identified police departments and the State Patrol and to make appropriate increases to patrol trooper salaries. For purposes of this paragraph, \"patrol troopers\" has the meaning given in subdivision 2, paragraph (a).\n[Repealed, 1982 c 568 s 13]\n[Repealed, 1977 c 452 s 36]\n[Repealed, 1977 c 455 s 95]\n(a) All fines and forfeited bail money collected from persons apprehended or arrested by officers of the State Patrol shall be transmitted by the person or officer collecting the fines, forfeited bail money, or installments thereof, on or before the tenth day after the last day of the month in which these moneys were collected, to the commissioner of management and budget. Except where a different disposition is required in this subdivision or section 387.213, or otherwise provided by law, three-eighths of these receipts must be deposited in the state treasury and credited to the state general fund. The other five-eighths of these receipts must be deposited in the state treasury and credited as follows: (1) the first $1,000,000 in each fiscal year must be credited to the Minnesota grade crossing safety account in the special revenue fund, and (2) remaining receipts must be credited to the state trunk highway fund. If, however, the violation occurs within a municipality and the city attorney prosecutes the offense, and a plea of not guilty is entered, one-third of the receipts shall be deposited in the state treasury and credited to the state general fund, one-third of the receipts shall be paid to the municipality prosecuting the offense, and one-third shall be deposited in the state treasury and credited to the Minnesota grade crossing safety account or the state trunk highway fund as provided in this paragraph. When section 387.213 also is applicable to the fine, section 387.213 shall be applied before this paragraph is applied. All costs of participation in a nationwide police communication system chargeable to the state of Minnesota shall be paid from appropriations for that purpose.\n(b) All fines and forfeited bail money from violations of statutes governing the maximum weight of motor vehicles, collected from persons apprehended or arrested by employees of the state of Minnesota, by means of stationary or portable scales operated by these employees, shall be transmitted by the person or officer collecting the fines or forfeited bail money, on or before the tenth day after the last day of the month in which the collections were made, to the commissioner of management and budget. Five-eighths of these receipts shall be deposited in the state treasury and credited to the state highway user tax distribution fund. Three-eighths of these receipts shall be deposited in the state treasury and credited to the state general fund.\nThe commissioner of public safety may provide training programs for the purpose of obtaining qualified personnel for the State Patrol. Persons accepted by the commissioner of public safety for training under this training program shall be designated State Patrol trainees and shall receive a salary no less than 70 percent of the basic salary for patrol officers as prescribed in subdivision 2, during the period of the training. Nothing contained in this subdivision shall be construed to prevent the commissioner of public safety from providing in-service training programs for State Patrol officers. The commissioner of transportation shall furnish the commissioner of public safety with lands and buildings necessary in providing in-service training programs and the Department of Public Safety shall reimburse the Department of Transportation for all reasonable costs incurred due to the provision of these training facilities.\nEvery person employed and designated as a state trooper under and pursuant to the provisions of this section, after 12 months of continuous employment, shall continue in service and hold the position without demotion, until suspended, demoted, or discharged in the manner hereinafter provided for one or more of the causes specified herein.\nA trooper who has completed six months of continuous employment shall not be suspended, demoted or discharged except for just cause. For purposes of this section, just cause includes, but is not limited to:\n(1) conviction of any criminal offense in any court of competent jurisdiction subsequent to the commencement of such employment;\n(2) neglect of duty or willful violation or disobedience of orders or rules;\n(3) inefficiency in performing duties;\n(4) immoral conduct or conduct injurious to the public welfare, or conduct unbecoming an officer; or\n(5) incapacity or partial incapacity affecting the trooper's normal ability to perform official duties.\n(a) Charges against any state trooper shall be made in writing and signed and sworn to by the person making the same, which written charges shall be filed with the commissioner. Upon the filing of same, if the commissioner shall be of the opinion that such charges constitute a ground for suspension, demotion, or discharge, a hearing shall be held on them. The hearing shall be conducted by an arbitrator selected by the parties from a list of five arbitrators provided by the Bureau of Mediation Services. At least 30 days before the time appointed for the hearing, written notice specifying the charges filed and stating the name of the person making the charges, shall be served on the employee personally or by leaving a copy thereof at the employee's usual place of abode with some person of suitable age and discretion then residing therein. If the commissioner orders a hearing the commissioner may suspend such employee before the hearing.\n(b) Members of the State Patrol shall have the option of utilizing either the contractual grievance procedure or the legal remedies of this section, but in no event both.\n(c) The commissioner, after having been informed by the exclusive representative that the employee against whom charges have been filed desires to utilize the grievance procedure of the labor agreement, may immediately suspend, demote, or discharge the employee without the hearing required by paragraph (a).\nThe arbitrator may compel the attendance of witnesses at the hearing and examine them under oath, and may require the production of books, papers, and other evidence at the hearing, and for that purpose may issue subpoenas and cause them to be served and executed in any part of the state. The employee accused is entitled to be confronted with the witnesses against the employee and may cross-examine them and may introduce at the hearing testimony in the employee's own behalf, and to be represented by counsel at the hearing.\nAny state trooper who is so suspended, demoted, or dismissed may have the decision or determination of the arbitrator reviewed pursuant to the Uniform Arbitrator Act in the district court of the county where the trooper resides. If the decision or determination of the arbitrator is finally rejected or modified by the court, the trooper shall be reinstated in the position, and the commissioner shall pay to the trooper so suspended out of the funds of the state the salary or wages withheld pending the determination of the charges or as may be directed by the court.\nSubdivisions 5 to 12 shall apply to all persons employed and designated under and pursuant to this section, except the chief supervisor and chief assistant supervisor of the State Patrol. If the chief supervisor or the chief assistant supervisor is removed for other than cause as defined herein the chief or assistant supervisor shall be reinstated to the position held in the patrol prior to being promoted to the position of chief supervisor or chief assistant supervisor.\nUpon the effective date of Laws 1969, chapter 1129, the individual occupying the position of chief assistant supervisor of the State Patrol shall retain such position for a period of at least 12 months, or until removed for cause.",
	"repealed": false
}