{
	"id": "82B.073",
	"url": "https://www.revisor.mn.gov/statutes/cite/82B.073",
	"title": "82B.073 REAL ESTATE APPRAISAL ADVISORY BOARD.",
	"text": "(a) The Real Estate Appraisal Advisory Board is created and composed of seven persons appointed by the commissioner. Members are appointed to the board subject to the following conditions:\n(1) members must currently be, and have been for the past five years, residents of this state;\n(2) the membership of the board must reasonably reflect the geographic distribution of the population of this state;\n(3) one member must be currently licensed as, and have been actively engaged and in good standing for the past five years as, a certified general real property appraiser;\n(4) two members must be currently licensed as, and have been actively engaged and in good standing for the past five years as, a certified residential real property appraiser;\n(5) one member must be currently licensed as, and have been actively engaged and in good standing for the past five years as, a real estate appraiser and as a real estate broker or salesperson under chapter 82;\n(6) one member must represent appraisal management companies, as defined in section 82C.02, subdivision 4, as evidenced by the member's employment with an appraisal management company;\n(7) one member must represent the interests of the general public and have knowledge of the real estate business; and\n(8) the commissioner must be a member.\n(b) In making appointments under paragraph (a), clauses (3) and (4), the commissioner must consider recommendations by members and the Minnesota chapters of any nationally recognized real estate appraisal organization.\n(c) In making the appointment under paragraph (a), clause (5), the commissioner must consider recommendations by members and organizations representing the real estate industry.\n(d) In making the appointment under paragraph (a), clause (6), the commissioner must consider recommendations by members and appraisal management companies.\nThe terms, compensation, and removal of members, other than the commissioner, are governed by section 15.059. Members are limited to serving two full terms on the board.\nMembers of the board must be compensated in accordance with section 15.059.\nA majority of the board members constitutes a quorum. If there is a vacancy in the membership of the board, a majority of the remaining members of the board constitute a quorum.\nThe board shall meet at least quarterly and may be convened, upon ten days' written notice, by the chair or by three members of the board.\nMeetings of the board shall comply with chapter 13D.\nThe board shall, annually at the first meeting of the calendar year, elect a chair from its members. The chair shall preside over the meetings and shall coordinate with the commissioner in developing and distributing an agenda for each meeting.\nThe commissioner shall provide a quarterly report to the board that includes a summarized list of:\n(1) appraisal courses and seminars that were not approved for continuing education credit and the reason for the denial; and\n(2) public disciplinary actions taken by the commissioner against a real estate appraiser.\nThe board shall advise, provide input, and suggest best practices to the commissioner regarding real estate appraisers, including, but not limited to, licensing, public disciplinary matters, continuing education, and industry-related trends.\nThe board expires January 1, 2030.",
	"repealed": false
}