{
	"id": "471.617",
	"url": "https://www.revisor.mn.gov/statutes/cite/471.617",
	"title": "471.617 SELF-INSURANCE OF EMPLOYEE HEALTH BENEFITS.",
	"text": "A statutory or home rule charter city, county, school district, or instrumentality thereof which has more than 100 employees, may by ordinance or resolution self-insure for any employee health benefits including long-term disability, but not for employee life benefits. Any self-insurance plan shall provide all benefits which are required by law to be provided by group health insurance policies. Self-insurance plans must be certified as provided by section 62E.05 and must be filed and certified by the Department of Commerce before they are issued or delivered to any person in this state.\nAny two or more statutory or home rule charter cities, counties, school districts, or instrumentalities thereof which together have more than 100 employees may jointly self-insure for any employee health benefits including long-term disability, but not for employee life benefits, subject to the same requirements as an individual self-insurer under subdivision 1. Self-insurance pools under this section are subject to section 62L.045. A self-insurance pool established and operated by one or more service cooperatives governed by section 123A.21 to provide coverage described in this subdivision qualifies under this subdivision, but the individual school district members of such a pool shall not be considered to be self-insured for purposes of section 471.6161, subdivision 8, paragraph (g). The commissioner of commerce may adopt rules pursuant to chapter 14, providing standards or guidelines for the operation and administration of self-insurance pools.\nAny self-insurance plan covering fewer than 1,000 employees shall include excess or stop-loss coverage provided by a licensed insurance company, an insurance company approved pursuant to sections 60A.195 to 60A.209, or service plan corporation, but excess or stop-loss coverage need not be obtained for long-term disability.\nThis excess or stop-loss coverage shall cover all eligible claims incurred during the term of the policy or contract. In addition to excess or stop-loss coverage, the self-insurance plan shall provide for reserving of an appropriate amount of funds to cover the estimated cost of claims incurred, but unpaid, during the term of the policy or contract which shall be added to the expected claim level. These funds shall be in addition to funds reserved to cover the claims paid during the term of the policy or contract. The excess or stop-loss coverage shall be provided at levels in excess of self-insured retention which is appropriate, taking into account the number of covered persons in the group.\n(a) No statutory or home rule charter city or county or school district or instrumentality of any of them shall adopt a self insured health benefit plan for any employees represented by an exclusive representative certified pursuant to section 179A.12 without prior notification and consultation on ten days' written notice to the exclusive representative and agreement by the exclusive representative that represents the largest number of employees to be included in the plan.\n(b) Prior to a decision to dissolve any self-insurance, trust fund, or dedicated insurance fund created by a single statutory or home rule charter city, county, school district, or instrumentality of any of them, either by ordinance or resolution, the employer must provide 30 days' written notice to each exclusive representative of employees and each individual currently receiving health benefits, and also obtain approval for the proposed action by the exclusive representative that represents the largest number of employees included in the plan. All assets from the trust fund must be audited before closure, and remaining assets must be dedicated for use for health insurance benefits for all individuals currently receiving health benefits. This paragraph does not apply to joint self-insurance trusts or pools.\n(c) The assets or liabilities of a joint self-insurance trust or pool that is dissolved must be distributed to members of the joint trust or pool in accordance with the joint trust or pool agreement, if any.\nA statutory or home rule charter city, county, school district, or instrumentality of any of these entities with a self-insurance health benefit plan, may, upon request of the exclusive representative of its employees as certified pursuant to section 179A.12, allow the employees of the exclusive representative to enroll, at their own expense, in the health insurance benefit plan.\nNo political subdivision or its employee or agent shall disclose any information about individual claims or total claims of an individual without the consent of the individual, except that the information may be disclosed to officers, employees, or agents of the political subdivision to the extent necessary to enable them to perform their duties in administering the health benefit program. This provision shall not prevent the disclosure of aggregate claims for the group without identification of any individual.\nA parent or legal guardian of a minor is authorized to act on behalf of the minor in the disclosure of a record.\nA statutory or home rule charter city or county or school district, or instrumentality thereof having a self insured health benefit plan on August 1, 1980, may continue to operate that plan notwithstanding that the plan does not meet the minimum employee group size requirement of subdivision 1.",
	"repealed": false
}