{
	"id": "360.511",
	"url": "https://www.revisor.mn.gov/statutes/cite/360.511",
	"title": "360.511 DEFINITIONS.",
	"text": "For the purposes of sections 360.521 to 360.675, the following words, terms, and phrases shall have the meanings herein given, unless otherwise specifically defined or unless another intention clearly appears or the context otherwise requires.\n[Renumbered subd 27]\n[Renumbered subd 16]\n\"Air commerce\" means the transportation by aircraft of persons or property for hire in interstate, intrastate, or international transportation on regularly scheduled flights by airline companies operating under a certificate of convenience and necessity issued by the United States Department of Transportation.\n[Renumbered subd 20]\n[Renumbered subd 22]\n[Renumbered subd 26]\n[Renumbered subd 23]\n[Renumbered subd 21]\n[Renumbered subd 25]\n[Renumbered subd 18]\n[Renumbered subd 28]\n[Renumbered subd 19]\n[Renumbered subd 17]\n[Renumbered subd 24]\n\"Aircraft\" means any contrivance, now known or hereafter invented, used or designed for navigation of or flight in the air.\nAn aircraft being manufactured or rebuilt is completed as of the date of the initial airworthiness certificate issued thereon by proper federal authorities.\n\"Aircraft manufacturer\" means a person, firm, or corporation engaged in the business of constructing aircraft of a particular design and model for the purpose of selling the finished product.\n\"Aircraft refitter\" means a person, firm, or corporation engaged in the business of refitting and modifying aircraft.\n\"Airline company\" means any person who undertakes directly or indirectly to engage in the business of air commerce.\n\"Airports thereof\" (referring to airports of the state of Minnesota) includes all airports located in this state owned by the state, by any political subdivision or municipality thereof, or by any person.\n\"Commissioner\" means the commissioner of transportation of this state.\n\"Dealer\" means any person regularly engaged in the business of manufacturing or selling, purchasing, and generally dealing in new or used aircraft, having an established place of business for the trade, sale, and display thereof and having in possession new or used aircraft for the purpose of sale or trade.\n\"Fiscal year\" starts July 1 and ends June 30.\n\"Municipality\" means a city, a county, or a town in this state and includes metropolitan airports commissions organized pursuant to the provisions of Laws 1943, chapter 500.\n\"Owner\" means any person owning or renting an aircraft, or having the exclusive use thereof, under a lease or otherwise, for a period greater than 30 days.\n\"Person\" means any individual, corporation, firm, copartnership, company, or association, and includes any guardian, trustee, executor, administrator, receiver, conservator, or any person acting in any fiduciary capacity therefor.\n\"Rebuilt aircraft\" means airworthy aircraft constructed from aircraft damaged to an extent that prior to the rebuilding process they were unairworthy.",
	"repealed": false
}