{
	"id": "103E.241",
	"url": "https://www.revisor.mn.gov/statutes/cite/103E.241",
	"title": "103E.241 ENGINEER.",
	"text": "Within 30 days after receiving a petition and bond from the county attorney, the drainage authority shall, by order, appoint an engineer to make a preliminary survey within a prescribed time. The engineer must be the county highway engineer of a county where the affected property is located or a professional engineer registered under state law. The engineer is the engineer for the drainage project throughout the proceeding and construction unless otherwise ordered. Each appointed engineer must file an oath and bond. The engineer may be removed by the drainage authority at any time. If the engineer position is vacant, the drainage authority shall appoint another engineer as soon as possible.\nAn appointed engineer must subscribe to an oath to faithfully perform the assigned duties in the best manner possible and file a bond with the auditor. Within ten days after being appointed, the drainage authority shall set an amount of at least $5,000 for the bond. The bond must have adequate surety and be payable to the county where the petition is filed, or for a proposed joint county drainage project to all counties in the petition. The bond must be conditioned to pay any person or the drainage authority for damages and injuries resulting from negligence of the engineer while the engineer is acting in the proceedings or construction and provide that the engineer will diligently and honestly perform the engineer's duties. The bond is subject to approval by the auditor. The aggregate liability of the surety for all damages may not exceed the amount of the bond.\nThe engineer may appoint assistant engineers and hire help necessary to complete the engineer's duties. The engineer is responsible for the assistant engineers and may remove them. The compensation of the engineer, assistant engineers, and other employees is provided by section 103E.645.\nThe engineer shall make an expense report every two weeks after the beginning of the engineer's work until the construction contract is awarded. The report must show costs incurred by the engineer and expenses incurred under the engineer's direction relating to the proceeding, and include the names of the engineer, engineer assistants, and employees and the time each was employed, and every item of expense incurred by the engineer. The engineer must file this report with the auditor as soon as possible and may not incur expenses for the proceeding greater than the petitioners' bond.\nAfter the engineer is appointed and before construction of the drainage project is finished, the drainage authority may employ an engineer as a consulting engineer for the proceeding and construction. A consulting engineer shall advise the engineer and drainage authority on engineering matters and problems that may arise related to the proceeding and construction of the drainage project. The drainage authority shall determine the compensation for the consulting engineer.",
	"repealed": false
}