{
	"id": "332B.04",
	"url": "https://www.revisor.mn.gov/statutes/cite/332B.04",
	"title": "332B.04 REGISTRATION.",
	"text": "Application for registration to operate as a debt settlement services provider in this state must be made in writing to the commissioner, under oath, in the form prescribed by the commissioner, and must contain:\n(1) the full name of each principal of the entity applying;\n(2) the address, which must not be a post office box, and the telephone number and, if applicable, email address of the applicant;\n(3) consent to the jurisdiction of the courts of this state;\n(4) the name and address of the registered agent authorized to accept service of process on behalf of the applicant or appointment of the commissioner as the applicant's agent for purposes of accepting service of process;\n(5) disclosure of:\n(i) whether any controlling or affiliated party has ever been convicted of a crime or found civilly liable for an offense involving moral turpitude, including forgery, embezzlement, obtaining money under false pretenses, larceny, extortion, conspiracy to defraud, or any other similar offense or violation, or any violation of a federal or state law or regulation in connection with activities relating to the rendition of debt settlement services or involving any consumer fraud, false advertising, deceptive trade practices, or similar consumer protection law;\n(ii) any judgments, private or public litigation, tax liens, written complaints, administrative actions, or investigations by any government agency against the applicant or any officer, director, manager, or shareholder owning more than five percent interest in the applicant, unresolved or otherwise, filed or otherwise commenced within the preceding ten years;\n(iii) whether the applicant or any person employed by the applicant has had a record of having defaulted in the payment of money collected for others, including the discharge of debts through bankruptcy proceedings; and\n(iv) whether the applicant's license or registration to provide debt settlement services in any other state has ever been revoked or suspended;\n(6) a copy of the applicant's standard debt settlement services agreement that the applicant intends to execute with debtors;\n(7) proof of accreditation, unless the applicant submits an affidavit attesting that the applicant does not provide credit counseling services; and\n(8) any other information and material as the commissioner may require.\nThe commissioner may, for good cause shown, temporarily waive any requirement of this subdivision.\nA registration is effective until 11:59 p.m. on December 31 of the year for which the application for registration is filed or until it is surrendered by the registrant or revoked or suspended by the commissioner. The registration is limited solely to the business of providing debt settlement services.\nAn applicant for registration as a debt settlement services provider must comply with the requirements of section 332A.04, subdivisions 3, 4, and 5.\nIf the registrant has failed to account to a debtor, or has failed to perform any of the services promised, the registrant is in default. The debtor or the debtor's legal representative or receiver, the commissioner, or the attorney general shall have, in addition to all other legal remedies, a right of action in the name of the debtor on the bond or the security given under this section, for loss suffered by the debtor, not exceeding the face amount of the bond or security, and without the necessity of joining the registrant in the suit or action based on the default.\nThe commissioner must maintain a list of registered debt settlement services providers. The list must be made available to the public in written form upon request and on the Department of Commerce website.\nEach year, each registrant under the provisions of this chapter must, not more than 60 nor less than 30 days before its registration is to expire, apply to the commissioner for renewal of its registration on a form prescribed by the commissioner. The application must be signed by the registrant under penalty of perjury, contain current information on all matters required in the original application, and be accompanied by a payment of $250. The registrant must maintain a continuous surety bond that satisfies the requirements of section 332A.04, subdivision 4. The renewal is effective for one year. The commissioner may, for good cause shown, temporarily waive any requirement of this section.\nA registrant must update any information required by this chapter the registrant provided in the original or renewal application not later than ten days after the date the events precipitating the update occurred.\nSection 58A.04, subdivisions 2 and 3, apply to this section.",
	"repealed": false
}