{
	"id": "256R.25",
	"url": "https://www.revisor.mn.gov/statutes/cite/256R.25",
	"title": "256R.25 EXTERNAL FIXED COSTS PAYMENT RATE.",
	"text": "(a) The payment rate for external fixed costs is the sum of the amounts in paragraphs (b) to (p).\n(b) For a facility licensed as a nursing home, the portion related to the provider surcharge under section 256.9657 is equal to $8.86 per resident day. For a facility licensed as both a nursing home and a boarding care home, the portion related to the provider surcharge under section 256.9657 is equal to $8.86 per resident day multiplied by the result of its number of nursing home beds divided by its total number of licensed beds.\n(c) The portion related to the licensure fee under section 144.122, paragraph (d), is the amount of the fee divided by the sum of the facility's resident days.\n(d) The portion related to development and education of resident and family advisory councils under section 144A.33 is $5 per resident day divided by 365.\n(e) The portion related to scholarships is determined under section 256R.37.\n(f) The portion related to planned closure rate adjustments is as determined under section 256R.40, subdivision 5, and Minnesota Statutes 2010, section 256B.436.\n(g) The portion related to consolidation rate adjustments shall be as determined under section 144A.071, subdivisions 4c, paragraph (a), clauses (5) and (6), and 4d.\n(h) The portion related to single-bed room incentives is as determined under section 256R.41.\n(i) The portions related to real estate taxes, special assessments, and payments made in lieu of real estate taxes directly identified or allocated to the nursing facility are the allowable amounts divided by the sum of the facility's resident days. Allowable costs under this paragraph for payments made by a nonprofit nursing facility that are in lieu of real estate taxes shall not exceed the amount which the nursing facility would have paid to a city or township and county for fire, police, sanitation services, and road maintenance costs had real estate taxes been levied on that property for those purposes.\n(j) The portion related to employer health insurance costs is the allowable costs divided by the sum of the facility's resident days.\n(k) The portion related to the Public Employees Retirement Association is the allowable costs divided by the sum of the facility's resident days.\n(l) The portion related to quality improvement incentive payment rate adjustments is the amount determined under section 256R.39.\n(m) The portion related to performance-based incentive payments is the amount determined under section 256R.38.\n(n) The portion related to special dietary needs is the amount determined under section 256R.51.\n(o) The portion related to the rate adjustments for border city facilities is the amount determined under section 256R.481.\n(p) The portion related to the rate adjustment for critical access nursing facilities is the amount determined under section 256R.47.",
	"repealed": false
}