{
	"id": "97A.441",
	"url": "https://www.revisor.mn.gov/statutes/cite/97A.441",
	"title": "97A.441 LICENSES ISSUED WITHOUT FEE.",
	"text": "(a) A person authorized to issue licenses must issue, without a fee, licenses to take fish by angling or spearing to a resident who is:\n(1) blind;\n(2) a recipient of Supplemental Security Income for the aged, blind, and disabled;\n(3) a recipient of Social Security aid to the disabled under United States Code, title 42, section 416, paragraph (i)(l), or section 423(d);\n(4) a recipient of workers' compensation based on a finding of total and permanent disability;\n(5) 65 years of age or older and was qualified under clause (2) or (3) at the age of 64;\n(6) permanently disabled and meets the disability requirements for Supplemental Security Income or Social Security aid to the disabled under United States Code, title 42, section 416, paragraph (i)(l), or section 423(d);\n(7) receiving aid under the federal Railroad Retirement Act of 1974, United States Code, title 45, section 231a(a)(1)(v); or\n(8) a former employee of the United States Postal Service receiving disability pay under United States Code, title 5, section 8337.\n(b) A driver's license or Minnesota identification card bearing the applicable designation under section 171.07, subdivision 17, serves as satisfactory evidence to obtain a license under this subdivision at all agent locations.\nA license to take fish by angling shall be issued without a fee to a citizen of a foreign country that is attending school in this state as an exchange student.\nThe commissioner may issue a license, without a fee, to take fish by angling to a person that is a ward of the commissioner of human services and a resident of a state institution upon application by the commissioner of human services.\nA person authorized to issue licenses must issue, without a fee, a permanent license to take fish by angling to a resident at least 16 years old that is developmentally disabled upon being furnished satisfactory evidence of the disability.\n(a) A person authorized to issue licenses must issue, without a fee, a permanent license to take fish by angling to a resident who is a veteran, as defined in section 197.447, and that has a 100 percent service-connected disability as defined by the United States Veterans Administration upon being furnished satisfactory evidence.\n(b) A driver's license or Minnesota identification card bearing the designation under section 171.07, subdivision 15, paragraph (a), clause (2), serves as satisfactory evidence to obtain a license under this subdivision at all agent locations.\n(a) A person authorized to issue licenses must issue, without a fee, a license to take deer with firearms or by archery to a resident that is a veteran, as defined in section 197.447, and that has a 100 percent service-connected disability as defined by the United States Veterans Administration upon being furnished satisfactory evidence.\n(b) The commissioner, upon request, must issue a permanent card documenting satisfactory evidence of 100 percent permanently disabled status.\n(c) The following serve as satisfactory evidence to obtain a license under this subdivision at all agent locations:\n(1) a card issued under paragraph (b); or\n(2) a driver's license or Minnesota identification card bearing the designation under section 171.07, subdivision 15, paragraph (a), clause (2).\n(a) A person authorized to issue licenses must issue, without a fee, a license to take small game to a resident who is a veteran, as defined in section 197.447, and who has a 100 percent service-connected disability as defined by the United States Veterans Administration upon being furnished satisfactory evidence.\n(b) The commissioner, upon request, must issue a permanent card documenting satisfactory evidence of 100 percent permanently disabled status.\n(c) The following serve as satisfactory evidence to obtain a license under this subdivision at all agent locations:\n(1) a card issued under paragraph (b); or\n(2) a driver's license or Minnesota identification card bearing the designation under section 171.07, subdivision 15, paragraph (a), clause (2).\n(a) The commissioner may issue, without a fee, a license to take an antlerless deer to a resident who is an owner or tenant, or a nonresident who is an owner, of at least 80 acres of agricultural land, as defined in section 97B.001, in deer permit areas that allow the taking of antlerless deer without a lottery application. A person may receive only one license per year under this subdivision. For properties with co-owners or cotenants, only one co-owner or cotenant may receive a license under this subdivision per year. The license issued under this subdivision is restricted to land leased for agricultural purposes or owned by the holder of the license within the permit area where the qualifying land is located. The holder of the license may transfer the license to the holder's spouse or dependent. Deer taken under this subdivision do not count towards the total bag limit for the permit area. Notwithstanding sections 97A.415, subdivision 1, and 97B.301, subdivision 2, the holder of the license may purchase additional licenses or permits for taking deer and may take additional deer under those licenses or permits, provided the holder adheres to the bag limits established for that permit area.\n(b) A person who obtains a license under paragraph (a) must allow public deer hunting on their land during that deer-hunting season, with the exception of the first Saturday and Sunday during the deer-hunting season applicable to the license issued under section 97A.475, subdivision 2, clause (5).\nThere is no fee for a duplicate license if the original license was issued without a fee.\nAn individual who is providing angling assistance to a disabled resident licensed under subdivision 1, 4, or 5, is not required to possess a license to take fish by angling provided that no lines in addition to those permitted for an individual under section 97C.315 are in the water.\nThe commissioner may issue, without a fee, licenses to take wild animals for the purposes of wildlife disease prevention and control.",
	"repealed": false
}