{
	"id": "253B.045",
	"url": "https://www.revisor.mn.gov/statutes/cite/253B.045",
	"title": "253B.045 TEMPORARY CONFINEMENT.",
	"text": "Except when ordered by the court pursuant to a finding of necessity to protect the life of the proposed patient or others or as provided under subdivision 1a, no person subject to the provisions of this chapter shall be confined in a jail or correctional institution, except pursuant to chapter 242 or 244.\nMS 2012 [Renumbered 253D.10, subd 2]\n(a) Each county or a group of counties shall maintain or provide by contract a facility for confinement of persons held temporarily for observation, evaluation, diagnosis, treatment, and care. When the temporary confinement is provided at a state-operated treatment program, the executive board shall charge the county of financial responsibility for the costs of confinement of patients hospitalized under sections 253B.051 and 253B.07, subdivision 2b, except that the executive board shall bill the responsible health plan first. Any charges not covered, including co-pays and deductibles shall be the responsibility of the county. If the patient has health plan coverage, but the hospitalization does not meet the criteria in subdivision 6 or section 62M.07, 62Q.53, or 62Q.535, the county is responsible.\n(b) For the purposes of this subdivision, \"county of financial responsibility\" has the meaning specified in section 253B.02, subdivision 4c, or, if the patient has no residence in this state, the county which initiated the confinement. The charge for confinement in a facility operated by the executive board shall be based on the executive board's determination of the cost of care pursuant to section 246.50, subdivision 5. When there is a dispute as to which county is the county of financial responsibility, the county charged for the costs of confinement shall pay for them pending final determination of the dispute over financial responsibility.\nNotwithstanding subdivision 2, a county shall be responsible for the cost of care as specified under section 246.54 for a patient hospitalized at a state-operated treatment program in accordance with section 253B.09 and the patient's legal status has been changed to a court hold under section 253B.07, subdivision 2b, pending a judicial determination regarding continued commitment pursuant to sections 253B.12 and 253B.13.\nThe designated agency shall take reasonable measures to assure proper care and treatment of a person temporarily confined pursuant to this section.\nFor purposes of this section, \"health plan company\" has the meaning given it in section 62Q.01, subdivision 4, and also includes a demonstration provider as defined in section 256B.69, subdivision 2, paragraph (b); and a county or group of counties participating in county-based purchasing according to section 256B.692.\n(a) For purposes of this section, \"mental health services\" means all covered services that are intended to treat or ameliorate an emotional, behavioral, or psychiatric condition and that are covered by the policy, contract, or certificate of coverage of the enrollee's health plan company or by law.\n(b) All health plan companies that provide coverage for mental health services must cover or provide mental health services ordered by a court of competent jurisdiction. This court-ordered coverage must not be subject to a separate medical necessity determination by a health plan company under its utilization procedures.",
	"repealed": false
}