{
	"id": "144G.33",
	"url": "https://www.revisor.mn.gov/statutes/cite/144G.33",
	"title": "144G.33 INNOVATION VARIANCE.",
	"text": "(a) For purposes of this section, \"innovation variance\" means a specified alternative to a requirement of this chapter.\n(b) An innovation variance may be granted to allow an assisted living facility to offer services of a type or in a manner that is innovative, will not impair the services provided, will not adversely affect the health, safety, or welfare of the residents, and is likely to improve the services provided. The innovative variance cannot change any of the resident's rights under the assisted living bill of rights.\nThe commissioner may impose conditions on granting an innovation variance that the commissioner considers necessary.\nThe commissioner may limit the duration of any innovation variance and may renew a limited innovation variance.\nAn application for innovation variance from the requirements of this chapter may be made at any time, must be made in writing to the commissioner, and must specify the following:\n(1) the statute or rule from which the innovation variance is requested;\n(2) the time period for which the innovation variance is requested;\n(3) the specific alternative action that the licensee proposes;\n(4) the reasons for the request; and\n(5) justification that an innovation variance will not impair the services provided, will not adversely affect the health, safety, or welfare of residents, and is likely to improve the services provided.\nThe commissioner may require additional information from the facility before acting on the request.\nThe commissioner shall grant or deny each request for an innovation variance in writing within 45 days of receipt of a complete request. Notice of a denial shall contain the reasons for the denial. The terms of a requested innovation variance may be modified upon agreement between the commissioner and the facility.\nA failure to comply with the terms of an innovation variance shall be deemed to be a violation of this chapter.\nThe commissioner shall revoke or deny renewal of an innovation variance if:\n(1) it is determined that the innovation variance is adversely affecting the health, safety, or welfare of the residents;\n(2) the facility has failed to comply with the terms of the innovation variance;\n(3) the facility notifies the commissioner in writing that it wishes to relinquish the innovation variance and be subject to the statute previously varied; or\n(4) the revocation or denial is required by a change in law.",
	"repealed": false
}