{
	"id": "414.041",
	"url": "https://www.revisor.mn.gov/statutes/cite/414.041",
	"title": "414.041 CONSOLIDATION OF MUNICIPALITIES.",
	"text": "(a) Two or more municipalities may be the subject of a single proceeding provided that each municipality abuts at least one of the included municipalities.\n(b) The proceeding shall be initiated in one of the following ways:\n(1) submitting to the chief administrative law judge a resolution of the city council of each affected municipality;\n(2) submitting to the chief administrative law judge a petition signed by a number of residents eligible to vote equivalent to five percent or more of the resident voters of a municipality who voted for governor at the last general election; or\n(3) by the chief administrative law judge.\n(c) The petition or resolution shall set forth the following information about each included municipality: name, description of boundaries, the reasons for requesting the consolidation and the names of all parties entitled to mailed notice under section 414.09.\n(d) The party initiating the proceeding shall serve copies of the petition or resolution on all of the included municipalities.\nUpon receipt of a petition or a resolution requesting consolidation or upon the chief administrative law judge's own motion, the chief administrative law judge shall appoint a consolidation commission from a list of ten candidates submitted by each affected city council. The commission shall be composed of not fewer than five members from each affected municipality. From a separate list of three persons submitted by each affected city council, the chief administrative law judge shall appoint a commission chair who is not a resident of an affected municipality but who resides in an affected county.\nNo person is disqualified from serving on a consolidation commission by reason of holding other elected or appointed office. Consolidation commission members shall hold office until a consolidation report has been issued by the commission. The chief administrative law judge shall fill vacancies in the commission by appointment. The consolidation commission shall make rules with reference to its operation and procedures including quorum requirements with reference to its operations and procedures.\n(a) The consolidation commission shall conduct hearings regarding the proposed consolidation.\n(b) The hearings shall include, but are not limited to, the following subjects:\n(1) the contents of any city charter for the proposed consolidated city or the form of government of the proposed consolidated city;\n(2) analysis of whether a ward system shall be included in the form of government of the proposed consolidated city; and\n(3) each factor considered by the chief administrative law judge under section 414.02, subdivision 3.\n(c) Based on these factors and upon other matters which come before the consolidation commission, the commission shall issue a report to the chief administrative law judge with findings and recommendations within two years from the date of the chief administrative law judge's initial appointment of the commission.\nUpon receipt of the commission's report, the chief administrative law judge shall designate a time and a place for a hearing in accordance with section 414.09.\n(a) In arriving at a decision, the chief administrative law judge shall consider the factors in section 414.02, subdivision 3.\n(b) The chief administrative law judge shall consider and may accept, amend, return to the commission for amendment or further study, or reject the commission's findings and recommendations based upon the chief administrative law judge's written determination of what is in the best interests of the affected municipalities.\n(c) The chief administrative law judge shall order the consolidation on finding that consolidation will be for the best interests of the municipalities. In all cases, the chief administrative law judge shall set forth the factors which are the basis for the decision.\n(d) If the chief administrative law judge orders consolidation, the order shall provide for election of new municipal officers in accordance with section 414.09.\n(e) If the most populous of the included municipalities is a statutory city, the new municipality shall be a statutory city and the plan of government shall be Optional Plan A, provided that an alternate plan may be adopted pursuant to section 412.551, at any time. If the most populous of the included municipalities is a home rule charter city or organized under a statute other than chapter 412, the new municipality shall be governed by its home rule charter or the statutory form under which it is governed except that any ward system for the election of council members shall be inoperable.\n(f) If the commission's findings and recommendations include a proposed home rule charter for the new municipality, the order may combine the issue of the adoption of the charter and the vote on approval of the order for consolidation into one question on the ballot, and shall submit it in a special or general election as provided in section 410.10.\n(g) The ordinances of all of the included municipalities shall continue in effect within their former boundaries until repealed by the governing body of the new municipality.\n(h) Notwithstanding any other provision of law to the contrary, the order may establish a ward system in the new municipality, in which event the order shall establish not less than three nor more than seven wards, each of which shall elect one council member. When more than two years have elapsed after consolidation, the governing body may, by a four-fifths vote, abolish the ward system.\n(i) The new municipality shall assume the name of the most populous municipality unless previous to the election another name is chosen by joint resolution of a majority of the included municipalities or by the consolidation commission.\n(j) The number of license privileges existing in the included municipalities prior to consolidation and pursuant to state law shall not be diminished as a result of the consolidation.\n(k) If the consolidation is denied or defeated in a referendum, no proceeding for the consolidation of the same municipalities may be initiated within two years from the date of the order unless authorized by the chief administrative law judge.\n(a) If the consolidation was initiated by a petition of the resident voters of a municipality, the order for consolidation shall be final upon approval by resolution of the city councils in each of the affected municipalities unless ten percent or more of the resident voters of an affected municipality who voted for governor at the last general election petition the city council for a referendum on the consolidation. The petition must be submitted within 90 days of the final date of the order or the date of final approval of the order by the city councils, whichever is later.\n(b) Upon receipt and verification of the petition, the chief administrative law judge shall order the municipalities to conduct separate referenda at a general or special election in each municipality on the same day, and the referenda shall be held within six months of the receipt of the petition.\n(c) Costs of the respective referenda shall be borne by the respective municipality. A majority of those voting in each city must approve the proposed consolidation. The results of the referenda shall be certified to the chief administrative law judge by the chief election judge within ten days after the referenda. The chief administrative law judge shall upon receipt of the certificate notify all parties of the election results.\n(d) If the consolidation was initiated by a city council resolution of each affected municipality, the order for consolidation shall be final unless ten percent or more of the resident voters of an affected municipality petition for a referendum as provided in paragraph (a).\n(e) If the consolidation was initiated by the chief administrative law judge, no chief administrative law judge's consolidation order involving existing municipalities shall become effective unless adopted by the council of each affected municipality by a majority vote and unless the consolidation order is approved by the qualified voters of the affected municipalities at a general or special election set according to law. The form of the ballot shall be fixed by the chief administrative law judge; and, if a majority of the votes cast on the question in each municipality are in favor of its adoption, the order shall become effective as provided herein.\n(f) Notwithstanding a disapproval of the order for consolidation by a city council of an affected municipality required to approve the order in paragraph (a) or (e), the order for consolidation shall nevertheless be deemed approved by that city council if ten percent or more of the resident voters of that municipality who voted for governor at the last general election petition the city council for a referendum on the consolidation as provided in paragraph (a), and a majority of those voting in that municipality approve the order for consolidation.\nWhere one municipality is receiving substantially fewer municipal services, the chief administrative law judge may provide that the tax rate of the municipality shall be increased in substantially equal proportions over a period of not more than five years to equality with the tax rate in the remainder of the new municipality. The period shall be determined by the chief administrative law judge on the basis of the period reasonably required to provide substantially equal municipal services.\nThe consolidation shall be effective upon the election and qualification of new municipal officers, or at such later date as set by the order.",
	"repealed": false
}