{
	"id": "609.6855",
	"url": "https://www.revisor.mn.gov/statutes/cite/609.6855",
	"title": "609.6855 SALE OF NICOTINE DELIVERY PRODUCTS TO PERSONS UNDER AGE 21.",
	"text": "(a) Any person 21 years of age or older who sells, gives, or otherwise furnishes to a person under the age of 21 years a product containing or delivering nicotine or lobelia, whether natural or synthetic, intended for human consumption, or any part of such a product, that is not tobacco or an electronic delivery device as defined by section 609.685, is guilty of a petty misdemeanor for the first violation. Whoever violates this subdivision a subsequent time within five years of a previous conviction under this subdivision is guilty of a misdemeanor.\n(b) It is an affirmative defense to a charge under this subdivision if the defendant proves by a preponderance of the evidence that the defendant reasonably and in good faith relied on proof of age as described in section 340A.503, subdivision 6.\n(c) Notwithstanding paragraph (a), a product containing or delivering nicotine or lobelia intended for human consumption, whether natural or synthetic, or any part of such a product, that is not tobacco or an electronic delivery device as defined by section 609.685, may be sold to persons under the age of 21 if the product is a drug, device, or combination product, as those terms are defined in the Federal Food, Drug, and Cosmetic Act, that is authorized for sale by the United States Food and Drug Administration.\nA person under the age of 21 years who purchases or attempts to purchase a product containing or delivering nicotine or lobelia intended for human consumption, or any part of such a product, that is not tobacco or an electronic delivery device as defined by section 609.685, and who uses a driver's license, permit, Minnesota identification card, or any type of false identification to misrepresent the person's age, shall only be subject to an alternative civil penalty in accordance with subdivision 3. No penalty shall apply to a person under the age of 21 years who purchases or attempts to purchase these products while under the direct supervision of a responsible adult for training, education, research, or enforcement purposes.\nLaw enforcement and court system representatives shall consult, as applicable, with interested persons, including but not limited to parents, guardians, educators, and persons under the age of 21 years, to develop alternative civil penalties for persons under the age of 21 years who violate this section. Consulting participants shall consider a variety of alternative civil penalties including but not limited to tobacco-free education programs, community service, court diversion programs, and tobacco cessation programs, and for persons under the age of 18 years, notice to schools and to parents or guardians. Alternative civil penalties developed under this subdivision shall not include fines or monetary penalties.",
	"repealed": false
}