{
	"id": "299F.57",
	"url": "https://www.revisor.mn.gov/statutes/cite/299F.57",
	"title": "299F.57 SAFETY STANDARDS; GAS PIPELINE.",
	"text": "(a) The commissioner may by rule establish additional or more stringent safety standards for the transportation of gas and gas pipeline facilities. Such standards may apply to the design, installation, inspection, testing, construction, extension, operation, replacement, and maintenance of gas pipeline facilities. These standards may include a requirement that individuals responsible for the operation and maintenance of gas pipeline facilities be tested for qualifications and certified to perform these functions. The standards may not prescribe the location or routing of a pipeline facility. Standards affecting the design, installation, construction, initial inspection, and initial testing shall not be applicable to pipeline facilities in existence on the date such standards are adopted. Such safety standards shall be practicable and designed to meet the need for pipeline safety.\n(b) In prescribing such standards, the commissioner shall consider:\n(1) relevant available pipeline safety data;\n(2) whether such standards are appropriate for the particular type of pipeline transportation;\n(3) the reasonableness of any proposed standards;\n(4) the extent to which any such standards will contribute to public safety; and\n(5) the existing standards established by the Secretary of Transportation of the United States pursuant to the federal Natural Gas Pipeline Safety Act.\nProvided, however, that the commissioner shall not be empowered to adopt any such standards as to the transportation of gas or to pipeline facilities which are subject to the jurisdiction of the Federal Energy Regulatory Commission under the Natural Gas Act of the United States, Statutes at Large, volume 52, chapter 556, except as provided in sections 299J.01 to 299J.17.\nThe federal safety standards adopted as Code of Federal Regulations, title 49, parts 191, 192, 193, and 199, and standards that may be adopted that amend parts 191, 192, 193, and 199, are adopted as minimum safety standards.\n[Repealed by amendment, 1989 c 244 s 10]\nThe rulemaking, contested case, and judicial review provisions of chapter 14 shall apply to all rules and orders establishing, amending, revoking, or waiving compliance with any standard established under sections 299F.56 to 299F.641 or any penalty imposed under sections 299F.56 to 299F.641. The commissioner shall afford interested persons an opportunity to participate fully in the establishment of such safety standards through submission of written data, views, or arguments, with opportunity to present oral testimony and argument.\nThe commissioner, on finding a particular facility to be hazardous to life or property, shall be empowered to require the person operating such facility to take such steps necessary to remove such hazards.\nUpon application by any person engaged in the transportation of gas or the operation of pipeline facilities, the commissioner may, after notice and opportunity for hearing and under such terms and conditions and to such extent as the commissioner deems appropriate, waive in whole or in part compliance with any standards established under sections 299F.56 to 299F.64, on determining that a waiver of compliance with such standard is not inconsistent with gas pipeline safety. The commissioner shall state the reasons for any such waiver.",
	"repealed": false
}