{
	"id": "11A.14",
	"url": "https://www.revisor.mn.gov/statutes/cite/11A.14",
	"title": "11A.14 MINNESOTA COMBINED INVESTMENT FUNDS.",
	"text": "The Minnesota combined investment funds are established for the purpose of providing investment vehicles for assets of the participating public retirement plans and nonretirement funds. The assets of participating nonretirement funds may not be commingled with the assets of participating public retirement plans. The combined funds shall consist of the following investment accounts: cash management accounts, equity accounts, fixed income accounts, and any other accounts determined appropriate by the state board.\nThe assets of the combined investment funds shall consist of the money certified to and received by the state board from participating retirement plans and nonretirement funds which shall be used to purchase investment shares in the appropriate investment accounts. Each participating plan or fund shall own an undivided participation in all the assets of the particular accounts of the combined funds in which it participates. As of any date, the total claim of a participating plan or fund on the assets in each account shall be equal to the ratio of units owned by a plan or fund in each account to the total issued units then outstanding.\nThe combined investment funds shall be managed by the state board.\nThe assets of the combined investment funds shall be invested by the state board subject to the provisions of section 11A.24, except that any individual account may be completely invested in a single asset class or managed in a separate account by the state board at its discretion.\nAny public retirement plan or nonretirement fund authorized by law to have its assets managed by the state board may participate in the Minnesota combined investment funds.\nAs of July 1, 1980, or a later date as determined by the state board, the participating funds shall transfer to the combined investment funds all appropriate securities then held together with cash necessary for the purchase of units in the combined fund accounts.\nAll assets transferred to the Minnesota combined investment funds shall be valued at their current market value as determined by the state board, including accrued interest. The initial value of each account unit shall be $1,000 with each participating fund allocated units in the various accounts of the Minnesota combined investment funds in the same proportion as their assets are to the total assets in each account.\nAny realized gains or losses in the value of investments incurred by a transferring fund pursuant to subdivision 7 shall be recognized on the date of the transfer.\n(a) Valuation of units for the accounts in the Minnesota combined investment funds shall be performed as of the last business day of each month, or more frequently should the state board determine that additional valuation dates are necessary.\n(b) The value of a unit for each account shall be determined by the following procedure:\n(1) As of the close of business on the valuation date the state board shall determine the fair market value of each asset in each account, using the references, pricing services, consultants, or other methods as the state board deems appropriate.\n(2) The sum total of the market value of all securities plus cash, less the value of undistributed income in each account, shall be divided by the number of units issued and outstanding for the account to determine the value per account unit.\nPurchase and redemption of units shall be on the first business day following the valuation date. All transactions shall be at the unit value established on the immediately preceding valuation date. Except for the initial purchase of units by an authorized participant, all purchases and redemptions shall be made in cash unless the state board determines that an exception is necessary.\nInvestment earnings shall be the sum total of the following of each account:\n(1) Dividends receivable on securities trading ex-dividend to and including the valuation date.\n(2) Cash dividends received to and including the valuation date that were not accounted for on a previous valuation date.\n(3) Accrued interest to and including the valuation date.\n(4) Interest received which had not been accrued and accounted for on a prior valuation date.\n(5) Income from the sale of options, rights, warrants, or security lending.\n(6) Other income received to and including the valuation date.\nAt least once each year the state board shall distribute to each participant net earnings determined proportionately in accordance with their average unit holdings in each account during the period. Unless otherwise directed by the participating fund, any distributions shall be used to purchase additional units in the accounts.\nThe executive director of the state board shall keep accounting records. The records shall reflect the number of units in the Minnesota combined investment funds owned by each participating fund. No certificates or other evidence of ownership shall be required.\nAs of each valuation date, or as often as the state board determines, each participant shall be informed of the number of units owned and the current value of the units.",
	"repealed": false
}