{
	"id": "518.165",
	"url": "https://www.revisor.mn.gov/statutes/cite/518.165",
	"title": "518.165 GUARDIANS AD LITEM FOR MINOR CHILDREN.",
	"text": "In all proceedings for child custody or for dissolution or legal separation where custody or parenting time with a minor child is in issue, the court may appoint a guardian ad litem to represent the interests of the child. The guardian ad litem shall advise the court with respect to custody and parenting time.\nIn all proceedings for child custody or for marriage dissolution or legal separation in which custody or parenting time with a minor child is an issue, if the court has reason to believe that the minor child is a victim of domestic child abuse or neglect, as those terms are defined in section 260C.007 and chapter 260E, respectively, the court shall appoint a guardian ad litem. The guardian ad litem shall represent the interests of the child and advise the court with respect to custody and parenting time. If the child is represented by a guardian ad litem in any other pending proceeding, the court may appoint that guardian to represent the child in the custody or parenting time proceeding. No guardian ad litem need be appointed if the alleged domestic child abuse or neglect is before the court on a juvenile dependency and neglect petition. Nothing in this subdivision requires the court to appoint a guardian ad litem in any proceeding for child custody, marriage dissolution, or legal separation in which an allegation of domestic child abuse or neglect has not been made.\nA guardian ad litem shall carry out the following responsibilities:\n(1) conduct an independent investigation to determine the facts relevant to the situation of the child and the family, which must include, unless specifically excluded by the court, reviewing relevant documents; meeting with and observing the child in the home setting and considering the child's wishes, as appropriate; and interviewing parents, caregivers, and others with knowledge relevant to the case;\n(2) advocate for the child's best interests by participating in appropriate aspects of the case and advocating for appropriate community services when necessary;\n(3) maintain the confidentiality of information related to a case, with the exception of sharing information as permitted by law to promote cooperative solutions that are in the best interests of the child;\n(4) monitor the child's best interests throughout the judicial proceeding; and\n(5) present written reports on the child's best interests that include conclusions and recommendations and the facts upon which they are based.\n(a) If a guardian ad litem is appointed on a fee basis, the court shall enter an order for costs, fees, and disbursements in favor of the child's guardian ad litem. The order may be made against either or both parties, except that any part of the costs, fees, or disbursements which the court finds the parties are incapable of paying shall be borne by the State Guardian Ad Litem Board. In no event may the court order that costs, fees, or disbursements be paid by a party receiving public assistance or legal assistance or by a party whose annual income falls below the poverty line as established under United States Code, title 42, section 9902(2).\n(b) In each fiscal year, the commissioner of management and budget shall deposit guardian ad litem reimbursements in the special revenue fund and credit them to a separate account with the State Guardian Ad Litem Board. The balance of this account is appropriated to the State Guardian Ad Litem Board and does not cancel but is available until expended. Revenue from this account must be spent in the judicial district in which the reimbursement is collected.\n(a) The court shall initiate a background study through the commissioner of human services under section 245C.32 on every guardian ad litem appointed under this section if a background study has not been completed on the guardian ad litem within the past three years. The background study must be completed before the court appoints the guardian ad litem, unless the court determines that it is in the best interest of the child to appoint a guardian ad litem before a background study can be completed by the commissioner. The court shall initiate a subsequent background study under this paragraph once every three years after the guardian has been appointed as long as the individual continues to serve as a guardian ad litem.\n(b) The background study must include criminal history data from the Bureau of Criminal Apprehension, other criminal history data held by the commissioner of human services, and data regarding whether the person has been a perpetrator of substantiated maltreatment of a minor or a vulnerable adult. When the information from the Bureau of Criminal Apprehension indicates that the subject of a study under paragraph (a) is a multistate offender or that the subject's multistate offender status is undetermined, the court shall require a search of the National Criminal Records Repository, and shall provide the commissioner a set of classifiable fingerprints of the subject of the study.\n(c) The Minnesota Supreme Court shall pay the commissioner a fee for conducting a background study under section 245C.32.\n(d) Nothing precludes the court from initiating background studies using court data on criminal convictions.\n(a) When the court requests a background study under subdivision 4, paragraph (a), the request shall be submitted to the Department of Human Services through the department's electronic online background study system.\n(b) When the court requests a search of the National Criminal Records Repository, the court must provide a set of classifiable fingerprints of the subject of the study on a fingerprint card provided by the commissioner of human services.\n(c) The commissioner of human services shall provide the court with criminal history data as defined in section 13.87 from the Bureau of Criminal Apprehension in the Department of Public Safety, other criminal history data held by the commissioner of human services, and data regarding substantiated maltreatment of a minor under chapter 260E, and substantiated maltreatment of a vulnerable adult under section 626.557, within 15 working days of receipt of a request. If the subject of the study has been determined by the Department of Human Services or the Department of Health to be the perpetrator of substantiated maltreatment of a minor or vulnerable adult in a licensed facility, the response must include a copy of the public portion of the investigation memorandum under section 260E.30 or the public portion of the investigation memorandum under section 626.557, subdivision 12b. When the background study shows that the subject has been determined by a county adult protection or child protection agency to have been responsible for maltreatment, the court shall be informed of the county, the date of the finding, and the nature of the maltreatment that was substantiated. The commissioner shall provide the court with information from the National Criminal Records Repository within three working days of the commissioner's receipt of the data. When the commissioner finds no criminal history or substantiated maltreatment on a background study subject, the commissioner shall make these results available to the court electronically through the secure online background study system.\n(d) Notwithstanding section 260E.30 or 626.557, subdivision 12b, if the commissioner or county lead agency or lead investigative agency has information that a person on whom a background study was previously done under this section has been determined to be a perpetrator of maltreatment of a minor or vulnerable adult, the commissioner or the county may provide this information to the court that requested the background study.\nThe court shall notify the subject of a background study that the subject has the following rights:\n(1) the right to be informed that the court will request a background study on the subject for the purpose of determining whether the person's appointment or continued appointment is in the best interests of the child;\n(2) the right to be informed of the results of the study and to obtain from the court a copy of the results; and\n(3) the right to challenge the accuracy and completeness of the information contained in the results to the agency responsible for creation of the data except to the extent precluded by section 256.045, subdivision 3.",
	"repealed": false
}