{
	"id": "103B.611",
	"url": "https://www.revisor.mn.gov/statutes/cite/103B.611",
	"title": "103B.611 BOARD.",
	"text": "The district is governed by a board composed of members appointed by the governing bodies of the municipalities included in the district. Each municipality may appoint one member.\nThe term of office of each board member is three years unless the appointing municipality recalls the member and either appoints another member for the balance of the term or leaves the office vacant for the balance of the term. This subdivision applies both to members serving on the effective date of Laws 1995, chapter 184, and to members appointed after the effective date of Laws 1995, chapter 184.\n(a) Subject to the provisions of chapters 97A, 103D, 103E, 103G, and 115, and the rules and regulations of the respective agencies and governing bodies vested with jurisdiction and authority under those chapters, the district has the following powers on Lake Minnetonka, excluding the area of public drainage ditches or watercourses connected to the lake:\n(1) to regulate the types of boats permitted to use the lake and set service fees;\n(2) to regulate, maintain, and police public beaches, public docks, and other public facilities for access to the lake within the territory of the municipalities, provided that a municipality may supersede the district's action under this clause by adopting an ordinance specifically referring to the district's action by one year after the district's action;\n(3) to limit by rule the use of the lake at various times and the use of various parts of the lake;\n(4) to regulate the speed of boats on the lake and the conduct of other activities on the lake to secure the safety of the public and the most general public use;\n(5) to contract with other law enforcement agencies to police the lake and its shore;\n(6) to regulate the construction, installation, and maintenance of permanent and temporary docks and moorings consistent with federal and state law;\n(7) to regulate the construction and use of mechanical and chemical means of deicing the lake and to regulate mechanical and chemical means of removal of weeds and algae from the lake;\n(8) to regulate the construction, configuration, size, location, and maintenance of commercial marinas and their related facilities that affect activity below the ordinary high-water mark. The authority under this clause does not apply to land-based marina activities, including storage facilities, and must be consistent with the applicable state statutes, municipal building codes, and zoning ordinances where the marinas are located;\n(9) to contract with other governmental bodies to perform any of the functions of the district;\n(10) to undertake research to determine the condition and development of the lake and the water entering it and to transmit their studies to the Pollution Control Agency and other interested authorities, and to develop a comprehensive program to eliminate pollution;\n(11) to receive financial assistance from and join in projects or enter into contracts with federal and state agencies for the study and treatment of pollution problems and demonstration programs related to them; and\n(12) to petition the board of managers of a watershed district in which the lake conservation district is located for improvements under section 103D.705; a bond is not required of the lake conservation district.\n(b) For purposes of this subdivision \"watercourses connected to the lake\" does not include channels connecting portions of the lake to one another.\nThe board shall adopt a seal, bylaws for the regulation of the affairs of the district, and rules of procedure to govern the board's actions that are consistent with law.",
	"repealed": false
}