{
	"id": "174.04",
	"url": "https://www.revisor.mn.gov/statutes/cite/174.04",
	"title": "174.04 FINANCIAL ASSISTANCE; APPLICATIONS; DISBURSEMENT.",
	"text": "Any state agency which receives an application from a regional development commission, metropolitan council, public transit commission, airport commission, port authority, or other political subdivision of the state, or any nonpublic organization, for financial assistance for transportation planning, capital expenditures, or operations to any state or federal agency, shall first submit the application to the commissioner of transportation. The commissioner shall review the application to determine whether it contains matters that substantially affect the statewide transportation plan and priorities. If the application does not contain such matters, the commissioner shall within 15 days after receipt return the application to the applicant political subdivision or nonpublic organization for forwarding to the appropriate agency. If the application contains such matters, the commissioner shall review and comment on the application as being consistent with the plan and priorities. The commissioner shall return the application together with comments within 45 days after receipt to the applicant political subdivision or nonpublic organization for forwarding with the commissioner's comments to the appropriate agency.\nA regional development commission, metropolitan council, public transit commission, airport commission, port authority, or any other political subdivision of the state, or any nonpublic organization, may designate the commissioner as its agent to receive and disburse funds by entering into an agreement with the commissioner prescribing the terms and conditions of the receipt and expenditure of the funds in accordance with federal and state laws, rules, and regulations.\nThe provisions of this section shall not be construed as altering or amending in any way the funding procedures specified in section 161.36, 360.016 or 360.0161.",
	"repealed": false
}