{
	"id": "169A.28",
	"url": "https://www.revisor.mn.gov/statutes/cite/169A.28",
	"title": "169A.28 CONSECUTIVE SENTENCES.",
	"text": "(a) The court shall impose consecutive sentences when it sentences a person for:\n(1) violations of section 169A.20 (driving while impaired) arising out of separate courses of conduct;\n(2) a violation of section 169A.20 when the person, at the time of sentencing, is on probation for, or serving, an executed sentence for a violation of section 169A.20 or Minnesota Statutes 1998, section 169.121 (driver under the influence of alcohol or controlled substance) or 169.129 (aggravated DWI-related violations; penalty), and the prior sentence involved a separate course of conduct; or\n(3) a violation of section 169A.20 and another offense arising out of a single course of conduct that is listed in subdivision 2, paragraph (e), when the person has five or more qualified prior impaired driving incidents within the past ten years.\n(b) The requirement for consecutive sentencing in paragraph (a) does not apply if the person is being sentenced to an executed prison term for a violation of section 169A.20 (driving while impaired) under circumstances described in section 169A.24 (first-degree driving while impaired).\n(a) When a person is being sentenced for a violation of a provision listed in paragraph (e), the court may sentence the person to a consecutive term of imprisonment for a violation of any other provision listed in paragraph (e), notwithstanding the fact that the offenses arose out of the same course of conduct, subject to the limitation on consecutive sentences contained in section 609.15, subdivision 2, and except as provided in paragraphs (b) and (c).\n(b) When a person is being sentenced for a violation of section 171.09 (violation of condition of restricted license), 171.20 (operation after revocation, suspension, cancellation, or disqualification), 171.24 (driving without valid license), or 171.30 (violation of condition of limited license), the court may not impose a consecutive sentence for another violation of a provision in chapter 171 (drivers' licenses and training schools).\n(c) When a person is being sentenced for a violation of section 169.791 (failure to provide proof of insurance) or 169.797 (failure to provide vehicle insurance), the court may not impose a consecutive sentence for another violation of a provision of sections 169.79 to 169.7995.\n(d) This subdivision does not limit the authority of the court to impose consecutive sentences for crimes arising on different dates or to impose a consecutive sentence when a person is being sentenced for a crime and is also in violation of the conditions of a stayed or otherwise deferred sentence under section 609.135 (stay of imposition or execution of sentence).\n(e) This subdivision applies to misdemeanor and gross misdemeanor violations of the following if the offender has two or more prior impaired driving convictions within the past ten years:\n(1) section 169A.20, subdivision 1 (driving while impaired; impaired driving offenses);\n(2) section 169A.20, subdivision 2 (driving while impaired; test refusal offense);\n(3) section 169.791;\n(4) section 169.797;\n(5) section 171.09 (violation of condition of restricted license);\n(6) section 171.20, subdivision 2 (operation after revocation, suspension, cancellation, or disqualification);\n(7) section 171.24; and\n(8) section 171.30.\nThe court may order that the sentence imposed for a violation of section 169A.20 (driving while impaired) run consecutively to a previously imposed misdemeanor, gross misdemeanor, or felony sentence for a violation other than section 169A.20.",
	"repealed": false
}