{
	"id": "270B.14",
	"url": "https://www.revisor.mn.gov/statutes/cite/270B.14",
	"title": "270B.14 DISCLOSURE FOR PURPOSES OTHER THAN TAX ADMINISTRATION.",
	"text": "(a) On the request of the commissioner of human services, the commissioner shall disclose return information regarding taxes imposed by chapter 290, and claims for refunds under chapter 290A, to the extent provided in paragraph (b) and for the purposes set forth in paragraph (c).\n(b) Data that may be disclosed are limited to data relating to the identity, whereabouts, employment, income, and property of a person owing or alleged to be owing an obligation of child support.\n(c) The commissioner of human services may request data only for the purposes of carrying out the child support enforcement program and to assist in the location of parents who have, or appear to have, deserted their children. Data received may be used only as set forth in section 518A.83.\n(d) The commissioner shall provide the records and information necessary to administer the supplemental housing allowance to the commissioner of human services.\n(e) At the request of the commissioner of human services, the commissioner of revenue shall electronically match the Social Security or individual taxpayer identification numbers and names of participants in the telephone assistance plan operated under sections 237.69 to 237.71, with those of property tax refund filers under chapter 290A or renter's credit filers under section 290.0693, and determine whether each participant's household income is within the eligibility standards for the telephone assistance plan.\n(f) The commissioner may provide records and information collected under sections 295.50 to 295.59 to the commissioner of human services for purposes of the Medicaid Voluntary Contribution and Provider-Specific Tax Amendments of 1991, Public Law 102-234. Upon the written agreement by the United States Department of Health and Human Services to maintain the confidentiality of the data, the commissioner may provide records and information collected under sections 295.50 to 295.59 to the Centers for Medicare and Medicaid Services section of the United States Department of Health and Human Services for purposes of meeting federal reporting requirements.\n(g) The commissioner may provide records and information to the commissioner of human services as necessary to administer the early refund of refundable tax credits.\n(h) The commissioner may disclose information to the commissioner of human services as necessary for income verification for eligibility and premium payment under the MinnesotaCare program, under section 256L.05, subdivision 2, as well as the medical assistance program under chapter 256B.\n(i) The commissioner may disclose information to the commissioner of human services necessary to verify whether applicants or recipients for the Minnesota family investment program, general assistance, the Supplemental Nutrition Assistance Program (SNAP), Minnesota supplemental aid program, and child care assistance have claimed refundable tax credits under chapter 290 and the property tax refund under chapter 290A, and the amounts of the credits.\n(j) At the request of the commissioner of human services and when authorized in writing by the taxpayer, the commissioner of revenue may match the business legal name or individual legal name, and the Minnesota tax identification number, federal Employer Identification Number, or Social Security number of the applicant under section 142C.03; 245A.04, subdivision 1; or 245I.20; or license or certification holder. The commissioner of revenue may share the matching with the commissioner of human services. The matching may only be used by the commissioner of human services to determine eligibility for provider grant programs and to facilitate the regulatory oversight of license and certification holders as it relates to ownership and public funds program integrity. This paragraph applies only if the commissioner of human services and the commissioner of revenue enter into an interagency agreement for the purposes of this paragraph.\n(a) Data relating to individuals are treated as follows:\n(1) Return information may be disclosed to the Department of Employment and Economic Development to the extent provided in clause (2) and for the purposes provided in clause (3).\n(2) The data that may be disclosed is limited to the amount of gross income earned by an individual, the total amounts of earnings from each employer, and the employer's name.\n(3) Data may be requested pertaining only to individuals who have claimed benefits under sections 268.03 to 268.23 and only if the individuals are the subject of investigations based on other information available to the Department of Employment and Economic Development. Data received may be used only as set forth in section 268.19, subdivision 1, paragraph (b).\n(b) Data pertaining to corporations or other employing units may be disclosed to the Department of Employment and Economic Development to the extent necessary for the proper enforcement of chapter 268.\nThe commissioner may disclose return information relating to the taxes imposed by chapters 290 and 297A to the Department of Employment and Economic Development or a municipality with a border city enterprise zone as defined under section 469.166, but only as necessary to administer the funding limitations under section 469.169, or to the Department of Employment and Economic Development and appropriate officials from the local government units in which a qualified business is located but only as necessary to enforce the job opportunity building zone benefits under section 469.315.\n(a) The commissioner may disclose return information to a claimant agency as defined in section 270A.03, subdivision 2, with respect to returns filed under chapters 290 and 290A, as limited by paragraph (b) as necessary to accomplish the intent of chapter 270A.\n(b) The commissioner may disclose to the claimant agency only the name, address, Social Security number and the amount of refund of a debtor, as defined in section 270A.03, subdivision 4.\nThe commissioner may disclose returns and return information with respect to returns filed under chapter 290, to the extent necessary to accomplish the intent of section 289A.50, subdivision 5, providing for the withholding of income tax refunds from child support debtors pursuant to court order.\nThe commissioner may disclose information regarding the filing of a report or a return to the extent provided in and for the purpose of section 290.371.\nThe commissioner may disclose return information relating to the taxes imposed by chapter 290 to the Minnesota Racing Commission with respect to an applicant or a holder of a license issued by the Minnesota Racing Commission or an owner of a horse entered in an event licensed by the Minnesota Racing Commission.\nThe Departments of Labor and Industry and Revenue may exchange information as follows:\n(1) data used in determining whether a business is an employer or a contracting agent;\n(2) taxpayer identity information relating to employers and employees for purposes of supporting tax administration and chapters 176, 177, and 181; and\n(3) data to the extent provided in and for the purpose set out in section 176.181, subdivision 8.\nRequests for data under this section must be in the form the commissioner prescribes.\nA state agency or municipality receiving Department of Revenue data under this chapter must establish procedures for safeguarding the information.\n(a) On the request of the commissioner of health, the commissioner may disclose return information to the extent provided in paragraph (b) and for the purposes provided in paragraph (c).\n(b) Data that may be disclosed are limited to the taxpayer's identity, as defined in section 270B.01, subdivision 5.\n(c) The commissioner of health may request data only for the purposes of carrying out epidemiologic investigations, which includes conducting occupational health and safety surveillance, and locating and notifying individuals exposed to health hazards as a result of employment. Requests for data by the commissioner of health must be in writing and state the purpose of the request. Data received may be used only for the purposes of section 144.0525.\n[Repealed, 1993 c 146 art 2 s 31]\nThe commissioner may disclose to Explore Minnesota Tourism the name, address, North American Industry Classification System (NAICS) code, and telephone number of a travel or tourism related business that is authorized to collect sales and use tax. The data may be used only by Explore Minnesota Tourism to survey travel or tourism related businesses.\n[Repealed, 2014 c 275 art 1 s 139]\nFor purposes of administering and enforcing the Dry Cleaner Environmental Response and Reimbursement Law of sections 115B.47 to 115B.51, the commissioner may disclose to the commissioner of the Pollution Control Agency the names and addresses of the facilities, owners, and operators collected by the commissioner under section 115B.49, subdivision 4.\nUnder circumstances involving threat of death or physical injury to any individual, or harassment of a Department of Revenue employee, the commissioner may disclose return information to the extent necessary to apprise appropriate federal, state, or local law enforcement authorities of such circumstances. For purposes of this subdivision, \"harassment\" is purposeful conduct directed at an individual and causing an individual to feel frightened, threatened, oppressed, persecuted, or intimidated. For purposes of harassment, the return information that initially can be disclosed is limited to the name, address, and phone number of the harassing individual, the name of the employee being harassed, and the nature and circumstances of the harassment. Data disclosed under this subdivision are classified under section 13.82 once they are received by the law enforcement authority.\n(a) The commissioner may disclose to the commissioner of commerce information required to administer the Uniform Disposition of Unclaimed Property Act in sections 345.31 to 345.60, including the Social Security numbers of the taxpayers whose refunds are on the report of abandoned property submitted by the commissioner to the commissioner of commerce under section 345.41. Except for data published under section 345.42, the information received that is private or nonpublic data retains its classification, and can be used by the commissioner of commerce only for the purpose of verifying that the persons claiming the refunds are the owners.\n(b) The commissioner may disclose a return or return information to the commissioner of commerce under section 45.0135 to the extent necessary to investigate employer compliance with section 176.181.\n(a) At the request of the commissioner of veterans affairs, the commissioner may disclose return information to the extent provided in paragraph (b) and for the purposes provided in paragraph (c).\n(b) Data that may be disclosed are limited to the taxpayer's identity, as defined in section 270B.01, subdivision 5.\n(c) The commissioner of veterans affairs may request data only for the purposes of locating and notifying individual veterans of health hazards, including, but not limited to, hearing loss, chemical, biological, and radiation exposure, Gulf War Syndrome, and other injuries as they become recognized as a result of their service in the armed forces of the United States and for the purpose of notifying veterans, their dependents, and survivors of veterans of potential benefits to which they may be entitled, including, but not limited to, eligibility for health care assistance for posttraumatic stress disorder and substance use disorder treatment as well as physical injuries. Requests for data by the commissioner of veterans affairs must be in writing and state the purpose of the request.\nThe commissioner may disclose to the commissioner of management and budget returns or return information necessary in order to prepare a revenue forecast under section 16A.103.\nThe commissioner may disclose return information related to the taxes imposed by chapter 297A to the Department of Natural Resources or an authorized deputy registrar of motor vehicles only:\n(1) if the commissioner has an agreement with the commissioner of natural resources under section 297A.825, subdivision 1; and\n(2) to the extent necessary for the Department of Natural Resources or an authorized deputy registrar of motor vehicles, as agents for the commissioner, to verify that the applicable sales or use tax has been paid or that a sales tax exemption applies on the purchase of a snowmobile, all-terrain vehicle, or watercraft, and to administer sections 84.82, subdivision 10; 84.922, subdivision 11; 86B.401, subdivision 12; and 297A.825, regarding either their collection of use tax or their issuance of refunds to applicants of use tax paid to them in error.\nThe commissioner may disclose return information related to the taxes imposed by chapter 297A to the Department of Transportation only:\n(1) if the commissioner has an agreement with the commissioner of transportation under section 297A.82, subdivision 7; and\n(2) to the extent necessary for the Department of Transportation, as agent for the commissioner, to verify that the applicable sales or use tax has been paid or that a sales tax exemption applies on the lease, purchase, or sale of an aircraft by an individual or business who owns and operates the aircraft that must be registered or licensed in Minnesota under section 360.018, and to otherwise administer section 297A.82, regarding the collection of tax by the Department of Transportation.\nThe commissioner may disclose a return or return information to the MNsure board if a taxpayer makes the designation under section 290.433 on an income tax return filed with the commissioner. The commissioner must only disclose data necessary to provide the taxpayer with information about the potential eligibility for financial assistance and health insurance enrollment options under section 62V.13.\nThe commissioner may disclose a return or return information to the attorney general for the purpose of determining whether a business is an employer and to the extent necessary to enforce section 177.45 or 181.1721.",
	"repealed": false
}