{
	"id": "79.252",
	"url": "https://www.revisor.mn.gov/statutes/cite/79.252",
	"title": "79.252 ASSIGNED RISK PLAN.",
	"text": "The purpose of the assigned risk plan is to provide workers' compensation coverage to employers rejected by a licensed insurance company pursuant to subdivision 2.\nAn insurer that refuses to write insurance for an employer shall furnish the employer a written notice of refusal. The employer shall file a copy of the notice of refusal with the data service organization under contract with the commissioner pursuant to section 79.251, subdivision 4.\nAny employer that (1) is required to carry workers' compensation insurance pursuant to chapter 176 and (2) has a current written notice of refusal to insure pursuant to subdivision 2, is entitled to coverage upon making written application to the assigned risk plan, and paying the applicable premium.\n(a) Policies and contracts of coverage issued pursuant to section 79.251, subdivision 4, shall contain the usual and customary provisions of workers' compensation insurance policies, and shall be deemed to meet the mandatory workers' compensation insurance requirements of section 176.181, subdivision 2.\n(b) Policies issued by the assigned risk plan pursuant to this chapter may also provide workers' compensation coverage required under the laws of states other than Minnesota, including coverages commonly known as \"all states coverage.\" The commissioner may apply for and obtain any licensure required in any other state to issue that coverage.\nAn employer may be denied or terminated from coverage through the assigned risk plan if the employer:\n(1) applies for coverage for only a portion of the employer's statutory liability under chapter 176, excluding wrap-up policies;\n(2) has an outstanding debt due and owing to the assigned risk plan at the time of renewal arising from a prior policy;\n(3) persistently refuses to permit completion of an adequate payroll audit;\n(4) repeatedly submits misleading or erroneous payroll information; or\n(5) flagrantly disregards safety or loss control recommendations. Cancellation for nonpayment of premium may be initiated by the service contractor upon 60 days' written notice to the employer pursuant to section 176.185, subdivision 1.\nAn employer having a significant occupational disease exposure, as determined by the commissioner, to be entitled to coverage shall have physical examinations made:\n(1) of employees who have not been examined within one year of the date of application for assignment;\n(2) of new employees before hiring; and\n(3) of terminated employees. Upon request, the findings and reports of doctors making examinations, together with x-rays and other original exhibits, must be furnished to the assigned risk plan or the Department of Labor and Industry.\nAssigned risk policies and contracts of coverage are subject to taxation under chapter 297I, and special compensation fund assessments under Minnesota Statutes 1990, section 176.131, subdivision 10. The assigned risk plan shall be a member of the reinsurance association for the purposes of sections 79.34 to 79.40 and may select either retention limit provided in section 79.34, subdivision 2.\nThe commissioner may adopt rules as may be necessary to implement section 79.251 and this section.",
	"repealed": false
}