{
	"id": "142G.45",
	"url": "https://www.revisor.mn.gov/statutes/cite/142G.45",
	"title": "142G.45 FAIR HEARINGS.",
	"text": "Caregivers receiving a notice of intent to sanction or a notice of adverse action that includes a sanction, reduction in benefits, suspension of benefits, denial of benefits, or termination of benefits may request a fair hearing. A request for a fair hearing must be submitted in writing to the county agency or to the commissioner and must be mailed within 30 days after a participant or former participant receives written notice of the agency's action or within 90 days when a participant or former participant shows good cause for not submitting the request within 30 days. A former participant who receives a notice of adverse action due to an overpayment may appeal the adverse action according to the requirements in this section. Issues that may be appealed are:\n(1) the amount of the assistance payment;\n(2) a suspension, reduction, denial, or termination of assistance;\n(3) the basis for an overpayment, the calculated amount of an overpayment, and the level of recoupment;\n(4) the eligibility for an assistance payment; and\n(5) the use of protective or vendor payments under section 142G.35, subdivision 2, clauses (1) to (3).\nA county agency must not reduce, suspend, or terminate payment when an aggrieved participant requests a fair hearing prior to the effective date of the adverse action or within ten days of the mailing of the notice of adverse action, whichever is later, unless the participant requests in writing not to receive continued assistance pending a hearing decision. Assistance issued pending a fair hearing is subject to recovery under section 256P.08 when as a result of the fair hearing decision the participant is determined ineligible for assistance or the amount of the assistance received. A county agency may increase or reduce an assistance payment while an appeal is pending when the circumstances of the participant change and are not related to the issue on appeal. The commissioner's order is binding on a county agency. No additional notice is required to enforce the commissioner's order.\nA county agency shall reimburse appellants for reasonable and necessary expenses of attendance at the hearing, such as child care and transportation costs and for the transportation expenses of the appellant's witnesses and representatives to and from the hearing. Reasonable and necessary expenses do not include legal fees. Fair hearings must be conducted at a reasonable time and date by an impartial human services judge employed by the department. The hearing may be conducted by telephone or at a site that is readily accessible to persons with disabilities.\nThe appellant may introduce new or additional evidence relevant to the issues on appeal. Recommendations of the human services judge and decisions of the commissioner must be based on evidence in the hearing record and are not limited to a review of the county agency action.",
	"repealed": false
}