{
	"id": "169A.276",
	"url": "https://www.revisor.mn.gov/statutes/cite/169A.276",
	"title": "169A.276 MANDATORY PENALTIES; FELONY VIOLATIONS.",
	"text": "(a) The court shall sentence a person who is convicted of a violation of section 169A.20 (driving while impaired) under the circumstances described in section 169A.24 (first-degree driving while impaired) to imprisonment for not less than three years. In addition, the court may order the person to pay a fine of not more than $14,000.\n(b) The court may stay execution of this mandatory sentence as provided in subdivision 2 (stay of mandatory sentence), but may not stay imposition or adjudication of the sentence or impose a sentence that has a duration of less than three years.\n(c) An offender committed to the custody of the commissioner of corrections under this subdivision is not eligible for release as provided in section 241.26, 244.065, 244.12, or 244.17, unless the offender has successfully completed treatment recommendations as determined by a comprehensive substance use disorder assessment while incarcerated.\n(d) Notwithstanding the statutory maximum sentence provided in section 169A.24 (first-degree driving while impaired), when the court commits a person to the custody of the commissioner of corrections under this subdivision, it shall provide that after the person has been released from prison the commissioner shall place the person on conditional release for five years. The commissioner shall impose any conditions of release that the commissioner deems appropriate including, but not limited to, successful completion of an intensive probation program as described in section 169A.74 (pilot programs of intensive probation for repeat DWI offenders). If the person fails to comply with any condition of release, the commissioner may revoke the person's conditional release and order the person to serve all or part of the remaining portion of the conditional release term in prison. The commissioner may not dismiss the person from supervision before the conditional release term expires. Except as otherwise provided in this section, conditional release is governed by provisions relating to supervised release. The failure of a court to direct the commissioner of corrections to place the person on conditional release, as required in this paragraph, does not affect the applicability of the conditional release provisions to the person.\n(e) The commissioner shall require persons placed on supervised or conditional release under this subdivision to pay as much of the costs of the supervision as possible. The commissioner shall develop appropriate standards for this.\nThe provisions of sections 169A.275 (mandatory penalties; nonfelony violations), subdivision 3 or 4, and subdivision 5, and 169A.283 (stay of execution of sentence), apply if the court stays execution of the sentence under subdivision 1 (mandatory prison sentence). In addition, the provisions of section 169A.277 (long-term monitoring) may apply.\nThe court may not stay the execution of the driver's license revocation provisions of section 169A.54 (impaired driving convictions and adjudications; administrative penalties).",
	"repealed": false
}