{
	"id": "518A.72",
	"url": "https://www.revisor.mn.gov/statutes/cite/518A.72",
	"title": "518A.72 CONTEMPT PROCEEDINGS FOR NONPAYMENT OF SUPPORT.",
	"text": "If a person against whom an order or decree for support has been entered under this chapter, chapter 256, chapter 518, or a comparable law from another jurisdiction, is in arrears in court-ordered child support or maintenance payments in an amount equal to or greater than three times the obligor's total monthly support and maintenance payments and is not in compliance with a written payment plan approved by the court, a child support magistrate, or the public authority, the person may be cited and punished by the court for contempt under section 518A.39, chapter 588, or this section. Failure to comply with a seek employment order entered under section 518A.64 is evidence of willful failure to pay support.\n(a) If a court cites a person for contempt under this section, and the obligor lives in a county that contracts with the commissioner of children, youth, and families under section 142A.30, the court may order the performance of community service work up to 32 hours per week for six weeks for each finding of contempt if the obligor:\n(1) is able to work full time;\n(2) works an average of less than 32 hours per week; and\n(3) has actual weekly gross income averaging less than 40 times the federal minimum hourly wage under United States Code, title 29, section 206(a)(1), or is voluntarily earning less than the obligor has the ability to earn, as determined by the court.\nAn obligor is presumed to be able to work full time. The obligor has the burden of proving inability to work full time.\n(b) A person ordered to do community service work under paragraph (a) may, during the six-week period, apply to the court, a child support magistrate, or the public authority to be released from the community service work requirement if the person:\n(1) provides proof to the court, a child support magistrate, or the public authority that the person is gainfully employed and submits to an order for income withholding under section 518A.53;\n(2) enters into a written payment plan regarding both current support and arrearages approved by the court, a child support magistrate, or the public authority; or\n(3) provides proof to the court, a child support magistrate, or the public authority that, subsequent to entry of the order, the person's circumstances have so changed that the person is no longer able to fulfill the terms of the community service order.\nThe performance of community service work does not relieve a child support obligor of any unpaid accrued or accruing support obligation.",
	"repealed": false
}