{
	"id": "297A.90",
	"url": "https://www.revisor.mn.gov/statutes/cite/297A.90",
	"title": "297A.90 INTERSTATE MOTOR CARRIERS AS RETAILERS.",
	"text": "(a) A person who is engaged in interstate for-hire transportation of tangible personal property or passengers by motor vehicle may, under rules prescribed by the commissioner, register as a retailer and pay the taxes imposed by this chapter in accordance with this section. Any taxes paid under this section are use taxes.\n(b) As used in this section, \"person\" means:\n(1) one who possesses a certificate or permit or has completed a registration process that authorizes for-hire transportation of property or passengers from the United States Department of Transportation or the Department of Transportation;\n(2) one who transports commodities defined as \"exempt\" in for-hire transportation in interstate commerce; or\n(3) one who transports tangible personal property in interstate commerce, pursuant to contracts with persons described in clause (1) or (2).\nPersons qualifying under clause (2) or (3) must maintain on a current basis the same type of mileage records that are required by persons specified in clause (1) by the United States Department of Transportation.\n(c) Persons who in the course of their business are transporting solely their own goods in interstate commerce may also register as retailers under rules prescribed by the commissioner and pay the taxes imposed by this chapter in accordance with this section.\n(a) Persons who are registered as retailers may make purchases in this state or import property into this state without payment of the sales or use taxes imposed by this chapter at the time of purchase or importation, if the purchases or importations come within the provisions of this section and are made in strict compliance with the rules of the commissioner.\n(b) A person described in subdivision 1 may elect to pay directly to the commissioner any sales or use tax that may be due under this chapter for the acquisition of mobile transportation equipment and parts and accessories attached or to be attached to such equipment registered under section 168.187.\n(c) The total cost of such equipment and parts and accessories attached or to be attached to such equipment must be multiplied by a fraction. The numerator of the fraction is the Minnesota mileage as reported on the current pro rata application provided for in section 168.187 and the denominator of the fraction is the total mileage reported on the current pro rata registration application. The amount so determined must be multiplied by the tax rate to obtain the tax due.\nIn computing the tax under this section \"sales price\" does not include the amount of any taxes imposed directly on the consumer that are separately stated on the invoice, bill of sale, or similar document given to the purchaser.\n(d) A retailer covered by this section shall make a return and remit to the commissioner the tax due for the preceding calendar month in accordance with sections 289A.11 and 289A.20, subdivision 4.\nA person who has paid the tax under this chapter or chapter 297B and who meets the requirements of this section at the time of the sale, but was not registered under this section at the time of the sale, may register as a retailer, make a return, and file for a refund of the difference between the tax calculated under this chapter or chapter 297B and the tax calculated under subdivision 2.\nNotwithstanding subdivisions 1 to 3, the commissioner may enter into an agreement with the commissioner of public safety whereby, upon approval of both commissioners, the commissioner of public safety shall collect the sales tax on motor vehicles from persons defined in subdivision 1. For the purpose of collecting the tax, the commissioner of public safety shall act as the agent of the commissioner of revenue and shall be subject to all rules consistent with this chapter that may be prescribed by the commissioner.",
	"repealed": false
}