{
	"id": "144.5509",
	"url": "https://www.revisor.mn.gov/statutes/cite/144.5509",
	"title": "144.5509 RADIATION THERAPY FACILITY CONSTRUCTION.",
	"text": "(a) A radiation therapy facility may be constructed only by an entity owned, operated, or controlled by a hospital licensed according to sections 144.50 to 144.56 either alone or in cooperation with another entity.\n(b) Notwithstanding paragraph (a), there shall be a moratorium on the construction of any radiation therapy facility located in the following counties: Hennepin, Ramsey, Dakota, Washington, Anoka, Carver, Scott, St. Louis, Sherburne, Benton, Stearns, Chisago, Isanti, and Wright. This paragraph does not apply to the relocation or reconstruction of an existing facility owned by a hospital if the relocation or reconstruction is within one mile of the existing facility. This paragraph does not apply to a radiation therapy facility that is being built attached to a community hospital in Wright County and meets the following conditions prior to August 1, 2007: the capital expenditure report required under section 62J.17 has been filed with the commissioner of health; a timely construction schedule is developed, stipulating dates for beginning, achieving various stages, and completing construction; and all zoning and building permits applied for. Beginning January 1, 2013, this paragraph does not apply to any construction necessary to relocate a radiation therapy machine from a community hospital-owned radiation therapy facility located in the city of Maplewood to a community hospital campus in the city of Woodbury within the same health system. This paragraph expires December 31, 2020.\n(c) Notwithstanding paragraph (a), after December 31, 2020, the construction of a radiation therapy facility located in any of the following counties: Hennepin, Ramsey, Dakota, Washington, Anoka, Carver, Scott, St. Louis, Sherburne, Benton, Stearns, Chisago, Isanti, and Wright, may occur only if the following requirements are met:\n(1) the entity constructing the radiation therapy facility is controlled by or is under common control with a hospital licensed under sections 144.50 to 144.56; and\n(2) the new radiation therapy facility is located outside of a 15-mile radius from any existing radiation therapy facility.\n(d) Any referring physician located within a county identified in paragraph (c) must provide each patient who is in need of radiation therapy services with a list of all radiation therapy facilities located within the counties identified in paragraph (c). Physicians with a financial interest in any radiation therapy facility must disclose to the patient the existence of the interest.\n(e) For purposes of this section, \"controlled by\" or \"under common control with\" means the possession, direct or indirect, of the power to direct or cause the direction of the policies, operations, or activities of an entity, through the ownership of, or right to vote or to direct the disposition of shares, membership interests, or ownership interests of the entity.\n(f) For purposes of this section, \"financial interest in any radiation therapy facility\" means a direct or indirect ownership or investment interest in a radiation therapy facility or a compensation arrangement with a radiation therapy facility.\n(g) This section does not apply to the relocation or reconstruction of an existing radiation therapy facility if:\n(1) the relocation or reconstruction of the facility remains owned by the same entity;\n(2) the relocation or reconstruction is located within one mile of the existing facility; and\n(3) the period in which the existing facility is closed and the relocated or reconstructed facility begins providing services does not exceed 12 months.",
	"repealed": false
}