{
	"id": "256B.056",
	"url": "https://www.revisor.mn.gov/statutes/cite/256B.056",
	"title": "256B.056 ELIGIBILITY REQUIREMENTS FOR MEDICAL ASSISTANCE.",
	"text": "(a) To be eligible for medical assistance, a person must reside in Minnesota, or, if absent from the state, be deemed to be a resident of Minnesota, in accordance with Code of Federal Regulations, title 42, section 435.403.\n(b) The commissioner shall identify individuals who are enrolled in medical assistance and who are absent from the state for more than 30 consecutive days, but who continue to qualify for medical assistance in accordance with paragraph (a).\n(c) If the individual is absent from the state for more than 30 consecutive days but still deemed a resident of Minnesota in accordance with paragraph (a), any covered service provided to the individual must be paid through the fee-for-service system and not through the managed care capitated rate payment system under section 256B.69 or 256L.12.\n(a)(1) Unless specifically required by state law or rule or federal law or regulation, the methodologies used in counting income and assets to determine eligibility for medical assistance for persons whose eligibility category is based on blindness, disability, or age of 65 or more years, the methodologies for the Supplemental Security Income program shall be used, except as provided in clause (2) and subdivision 3, paragraph (a), clause (6).\n(2) State tax credits, rebates, and refunds must not be counted as income. State tax credits, rebates, and refunds must not be counted as assets for a period of 12 months after the month of receipt.\n(3) Increases in benefits under title II of the Social Security Act shall not be counted as income for purposes of this subdivision until July 1 of each year. Effective upon federal approval, for children eligible under section 256B.055, subdivision 12, or for home and community-based waiver services whose eligibility for medical assistance is determined without regard to parental income, child support payments, including any payments made by an obligor in satisfaction of or in addition to a temporary or permanent order for child support, and Social Security payments are not counted as income.\n(b)(1) The modified adjusted gross income methodology as defined in United States Code, title 42, section 1396a(e)(14), shall be used for eligibility categories based on:\n(i) children under age 19 and their parents and relative caretakers as defined in section 256B.055, subdivision 3a;\n(ii) children ages 19 to 20 as defined in section 256B.055, subdivision 16;\n(iii) pregnant women as defined in section 256B.055, subdivision 6;\n(iv) infants as defined in sections 256B.055, subdivision 10, and 256B.057, subdivision 1; and\n(v) adults without children as defined in section 256B.055, subdivision 15.\nFor these purposes, a \"methodology\" does not include an asset or income standard, or accounting method, or method of determining effective dates.\n(2) For individuals whose income eligibility is determined using the modified adjusted gross income methodology in clause (1):\n(i) the commissioner shall subtract from the individual's modified adjusted gross income an amount equivalent to five percent of the federal poverty guidelines; and\n(ii) the individual's current monthly income and household size is used to determine eligibility for the 12-month eligibility period. If an individual's income is expected to vary month to month, eligibility is determined based on the income predicted for the 12-month eligibility period.\nThe $20 general income disregard allowed under the Supplemental Security Income program is included in the standard and shall not be allowed as a deduction from income for a person eligible under section 256B.055, subdivisions 7, 7a, and 12.\n(a) The commissioner shall adjust the income standards under this section each July 1 by the annual update of the federal poverty guidelines following publication by the United States Department of Health and Human Services except that the income standards shall not go below those in effect on July 1, 2009.\n(b) For children age 18 or under, annual gifts of $2,000 or less by a tax-exempt organization to or for the benefit of the child with a life-threatening illness must be disregarded from income.\nThe commissioner shall disregard as income any portion of a monetary gift received by an applicant or enrollee that is designated to purchase a prosthetic device not covered by insurance, other third-party payers, or medical assistance.\nThe homestead shall be excluded for the first six calendar months of a person's stay in a long-term care facility and shall continue to be excluded for as long as the recipient can be reasonably expected to return to the homestead. For purposes of this subdivision, \"reasonably expected to return to the homestead\" means the recipient's attending physician, advanced practice registered nurse, or physician assistant has certified that the expectation is reasonable, and the recipient can show that the cost of care upon returning home will be met through medical assistance or other sources. The homestead shall continue to be excluded for persons residing in a long-term care facility if it is used as a primary residence by one of the following individuals:\n(1) the spouse;\n(2) a child under age 21;\n(3) a child of any age who is blind or permanently and totally disabled as defined in the Supplemental Security Income program;\n(4) a sibling who has equity interest in the home and who resided in the home for at least one year immediately before the date of the person's admission to the facility; or\n(5) a child of any age or a grandchild of any age who resided in the home for at least two years immediately before the date of the person's admission to the facility, and who provided care to the person that permitted the person to reside at home rather than in an institution.\n(a) Effective for requests of medical assistance payment of long-term care services filed on or after July 1, 2006, and for renewals on or after July 1, 2006, for persons who received payment of long-term care services under a request filed on or after January 1, 2006, the equity interest in the home of a person whose eligibility for long-term care services is determined on or after January 1, 2006, shall not exceed $500,000, unless it is the lawful residence of the person's spouse or child who is under age 21, or a child of any age who is blind or permanently and totally disabled as defined in the Supplemental Security Income program. The amount specified in this paragraph shall be increased beginning in year 2011, from year to year based on the percentage increase in the Consumer Price Index for all urban consumers (all items; United States city average), rounded to the nearest $1,000.\n(b) For purposes of this subdivision, a \"home\" means any real or personal property interest, including an interest in an agricultural homestead as defined under section 273.124, subdivision 1, that, at the time of the request for medical assistance payment of long-term care services, is the primary dwelling of the person or was the primary dwelling of the person before receipt of long-term care services began outside of the home.\n(c) A person denied or terminated from medical assistance payment of long-term care services because the person's home equity exceeds the home equity limit may seek a waiver based upon a hardship by filing a written request with the county agency. Hardship is an imminent threat to the person's health and well-being that is demonstrated by documentation of no alternatives for payment of long-term care services. The county agency shall make a decision regarding the written request to waive the home equity limit within 30 days if all necessary information has been provided. The county agency shall send the person and the person's representative a written notice of decision on the request for a demonstrated hardship waiver that also advises the person of appeal rights under the fair hearing process of section 256.045.\n(a) To be eligible for medical assistance, a person must not individually own more than $3,000 in assets, or if a member of a household with two family members, spouses, or parent and child, the household must not own more than $6,000 in assets, plus $200 for each additional legal dependent. In addition to these maximum amounts, an eligible individual or family may accrue interest on these amounts, but they must be reduced to the maximum at the time of an eligibility redetermination. The accumulation of the clothing and personal needs allowance according to section 256B.35 must also be reduced to the maximum at the time of the eligibility redetermination. The value of assets that are not considered in determining eligibility for medical assistance is the value of those assets excluded under the Supplemental Security Income program for aged, blind, and disabled persons, with the following exceptions:\n(1) household goods and personal effects are not considered;\n(2) capital and operating assets of a trade or business that the local agency determines are necessary to the person's ability to earn an income are not considered;\n(3) motor vehicles are excluded to the same extent excluded by the Supplemental Security Income program;\n(4) assets designated as burial expenses are excluded to the same extent excluded by the Supplemental Security Income program. Burial expenses funded by annuity contracts or life insurance policies must irrevocably designate the individual's estate as contingent beneficiary to the extent proceeds are not used for payment of selected burial expenses;\n(5) for a person who no longer qualifies as an employed person with a disability due to loss of earnings, assets allowed while eligible for medical assistance under section 256B.057, subdivision 9, are not considered for 12 months, beginning with the first month of ineligibility as an employed person with a disability;\n(6) a designated employment incentives asset account is disregarded when determining eligibility for medical assistance for a person age 65 years or older under section 256B.055, subdivision 7. An employment incentives asset account must only be designated by a person who has been enrolled in medical assistance under section 256B.057, subdivision 9, for a 24-consecutive-month period. A designated employment incentives asset account contains qualified assets owned by the person in the last month of enrollment in medical assistance under section 256B.057, subdivision 9. Qualified assets include retirement and pension accounts, medical expense accounts, and up to $17,000 of the person's other nonexcluded liquid assets. An employment incentives asset account is no longer designated when a person loses medical assistance eligibility for a calendar month or more before turning age 65. A person who loses medical assistance eligibility before age 65 can establish a new designated employment incentives asset account by establishing a new 24-consecutive-month period of enrollment under section 256B.057, subdivision 9. Persons eligible under this clause are not subject to the provisions in section 256B.059; and\n(7) effective July 1, 2009, certain assets owned by American Indians are excluded as required by section 5006 of the American Recovery and Reinvestment Act of 2009, Public Law 111-5. For purposes of this clause, an American Indian is any person who meets the definition of Indian according to Code of Federal Regulations, title 42, section 447.50.\n(b) No asset limit shall apply to persons eligible under sections 256B.055, subdivision 15, and 256B.057, subdivision 9.\n[See Note.]\n[Repealed, 1992 c 513 art 7 s 135]\n(a) It is the public policy of this state that individuals use all available resources to pay for the cost of long-term care services, as defined in section 256B.0595, before turning to Minnesota health care program funds, and that trust instruments should not be permitted to shield available resources of an individual or an individual's spouse from such use.\n(b) A \"medical assistance qualifying trust\" is a revocable or irrevocable trust, or similar legal device, established on or before August 10, 1993, by a person or the person's spouse under the terms of which the person receives or could receive payments from the trust principal or income and the trustee has discretion in making payments to the person from the trust principal or income. Notwithstanding that definition, a medical assistance qualifying trust does not include: (1) a trust set up by will; (2) a trust set up before April 7, 1986, solely to benefit a person with a developmental disability living in an intermediate care facility for persons with developmental disabilities; or (3) a trust set up by a person with payments made by the Social Security Administration pursuant to the United States Supreme Court decision in Sullivan v. Zebley, 110 S. Ct. 885 (1990). The maximum amount of payments that a trustee of a medical assistance qualifying trust may make to a person under the terms of the trust is considered to be available assets to the person, without regard to whether the trustee actually makes the maximum payments to the person and without regard to the purpose for which the medical assistance qualifying trust was established.\n(c) Trusts established after August 10, 1993, are treated according to United States Code, title 42, section 1396p(d).\n(d) For purposes of paragraph (e), a pooled trust means a trust established under United States Code, title 42, section 1396p(d)(4)(C).\n(e) A beneficiary's interest in a pooled trust is considered an available asset unless the trust provides that upon the death of the beneficiary or termination of the trust during the beneficiary's lifetime, whichever is sooner, the department receives any amount, up to the amount of medical assistance benefits paid on behalf of the beneficiary, remaining in the beneficiary's trust account after a deduction for reasonable administrative fees and expenses, and an additional remainder amount. The retained remainder amount of the subaccount must not exceed ten percent of the account value at the time of the beneficiary's death or termination of the trust, and must only be used for the benefit of disabled individuals who have a beneficiary interest in the pooled trust.\n(f) Trusts may be established on or after December 12, 2016, by a person who has been determined to be disabled, according to United States Code, title 42, section 1396p(d)(4)(A), as amended by section 5007 of the 21st Century Cures Act, Public Law 114-255.\n[See Note.]\n(a) A household of two or more persons must not own more than $20,000 in total net assets, and a household of one person must not own more than $10,000 in total net assets. In addition to these maximum amounts, an eligible individual or family may accrue interest on these amounts, but they must be reduced to the maximum at the time of an eligibility redetermination. The value of assets that are not considered in determining eligibility for medical assistance for families and children is the value of those assets excluded under the AFDC state plan as of July 16, 1996, as required by the Personal Responsibility and Work Opportunity Reconciliation Act of 1996 (PRWORA), Public Law 104-193, with the following exceptions:\n(1) household goods and personal effects are not considered;\n(2) capital and operating assets of a trade or business up to $200,000 are not considered;\n(3) one motor vehicle is excluded for each person of legal driving age who is employed or seeking employment;\n(4) assets designated as burial expenses are excluded to the same extent they are excluded by the Supplemental Security Income program;\n(5) court-ordered settlements up to $10,000 are not considered;\n(6) individual retirement accounts and funds are not considered;\n(7) assets owned by children are not considered; and\n(8) certain assets owned by American Indians are excluded as required by section 5006 of the American Recovery and Reinvestment Act of 2009, Public Law 111-5. For purposes of this clause, an American Indian is any person who meets the definition of Indian according to Code of Federal Regulations, title 42, section 447.50.\n(b) Paragraph (a) applies only to parents and caretaker relatives who qualify for medical assistance under subdivision 5.\n(c) Eligibility for children under age 21 must be determined without regard to the asset limitations described in paragraphs (a) and (b) and subdivision 3.\nAssets in excess of the limits in subdivisions 3 to 3c may be reduced to allowable limits as follows:\n(a) Assets may be reduced in any of the three calendar months before the month of application in which the applicant seeks coverage by paying bills for health services that are incurred in the retroactive period for which the applicant seeks eligibility, starting with the oldest bill. After assets are reduced to allowable limits, eligibility begins with the next dollar of MA-covered health services incurred in the retroactive period. Applicants reducing assets under this subdivision who also have excess income shall first spend excess assets to pay health service bills and may meet the income spenddown on remaining bills.\n(b) Assets may be reduced beginning the month of application by paying bills for health services that are incurred during the period specified in Minnesota Rules, part 9505.0090, subpart 2, that would otherwise be paid by medical assistance. After assets are reduced to allowable limits, eligibility begins with the next dollar of medical assistance covered health services incurred in the period. Applicants reducing assets under this subdivision who also have excess income shall first spend excess assets to pay health service bills and may meet the income spenddown on remaining bills.\n[See Note.]\nAn entrance fee paid by an individual to a continuing care retirement or life care community shall be treated as an available asset to the extent that:\n(1) the individual has the ability to use the entrance fee, or the contract provides that the entrance fee may be used, to pay for care should other resources or income of the individual be insufficient to pay for care;\n(2) the individual is eligible for a refund of any remaining entrance fees when the individual dies or terminates the continuing care retirement or life care community contract and leaves the community; and\n(3) the entrance fee does not confer an ownership interest in the continuing care retirement or life care community.\n(a) To be eligible for medical assistance, a person eligible under section 256B.055, subdivisions 7, 7a, and 12, may have income up to 100 percent of the federal poverty guidelines. Effective January 1, 2000, and each successive January, recipients of Supplemental Security Income may have an income up to the Supplemental Security Income standard in effect on that date.\n(b) To be eligible for medical assistance under section 256B.055, subdivision 3a, a parent or caretaker relative may have an income up to 133 percent of the federal poverty guidelines for the household size.\n(c) To be eligible for medical assistance under section 256B.055, subdivision 15, a person may have an income up to 133 percent of federal poverty guidelines for the household size.\n(d) To be eligible for medical assistance under section 256B.055, subdivision 16, a child age 19 to 20 may have an income up to 133 percent of the federal poverty guidelines for the household size.\n(e) To be eligible for medical assistance under section 256B.055, subdivision 3a, a child under age 19 may have income up to 275 percent of the federal poverty guidelines for the household size.\n(f) In computing income to determine eligibility of persons under paragraphs (a) to (e) who are not residents of long-term care facilities, the commissioner shall disregard increases in income as required by Public Laws 94-566, section 503; 99-272; and 99-509. For persons eligible under paragraph (a), veteran aid and attendance benefits and Veterans Administration unusual medical expense payments are considered income to the recipient.\nFor purposes of verification, an individual is not required to make a good faith effort to sell a life estate that is not excluded under subdivision 2 and the life estate shall be deemed not salable unless the owner of the remainder interest intends to purchase the life estate, or the owner of the life estate and the owner of the remainder sell the entire property. This subdivision applies only for the purpose of determining eligibility for medical assistance, and does not apply to the valuation of assets owned by either the institutional spouse or the community spouse under section 256B.059, subdivision 2.\nThe local agency shall not require a monthly income verification form for a recipient who is a resident of a long-term care facility and who has monthly earned income of $80 or less. The commissioner or county agency shall use electronic verification as the primary method of income verification. If there is a discrepancy between reported income and electronically verified income, an individual may be required to submit additional verification.\nA person who has excess income is eligible for medical assistance if the person has expenses for medical care that are more than the amount of the person's excess income, computed by deducting incurred medical expenses from the excess income to reduce the excess to the income standard specified in subdivision 5c. The person shall elect to have the medical expenses deducted at the beginning of a one-month budget period or at the beginning of a six-month budget period. The commissioner shall allow persons eligible for assistance on a one-month spenddown basis under this subdivision to elect to pay the monthly spenddown amount in advance of the month of eligibility to the state agency in order to maintain eligibility on a continuous basis. If the recipient does not pay the spenddown amount on or before the 20th of the month, the recipient is ineligible for this option for the following month. The local agency shall code the Medicaid Management Information System (MMIS) to indicate that the recipient has elected this option. The state agency shall convey recipient eligibility information relative to the collection of the spenddown to providers through the Electronic Verification System (EVS). A recipient electing advance payment must pay the state agency the monthly spenddown amount on or before the 20th of the month in order to be eligible for this option in the following month.\nRecipients of medical assistance who receive only fixed unearned or excluded income, when that income is excluded from consideration as income or unvarying in amount and timing of receipt throughout the year, shall report and verify their income annually.\n[Repealed, 2013 c 108 art 1 s 68]\n(a) The excess income standard for parents and caretaker relatives, pregnant women, infants, and children ages two through 20 is the standard specified in subdivision 4, paragraph (b).\n(b) The excess income standard for a person whose eligibility is based on blindness, disability, or age of 65 or more years shall equal:\n(1) 81 percent of the federal poverty guidelines; and\n(2) effective July 1, 2022, the standard specified in subdivision 4, paragraph (a).\n\"Medical assistance room and board rate\" means an amount equal to 81 percent of the federal poverty guideline for a single individual living alone in the community less the medical assistance personal needs allowance under section 256B.35. The amount of the room and board rate, as defined in section 256I.03, subdivision 14a, that exceeds the medical assistance room and board rate is considered a remedial care cost. A remedial care cost may be used to meet a spenddown obligation under this section. The medical assistance room and board rate is to be adjusted on January 1 of each year.\nTo be eligible for medical assistance a person must have applied or must agree to apply all proceeds received or receivable by the person or the person's legal representative from any third party liable for the costs of medical care. By accepting or receiving assistance, the person is deemed to have assigned the person's rights to medical support and third-party payments as required by title 19 of the Social Security Act. Persons must cooperate with the state in establishing paternity and obtaining third-party payments. By accepting medical assistance, a person assigns to the Department of Human Services all rights the person may have to medical support or payments for medical expenses from any other person or entity on their own or their dependent's behalf and agrees to cooperate with the state in establishing paternity and obtaining third-party payments. Any rights or amounts so assigned shall be applied against the cost of medical care paid for under this chapter. Any assignment takes effect upon the determination that the applicant is eligible for medical assistance and up to three months prior to the date of application if the applicant is determined eligible for and receives medical assistance benefits. The application must contain a statement explaining this assignment. For the purposes of this section, \"the Department of Human Services or the state\" includes prepaid health plans under contract with the commissioner according to sections 256B.69 and 256L.12 and Minnesota Statutes 2009 Supplement, section 256D.03, subdivision 4, paragraph (c); children's mental health collaboratives under section 245.493; demonstration projects for persons with disabilities under section 256B.77; nursing facilities under the alternative payment demonstration project under section 256B.434; and the county-based purchasing entities under section 256B.692.\n(a) Eligibility is available for the month of application and for three months prior to application if the person was eligible in those prior months. A redetermination of eligibility must occur every 12 months.\n(b) Notwithstanding any other law to the contrary:\n(1) a child under 19 years of age who is determined eligible for medical assistance must remain eligible for a period of 12 months;\n(2) a child 19 years of age and older but under 21 years of age who is determined eligible for medical assistance must remain eligible for a period of 12 months; and\n(3) a child under six years of age who is determined eligible for medical assistance must remain eligible through the month in which the child reaches six years of age.\n(c) A child's eligibility under paragraph (b) may be terminated earlier if:\n(1) the child or the child's representative requests voluntary termination of eligibility;\n(2) the child ceases to be a resident of this state;\n(3) the child dies;\n(4) the child attains the maximum age; or\n(5) the agency determines eligibility was erroneously granted at the most recent eligibility determination due to agency error or fraud, abuse, or perjury attributed to the child or the child's representative.\n(d) For a person eligible for an insurance affordability program as defined in section 256B.02, subdivision 19, who reports a change that makes the person eligible for medical assistance, eligibility is available for the month the change was reported and for three months prior to the month the change was reported, if the person was eligible in those prior months.\n[See Note.]\n(a) The commissioner shall make an annual redetermination of eligibility based on information contained in the enrollee's case file and other information available to the agency, including but not limited to information accessed through an electronic database, without requiring the enrollee to submit any information when sufficient data is available for the agency to renew eligibility.\n(b) If the commissioner cannot renew eligibility in accordance with paragraph (a), the commissioner must provide the enrollee with a prepopulated renewal form containing eligibility information available to the agency and permit the enrollee to submit the form with any corrections or additional information to the agency and sign the renewal form via any of the modes of submission specified in section 256B.04, subdivision 18.\n(c) An enrollee who is terminated for failure to complete the renewal process may subsequently submit the renewal form and required information within four months after the date of termination and have coverage reinstated without a lapse, if otherwise eligible under this chapter. The local agency may close the enrollee's case file if the required information is not submitted within four months of termination.\n(d) Notwithstanding paragraph (a), a person who is eligible under subdivision 5 shall be subject to a review of the person's income every six months.\nTo be eligible for medical assistance, applicants and recipients must cooperate with the state and local agency to identify potentially liable third-party payers and assist the state in obtaining third-party payments, unless good cause for noncooperation is determined according to Code of Federal Regulations, title 42, part 433.147. \"Cooperation\" includes identifying any third party who may be liable for care and services provided under this chapter to the applicant, recipient, or any other family member for whom application is made and providing relevant information to assist the state in pursuing a potentially liable third party. Cooperation also includes providing information about a group health plan for which the person may be eligible and if the plan is determined cost-effective by the state agency and premiums are paid by the local agency or there is no cost to the recipient, they must enroll or remain enrolled with the group. For purposes of this subdivision, coverage provided by the Minnesota Comprehensive Health Association under chapter 62E shall not be considered group health plan coverage or cost-effective by the state and local agency. Cost-effective insurance premiums approved for payment by the state agency and paid by the local agency are eligible for reimbursement according to section 256B.19.\nThe state agency must be given notice of monetary claims against a person, entity, or corporation that may be liable to pay all or part of the cost of medical care when the state agency has paid or becomes liable for the cost of that care. Notice must be given according to paragraphs (a) to (d).\n(a) An applicant for medical assistance shall notify the state or local agency of any possible claims when the applicant submits the application. A recipient of medical assistance shall notify the state or local agency of any possible claims when those claims arise.\n(b) A person providing medical care services to a recipient of medical assistance shall notify the state agency when the person has reason to believe that a third party may be liable for payment of the cost of medical care.\n(c) A party to a claim that may be assigned to the state agency under this section shall notify the state agency of its potential assignment claim in writing at each of the following stages of a claim:\n(1) when a claim is filed;\n(2) when an action is commenced; and\n(3) when a claim is concluded by payment, award, judgment, settlement, or otherwise.\n(d) Every party involved in any stage of a claim under this subdivision is required to provide notice to the state agency at that stage of the claim. However, when one of the parties to the claim provides notice at that stage, every other party to the claim is deemed to have provided the required notice for that stage of the claim. If the required notice under this paragraph is not provided to the state agency, all parties to the claim are deemed to have failed to provide the required notice. A party to the claim includes the injured person or the person's legal representative, the plaintiff, the defendants, or persons alleged to be responsible for compensating the injured person or plaintiff, and any other party to the cause of action or claim, regardless of whether the party knows the state agency has a potential or actual assignment claim.\n(a) The commissioner shall require women who are applying for the continuation of medical assistance coverage following the end of the 12-month postpartum period to update their income and asset information and to submit any required income or asset verification.\n(b) The commissioner shall determine the eligibility of private-sector health care coverage for infants less than one year of age eligible under section 256B.055, subdivision 10, or 256B.057, subdivision 1, paragraph (c), and shall pay for private-sector coverage if this is determined to be cost-effective.\n(c) The commissioner shall verify assets and income for all applicants, and for all recipients upon renewal.\n(d) The commissioner shall utilize information obtained through the electronic service established by the secretary of the United States Department of Health and Human Services and other available electronic data sources in Code of Federal Regulations, title 42, sections 435.940 to 435.956, to verify eligibility requirements. The commissioner shall establish standards to define when information obtained electronically is reasonably compatible with information provided by applicants and enrollees, including use of self-attestation, to accomplish real-time eligibility determinations and maintain program integrity.\n(e) Each person applying for or receiving medical assistance under section 256B.055, subdivision 7, and any other person whose resources are required by law to be disclosed to determine the applicant's or recipient's eligibility must authorize the commissioner to obtain information from financial institutions to verify assets as required in section 256.01, subdivision 18f. If a person refuses or revokes the authorization, the commissioner may determine that the applicant or recipient is ineligible for medical assistance. For purposes of this paragraph, an authorization to verify assets meets the requirements of the Right to Financial Privacy Act, United States Code, title 12, chapter 35, and need not be furnished to the financial institution.\n(f) County and tribal agencies shall comply with the standards established by the commissioner for appropriate use of the asset verification system specified in section 256.01, subdivision 18f.\n(a) Any person requesting medical assistance payment of long-term care services shall provide a complete description of any interest either the person or the person's spouse has in annuities on a form designated by the department. The form shall include a statement that the state becomes a preferred remainder beneficiary of annuities or similar financial instruments by virtue of the receipt of medical assistance payment of long-term care services. The person and the person's spouse shall furnish the agency responsible for determining eligibility with complete current copies of their annuities and related documents and complete the form designating the state as the preferred remainder beneficiary for each annuity in which the person or the person's spouse has an interest.\n(b) The department shall provide notice to the issuer of the department's right under this section as a preferred remainder beneficiary under the annuity or similar financial instrument for medical assistance furnished to the person or the person's spouse, and provide notice of the issuer's responsibilities as provided in paragraph (c).\n(c) An issuer of an annuity or similar financial instrument who receives notice of the state's right to be named a preferred remainder beneficiary as described in paragraph (b) shall provide confirmation to the requesting agency that the state has been made a preferred remainder beneficiary. The issuer shall also notify the county agency when a change in the amount of income or principal being withdrawn from the annuity or other similar financial instrument or a change in the state's preferred remainder beneficiary designation under the annuity or other similar financial instrument occurs. The county agency shall provide the issuer with the name, address, and telephone number of a unit within the department that the issuer can contact to comply with this paragraph.\n(d) \"Preferred remainder beneficiary\" for purposes of this subdivision and sections 256B.0594 and 256B.0595 means the state is a remainder beneficiary in the first position in an amount equal to the amount of medical assistance paid on behalf of the institutionalized person, or is a remainder beneficiary in the second position if the institutionalized person designates and is survived by a remainder beneficiary who is (1) a spouse who does not reside in a medical institution, (2) a minor child, or (3) a child of any age who is blind or permanently and totally disabled as defined in the Supplemental Security Income program. Notwithstanding this paragraph, the state is the remainder beneficiary in the first position if the spouse or child disposes of the remainder for less than fair market value.\n(e) For purposes of this subdivision, \"institutionalized person\" and \"long-term care services\" have the meanings given in section 256B.0595, subdivision 1, paragraph (a).\n(f) For purposes of this subdivision, \"medical institution\" means a skilled nursing facility, intermediate care facility, intermediate care facility for persons with developmental disabilities, nursing facility, or inpatient hospital.",
	"repealed": false
}