{
	"id": "103F.518",
	"url": "https://www.revisor.mn.gov/statutes/cite/103F.518",
	"title": "103F.518 REINVEST IN MINNESOTA CLEAN ENERGY PROGRAM.",
	"text": "(a) The board shall establish and administer a reinvest in Minnesota (RIM) clean energy program that is in addition to the program under section 103F.515. Selection of land for the clean energy program must be based on its potential benefits for bioenergy crop production, water quality, soil health, reduction of chemical inputs, soil carbon storage, biodiversity, and wildlife habitat.\n(b) For the purposes of this section, \"diverse native prairie\" means a prairie planted from a mix of local Minnesota native prairie species. A selection from all available native prairie species may be made so as to match species appropriate to local site conditions.\nEligible land under this section must:\n(1) be owned by the landowner, or a parent or other blood relative of the landowner, for at least one year before the date of application;\n(2) be at least five acres in size;\n(3) not be currently set aside, enrolled, or diverted under another federal or state government program; and\n(4) have been in agricultural use, as defined in section 17.81, subdivision 4, or have been set aside, enrolled, or diverted under another federal or state program for at least two of the last five years before the date of application.\nThe board shall develop a process to designate defined project areas. The designation process shall prioritize projects that include coordinated cooperation of a cellulosic biofuel facility or a bioenergy production facility, target impaired waters, or support other state or local natural resource plans, goals, or objectives.\nThe board may acquire, or accept by gift or donation, easements on eligible land. An easement may be permanent or of limited duration. An easement of limited duration may not be acquired if it is for a period less than 20 years. The negotiation and acquisition of easements authorized by this section are exempt from the contractual provisions of chapters 16B and 16C.\n(a) An easement must prohibit:\n(1) agricultural crop production, unless approved by the board for energy production purposes; and\n(2) spraying with chemicals, except as necessary to comply with noxious weed control laws, emergency pest control necessary to protect public health, or as needed to establish a productive planting as determined by the technical committee under subdivision 11.\n(b) An easement is subject to the terms of the agreement provided in subdivision 6.\n(c) Agricultural crop production and harvest are limited to native, perennial bioenergy crops. Harvest shall occur outside of bird nesting season.\n(d) An easement must allow repairs, improvements, and inspections necessary to maintain public drainage systems provided the easement area is restored to the condition required by the terms of the easement.\n(e) An easement may allow nonnative perennial prairie or pasture established by September 1, 2007, that meet the other objectives outlined in subdivision 7.\n(f) An easement may allow grazing of livestock only if practiced under a plan, approved by the board, that protects water quality, wildlife habitat, and biodiversity.\nThe board may enroll eligible land in the reinvest in Minnesota clean energy program by signing an agreement in recordable form with a landowner in which the landowner agrees:\n(1) to convey to the state an easement that is not subject to any prior title, lien, or encumbrance;\n(2) to seed the land subject to the easement, as specified in the agreement, at seeding rates determined by the board, or carry out other long-term capital improvements approved by the board; and\n(3) that the easement duration may be lengthened through mutual agreement with the board.\nThe board must develop a tiered payment system for easements partially based on the benefits of the bioenergy crop production for water quality, soil health, reduction in chemical inputs, soil carbon storage, biodiversity, and wildlife habitat using cash rent or a similar system as may be determined by the board. The payment system must provide that the highest per-acre payment is for diverse native prairie and perennials.\nWhen an easement of limited duration expires, a new easement and agreement for an additional period of not less than 20 years may be acquired by agreement of the board and the landowner under the terms of this section. The board may adjust payment rates as a result of renewing an agreement and easement only after examining the condition of the established plantings, conservation practices, and land values.\nTo correct errors in legal descriptions for easements that affect the ownership interest in the state and adjacent landowners, the board may, in the name of the state, with the approval of the attorney general, convey, without consideration, interests of the state necessary to correct legal descriptions of boundaries. The conveyance must be by quitclaim deed or release in a form approved by the attorney general.\n(a) A landowner who violates the term of an easement or agreement under this section, or induces, assists, or allows another to do so, is liable to the state for treble damages if the trespass is willful, but liable for double damages only if the trespass is not willful. The amount of damages is the amount needed to make the state whole or the amount the landowner has gained due to the violation, whichever is greater.\n(b) Upon the request of the board, the attorney general may commence an action for specific performances, injunctive relief, damages, including attorney fees, and any other appropriate relief to enforce this section in district court in the county where all or part of the violation is alleged to have been committed, or where the landowner resides or has a principal place of business.\n[Repealed, 2014 c 286 art 2 s 4]",
	"repealed": false
}