{
	"id": "609.748",
	"url": "https://www.revisor.mn.gov/statutes/cite/609.748",
	"title": "609.748 HARASSMENT; RESTRAINING ORDER.",
	"text": "For the purposes of this section, the following terms have the meanings given them in this subdivision.\n(a) \"Harassment\" includes:\n(1) a single incident of physical or sexual assault, a single incident of harassment under section 609.749, subdivision 2, paragraph (c), clause (8), a single incident of nonconsensual dissemination of private sexual images under section 617.261, or repeated incidents of intrusive or unwanted acts, words, or gestures that have a substantial adverse effect or are intended to have a substantial adverse effect on the safety, security, or privacy of another, regardless of the relationship between the actor and the intended target;\n(2) targeted residential picketing; and\n(3) a pattern of attending public events after being notified that the actor's presence at the event is harassing to another.\n(b) \"Respondent\" includes any adults or juveniles alleged to have engaged in harassment or organizations alleged to have sponsored or promoted harassment.\n(c) \"Targeted residential picketing\" includes the following acts when committed on more than one occasion:\n(1) marching, standing, or patrolling by one or more persons directed solely at a particular residential building in a manner that adversely affects the safety, security, or privacy of an occupant of the building; or\n(2) marching, standing, or patrolling by one or more persons which prevents an occupant of a residential building from gaining access to or exiting from the property on which the residential building is located.\n(a) A person who is a victim of harassment or the victim's guardian or conservator may seek a restraining order from the district court in the manner provided in this section.\n(b) The parent, guardian or conservator, or stepparent of a minor who is a victim of harassment may seek a restraining order from the district court on behalf of the minor.\n(c) A minor may seek a restraining order if the minor demonstrates that the minor is emancipated and the court finds that the order is in the best interests of the emancipated minor. A minor demonstrates the minor is emancipated by a showing that the minor is living separate and apart from parents and managing the minor's own financial affairs, and shows, through an instrument in writing or other agreement, or by the conduct of the parties that all parents who have a legal parent and child relationship with the minor have relinquished control and authority over the minor.\n(d) An application for relief under this section may be filed in the county of residence of either party or in the county in which the alleged harassment occurred. There are no residency requirements that apply to a petition for a harassment restraining order.\n(a) A petition for relief must allege facts sufficient to show the following:\n(1) the name of the alleged harassment victim;\n(2) the name of the respondent; and\n(3) that the respondent has engaged in harassment.\nA petition for relief must state whether the petitioner has had a previous restraining order in effect against the respondent. The petition shall be accompanied by an affidavit made under oath stating the specific facts and circumstances from which relief is sought. The court shall provide simplified forms and clerical assistance to help with the writing and filing of a petition under this section and shall advise the petitioner of the right to sue in forma pauperis under section 563.01. The court shall advise the petitioner of the right to request a hearing. If the petitioner does not request a hearing, the court shall advise the petitioner that the respondent may request a hearing and that notice of the hearing date and time will be provided to the petitioner by mail at least five days before the hearing. Upon receipt of the petition and a request for a hearing by the petitioner, the court shall order a hearing. Personal service must be made upon the respondent not less than five days before the hearing. If personal service cannot be completed in time to give the respondent the minimum notice required under this paragraph, the court may set a new hearing date. Nothing in this section shall be construed as requiring a hearing on a matter that has no merit.\n(b) Notwithstanding paragraph (a), the order for a hearing and a temporary order issued under subdivision 4 may be served on the respondent by means of a one-week published notice under section 645.11, if:\n(1) the petitioner files an affidavit with the court stating that an attempt at personal service made by a peace officer was unsuccessful because the respondent is avoiding service by concealment or otherwise; and\n(2) a copy of the petition and order for hearing and any temporary restraining order has been mailed to the respondent at the respondent's residence or place of business, if the respondent is an organization, or the respondent's residence or place of business is not known to the petitioner.\n(c) Regardless of the method of service, if the respondent is a juvenile, whenever possible, the court also shall have notice of the pendency of the case and of the time and place of the hearing served by mail at the last known address upon any parent or guardian of the juvenile respondent who is not the petitioner.\n(d) A request for a hearing under this subdivision must be made within 20 days of service of the petition.\nThe filing fees for a restraining order under this section are waived for the petitioner and the respondent if the petition alleges acts that would constitute a violation of section 609.749, subdivision 2, 3, 4, or 5, or sections 609.342 to 609.3451.\n(a) The court may issue a temporary restraining order that provides any or all of the following:\n(1) orders the respondent to cease or avoid the harassment of another person; or\n(2) orders the respondent to have no contact with another person.\n(b) The court may issue an order under paragraph (a) if the petitioner files a petition in compliance with subdivision 3 and if the court finds reasonable grounds to believe that the respondent has engaged in harassment. When a petition alleges harassment as defined by subdivision 1, paragraph (a), clause (1), the petition must further allege an immediate and present danger of harassment before the court may issue a temporary restraining order under this section. When signed by a referee, the temporary order becomes effective upon the referee's signature.\n(c) Notice need not be given to the respondent before the court issues a temporary restraining order under this subdivision. A copy of the restraining order must be served on the respondent along with the order for hearing and petition, as provided in subdivision 3. If the respondent is a juvenile, whenever possible, a copy of the restraining order, along with notice of the pendency of the case and the time and place of the hearing, shall also be served by mail at the last known address upon any parent or guardian of the juvenile respondent who is not the petitioner. A temporary restraining order may be entered only against the respondent named in the petition.\n(d) The temporary restraining order is in effect until a hearing is held on the issuance of a restraining order under subdivision 5. The court shall hold the hearing on the issuance of a restraining order if the petitioner requests a hearing. The hearing may be continued by the court upon a showing that the respondent has not been served with a copy of the temporary restraining order despite the exercise of due diligence or if service is made by published notice under subdivision 3 and the petitioner files the affidavit required under that subdivision.\n(e) If the temporary restraining order has been issued and the respondent requests a hearing, the hearing shall be scheduled by the court upon receipt of the respondent's request. Service of the notice of hearing must be made upon the petitioner not less than five days prior to the hearing. The court shall serve the notice of the hearing upon the petitioner by mail in the manner provided in the Rules of Civil Procedure for pleadings subsequent to a complaint and motions and shall also mail notice of the date and time of the hearing to the respondent. In the event that service cannot be completed in time to give the respondent or petitioner the minimum notice required under this subdivision, the court may set a new hearing date.\n(f) A request for a hearing under this subdivision must be made within 20 days of the date of completed service of the petition.\n(a) The court may issue a restraining order that provides any or all of the following:\n(1) orders the respondent to cease or avoid the harassment of another person; or\n(2) orders the respondent to have no contact with another person.\n(b) The court may issue an order under paragraph (a) if all of the following occur:\n(1) the petitioner has filed a petition under subdivision 3;\n(2) a peace officer has served respondent with a copy of the temporary restraining order obtained under subdivision 4, and with notice of the right to request a hearing, or service has been made by publication under subdivision 3, paragraph (b); and\n(3) the court finds at the hearing that there are reasonable grounds to believe that the respondent has engaged in harassment.\nA restraining order may be issued only against the respondent named in the petition; except that if the respondent is an organization, the order may be issued against and apply to all of the members of the organization. If the court finds that the petitioner has had two or more previous restraining orders in effect against the same respondent or the respondent has violated a prior or existing restraining order on two or more occasions, relief granted by the restraining order may be for a period of up to 50 years. In all other cases, relief granted by the restraining order must be for a fixed period of not more than two years. When a referee presides at the hearing on the petition, the restraining order becomes effective upon the referee's signature.\n(c) An order issued under this subdivision must be personally served upon the respondent, or if the respondent appears remotely for a hearing and is notified at the hearing by the judicial officer that a restraining order will be issued, the order may be served on the respondent electronically or by first class mail, as ordered by the court.\n(d) If the court orders relief for a period of up to 50 years under paragraph (a), the respondent named in the restraining order may request to have the restraining order vacated or modified if the order has been in effect for at least five years and the respondent has not violated the order. Application for relief under this paragraph must be made in the county in which the restraining order was issued. Upon receipt of the request, the court shall set a hearing date. Personal service must be made upon the petitioner named in the restraining order not less than 30 days before the date of the hearing. At the hearing, the respondent named in the restraining order has the burden of proving by a preponderance of the evidence that there has been a material change in circumstances and that the reasons upon which the court relied in granting the restraining order no longer apply and are unlikely to occur. If the court finds that the respondent named in the restraining order has met the burden of proof, the court may vacate or modify the order. If the court finds that the respondent named in the restraining order has not met the burden of proof, the court shall deny the request and no request may be made to vacate or modify the restraining order until five years have elapsed from the date of denial. An order vacated or modified under this paragraph must be personally served on the petitioner named in the restraining order.\n(a) In lieu of personal service of a harassment restraining order, a peace officer may serve a person with a short-form notification. The short-form notification must include the following clauses: the respondent's name; the respondent's date of birth, if known; the petitioner's name; the names of other protected parties; the date and county in which the temporary restraining order or restraining order was filed; the court file number; the hearing date and time, if known; the conditions that apply to the respondent, either in checklist form or handwritten; and the name of the judge who signed the order.\nThe short-form notification must be in bold print in the following form:\n\"The restraining order is now enforceable. You must report to your nearest sheriff's office or county court to obtain a copy of the restraining order. You are subject to arrest and may be charged with a misdemeanor, gross misdemeanor, or felony if you violate any of the terms of the restraining order or this short-form notification.\"\n(b) Upon verification of the identity of the respondent and the existence of an unserved harassment restraining order against the respondent, a law enforcement officer may detain the respondent for a reasonable time necessary to complete and serve the short-form notification.\n(c) When service is made by short-form notification, it may be proved by the affidavit of the law enforcement officer making the service.\n(d) For service under this section only, service upon an individual may occur at any time, including Sundays and legal holidays.\n(e) The superintendent of the Bureau of Criminal Apprehension shall provide the short form to law enforcement agencies.\n(a) Where personal service is required under this section, service must comply with rule 4.03 of the Rules of Civil Procedure.\n(b) In addition to peace officers, corrections officers, including but not limited to probation officers, court services officers, parole officers, and employees of jails or correctional facilities, may serve a temporary restraining order or restraining order and must, to the extent possible, provide any sheriff, law enforcement officer, or other peace officer attempting to effectuate service with relevant information regarding where a respondent may be found, such as the respondent's residence, the respondent's place of employment or schooling, or other locations frequented by the respondent.\n(c) The court administrator and any peace officer in this state shall perform their duties relating to service of process without charge to the petitioner. The court shall direct payment of the reasonable costs of service of process if served by a private process server when a peace officer is unavailable or if service is made by publication.\n(d) A sheriff, law enforcement officer, or any other peace officer must make reasonable efforts to locate a respondent to effectuate service. Reasonable efforts may include:\n(1) a search of any information that is publicly available;\n(2) a search of any government data in a database to which the sheriff, law enforcement officer, or other peace officer has access, provided the data is classified as public data on individuals as defined in section 13.02, subdivision 15, or is otherwise available to criminal justice agencies, as defined in section 13.02, subdivision 3a; and\n(3) communication with any court administrator, the sheriff of any county in this state, and any other law enforcement officer, peace officer, or corrections officer.\n(e) A sheriff, law enforcement officer, or any other peace officer who serves a respondent who the sheriff or officer knows is on supervised probation or supervised release with a temporary restraining order, restraining order, or short-form notification must provide a copy of the served order or notification to the respondent's probation officer, supervised release or conditional release agent, or parole officer.\nOrders for dismissal of a temporary restraining order or a restraining order may be served personally or by certified mail.\n(a) A person who violates a restraining order issued under this section is subject to the penalties provided in paragraphs (b) to (d).\n(b) Except as otherwise provided in paragraphs (c) and (d), when a temporary restraining order or a restraining order is granted under this section and the respondent knows of the order, violation of the order is a misdemeanor.\n(c) A person is guilty of a gross misdemeanor who violates the order within ten years of a previous qualified domestic violence-related offense conviction or adjudication of delinquency.\n(d) A person is guilty of a felony and may be sentenced to imprisonment for not more than five years or to payment of a fine of not more than $10,000, or both, if the person violates the order:\n(1) within ten years of the first of two or more previous qualified domestic violence-related offense convictions or adjudications of delinquency;\n(2) because of the victim's or another's actual or perceived race, color, religion, sex, sexual orientation, disability as defined in section 363A.03, age, or national origin;\n(3) by falsely impersonating another;\n(4) while possessing a dangerous weapon;\n(5) with an intent to influence or otherwise tamper with a juror or a judicial proceeding or with intent to retaliate against a judicial officer, as defined in section 609.415, or a prosecutor, defense attorney, or officer of the court, because of that person's performance of official duties in connection with a judicial proceeding; or\n(6) against a victim under the age of 18, if the respondent is more than 36 months older than the victim.\n(e) A person who commits violations in two or more counties may be prosecuted in any county in which one of the acts was committed for all acts in violation of this section.\n(f) A person may be prosecuted at the place where any call is made or received or, in the case of wireless or electronic communication or any communication made through any available technologies, where the actor or victim resides, or in the jurisdiction of the victim's designated address if the victim participates in the address confidentiality program established under chapter 5B.\n(g) A peace officer shall arrest without a warrant and take into custody a person whom the peace officer has probable cause to believe has violated an order issued under subdivision 4 or 5 if the existence of the order can be verified by the officer.\n(h) A violation of a temporary restraining order or restraining order shall also constitute contempt of court.\n(i) Upon the filing of an affidavit by the petitioner, any peace officer, or an interested party designated by the court, alleging that the respondent has violated an order issued under subdivision 4 or 5, the court may issue an order to the respondent requiring the respondent to appear within 14 days and show cause why the respondent should not be held in contempt of court. The court also shall refer the violation of the order to the appropriate prosecuting authority for possible prosecution under paragraph (b), (c), or (d).\nAn order granted under this section shall be forwarded by the court administrator within 24 hours to the local law enforcement agency with jurisdiction over the residence of the applicant. Each appropriate law enforcement agency shall make available to other law enforcement officers through a system for verification, information as to the existence and status of any order issued under this section.\n(a) An order granted under this section must contain a conspicuous notice to the respondent:\n(1) of the specific conduct that will constitute a violation of the order;\n(2) that violation of an order is either (i) a misdemeanor punishable by imprisonment for up to 90 days or a fine of up to $1,000, or both, (ii) a gross misdemeanor punishable by imprisonment for up to 364 days or a fine of up to $3,000, or both, or (iii) a felony punishable by imprisonment for up to five years or a fine of up to $10,000, or both; and\n(3) that a peace officer must arrest without warrant and take into custody a person if the peace officer has probable cause to believe the person has violated a restraining order.\n(b) If the court grants relief for a period of up to 50 years under subdivision 5, the order must also contain a conspicuous notice to the respondent that the respondent must wait five years to seek a modification of the order.\nNothing in this section shall supersede or preclude the continuation or adoption of any local ordinance which applies to a broader scope of targeted residential picketing conduct than that described in subdivision 1.\n(a) An employer shall not discharge, discipline, threaten, otherwise discriminate against, or penalize an employee regarding the employee's compensation, terms, conditions, location, or privileges of employment, because the employee took reasonable time off from work to obtain or attempt to obtain relief under this section. Except in cases of imminent danger to the health or safety of the employee or the employee's child, or unless impracticable, an employee who is absent from the workplace shall give 48 hours' advance notice to the employer. Upon request of the employer, the employee shall provide verification that supports the employee's reason for being absent from the workplace. All information related to the employee's leave pursuant to this section shall be kept confidential by the employer.\n(b) An employer who violates paragraph (a) is guilty of a misdemeanor and may be punished for contempt of court. In addition, the court shall order the employer to pay back wages and offer job reinstatement to any employee discharged from employment in violation of paragraph (a).\n(c) In addition to any remedies otherwise provided by law, an employee injured by a violation of paragraph (a) may bring a civil action for recovery of damages, together with costs and disbursements, including reasonable attorneys fees, and may receive such injunctive and other equitable relief, including reinstatement, as determined by the court.",
	"repealed": false
}