{
	"id": "115B.04",
	"url": "https://www.revisor.mn.gov/statutes/cite/115B.04",
	"title": "115B.04 LIABILITY FOR RESPONSE COSTS AND NATURAL RESOURCES; LIMITATIONS AND DEFENSES.",
	"text": "Except as otherwise provided in subdivisions 2 to 12, and notwithstanding any other provision or rule of law, any person who is responsible for a release or threatened release of a hazardous substance from a facility is strictly liable, jointly and severally, for the following response costs and damages which result from the release or threatened release or to which the release or threatened release significantly contributes:\n(1) all reasonable and necessary response costs incurred by the state, a political subdivision of the state or the United States;\n(2) all reasonable and necessary removal costs incurred by any person; and\n(3) all damages for any injury to, destruction of, or loss of natural resources, including the reasonable costs of assessing such injury, destruction, or loss.\nThere is no liability under this section for response costs or damages which result from the release of a pollutant or contaminant.\nLiability under this section for a threatened release of a hazardous substance is limited to the recovery by the agency of reasonable and necessary response costs as provided in section 115B.17, subdivision 6.\n(a) The liability of a political subdivision under this section is subject to the limits imposed under section 466.04, subdivision 1, except when the political subdivision is liable under this section as the owner or operator of a disposal facility as defined in section 115A.03, subdivision 10.\n(b) When a political subdivision is liable as an owner or operator of a disposal facility, the liability of each political subdivision is limited to $400,000 at each facility unless the facility was owned or operated under a valid joint powers agreement by three or more political subdivisions, in which case the aggregate liability of all political subdivisions that are parties to the joint powers agreement is limited to $1,200,000.\n(c) The limits on the liability of a political subdivision for ownership or operation of a disposal facility apply to the costs of response action incurred between the date a request for response action is issued by the agency and the date one year after the construction certificate of completion is approved by the commissioner, excluding the costs of negotiation of a consent order agreement.\n(d) When a political subdivision takes response action as the owner or operator of a disposal facility between the dates in paragraph (c), it may receive, after approval by the agency, reimbursement of any amount spent pursuant to an approved work plan that exceeds the applicable liability limit specified in this subdivision.\n(a) Except as provided in paragraph (b), liability under this section for claims by owners or operators of mixed municipal solid waste disposal facilities that accept waste on or after April 9, 1994, and are not qualified facilities under section 115B.39, subdivision 2, is limited to liability for response costs exceeding the amount of available financial assurance funds required under section 116.07, subdivision 4h.\n(b) This subdivision does not affect liability under this section for claims based on the illegal disposal of waste at a facility.\nA person who accepts only household refuse for transport to a treatment or disposal facility is not liable under this section for the release or threatened release of any hazardous substance unless that person knew or reasonably should have known that the hazardous substance was present in the refuse. For the purpose of this subdivision, household refuse means garbage, trash, or septic tank sanitary wastes generated by single or multiple residences, hotels, motels, restaurants and other similar facilities.\nIt is a defense to a claim by a political subdivision or private person for recovery of the costs of its response actions under this section that the hazardous substance released from the facility was placed or came to be located in or on the facility before April 1, 1982, and that the response actions of the political subdivision or private person were not authorized by the agency as provided in section 115B.17, subdivision 12. This defense applies only to response costs incurred on or after July 1, 1983.\n(a) It is a defense to liability under this section that the release or threatened release was caused solely by:\n(1) an act of God;\n(2) an act of war;\n(3) an act of vandalism or sabotage; or\n(4) an act or omission of a third party or the plaintiff.\n(b) \"Third party\" for the purposes of paragraph (a), clause (4), does not include an employee or agent of the defendant, or a person in the chain of responsibility for the generation, transportation, storage, treatment, or disposal of the hazardous substance.\n(c) The defenses provided in paragraph (a), clauses (3) and (4), apply only if the defendant establishes that the defendant exercised due care with respect to the hazardous substance concerned, taking into consideration the characteristics of the hazardous substance in light of all relevant facts and circumstances which the defendant knew or should have known, and that the defendant took precautions against foreseeable acts or omissions and the consequences that could foreseeably result from those acts or omissions.\nWhen the agency or the federal Environmental Protection Agency assumes control over any release or threatened release of a hazardous substance by taking removal actions at the site of the release, the persons responsible for the release are not liable under sections 115B.01 to 115B.15 for any subsequent release of the hazardous substance from another facility to which it has been removed.\nIt is a defense to liability under this section that:\n(1) the release or threatened release was from a hazardous waste facility as defined under section 115A.03, for which a permit had been issued pursuant to section 116.07 or pursuant to subtitle C of the Solid Waste Disposal Act, United States Code, title 42, section 6921 et seq., the hazardous substance was specifically identified in the permit, and the release was within the limits allowed in the permit for release of that substance;\n(2) the hazardous substance released was specifically identified in a federal or state permit and the release is within the limits allowed in the permit;\n(3) the release resulted from circumstances identified and reviewed and made a part of the public record of a federal or state agency with respect to a permit issued or modified under federal or state law, and the release conformed with the permit;\n(4) the release was any part of an emission or discharge into the air or water and the emission or discharge was subject to a federal or state permit and was in compliance with control rules or regulations adopted pursuant to state or federal law;\n(5) the release was the introduction of any hazardous substance into a publicly owned treatment works and the substance was specified in, and is in compliance with, applicable pretreatment standards specified for that substance under state and federal law; or\n(6) liability has been assumed by the federal postclosure liability fund under United States Code, title 42, section 9607(k).\nIt is a defense to liability under this section, for any injury to, destruction of, or loss of natural resources that:\n(1) the natural resources were specifically identified as an irreversible and irretrievable commitment of natural resources in an approved final state or federal environmental impact statement, or other comparable approved final environmental analysis for a project or facility which was the subject of a governmental permit or license; and\n(2) the project or facility was being operated within the terms of its permit or license.\nIt is a defense to liability under this section that the response costs or damages resulted from acts taken or omitted in preparation for, or in the course of rendering care, assistance, or advice to the commissioner or agency pursuant to section 115B.17 or in accordance with the national hazardous substance response plan pursuant to the federal Superfund Act, under United States Code, title 42, section 9605, or at the direction of an on-scene coordinator appointed under that plan, with respect to any release or threatened release of a hazardous substance.\nAny person claiming a defense provided in subdivisions 6 to 11 has the burden to prove all elements of the defense by a preponderance of the evidence.",
	"repealed": false
}