{
	"id": "458D.12",
	"url": "https://www.revisor.mn.gov/statutes/cite/458D.12",
	"title": "458D.12 PUBLIC HEARING AND SPECIAL ASSESSMENTS.",
	"text": "Before the board orders any project involving the acquisition or betterment of any interceptor or treatment works, all or a part of the cost of which will be allocated to local government units pursuant to section 458D.09, as current costs, the board shall hold a public hearing on the proposed project following two publications in a newspaper or newspapers having general circulation in the district, stating the time and place of the hearing, the general nature and location of the project, the estimated total cost of acquisition and betterment, that portion of such costs estimated to be paid out of federal and state grants, and that portion of such costs estimated to be allocated to each local government unit affected thereby. The two publications shall be a week apart and the hearing shall be at least three days after the last publication. Not less than 45 days before the hearing, notice thereof shall also be mailed to each clerk of all local government units in the district, but failure to give mailed notice or any defects in the notice shall not invalidate the proceedings. The project may include all or part of one or more interceptors or treatment works. No such hearing shall be held on any project unless the project is within the area covered by a comprehensive plan adopted by the board pursuant to section 458D.05, except that the hearing may be held simultaneously with a hearing on such a comprehensive plan. A hearing is not required with respect to a project, no part of the costs of which are to be allocated to local government units as the current costs of acquisition, betterment and debt service.\nIf the governing body of any local government unit in the district proposes to assess against benefited property within such unit all or any part of the allocable costs of the project as provided in subdivision 5, such governing body shall, not less than ten days prior to the hearing provided for in subdivision 1 cause mailed notice thereof to be given to the owner of each parcel within the area proposed to be specially assessed and shall also give one week's published notice of the hearing. The notice of hearing shall contain the same information provided in the notice published by the board pursuant to subdivision 1, and in addition, a description of the area proposed to be assessed by the local government unit. For the purpose of giving mailed notice, owners shall be those shown to be on the records of the county auditor or, in any county where tax statements are mailed by the county treasurer, on the records of the county treasurer; but other appropriate records may be used for this purpose. However, as to properties which are tax exempt or subject to taxation on a gross earnings basis and are not listed on the records of the county auditor or the county treasurer, the owners thereof shall be ascertained by any practicable means and mailed notice shall be given them as herein provided. Failure to give mailed notice or any defects in the notice shall not invalidate the proceedings of the board or the local governing body.\nPrior to adoption of the resolution calling for such a hearing, the board shall secure from the district engineer or some other competent person of the board's selection a report advising it in a preliminary way as to whether the proposed project is feasible and as to whether it should best be made as proposed or in connection with some other project and the estimated costs of the project as recommended; but no error or omission in such report shall invalidate the proceeding. The board may also take such other steps prior to the hearing, as will in its judgment provide helpful information in determining the desirability and feasibility of the project, including but not limited to preparation of plans and specifications and advertisement for bids thereon. The hearing may be adjourned from time to time and a resolution ordering the project may be adopted by the board at any time within six months after the date of the hearing. In ordering the project the board may reduce but not increase the extent of the project as stated in the notice of hearing and shall find that the project as ordered is in accordance with the comprehensive plan and program adopted by the board pursuant to section 458D.05.\nIf the board by resolution determines that an emergency exists requiring the immediate purchase of materials or supplies or the making of emergency repairs, it may order the purchase of such supplies and materials and the making of such repairs prior to any hearing required under this section, provided that the board shall set as early a date as practicable for such hearing at the time it declares such emergency. All other provisions of this section shall be followed in giving notice of and conducting such hearing. Nothing herein shall be construed as preventing the board or its agents from purchasing maintenance supplies or incurring maintenance costs without regard to the requirements of this section.\nA local government unit may specially assess all or any part of the costs of acquisition and betterment as herein provided, of any project ordered by the board pursuant to this section. Such special assessments shall be levied in accordance with the provisions of sections 429.051 to 429.081, except as otherwise provided in this subdivision. No other provisions of chapter 429 shall apply. For purposes of levying such special assessments, the hearing on such project required in subdivision 1 shall serve as the hearing on the making of the original improvement provided for by section 429.051. The area assessed may be less than but may not exceed the area proposed to be assessed as stated in the notice of hearing on the project provided for in subdivision 2. For the purpose of determining the allocable cost of the project, or part thereof, to the local government unit, the government unit may adopt one of the following two procedures:\n(1) At any time after a contract is let for the project, the local government unit may obtain from the board a current written estimate, on the basis of such historical and reasonably projected data as may be available, of that part of the total costs of acquisition and betterment of such project or of some portion of the project which the government unit shall designate, which will be allocated to the government unit and the number of years over which such costs will be allocated as current costs of acquisition, betterment and debt service pursuant to section 458D.09. The board shall not in any way be bound by this estimate for the purpose of allocating the costs of such project to local government units.\n(2) The governing body may obtain from the board a written statement setting forth, for such prior period as the governing body designates, that portion of the costs previously allocated to the local government unit as current costs of acquisition, betterment and debt service only, of all or any part of the project designated by the governing body. In addition to the allocable costs so ascertained, the local government unit may include in the total expense it will pay, as a basis for levying assessments, all other expenses incurred directly by the government unit in connection with said project, or any part thereof. Special assessments levied by the government unit with respect to previously allocated costs ascertained under the second procedure above shall be payable in equal annual installments extending over a period not exceeding by more than one year the number of years over which such costs had been allocated to the government unit or the estimated useful life of said project, or part thereof, whichever number of years is the lesser. No limitation is placed upon the number of times the governing body of a government unit may assess such previously allocated costs not previously assessed by the government unit. The power to specially assess provided for in this section shall be in addition and supplemental to and not in substitution of all other powers of government units to levy special assessments granted by law or charter; and, to the extent practicable, a local government unit may exercise such existing power to levy special assessments for the purpose of paying all or part of the allocable costs and other expenses incurred by the government unit in connection with all or a part of said project, ascertained in accordance with the provisions of this subdivision and subject to the limitation in this subdivision with respect to the number of years over which the payment of such assessments for previously allocated costs may be extended.",
	"repealed": false
}