{
	"id": "515B.2-119",
	"url": "https://www.revisor.mn.gov/statutes/cite/515B.2-119",
	"title": "515B.2-119 TERMINATION OF COMMON INTEREST COMMUNITY.",
	"text": "(a) Except as otherwise provided in this chapter, a common interest community may be terminated only by agreement of unit owners of units to which at least 80 percent of the votes in the association are allocated, and 80 percent of the first mortgagees of units (each mortgagee having one vote per unit financed), or any larger percentage the declaration specifies. The declaration may specify a smaller percentage only if all of the units are restricted to nonresidential use.\n(b) An agreement to terminate shall be evidenced by a written agreement, executed in the same manner as a deed by the number of unit owners and first mortgagees of units required by subsection (a). The agreement shall specify a date after which the agreement shall be void unless recorded before that date. The agreement shall also specify a date by which the termination of the common interest community and the winding up of its affairs must be accomplished. A certificate of termination executed by the association evidencing the termination shall be recorded on or before the termination date, or the agreement to terminate shall be revoked. The agreement to terminate, or a memorandum thereof, and the certificate of termination shall be recorded in every county in which a portion of the common interest community is situated and is effective only upon recording.\n(c) In the case of a condominium or planned community containing only units having upper and lower boundaries, a termination agreement may provide that all of the common elements and units of the common interest community must be sold following termination. If, pursuant to the agreement, any real estate in the common interest community is to be sold following termination, the termination agreement shall set forth the minimum terms of sale acceptable to the association.\n(d) In the case of a condominium or planned community containing any units not having upper and lower boundaries, a termination agreement may provide for sale of the common elements, but it may not require that the units be sold following termination, unless the original declaration provided otherwise or all unit owners whose units are to be sold consent to the sale.\n(e) The association, on behalf of the unit owners, shall have authority to contract for the sale of real estate in a common interest community pursuant to this section, subject to the required approval. The agreement to terminate shall be deemed to grant to the association a power of attorney coupled with an interest to effect the conveyance of the real estate on behalf of the holders of all interests in the units, including without limitation the power to execute all instruments of conveyance and related instruments. Until the sale has been completed, all instruments in connection with the sale have been executed and the sale proceeds distributed, the association shall continue in existence with all powers it had before termination.\n(1) The instrument conveying or creating the interest in the common interest community shall include as exhibits (i) an affidavit of the secretary of the association certifying that the approval required by this section has been obtained and (ii) a schedule of the names of all unit owners in the common interest community as of the date of the approval.\n(2) Proceeds of the sale shall be distributed to unit owners and secured parties as their interests may appear, in accordance with subsections (h), (i), (j), and (k).\n(3) Unless otherwise specified in the agreement of termination, until the association has conveyed title to the real estate, each unit owner and the unit owner's successors in interest have an exclusive right to occupancy of the portion of the real estate that formerly constituted the unit. During the period of that occupancy, each unit owner and the unit owner's successors in interest remain liable for all assessments and other obligations imposed on unit owners by this chapter, the declaration or the bylaws.\n(f) The legal description of the real estate constituting the common interest community shall, upon the date of recording of the certificate of termination referred to in subsection (b), be as follows:\n(1) In a planned community utilizing a CIC plat complying with section 515B.2-110(d)(1) and (2), the lot and block description contained in the CIC plat, and any amendments thereto, subject to any subsequent conveyance or taking of a fee interest in any part of the property.\n(2) In a condominium or cooperative, or a planned community utilizing a CIC plat complying with section 515B.2-110(c), the underlying legal description of the real estate as set forth in the declaration creating the common interest community, and any amendments thereto, subject to any subsequent conveyance or taking of a fee interest in any part of the property.\n(3) The legal description referred to in this subsection shall apply upon the recording of the certificate of termination. The recording officer for each county in which the common interest community is located shall index the property located in that county in its records under the legal description required by this subsection from and after the date of recording of the certificate of termination. In the case of registered property, the registrar of titles shall cancel the existing certificates of title with respect to the property and issue one or more certificates of title for the property utilizing the legal description required by this subsection.\n(g) In a condominium or planned community, if the agreement to terminate provides that the real estate constituting the common interest community is not to be sold following termination, title to the common elements and, in a common interest community containing only units having upper and lower boundaries described in the declaration, title to all the real estate in the common interest community, vests in the unit owners upon termination as tenants in common in proportion to their respective interest as provided in subsection (k), and liens on the units shift accordingly. While the tenancy in common exists, each unit owner and the unit owner's successors in interest have an exclusive right to occupancy of the portion of the real estate that formerly constituted the unit.\n(h) The proceeds of any sale of real estate pursuant to subsection (e), together with the assets of the association, shall be held by the association as trustee for unit owners, secured parties and other holders of liens on the units as their interests may appear. Before distributing any proceeds, the association shall have authority to deduct from the proceeds of sale due with respect to the unit (i) unpaid assessments levied by the association with respect to the unit, (ii) unpaid real estate taxes or special assessments due with respect to the unit, and (iii) the share of expenses of sale and winding up of the association's affairs with respect to the unit.\n(i) Following termination of a condominium or planned community, creditors of the association holding liens on the units perfected before termination may enforce those liens in the same manner as any lienholder, in order of priority based upon their times of perfection. All other creditors of the association are to be treated as if they had perfected liens on the units immediately before termination.\n(j) In a cooperative, the declaration may provide that all creditors of the association have priority over any interests of unit owners and creditors of unit owners. In that event, following termination, creditors of the association holding liens on the cooperative which were perfected before termination may enforce their liens in the same manner as any lienholder, in order of priority based upon their times of perfection. All other creditors of the association shall be treated as if they had perfected a lien against the cooperative immediately before termination. Unless the declaration provides that all creditors of the association have that priority:\n(1) the lien of each creditor of the association which was perfected against the association before termination becomes, upon termination, a lien against each unit owner's interest in the unit as of the date the lien was perfected;\n(2) any other creditor of the association is to be treated upon termination as if the creditor had perfected a lien against each unit owner's interest immediately before termination;\n(3) the amount of the lien of an association's creditor described in paragraphs (1) and (2) against each of the unit owners' interest shall be proportionate to the ratio which each unit's common expense liability bears to the common expense liability of all of the units;\n(4) the lien of each creditor of each unit owner which was perfected before termination continues as a lien against that unit owner's interest in the unit as of the date the lien was perfected; and\n(5) the assets of the association shall be distributed to all unit owners and all lienholders as their interests may appear in the order described in this section. Creditors of the association are not entitled to payment from any unit owner in excess of the amount of the creditor's lien against that unit owner's interest.\n(k) The respective interest of unit owners referred to in subsections (e), (f), (g), (h) and (i) are as follows:\n(1) Except as provided in paragraph (2), the respective interests of unit owners are the fair market values of their units, allocated interests, and any limited common elements immediately before the termination, as determined by one or more independent appraisers selected by the association. The decision of the independent appraisers must be distributed to the unit owners and becomes final unless disapproved within 30 days after distribution by unit owners of units to which 25 percent of the votes in the association are allocated. The proportion of any unit's interest to that of all units is determined by dividing the fair market value of that unit by the total fair market values of all the units.\n(2) If any unit or any limited common element is destroyed to the extent that an appraisal of the fair market value thereof before destruction cannot be made, the interests of all unit owners shall be measured by: (i) in a condominium, their allocations of common element interests immediately before the termination, (ii) in a cooperative, their respective ownership interests immediately before the termination, and (iii) in a planned community, their respective allocations of common expenses immediately before the termination.\n(l) In a condominium or planned community, except as provided in subsection (m), foreclosure or enforcement of a lien or encumbrance against the entire common interest community does not terminate, of itself, the common interest community, and foreclosure or enforcement of a lien or encumbrance against a portion of the common interest community does not withdraw that portion from the common interest community.\n(m) In a condominium or planned community, if a lien or encumbrance against a portion of the real estate comprising the common interest community has priority over the declaration and the lien or encumbrance has not been partially released, the parties foreclosing the lien or encumbrance, upon foreclosure, may record an instrument excluding the real estate subject to that lien or encumbrance from the common interest community.\n(n) Following the termination of a common interest community in accordance with this section, the association shall be dissolved in accordance with law.",
	"repealed": false
}