{
	"id": "508A.70",
	"url": "https://www.revisor.mn.gov/statutes/cite/508A.70",
	"title": "508A.70 SUBSEQUENT ADVERSE CLAIM, HOW REGISTERED; COSTS.",
	"text": "(a) Any person claiming any interest in land registered under sections 508A.01 to 508A.85 arising or created after the date of the first CPT, may, if there is some impediment to registering the claimed interest, file with the registrar of titles a verified claim of unregistered interest, made by or at the instance of the claimant, stating:\n(1) the alleged interest;\n(2) how or from whom it was acquired;\n(3) the reason the interest cannot be registered;\n(4) the number of the affected CPT;\n(5) a description of the affected land;\n(6) a place at which all notices may be served upon the claimant; and\n(7) that the claim is not made for the purpose of avoiding the payment of mortgage registry tax under section 287.01 or deed tax under section 287.21, or avoiding obtaining the auditor's statement on an instrument under section 272.12.\n(b) If the claimant claims an interest in an unregistered mortgage that is subject to the imposition of mortgage registry tax upon recording, the notice must contain evidence satisfactory to the registrar of titles that the mortgage registry tax has been paid.\n(c) A copy of the claim must be mailed to the persons whose registered interests are affected by the claim at their addresses shown on the CPT. An affidavit stating the names and addresses of the persons to whom copies of the claim were mailed must be attached to the claim. The claim with attached affidavit regarding mailing shall be entitled to registration, and the court, upon the petition of any party in interest, shall grant a speedy hearing upon the validity of the claim and enter an order as justice and equity may require. If the court determines that the claim is invalid, it shall order the cancellation of the memorial of the claim. The court may, in any case, award costs and damages, including a reasonable attorney's fee, as it may deem just.\nA person whose registered interest is affected by a statement of adverse claim filed before August 1, 2003, or by a claim of unregistered interest, or the person's agent, may file a demand for discharge of the claim of unregistered interest. A copy of the demand must be mailed to the claimant at the address stated on the claim. An affidavit stating the name and address of the person to whom a copy of the demand was mailed must be attached to the demand. The demand must be substantially in the following form: \"DEMAND FOR DISCHARGE OF CLAIM OF UNREGISTERED INTEREST.\nDate: .....................\n................................................, having a registered interest in (name of person having a registered interest) Certificate of Possessory Title (CPT) No. ......., hereby demands that ................................. (name of claimant) either (1) discharge the claimant's claim of unregistered interest regarding the CPT, or (2) petition the court for a determination of the validity of the claim pursuant to Minnesota Statutes, section 508A.70, subdivision 1. If the claimant fails to do so the claim will terminate and be of no effect 90 days after this demand for discharge is filed with the registrar of titles of ............... county, Minnesota. ......................................(signature of person having registered interest or agent)\"\nUnless the claimant has petitioned the court as provided in subdivision 1 and filed with the registrar of titles a certified copy of the petition, the claim shall terminate and be of no effect 90 days after the filing of a demand for discharge with attached affidavit regarding mailing. The registrar of titles shall not carry forward to new CPTs the memorial of any claim that has terminated or has been discharged pursuant to this subdivision.\nThe registration of a claim of unregistered interest has the same effect as to priority as the registration of any instrument under this chapter. If the instrument under which the claim is made is filed before the claim has been terminated or discharged, the instrument shall have the same priority as the claim and the registrar of titles shall include in the memorial of the instrument a reference to the document number of the claim.",
	"repealed": false
}