{
	"id": "192A.205",
	"url": "https://www.revisor.mn.gov/statutes/cite/192A.205",
	"title": "192A.205 UNLAWFUL COMMAND INFLUENCE.",
	"text": "(a) No convening authority or commander may censure, reprimand, admonish, or otherwise retaliate against any member, military judge, counsel, or witness involved in the investigation, prosecution, or defense of military actions, punitive or administrative.\n(b) No person subject to the code may attempt to coerce or, by any unauthorized means, influence the action of a court-martial or any other military tribunal or any member of a court-martial or other military tribunal, in reaching the findings or sentence in any case or the action of any convening, approving, or reviewing authority with respect to that authority's judicial acts.\n(c) This subdivision does not prohibit general instructional or informational courses in military justice if the courses are designed solely for the purpose of instructing personnel of a command in the substantive and procedural aspects of courts-martial.\n(d) This subdivision does not prohibit statements and instructions given in open session by the military judge or counsel.\n(e) This subdivision does not prohibit professional supervision by senior judge advocates regarding adherence to local and military standards of professional conduct and responsibility.\n(f) This subdivision does not prohibit appropriate action against a person for an offense committed while detailed as a military judge, counsel, or member of a court-martial, or while serving as individual counsel.\n(a) In the preparation of an effectiveness, fitness, or efficiency report or any other report or document used in whole or in part for the purpose of determining whether a member of the armed forces is qualified to be advanced in grade, in determining the assignment or transfer of a member of the armed forces, or in determining whether a member of the armed forces should be retained on active duty, no person subject to the code may:\n(1) consider or evaluate the performance of duty of the person as a member of a court-martial or administrative hearing; or\n(2) give a less favorable rating or evaluation of a defense counsel because of the zeal with which the counsel represented an accused.\n(b) For general, special, and summary courts-martial, neither the convening authority nor any member of the convening authority's staff may prepare or review any report concerning the effectiveness, fitness, or efficiency of the military judge, which relates to the performance of duty as a military judge. When the military judge is normally rated or the military judge's report is reviewed by the convening authority, the manner in which the military judge will be rated or evaluated upon the performance of duty as a military judge may be as prescribed in regulations of the National Guard concerned which must ensure the absence of any command influence in the rating or evaluation of the military judge's judicial performance.",
	"repealed": false
}