{
	"id": "168.12",
	"url": "https://www.revisor.mn.gov/statutes/cite/168.12",
	"title": "168.12 PLATES.",
	"text": "(a) The commissioner, upon approval and payment, must issue to the applicant the plates required by this chapter, bearing the state name and an assigned vehicle registration number. The number assigned by the commissioner may be a combination of a letter or sign with figures. The color of the plates and the color of the abbreviation of the state name and the number assigned must be in marked contrast. The plates must be lettered, spaced, or distinguished to suitably indicate the registration of the vehicle according to the rules of the commissioner.\n(b) When a vehicle is registered on the basis of total gross weight, the plates issued must clearly indicate by letters or other suitable insignia the maximum gross weight for which the tax has been paid.\n(c) Plates issued to a noncommercial vehicle must bear the inscription \"noncommercial\" unless the vehicle is displaying a special plate authorized and issued under this chapter.\n(d) A one-ton pickup truck that is used for commercial purposes and is subject to section 168.185, is eligible to display special plates as authorized and issued under this chapter.\n(e) The plates must be so treated as to be at least 100 times brighter than the conventional painted number plates. When properly mounted on an unlighted vehicle, the plates, when viewed from a vehicle equipped with standard headlights, must be visible for a distance of not less than 1,500 feet and readable for a distance of not less than 110 feet.\n(f) The commissioner must issue plates for the following periods:\n(1) New plates issued pursuant to section 168.012, subdivision 1, must be issued to a vehicle for as long as the vehicle is owned by the exempt agency and the plate is not transferable from one vehicle to another but the plate may be transferred with the vehicle from one tax-exempt agency to another.\n(2) Plates issued for passenger automobiles must be issued for a seven-year period. All plates issued under this paragraph must be replaced if they are seven years old or older at the time of registration renewal or will become so during the registration period.\n(3) Plates issued under sections 168.053 and 168.27, subdivisions 16 and 17, must be for a seven-year period.\n(4) Plates issued under subdivisions 2c and 2d and sections 168.123, 168.1235, and 168.1255 must be issued for the life of the veteran under section 169.79.\n(5) Plates for any vehicle not specified in clauses (1) to (3) must be issued for the life of the vehicle.\n(g) In a year in which plates are not issued, the commissioner must issue for each registration a sticker to designate the year of registration. This sticker must show the year or years for which the sticker is issued, and is valid only for that period. The plates and stickers issued for a vehicle may not be transferred to another vehicle during the period for which the sticker is issued, except when issued for a vehicle registered under section 168.187.\n(h) Despite any other provision of this subdivision, plates issued to a vehicle used for behind-the-wheel instruction in a driver education course in a public school may be transferred to another vehicle used for the same purpose without payment of any additional fee. The public school must notify the commissioner of each transfer of plates under this paragraph. The commissioner may prescribe a format for notification.\n(i) In lieu of plates required under this section, the commissioner must issue a registration number identical to the federally issued tail number assigned to a roadable aircraft.\n(a) The commissioner shall issue amateur radio plates to an applicant who:\n(1) is an owner of a passenger automobile or recreational vehicle;\n(2) is a resident of this state;\n(3) holds an official amateur radio station license or a citizens radio service class D license, in good standing, issued by the Federal Communications Commission;\n(4) pays the registration tax required under section 168.013;\n(5) pays a fee in the amount specified for special plates under subdivision 5, for each set of special plates and any other fees required by this chapter; and\n(6) complies with this chapter and rules governing the registration of motor vehicles and licensing of drivers.\n(b) In lieu of the registration number required for identification under subdivision 1, the plates must indicate the official amateur call letters of the applicant, as assigned by the Federal Communications Commission, and the words \"AMATEUR RADIO.\"\n(c) This provision for the issue of special plates applies only if the applicant's motor vehicle is already registered in Minnesota so that the applicant has valid regular Minnesota plates issued for that motor vehicle under which to operate it during the time that it will take to have the necessary special plates made.\n(d) If owning more than one motor vehicle of the type specified in this subdivision, the applicant may apply for special plates for each motor vehicle and, if each application complies with this subdivision, the commissioner shall furnish the applicant with the special plates, indicating the official amateur call letters and other distinguishing information as the commissioner considers necessary, for each of the motor vehicles.\n(e) The commissioner may make reasonable rules governing the use of the special plates as will assure the full compliance by the owner of the special plates, with all existing laws governing the registration of motor vehicles and the transfer and use of the plates.\n(f) Despite any contrary provision of subdivision 1, the special plates issued under this subdivision may be transferred by an owner to another motor vehicle listed in paragraph (a) and registered to the same owner, upon the payment of a fee of $5. The commissioner must be notified before the transfer and may prescribe a format for the notification.\n(a) The commissioner may issue personalized plates or, if requested for special plates issued under section 168.123 for veterans, 168.124 for medal of honor recipients, or 168.125 for former prisoners of war, applicable personalized special veterans plates, to an applicant who:\n(1) is an owner of a passenger automobile including a passenger automobile registered as a classic car, pioneer car, collector car, or street rod; any truck with a manufacturer's nominal rated capacity of one ton or less and resembling a pickup truck; a motorcycle, including a classic motorcycle; a motorized bicycle; a commuter van as defined in section 168.126; or a recreational vehicle;\n(2) pays a onetime fee of $100 and any other fees required by this chapter;\n(3) pays the registration tax required by this chapter for the motor vehicle; and\n(4) complies with this chapter and rules governing registration of motor vehicles and licensing of drivers.\n(b) The commissioner shall charge a replacement fee for personalized license plates and personalized special veterans plates issued under section 168.123 as specified in subdivision 5. This fee must be paid by the applicant whenever the personalized plates are required to be replaced by law, except that as provided in section 168.124, subdivision 3, and 168.125, subdivision 1b, no fee may be charged to replace plates issued under those sections.\n(c) In lieu of the registration number assigned as provided in subdivision 1, personalized plates and personalized special veterans plates must have imprinted on them a series of not more than seven numbers and letters, or five numbers and letters for personalized special veterans plates, in any combination and, as applicable, satisfy the design requirements of section 168.123, 168.124, or 168.125. When an applicant has once obtained personalized plates or personalized special veterans plates, the applicant shall have a prior claim for similar personalized plates or personalized special veterans plates in the next succeeding year as long as current motor vehicle registration is maintained.\n(d) The commissioner shall adopt rules in the manner provided by chapter 14, regulating the issuance and transfer of personalized plates and personalized special veterans plates. No words or combination of letters placed on these plates may be used for commercial advertising, be of an obscene, indecent, or immoral nature, or be of a nature that would offend public morals or decency. The call signals or letters of a radio or television station are not commercial advertising for the purposes of this subdivision.\n(e) Despite the provisions of subdivision 1, personalized plates and personalized special veterans plates issued under this subdivision may be transferred to another motor vehicle listed in paragraph (a) and owned by the applicant, upon the payment of a fee of $5.\n(f) The commissioner may by rule specify the format for notification.\n(g) A personalized plate or personalized special veterans plate issued for a classic car, pioneer car, collector car, street rod, or classic motorcycle may not be transferred to a vehicle not eligible for such a plate.\n(h) Despite any law to the contrary, if the personalized license plates are lost, stolen, or destroyed, the applicant may apply and must be issued duplicate license plates bearing the same combination of letters and numbers and the same design as (1) the former personalized plates or personalized special veterans plates under section 168.123 upon the payment of the fee required by section 168.29 or (2) the former personalized special veterans plates issued under section 168.124 or 168.125, without charge.\n(i) A personalized vertical motorcycle plate may be issued upon payment of an additional payment of $100. The vertical plate must have not more than four identification characters, cannot be a duplication of any current or reserved license plate, and must meet the requirements in paragraph (d).\n(a) The commissioner shall issue special plates, or a single license plate in the case of a motorcycle plate, to any applicant who:\n(1) is a member of a fire department receiving state aid under chapter 69, has a letter from the fire chief, and is an owner of a passenger automobile, a one-ton pickup truck, or a motorcycle;\n(2) pays a fee in the amount specified for special plates under subdivision 5, and any other fees required by this chapter;\n(3) pays the registration tax required by this chapter for the motor vehicle; and\n(4) complies with this chapter and rules governing the registration of motor vehicles and licensing of drivers.\n(b) In lieu of the identification required under subdivision 1, the special plates must bear an emblem of a Maltese Cross together with any numbers or characters prescribed by the commissioner.\n(c) Special plates issued under this subdivision may only be used during the period that the owner of the motor vehicle is a member of a fire department as specified in this subdivision. When the individual to whom the special plates were issued is no longer a member of a fire department or when the motor vehicle ownership is transferred, the owner shall remove the special plates from the motor vehicle. If the commissioner receives written notification that an individual is no longer qualified for these special plates, the commissioner shall invalidate the plates and notify the individual of this action. The individual may retain the plate only upon demonstrating compliance with the qualifications of this subdivision. Upon removal or invalidation of the special plates or special motorcycle plate, the owner or purchaser of the motor vehicle shall obtain regular plates, a regular motorcycle plate, or special plates for the proper registration classification for the motor vehicle.\n(d) A special motorcycle license plate issued under this subdivision must be the same size as a standard motorcycle license plate.\n(e) Upon payment of a fee of $5, plates issued under this subdivision for a passenger automobile or truck may be transferred to another passenger automobile or truck owned or jointly owned by the person to whom the plates were issued. On payment of a fee of $5, a plate issued under this subdivision for a motorcycle may be transferred to another motorcycle owned or jointly owned by the person to whom the plate was issued.\n(f) The commissioner may adopt rules under the Administrative Procedure Act, sections 14.001 to 14.69, to govern the issuance and use of the special plates authorized in this subdivision.\n(a) The commissioner shall issue special plates to any applicant who:\n(1) is a regularly enlisted, commissioned, or retired member of the Minnesota National Guard, other than an inactive member who is not a retired member, and is an owner of a passenger automobile;\n(2) pays a fee in the amount specified for special plates under subdivision 5, and any other fees required by this chapter;\n(3) pays the registration tax required by this chapter; and\n(4) complies with this chapter and rules governing the registration of motor vehicles and licensing of drivers.\n(b) The adjutant general shall design the emblem for these special plates subject to the approval of the commissioner.\n(c) Special plates issued under this subdivision may only be used during the period that the owner of the motor vehicle is an active or retired member of the Minnesota National Guard as specified in this subdivision. When the individual to whom the special plates were issued is no longer an active or retired member of the Minnesota National Guard, the special plates must be removed from the vehicle by the owner. If the commissioner receives written notification that an individual is no longer qualified for these special plates, the commissioner shall invalidate the plates and notify the individual of this action. The individual may retain the plate only upon demonstrating compliance with the qualifications of this subdivision. Upon removal or invalidation of the special plates, either the owner or purchaser of the motor vehicle shall obtain regular plates for the motor vehicle.\n(d) While the person is an active or retired member of the Minnesota National Guard, plates issued pursuant to this subdivision may be transferred to another motor vehicle owned by that individual upon payment of a fee of $5.\n(e) For purposes of this subdivision, \"retired member\" means an individual placed on the roll of retired officers or roll of retired enlisted members in the Office of the Adjutant General under section 192.18 and who is not deceased.\n(f) The commissioner may adopt rules under the Administrative Procedure Act to govern the issuance and use of the special plates authorized by this subdivision.\n(a) The commissioner shall issue special plates to an applicant who:\n(1) is not eligible for special National Guard plates under subdivision 2c, is a member of the United States armed forces ready reserve as described in United States Code, title 10, section 10142 or 10143, or a retired reserve as described in United States Code, title 10, section 10154, and is an owner of a passenger automobile;\n(2) pays a fee in the amount specified for special plates under subdivision 5, and any other fees required by this chapter;\n(3) pays the registration tax required by this chapter; and\n(4) complies with this chapter and rules governing the registration of motor vehicles and licensing of drivers.\n(b) The commissioner of veterans affairs shall design the emblem for these special plates subject to the approval of the commissioner.\n(c) Special plates issued under this subdivision may only be used during the period that the owner of the motor vehicle is a member of the ready reserve. When the owner is no longer a member, the special plates must be removed from the motor vehicle by the owner. If the commissioner receives written notification that an individual is no longer qualified for these special plates, the commissioner shall invalidate the plates and notify the individual of this action. The individual may retain the plate only upon demonstrating compliance with the qualifications of this subdivision. On removal or invalidation of the special plates, either the owner or purchaser of the motor vehicle shall obtain regular plates for the motor vehicle. While the owner is a member of the ready reserve, plates issued under this subdivision may be transferred to another motor vehicle owned by that individual on paying a fee of $5.\n(d) The commissioner may adopt rules under the Administrative Procedure Act to govern the issuance and use of the special plates authorized by this subdivision.\n(a) The commissioner shall issue special license plates to an applicant who:\n(1) is a volunteer ambulance attendant as defined in section 144E.001, subdivision 15, and owns a motor vehicle taxed as a passenger automobile;\n(2) pays the registration tax required by this chapter for the motor vehicle;\n(3) pays a fee in the amount specified for special plates under subdivision 5, and any other fees required by this chapter; and\n(4) complies with this chapter and rules governing the registration of motor vehicles and licensing of drivers.\n(b) An individual may use special plates issued under this subdivision only during the period that the individual is a volunteer ambulance attendant. When the individual to whom the special plates were issued ceases to be a volunteer ambulance attendant, the individual shall remove each set of special plates issued. If the commissioner receives written notification that an individual is no longer qualified for these special plates, the commissioner shall invalidate the plates and notify the individual of this action. The individual may retain the plate only upon demonstrating compliance with the qualifications of this subdivision. When ownership of the motor vehicle is transferred, the individual shall remove the special plates from that motor vehicle. On removal or invalidation of the special plates, the owner or purchaser of the motor vehicle shall obtain regular plates for the motor vehicle. Special plates issued under this subdivision may be transferred to another motor vehicle owned by the volunteer ambulance attendant on payment of a fee of $5.\n(c) The commissioner may adopt rules governing the design, issuance, and sale of the special plates authorized by this subdivision.\n(a) On application of the owner and in lieu of issuing plates under subdivision 1 to a motor vehicle registered and taxed as a passenger automobile, the commissioner may assign to the motor vehicle original Minnesota registration plates issued in the same year as the model year of the motor vehicle, if (1) the original plates are at least 20 years old, (2) the owner of the motor vehicle has the original plates in possession at the time of the application, and (3) the owner provides the plate number to the commissioner.\n(b) Plates displayed under this subdivision, including stickers applied to the plates, must be clearly legible and must be displayed on the motor vehicle.\n(c) The commissioner shall not assign the registration number on the original plates to the motor vehicle if the commissioner determines that the number on the original plate is identical to the number on any plate in the current or reserved numbering system used by the commissioner.\n(d) Despite subdivision 1, an original plate whose number has been assigned under this subdivision may be displayed for as long as the plates, including tabs and stickers on the plates, are clearly legible and the number is not subsequently used by the commissioner as a plate number in a registration numbering system.\n(e) Despite subdivision 1, original plates assigned under this subdivision need not bear a tab or sticker to indicate the month or year of registration if the motor vehicle carries the registration certificate issued under section 168.11 at all times when the motor vehicle is operated on the public highways.\n(f) The commissioner may charge a fee for receiving an application and assigning original plate numbers.\n(a) The commissioner shall issue special retired firefighters plates to an applicant who:\n(1) is a retired member of a fire department as defined in section 299N.01, subdivision 2, has a letter from the fire chief affirming that the applicant is a retired firefighter who served ten or more years and separated in good standing, and is a registered owner of a passenger automobile, a one-ton pickup truck, a recreational vehicle, or a motorcycle;\n(2) pays a fee in the amount specified for special plates under subdivision 5, for each set of license plates applied for along with any other fees required by this chapter; and\n(3) complies with this chapter and rules governing registration of motor vehicles and licensing of drivers.\n(b) The commissioner shall design the special plate emblem so that it is distinguishable from the emblem on firefighter special plates issued under subdivision 2b.\n(c) On payment of a transfer fee of $5, plates issued under this subdivision may be transferred to another passenger automobile, one-ton pickup truck, recreational vehicle, or motorcycle registered to the individual to whom the special plates were issued.\n(d) Fees collected under this subdivision must be credited to the driver and vehicle services operating account under section 299A.705.\n(e) This subdivision is exempt from section 168.1293.\nMS 1988 [Repealed, 1990 c 497 s 13]\nMS 1988 [Repealed, 1990 c 497 s 13]\n(a) In addition to any fee otherwise authorized or any tax otherwise imposed upon any vehicle, the payment of which is required as a condition to the issuance of any plate or plates, the commissioner shall impose the fee specified in paragraph (b) that is calculated to cover the cost of manufacturing and issuing the plate or plates, except for plates issued to disabled veterans as defined in section 168.031 and plates issued pursuant to section 168.124, 168.125, or 168.27, subdivisions 16 and 17, for passenger automobiles. The commissioner shall issue graphic design plates only for vehicles registered pursuant to section 168.017 and recreational vehicles registered pursuant to section 168.013, subdivision 1g.\n(b) Unless otherwise specified or exempted by statute, the following plate and validation sticker fees apply for the original, duplicate, or replacement issuance of a plate in a plate year:\n(c) For vehicles that require two of the categories in paragraph (b), the registrar shall only charge the higher of the two fees and not a combined total.",
	"repealed": false
}