{
	"id": "253D.14",
	"url": "https://www.revisor.mn.gov/statutes/cite/253D.14",
	"title": "253D.14 VICTIM NOTIFICATION OF PETITION AND RELEASE; RIGHT TO SUBMIT STATEMENT.",
	"text": "As used in this section:\n(1) \"crime\" has the meaning given to \"violent crime\" in section 609.1095, and includes criminal sexual conduct in the fifth degree and offenses within the definition of \"crime against the person\" in section 253B.02, subdivision 4e, and also includes offenses listed in section 253D.02, subdivision 8, paragraph (b), regardless of whether they are sexually motivated;\n(2) \"victim\" means a person who has incurred loss or harm as a result of a crime, the behavior for which forms the basis for a commitment under this chapter, and includes the family members, guardian, conservator, or custodian of a minor, incompetent, incapacitated, or deceased person; and\n(3) \"convicted\" and \"conviction\" have the meanings given in section 609.02, subdivision 5, and also include juvenile court adjudications, findings under Minnesota Rules of Criminal Procedure, rule 20.02, that the elements of a crime have been proved, and findings in commitment cases under this section or section 253B.18, that an act or acts constituting a crime occurred.\nA county attorney who files a petition to commit a person under this chapter shall make a reasonable effort to provide prompt notice of filing the petition to any victim of a crime for which the person was convicted or was listed as a victim in the petition of commitment. In addition, the county attorney shall make a reasonable and good faith effort to promptly notify the victim of the resolution of the process for requesting the notification of an individual's change in status as provided in section 253D.14, subdivision 3.\nA victim may request notification of an individual's discharge or release as outlined in subdivision 3 by submitting a written request for notification to the executive director of the facility in which the individual is confined. The Department of Corrections or a county attorney who receives a request for notification from a victim under this section following an individual's civil commitment shall promptly forward the request to the executive director of the treatment facility in which the individual is confined.\nBefore provisionally discharging, discharging, granting pass-eligible status, approving a pass plan, or otherwise permanently or temporarily releasing a person committed under this chapter from a treatment facility, the executive director shall make a reasonable effort to notify any victim of a crime for which the person was convicted that the person may be discharged or released and that the victim has a right to submit a written statement regarding decisions of the executive director, or special review board, with respect to the person. To the extent possible, the notice must be provided at least 14 days before any special review board hearing or before a determination on a pass plan. Notwithstanding section 611A.06, subdivision 4, the executive board shall provide the judicial appeal panel with victim information in order to comply with the provisions of this chapter. The judicial appeal panel shall ensure that the data on victims remains private as provided for in section 611A.06, subdivision 4. This subdivision applies only to victims who have submitted a written request for notification as provided in subdivision 2a.\nMS 2020 [Repealed, 1Sp2021 c 11 art 6 s 7]\nRights under this section are in addition to rights available to a victim under chapter 611A. This provision does not give a victim all the rights of a \"notified person\" or a person \"entitled to statutory notice\" under section 253B.18, subdivision 4a, 4b, or 5; 253D.23; or 253D.27.",
	"repealed": false
}