{
	"id": "302A.223",
	"url": "https://www.revisor.mn.gov/statutes/cite/302A.223",
	"title": "302A.223 REMOVAL OF DIRECTORS.",
	"text": "The provisions of this section apply unless modified by the articles, the bylaws, or an agreement described in section 302A.457.\nA director may be removed at any time, with or without cause, if:\n(a) the director was named by the board to fill a vacancy;\n(b) the shareholders have not elected directors in the interval between the time of the appointment to fill a vacancy and the time of the removal; and\n(c) a majority of the remaining directors present affirmatively vote to remove the director.\nExcept as provided in subdivision 4, any one or all of the directors may be removed at any time, with or without cause, by the affirmative vote of the holders of a majority of the voting power of all shares entitled to vote at an election of directors; provided that, if a director has been elected solely by the holders of a class or series of shares, as stated in the articles or bylaws, then that director may be removed only by the affirmative vote of the holders of a majority of the voting power of all shares of that class or series entitled to vote at an election of that director.\nIn a corporation having cumulative voting, unless the entire board is removed simultaneously, a director is not removed from the board if there are cast against removal of the director the votes of a proportion of the voting power sufficient to elect the director at an election of the entire board under cumulative voting.\nNew directors may be elected at a meeting at which directors are removed. If the corporation allows cumulative voting and a shareholder notifies the presiding officer at any time prior to the election of new directors of intent to cumulate the votes of the shareholder, the presiding officer shall announce before the election that cumulative voting is in effect, and shareholders shall cumulate their votes as provided in section 302A.215, subdivision 1, clause (b).",
	"repealed": false
}