{
	"id": "282.222",
	"url": "https://www.revisor.mn.gov/statutes/cite/282.222",
	"title": "282.222 SALE.",
	"text": "All lands so classified and appraised and remaining unsold shall be offered for sale at a public sale to be held by the county auditor at the time determined by the county board in a resolution authorizing the sale and fixing the date of the commencement thereof. The auditor shall publish a notice of the intended sale and the resolution authorizing same by publication once a week for two weeks in an official newspaper of the county, the last publication to be not less than ten days previous to the commencement of the sale. Notice of the sale shall be given in substantially the following form:\n\"NOTICE OF SALE OF AGRICULTURAL LANDS\nNotice is hereby given that on ..............., the .............. day of ............, ......., at my office in ......................... in the county of ........................., I shall sell to the highest bidder the following described parcels of land in the county, which have been forfeited to the state for nonpayment of taxes, and which have been classified as agricultural lands and appraised as provided by law. This sale will be governed by the provisions of sections 282.221 to 282.226 and by the resolution of the county board authorizing such sale, which resolution is as follows:\nThe land shall be described in the notice and offered for sale in parcels not exceeding one-quarter section in area.\nIf the county board of St. Louis or Koochiching Counties determines that the sale shall take place in a county facility other than the courthouse, the notice shall specify such facility and its location.\nThese lands shall be sold to the highest bidder and at a price not less than the appraised value thereof. Any lands not sold at this public sale may be sold by the county auditor at a price not less than the appraised value thereof. The sale shall continue until all parcels are sold or until the county board shall order a reappraisal or shall withdraw any or all such parcels from sale or until such time as the county board shall have determined by resolution adopted before giving notice of sale. Any lands remaining unsold may be included in the notice of sale and offered for sale by the county auditor in each following year until the same shall be sold, or the original list of lands may be added to annually by publishing, in the same manner as provided for the publication of the original list, the descriptions and appraised values of such additional parcels which have been classified as agricultural and which classification shall have been approved as provided by law. The purchasers at such sale shall be entitled to immediate possession, subject to the provisions of any existing valid lease made in behalf of the state.\nAny parcel of land described in any such notice of sale may, at any time not less than one week prior to the date of the sale, be purchased at the appraised value thereof by the person who is a bona fide federal entryman or patentee of any such land or by the person who was the record owner of the fee title thereto at the time the state became the absolute owner thereof.\nAll sales under sections 282.221 to 282.226 shall be for cash or on the following terms: at least 15 percent of the purchase price shall be paid in cash at the time of the sale, and the balance shall be paid in equal annual installments over a period of 20 years, with interest at a rate equal to the rate in effect at the time under section 549.09, payable annually, on the portion remaining unpaid, with privilege of prepayment of any installment on any interest date. Sales on terms shall be evidenced by a certificate issued by the county auditor in a form prescribed by the attorney general. The county auditor shall submit a copy of the certificate to the commissioner of natural resources within 30 days. The appraised value of all merchantable timber on such agricultural lands shall be paid for in cash in full at the time of sale. The county auditor shall report all sales to the commissioner of natural resources within 30 days. Failure of the purchaser to make any payment of any installment or of any interest required under any contract within six months from the date on which the payment is due, or to pay all taxes that may be levied upon the land purchased before they become delinquent, shall constitute a default. Upon default the contract shall be canceled and all right, title, and interest of the purchaser, or the purchaser's heirs, representatives, or assigns in the premises shall terminate upon cancellation in accord with section 282.40. A record of the default shall be made in the state land records kept by or under the direction of the commissioner of natural resources. A certificate of the default may be made by or under the direction of the commissioner and filed with the county treasurer or recorded in the office of the county recorder of the county in which the premises are situated. Any record or certificate shall be prima facie evidence of the facts stated in it. The making of the record or certificate is not essential to the taking effect of the cancellation and termination. Upon cancellation and termination, the land described in the contract shall be subject to disposition as provided in this section after having been reclassified and reappraised as provided by section 282.221. The county auditor shall report any default to the commissioner of natural resources on or before June 30th of each year.\nIn any case where a certificate of cancellation of any certificate of sale of lands sold pursuant to sections 282.221 to 282.226, has heretofore been made by either the commissioner of management and budget or the commissioner of natural resources and filed in the office of the officer executing the same or in the office of the commissioner of management and budget or recorded in the office of the county recorder of the county in which the land lies, such cancellation is hereby validated and made effective, and the certificate of sale shall be deemed canceled as if canceled by the proper officer and in the manner prescribed by law. All cancellations made after January 1, 1984, shall be in accord with section 282.40.\nIn any case where prior to the passage of Laws 1947, chapter 484, the purchaser has defaulted in the payment of any installment on the principal or interest due on a certificate of sale of land made pursuant to sections 282.221 to 282.226, or has failed to pay before they became delinquent all taxes levied upon the land so purchased, and where a certificate of cancellation has been made and filed or recorded as provided in subdivision 5, it shall be presumed that the purchaser, and all persons claiming under the purchaser, have left and abandoned the land and all right, title, and interest therein and claim thereto, and have released the same absolutely to the state and its assigns.\nIn any case where prior to the passage of Laws 1947, chapter 484, the purchaser has defaulted in the payment of any installment of the principal or interest due under a certificate of sale of land issued pursuant to sections 282.221 to 282.226, or has failed to pay all taxes that may have been levied upon the lands, and where a certificate of cancellation has been made and filed or recorded as provided in subdivision 5, no action for the recovery or possession of the land or the enforcement of any right, title, or interest therein, or claim thereto shall be maintained by the purchaser or any one claiming under the purchaser unless such action is commenced within six months after the passage of Laws 1947, chapter 484.",
	"repealed": false
}