{
	"id": "154.15",
	"url": "https://www.revisor.mn.gov/statutes/cite/154.15",
	"title": "154.15 CERTIFICATES OF REGISTRATION MUST BE RENEWED ANNUALLY.",
	"text": "All registered barbers and registered instructors of barbering who continue in active practice or service shall, on or before December 31 each year, renew their certificates of registration for the following year and pay the required fee. Every certificate of registration which has not been renewed during the month of December in any year shall expire on the 31st day of December in that year. All shop registration cards shall be renewed on or before June 30 of each year upon payment of the required fee. All certificates of registration as a barber school shall be renewed on or before December 31 of each year upon payment of the required fee.\nA registered barber who has not renewed a certificate of registration may be reinstated within four years of such failure to renew without examination upon the payment of the required restoration fee for each year the certificate is lapsed. A registered instructor of barbering who has not renewed a certificate of registration may be reinstated within four years of such failure to renew without examination upon payment of the required restoration fee for each year the certificate is lapsed. All registered barbers who allow their certificates of registration to lapse for more than four years shall be required to reexamine before being issued a certificate of registration. All registered instructors of barbering who allow their certificates of registration to lapse for more than four years shall be required to reexamine before being issued a certificate of registration. A barber shop owner who has not renewed the barber shop certificate for more than one year may reinstate the barber shop registration upon payment of the restoration fee for each year the shop card was lapsed. If lapsed or unregistered status is discovered by the barber inspector during inspection, penalties under section 154.162 shall apply.",
	"repealed": false
}