{
	"id": "134.001",
	"url": "https://www.revisor.mn.gov/statutes/cite/134.001",
	"title": "134.001 DEFINITIONS.",
	"text": "The terms used in this chapter have the meanings given them in this section.\n\"Public library\" means any library that provides free access to all residents of a city or county without discrimination, receives at least half of its financial support from public funds and is organized under the provisions of this chapter. Except as provided in section 134.195, it does not include libraries such as law, medical, school and academic libraries organized to serve a special group of persons, or libraries organized as a combination of a public library and another type of library.\n\"Public library services\" means services provided by or on behalf of a public library. Except as provided in section 134.195, it does not include services for elementary schools, secondary schools or postsecondary educational institutions.\n\"Regional public library system\" means a multicounty public library service agency that provides free access to all residents of the region without discrimination, and is organized under the provisions of this chapter or chapter 317A, or section 471.59.\n\"Basic system services\" means services offered by all regional public library systems either directly or by contract. These services shall include, but are not limited to, communication among participants, resource sharing, delivery of materials, reciprocal borrowing, and cooperative reference service.\n\"Multicounty, multitype library system\" means a cooperative network composed of any combination of public libraries, regional public library systems, public school libraries, public or private college or university libraries and any other libraries which share services and resources within a multicounty area.\n\"City\" or \"cities\" means home rule and statutory cities unless specifically provided otherwise.\n\"Regional public library district\" means a governmental unit formed according to this chapter to operate multicounty public library services.",
	"repealed": false
}