{
	"id": "447.36",
	"url": "https://www.revisor.mn.gov/statutes/cite/447.36",
	"title": "447.36 ANNEXATION OF TERRITORY.",
	"text": "After the creation or reorganization of a hospital district, a city or town whose territory is contiguous to the district or contiguous to a city or town that is contiguous to the district at any point may ask to be annexed to the district. The resolution is subject to referendum according to section 447.31, subdivision 3. Annexed territory is subject to taxation like other property in the district for the support of its facilities and for the payment of principal and interest becoming due after the annexation on bonds of the district, whether authorized or issued before or after the annexation. If the hospital district has outstanding bonds or has voted bonds that are not yet issued, the annexation must not be requested unless approved by a majority of the electors of the city or town voting on the question at a regular or special election. The hospital board may condition its approval of the annexation upon the contribution, by or on behalf of the city or town to be annexed, to the capital improvement fund or the bond sinking fund of the hospital district, of an amount agreed upon as a reasonable estimate of the proportionate share, properly applicable to the annexed territory, of capital costs previously paid by the district, having regard to contributions previously made by cities and towns in the district and their inhabitants, and principal and interest already paid on bonds of the district. A city or town asking to be annexed may appropriate money or may authorize, issue, and sell its bonds or may accept and spend contributions from private parties to pay the proportionate share agreed upon. Each annexation becomes effective upon the date of adoption of the hospital board's resolution approving the annexation, or on a later date as the resolution prescribes. A certified copy of the resolution must be filed as provided in section 447.31, subdivision 4, for resolutions creating the district.",
	"repealed": false
}