{
	"id": "256S.211",
	"url": "https://www.revisor.mn.gov/statutes/cite/256S.211",
	"title": "256S.211 RATE SETTING; UPDATING RATES; SPENDING REQUIREMENTS.",
	"text": "When establishing and updating the base wages according to section 256S.212, the commissioner shall use standard occupational classification (SOC) codes from the Bureau of Labor Statistics as defined in the edition of the Occupational Handbook published immediately prior to January 1, 2019, using Minnesota-specific wages taken from job descriptions.\nOn January 1, 2024, the commissioner shall update component rates and rates according to sections 256S.212 to 256S.215, using the data referenced in subdivision 1.\nOn January 1 of each year, the commissioner must update the home-delivered meals rate in section 256S.215, subdivision 15, by the percent increase in the nursing facility dietary per diem using the two most recently available nursing facility cost reports.\n(a) Except for community access for disability inclusion customized living and brain injury customized living under section 256B.49, home-delivered meals, and designated disproportionate share facilities under section 256S.205, at least 80 percent of the marginal increase in revenue from the implementation of any rate adjustments under this section must be used to increase compensation-related costs for employees directly employed by the provider.\n(b) For the purposes of this subdivision, compensation-related costs include:\n(1) wages and salaries;\n(2) the employer's share of FICA taxes, Medicare taxes, state and federal unemployment taxes, workers' compensation, and mileage reimbursement;\n(3) the employer's paid share of health and dental insurance, life insurance, disability insurance, long-term care insurance, uniform allowance, pensions, and contributions to employee retirement accounts; and\n(4) benefits that address direct support professional workforce needs above and beyond what employees were offered prior to the implementation of any rate adjustments under this section, including any concurrent or subsequent adjustments to the base wage indices.\n(c) Compensation-related costs for persons employed in the central office of a corporation or entity that has an ownership interest in the provider or exercises control over the provider, or for persons paid by the provider under a management contract, do not count toward the 80 percent requirement under this subdivision.\n(d) A provider agency or individual provider that receives additional revenue subject to the requirements of this subdivision shall prepare, and upon request submit to the commissioner, a distribution plan that specifies the amount of money the provider expects to receive that is subject to the requirements of this subdivision, including how that money was or will be distributed to increase compensation-related costs for employees. Within 60 days of final implementation of the new phase-in proportion or adjustment to the base wage indices subject to the requirements of this subdivision, the provider must post the distribution plan and leave it posted for a period of at least six months in an area of the provider's operation to which all employees have access. The posted distribution plan must include instructions regarding how to contact the commissioner, or the commissioner's representative, if an employee has not received the compensation-related increase described in the plan.",
	"repealed": false
}