{
	"id": "80C.146",
	"url": "https://www.revisor.mn.gov/statutes/cite/80C.146",
	"title": "80C.146 ELIMINATION OF SERVICE BAYS PROHIBITED.",
	"text": "As used in this section, the terms defined in this subdivision have the meanings given them.\n\"Full-service station\" means any place of business where motor vehicle fuel is sold and delivered into the tanks of motor vehicles and has an enclosed area where automobile repairs are offered to consumers, including, but not limited to, lubrication, oil change, tire repair, battery charge, replacement of fan belts, hoses, and wiper blades.\n\"Service bays\" are enclosed areas where automobile repairs are performed, including, but not limited to, lubrication, oil change, tire repair, battery charge, replacement of fan belts, hoses, and wiper blades.\n(a) A motor fuel franchise agreement entered into or renewed, extended, or modified, after April 27, 1988, must comply with this subdivision if it allows the franchisor to modify, remodel, or alter a full-service station operated by a franchisee by eliminating one or more service bays. The agreement must provide that if the motor fuel franchisor eliminates one or more service bays during the term of the agreement, the franchisor must first pay to the franchisee in cash an amount that fairly and adequately compensates the franchisee for the loss of the service and repair business. The amount of compensation must be determined without regard to:\n(1) the income or loss the franchisee may realize as a result of any subsequent or replacement business the franchisee may be entitled to operate on the premises leased from the motor fuel franchisor; or\n(2) the income or loss the franchisee may realize by relocating the franchisee service and repair business or by acquiring another service and repair business.\n(b) The commissioner shall require inclusion of the provision specified in paragraph (a) in the franchise agreement as a condition of registration of the agreement. An agreement subject to this subdivision that does not contain the provision is deemed to contain the provision. The provision may not be waived or modified except in a writing signed by the franchisee that is executed at least 30 days after the execution of the franchise agreement, is separate and independent from the franchise agreement, and is based upon adequate consideration. Adequate consideration may include, without limitation, an agreement to purchase the entire business operated by the franchisee or an agreement to provide equivalent repair facilities for use by the franchisee.\n(c) If the franchisor and the franchisee are unable to agree on the amount of compensation, and either the franchisor or the franchisee demands arbitration, the matter must be submitted to binding arbitration in accordance with sections 572B.01 to 572B.31 and the rules of the American Arbitration Association. Within 30 days after the demand for arbitration, the franchisor and the franchisee shall each select an arbitrator. The two arbitrators shall select a third arbitrator within 45 days after the demand for arbitration. The franchisor and the franchisee shall pay the fees and expenses of the arbitrator each selects, and the franchisor and franchisee shall share equally the fees and expenses of the third arbitrator.\n(d) Nothing in this subdivision prohibits a motor fuel franchisor from altering, modifying, or remodeling a full-service station, without payment to the franchisee, following the expiration of the franchise relationship based upon termination or nonrenewal of the franchise relationship in accordance with United States Code, title 15, section 2802(b)(3)(D).\nThe attorney general or any aggrieved party may institute a civil action in the district court for an injunction prohibiting any violation of subdivision 2 and an award of costs, disbursements, and reasonable attorney's fees. It is no defense to the action that the state or aggrieved party may have adequate remedies at law.",
	"repealed": false
}