{
	"id": "142F.15",
	"url": "https://www.revisor.mn.gov/statutes/cite/142F.15",
	"title": "142F.15 AMERICAN INDIAN FOOD SOVEREIGNTY FUNDING PROGRAM.",
	"text": "The American Indian food sovereignty funding program is established to improve access and equity to food security programs within Tribal and American Indian communities. The program shall assist Tribal Nations and American Indian communities in achieving self-determination and improve collaboration and partnership building between American Indian communities and the state. The commissioner of children, youth, and families shall administer the program and provide outreach, technical assistance, and program development support to increase food security for American Indians.\n(a) The commissioner shall provide funding to support food system changes and provide equitable access to existing and new methods of food support for American Indian communities. The commissioner shall determine the timing and form of the application for the program.\n(b) Eligible recipients of funding under this section include:\n(1) federally recognized American Indian Tribes or Bands in Minnesota as defined in section 10.65; or\n(2) nonprofit organizations or fiscal sponsors with a majority American Indian board of directors.\n(c) Funding for American Indian Tribes or Bands must be allocated by a formula determined by the commissioner. Funding for nonprofit organizations or fiscal sponsors must be awarded through a competitive grant process.\nRecipients shall use money provided under this section to promote food security for American Indian communities by:\n(1) planning for sustainable food systems;\n(2) implementing food security programs, including but not limited to technology to facilitate no-contact or low-contact food distribution and outreach models;\n(3) providing culturally relevant training for building food access;\n(4) purchasing, producing, processing, transporting, storing, and coordinating the distribution of food, including culturally relevant food; and\n(5) purchasing seeds, plants, equipment, or materials to preserve, procure, or grow food.\nRecipients shall report on the use of American Indian food sovereignty funding program money under this section to the commissioner.\nThe commissioner shall determine the timing and form required for the reports.",
	"repealed": false
}