{
	"id": "260B.007",
	"url": "https://www.revisor.mn.gov/statutes/cite/260B.007",
	"title": "260B.007 DEFINITIONS.",
	"text": "As used in this chapter, the terms defined in this section have the same meanings given to them.\n\"Agency\" means the local social services agency or a licensed child-placing agency.\n\"Child\" means an individual under 18 years of age and includes any minor alleged to have been delinquent or a juvenile traffic offender prior to having become 18 years of age.\n\"Child-placing agency\" means anyone licensed under sections 142B.01 to 142B.79 and 252.28, subdivision 2.\n\"Court\" means juvenile court unless otherwise specified in this section.\n(a) Except as otherwise provided in paragraphs (b), (c), and (d), \"delinquent child\" means a child:\n(1) who has violated any state or local law, except as provided in section 260B.225, subdivision 1, and except for juvenile offenders as described in subdivisions 16 to 18;\n(2) who has violated a federal law or a law of another state and whose case has been referred to the juvenile court if the violation would be an act of delinquency if committed in this state or a crime or offense if committed by an adult;\n(3) who has escaped from confinement to a state juvenile correctional facility after being committed to the custody of the commissioner of corrections; or\n(4) who has escaped from confinement to a local juvenile correctional facility after being committed to the facility by the court.\n(b) The term delinquent child does not include a child alleged to have committed murder in the first degree after becoming 16 years of age, but the term delinquent child does include a child alleged to have committed attempted murder in the first degree.\n(c) The term delinquent child does not include a child alleged to have engaged in conduct which would, if committed by an adult, violate any federal, state, or local law relating to being hired, offering to be hired, or agreeing to be hired by another individual to engage in sexual penetration or sexual conduct.\n(d) Effective August 1, 2026, and applied to acts committed on or after that date, the term delinquent child does not include a child alleged to have committed a delinquent act before becoming 13 years old.\n\"Foster care\" means 24-hour substitute care for children placed away from their parents or guardian and for whom a responsible social services agency has placement and care responsibility. Foster care includes, but is not limited to, placement in foster family homes, foster homes of relatives, group homes, emergency shelters, residential facilities not excluded in this subdivision, child care institutions, and preadoptive homes. A child is in foster care under this definition regardless of whether the facility is licensed and payments are made for the cost of care. Nothing in this definition creates any authority to place a child in a home or facility that is required to be licensed which is not licensed. Foster care does not include placement in any of the following facilities: hospitals, inpatient chemical dependency treatment facilities, facilities that are primarily for delinquent children, any corrections facility or program within a particular corrections facility not meeting requirements for title IV-E facilities as determined by the commissioner, facilities to which a child is committed under the provision of chapter 253B, forestry camps, or jails. Foster care is intended to provide for a child's safety or to access treatment. Foster care must not be used as a punishment or consequence for a child's behavior.\n\"Legal custody\" means the right to the care, custody, and control of a child who has been taken from a parent by the court in accordance with the provisions of sections 260B.198 and 260B.235. The expenses of legal custody are paid in accordance with the provisions of section 260B.331.\n\"Minor\" means an individual under 18 years of age.\n\"Parent\" means the birth or adoptive parent of a minor. For an Indian child, parent includes any Indian person who has adopted a child by tribal law or custom, as provided in section 260.755, subdivision 14.\n\"Person\" includes any individual, association, corporation, partnership, and the state or any of its political subdivisions, departments, or agencies.\n\"Relative\" means a parent, stepparent, grandparent, brother, sister, uncle, or aunt of the minor. This relationship may be by blood or marriage. For an Indian child, relative means a person who is a member of the Indian child's family as defined in the Indian Child Welfare Act of 1978, United States Code, title 25, section 1903, paragraphs (2), (6), and (9).\n\"Custodian\" means any person who is under a legal obligation to provide care and support for a minor or who is in fact providing care and support for a minor. This subdivision does not impose upon persons who are not otherwise legally responsible for providing a child with necessary food, clothing, shelter, education, or medical care a duty to provide that care. For an Indian child, custodian means any Indian person who has legal custody of an Indian child under tribal law or custom or under state law or to whom temporary physical care, custody, and control has been transferred by the parent of the child, as provided in section 260.755, subdivision 11.\n\"Secure detention facility\" means a physically restricting facility, including but not limited to a jail, a hospital, a state institution, a residential treatment center, or a detention home used for the temporary care of a child pending court action.\n\"Shelter care facility\" means a physically unrestricting facility, such as, but not limited to, a hospital, a group home, or a licensed facility for foster care, used for the temporary care of a child pending court action.\n(a) \"Juvenile petty offense\" includes a juvenile alcohol offense, a juvenile controlled substance offense, a violation of section 609.685, or a violation of a local ordinance, which by its terms prohibits conduct by a child under the age of 18 years which would be lawful conduct if committed by an adult.\n(b) Except as otherwise provided in paragraph (c), \"juvenile petty offense\" also includes an offense that would be a misdemeanor if committed by an adult.\n(c) \"Juvenile petty offense\" does not include any of the following:\n(1) a misdemeanor-level violation of section 518B.01, 588.20, 609.224, 609.2242, 609.324, subdivision 2 or 3, 609.5632, 609.576, 609.66, 609.746, 609.748, 609.79, or 617.23;\n(2) a major traffic offense or an adult court traffic offense, as described in section 260B.225;\n(3) a misdemeanor-level offense committed by a child whom the juvenile court previously has found to have committed a misdemeanor, gross misdemeanor, or felony offense; or\n(4) a misdemeanor-level offense committed by a child whom the juvenile court has found to have committed a misdemeanor-level juvenile petty offense on two or more prior occasions, unless the county attorney designates the child on the petition as a juvenile petty offender notwithstanding this prior record. As used in this clause, \"misdemeanor-level juvenile petty offense\" includes a misdemeanor-level offense that would have been a juvenile petty offense if it had been committed on or after July 1, 1995.\n(d) A child who commits a juvenile petty offense is a \"juvenile petty offender.\" The term juvenile petty offender does not include a child alleged to have violated any law relating to being hired, offering to be hired, or agreeing to be hired by another individual to engage in sexual penetration or sexual conduct which, if committed by an adult, would be a misdemeanor.\n(e) Effective August 1, 2026, and applied to acts committed on or after that date, notwithstanding any contrary provision in paragraphs (a) to (d), a juvenile petty offender does not include a child who is alleged to have committed a juvenile petty offense before reaching the age of 13 years.\n\"Juvenile alcohol offense\" means a violation by a child of any provision of section 340A.503 or an equivalent local ordinance.\n\"Juvenile controlled substance offense\" means a violation by a child of section 152.027, subdivision 4, with respect to a small amount of marijuana or an equivalent local ordinance.\n\"Indian,\" consistent with section 260.755, subdivision 7, means a person who is a member of an Indian tribe or who is an Alaskan native and a member of a regional corporation as defined in section 7 of the Alaska Native Claims Settlement Act, United States Code, title 43, section 1606.\n\"Indian child,\" consistent with section 260.755, subdivision 8, means an unmarried person who is under age 18 and is:\n(1) a member of an Indian tribe; or\n(2) eligible for membership in an Indian tribe.",
	"repealed": false
}