{
	"id": "318.02",
	"url": "https://www.revisor.mn.gov/statutes/cite/318.02",
	"title": "318.02 GENERAL PROVISIONS.",
	"text": "The term \"declaration of trust\" as used in this section means the declaration of trust, business trust instrument, trust indenture, contract of custodianship, or other instrument pursuant to which such association is organized. Every such association organized after April 20, 1961, for the purpose of transacting business in this state shall, prior to transacting any business in this state, file in the Office of the Secretary of State a true and correct copy of the \"declaration of trust\" under which the association proposes to conduct its business. The copy shall also contain a statement that the true and correct copy of the \"declaration of trust\" is being filed in the Office of the Secretary of State of the state of Minnesota pursuant to this chapter and shall also include the full name and street address of an agent of the business trust in this state. That agent shall be the agent for service of process which shall be made pursuant to the provisions of section 543.08. The \"declaration of trust\" may provide that the duration of such association shall be perpetual. Upon the filing of the copy of the \"declaration of trust,\" the association is authorized to transact business in this state; provided that all other applicable laws have been complied with. The \"declaration of trust\" may be amended as provided in the \"declaration of trust\" or in any amendments thereto but a true and correct copy of all amendments to the \"declaration of trust,\" shall be filed in the Office of the Secretary of State and all amendments shall become effective at the time of said filing. When such copy of the \"declaration of trust\" and any amendments thereto shall have been filed in the Office of the Secretary of State it shall constitute public notice as to the purposes and manner of the business to be engaged in by such association.\nAny such association heretofore or hereafter organized shall be a business trust and a separate unincorporated association, not a partnership, joint-stock association, agency, or any other relation except a business trust. A business trust is also known as a common law trust and Massachusetts trust for doing business.\nAny such association heretofore or hereafter organized shall have the power in its name:\n(1) To continue as a business trust for the time limited in its \"declaration of trust\" or in any amendments, or if no time limit is specified, then perpetually;\n(2) To sue and be sued;\n(3) To adopt, use, and, at will, alter a business trust seal, but failure to affix the business trust seal, if any, shall not affect the validity of any instrument;\n(4) To conduct in this state and elsewhere the business to be engaged in by such association and to contract and enter into obligations and do any acts necessary and incidental to the transaction of its business or expedient for the attainment of the purposes stated in its \"declaration of trust\" or in any amendments;\n(5) To acquire including by will or gift, purchase, sell, contract for, hold, lease, mortgage, encumber, convey, transfer, or otherwise deal in and dispose of real and personal property within or without the state by and through its officers, agents or trustees in the manner provided in its \"declaration of trust\" or in any amendments. All deeds, contracts, mortgages and other legal instruments heretofore or hereafter acquired by or executed by any such association, and whether or not recorded in the office of the county recorder in the office of the registrar of titles, shall have the same force and effect as a like instrument would have if executed, or recorded or filed in said offices, as in the case of corporations.\nNo personal liability for any debt or obligation of any such association heretofore or hereafter organized shall attach to the owners of the shares of beneficial interests, beneficiaries, shareholders, or trustees of any such association heretofore or hereafter organized, or to any person or party to the \"declaration of trust.\"\n[Repealed, 2011 c 106 s 27]\nAn association organized under the laws of another state may register by using the process described in subdivision 1. The registration must be accompanied by a certificate from a state authenticating the prior registration of the association in that state. The Minnesota registration does not create a new association and the association continues to be governed by the laws of the state of prior registration with respect to internal governance. Amendments to a declaration of trust will also follow the process described in subdivision 1. The fees stated in subdivision 1 apply to these transactions.",
	"repealed": false
}