{
	"id": "206.89",
	"url": "https://www.revisor.mn.gov/statutes/cite/206.89",
	"title": "206.89 POSTELECTION REVIEW OF VOTING SYSTEMS.",
	"text": "For purposes of this section \"postelection review official\" means the county auditor, unless the county auditor designates the municipal clerk as the \"postelection review official\" within 24 hours after the canvass of the state general election.\nAt the canvass of the state primary, the county canvassing board in each county must set the date, time, and place for the postelection review of the state general election to be held under this section. The postelection review must not begin before the ninth day after the state general election and must be complete no later than the 14th day after the state general election.\nAt the canvass of the state general election, the county canvassing boards must select the precincts to be reviewed by lot. The ballots to be reviewed for a precinct include both the ballots counted at the polling place for that precinct and the absentee ballots counted centrally by a ballot board for that precinct. The county canvassing board of a county with fewer than 50,000 registered voters must conduct a postelection review of a total of at least two precincts. The county canvassing board of a county with between 50,000 and 100,000 registered voters must conduct a review of a total of at least three precincts. The county canvassing board of a county with over 100,000 registered voters must conduct a review of a total of at least four precincts, or three percent of the total number of precincts in the county, whichever is greater. At least one precinct selected in each county must have had more than 150 votes cast at the general election.\nThe county auditor must notify the secretary of state of the precincts that have been chosen for review and the time and place the postelection review for that county will be conducted, as soon as the decisions are made. If the selection of precincts has not resulted in the selection of at least four precincts in each congressional district, the secretary of state may require counties to select by lot additional precincts to meet the congressional district requirement. The secretary of state must post this information on the office website.\nNo review is required under this section if the election for the office will be subject to a recount as provided in section 204C.35, subdivision 1.\nThe county canvassing board shall appoint the postelection review official as defined in subdivision 1. The postelection review must be conducted of the votes cast for president or governor; United States senator; and United States representative. The postelection review official may conduct postelection review of the votes cast for additional offices.\nThe postelection review must be conducted in public at the location where the voted ballots have been securely stored after the state general election or at another location chosen by the county canvassing board. The postelection review official for each precinct selected must conduct the postelection review and may be assisted by election judges designated by the postelection review official for this purpose. The party balance requirement of section 204B.19 applies to election judges designated for the review. The postelection review must consist of a manual count of the ballots used in the precincts selected and must be performed in the manner provided by section 204C.21. The postelection review must be conducted in the manner provided for recounts under section 204C.361 to the extent practicable. The review must be completed no later than one day before the meeting of the state canvassing board to certify the results of the state general election.\nA comparison of the results compiled by the voting system with the postelection review described in this section must show that the results of the electronic voting system differed from the manual count of the offices reviewed by no more than two votes in a precinct where fewer than 1,200 voters cast ballots, three votes in a precinct where between 1,200 and 1,599 voters cast ballots, four votes in a precinct where between 1,600 and 1,999 voters cast ballots, or five votes in a precinct where 2,000 or more voters cast ballots. Valid votes that have been marked by the voter outside the vote targets or using a manual marking device that cannot be read by the voting system must not be included in making the determination whether the voting system has met the standard of acceptable performance for any precinct.\n(a) If the postelection review in one of the reviewed precincts reveals a difference greater than the thresholds specified in subdivision 4, the postelection review official must, within one day, conduct an additional review of the races indicated in subdivision 3 in at least three precincts in the same jurisdiction where the discrepancy was discovered. If all precincts in that jurisdiction have been reviewed, the county auditor must immediately publicly select by lot at least three additional precincts for review. The postelection review official must complete the additional review within one day after the precincts are selected and report the results immediately to the county auditor. If the second review in any of the reviewed precincts also indicates a difference in the vote totals compiled by the voting system that is greater than the thresholds specified in subdivision 4, the county auditor must conduct a review of the ballots from all the remaining precincts in the county for the races indicated in subdivision 3. This review must be completed and the results must be reported to the secretary of state within six days after the second review was completed.\n(b) If the results from the countywide reviews from one or more counties comprising in the aggregate more than ten percent of the total number of persons voting in the election clearly indicate that an error in vote counting has occurred, the secretary of state must notify the postelection review official of each county in the district that they must conduct manual recounts of all the ballots in the district for the affected office using the procedure outlined in section 204C.35. The recount must be completed and the results reported to the appropriate canvassing board within one week after the postelection review official received notice from the secretary of state.\nUpon completion of the postelection review, the postelection review official must immediately report the results to the county auditor. The county auditor must then immediately submit the results of the postelection review electronically or in writing to the secretary of state not later than one day before the State Canvassing Board meets to canvass the state general election. The secretary of state shall report the results of the postelection review at the meeting of the State Canvassing Board to canvass the state general election.\nIf the postelection review under this section results in a change in the number of votes counted for any candidate, the revised vote totals must be incorporated in the official result from those precincts.\nIf a voting system is found to have failed to record votes accurately and in the manner provided by the Minnesota Election Law, the voting system must not be used at another election until it has been examined and recertified by the secretary of state. If the voting system failure is attributable to either its design or to actions of the vendor, the vendor must forfeit the vendor bond required by section 206.57 and the performance bond required by section 206.66.\nThe costs of the postelection review required by this section must be allocated as follows:\n(1) the governing body responsible for each precinct selected for review must pay the costs incurred for the review conducted under subdivision 2 or 5, paragraph (a);\n(2) the vendor of the voting system must pay any costs incurred by the secretary of state to examine and recertify the voting system; and\n(3) the secretary of state must reimburse local units of government for the costs of any recount required under subdivision 5, paragraph (b).\nThe appropriate canvass is not completed and the time for notice of a contest of election does not begin to run until all reviews under this section have been completed.",
	"repealed": false
}