{
	"id": "245A.26",
	"url": "https://www.revisor.mn.gov/statutes/cite/245A.26",
	"title": "245A.26 CHILDREN'S RESIDENTIAL FACILITY CRISIS STABILIZATION SERVICES.",
	"text": "(a) For the purposes of this section, the terms defined in this subdivision have the meanings given.\n(b) \"Clinical trainee\" means a staff person who is qualified under section 245I.04, subdivision 6.\n(c) \"License holder\" means an individual, organization, or government entity that was issued a license by the commissioner of human services under this chapter for residential mental health treatment for children with emotional disturbance according to Minnesota Rules, parts 2960.0010 to 2960.0220 and 2960.0580 to 2960.0700, or shelter care services according to Minnesota Rules, parts 2960.0010 to 2960.0120 and 2960.0510 to 2960.0530.\n(d) \"Mental health professional\" means an individual who is qualified under section 245I.04, subdivision 2.\n(a) This section establishes additional licensing requirements for a children's residential facility to provide children's residential crisis stabilization services to a client who is experiencing a mental health crisis and is in need of residential treatment services.\n(b) A children's residential facility may provide residential crisis stabilization services only if the facility is licensed to provide:\n(1) residential mental health treatment for children with emotional disturbance according to Minnesota Rules, parts 2960.0010 to 2960.0220 and 2960.0580 to 2960.0700; or\n(2) shelter care services according to Minnesota Rules, parts 2960.0010 to 2960.0120 and 2960.0510 to 2960.0530.\n(c) If a client receives residential crisis stabilization services for 35 days or fewer in a facility licensed according to paragraph (b), clause (1), the facility is not required to complete a diagnostic assessment or treatment plan under Minnesota Rules, part 2960.0180, subpart 2, and part 2960.0600.\n(d) If a client receives residential crisis stabilization services for 35 days or fewer in a facility licensed according to paragraph (b), clause (2), the facility is not required to develop a plan for meeting the client's immediate needs under Minnesota Rules, part 2960.0520, subpart 3.\nAn individual is eligible for children's residential crisis stabilization services if the individual is under 21 years of age and meets the eligibility criteria for crisis services under section 256B.0624, subdivision 3.\n(a) A license holder providing residential crisis stabilization services must continually follow a client's individual crisis treatment plan to improve the client's functioning.\n(b) The license holder must offer and have the capacity to directly provide the following treatment services to a client:\n(1) crisis stabilization services as described in section 256B.0624, subdivision 7;\n(2) mental health services as specified in the client's individual crisis treatment plan, according to the client's treatment needs;\n(3) health services and medication administration, if applicable; and\n(4) referrals for the client to community-based treatment providers and support services for the client's transition from residential crisis stabilization to another treatment setting.\n(c) Children's residential crisis stabilization services must be provided by a qualified staff person listed in section 256B.0624, subdivision 8, according to the scope of practice for the individual staff person's position.\n(a) Within 12 hours of a client's admission for residential crisis stabilization, the license holder must assess the client and document the client's immediate needs, including the client's:\n(1) health and safety, including the need for crisis assistance;\n(2) need for connection to family and other natural supports;\n(3) if applicable, housing and legal issues; and\n(4) if applicable, responsibilities for children, family, and other natural supports, and employers.\n(b) Within 24 hours of a client's admission for residential crisis stabilization, the license holder must complete a crisis treatment plan for the client, according to the requirements for a crisis treatment plan under section 256B.0624, subdivision 11. The license holder must base the client's crisis treatment plan on the client's referral information and the assessment of the client's immediate needs under paragraph (a). A mental health professional or a clinical trainee under the supervision of a mental health professional must complete the crisis treatment plan. A crisis treatment plan completed by a clinical trainee must contain documentation of approval, as defined in section 245I.02, subdivision 2, by a mental health professional within five business days of initial completion by the clinical trainee.\n(c) A mental health professional must review a client's crisis treatment plan each week and document the weekly reviews in the client's client file.\n(d) For a client receiving children's residential crisis stabilization services who is 18 years of age or older, the license holder must complete an individual abuse prevention plan for the client, pursuant to section 245A.65, subdivision 2, as part of the client's crisis treatment plan.\nStaff members of facilities providing services under this section must have access to a mental health professional or clinical trainee within 30 minutes, either in person or by telephone. The license holder must maintain a current schedule of available mental health professionals or clinical trainees and include contact information for each mental health professional or clinical trainee. The schedule must be readily available to all staff members.",
	"repealed": false
}