{
	"id": "103F.511",
	"url": "https://www.revisor.mn.gov/statutes/cite/103F.511",
	"title": "103F.511 DEFINITIONS.",
	"text": "The definitions in this section apply to sections 103F.505 to 103F.535.\n\"Agricultural crop production\" means an agricultural activity that is devoted to producing horticultural, row, close-grown, introduced pasture, or introduced hayland crops and includes but is not limited to tillage, planting, or harvesting operations.\n\"Agricultural land\" means land devoted to the following uses and includes any contiguous land associated with the uses:\n(1) pasture or hayland for domestic livestock or dairy animals;\n(2) producing agricultural crops;\n(3) growing nursery stocks; or\n(4) animal feedlots.\n\"Approved practice\" means a conservation practice that may be established on an easement area and that meets the requirements of section 103F.527.\n\"Board\" means the Board of Water and Soil Resources.\n\"Conservation easement\" means a conservation easement as defined in section 84C.01.\n\"Conservation easement program\" means:\n(1) the reinvest in Minnesota reserve program under section 103F.515;\n(2) the permanent wetlands preserve program under section 103F.516;\n(3) the reinvest in Minnesota clean energy program under section 103F.518; or\n(4) the reinvest in Minnesota working lands program under section 103F.519.\n\"Conservation plan\" means a written description and map of approved practices that must be applied to or that already exist on an easement area.\n[Repealed, 2009 c 172 art 2 s 32; 2009 c 176 art 1 s 52]\n\"Drained wetland\" means a former natural wetland that has been altered by draining, dredging, filling, leveling, or other manipulation sufficient to render the land suitable for agricultural crop production.\n[Renumbered subd 5c]\n\"Food plot\" means an area established to provide food for wildlife.\n\"Grasslands\" means landscapes that are or were formerly dominated by grasses, that have a low percentage of trees and shrubs, and that provide economic and ecosystem services such as managed grazing, wildlife habitat, carbon sequestration, and water filtration and retention.\n\"Land with crop history\" means land that has produced horticultural, row, or close-grown crops or that has been enrolled at a cropland rate in a federal or state conservation program for at least two of the five years preceding an application to enroll the land in a conservation easement program. Land with crop history includes acres devoted to set-aside or conserving use for programs of the United States Department of Agriculture.\n\"Landowner\" means an individual or entity that is not prohibited from owning agricultural land under section 500.24 and either owns eligible land or is purchasing eligible land under a contract for deed.\n\"Marginal agricultural land\" means land that is:\n(1) composed of class IIIe, IVe, V, VI, VII, or VIII land as identified in the land capability classification system of the United States Department of Agriculture; or\n(2) similar to land described under clause (1) and identified under a land classification system selected by the board.\n\"Pasture\" means land that is used for grazing by domestic livestock and that is not considered land with crop history.\n\"Perennial cover\" means:\n(1) existing or established perennial vegetation within the easement boundary; or\n(2) a restored or existing wetland or water-covered area within the easement boundary.\n\"Public waters\" means waters and wetlands as defined in section 103G.005, and inventoried under section 103G.201.\nMS 2008 [Renumbered subd 8c]\nMS 2022 [Repealed, 2024 c 90 art 3 s 88]\n\"Riparian land\" means lands adjacent to public waters, drainage systems, wetlands, or locally designated priority waters.\n\"Restored prairie\" means a restoration that uses at least 25 representative and biologically diverse native prairie plant species and that occurs on land that was previously cropped or used as pasture.\n\"Sensitive groundwater area\" means a geographic area defined by natural features where there is a significant risk of groundwater degradation from activities conducted at or near the land surface. These areas may be identified by mapping or other appropriate methods determined by the commissioner of natural resources and the Board of Water and Soil Resources. Wellhead protection areas may be designated as a sensitive groundwater area.\n\"Wetland\" means land that has a predominance of hydric soils and that is inundated or saturated by surface water or groundwater at a frequency and duration sufficient to support, or that periodically does support, a predominance of hydrophytic vegetation typically adapted for life in saturated soil conditions.\n\"Windbreak\" means a strip or belt of trees, shrubs, or grass barriers at least six rows deep and within 300 feet of the right-of-way of a highway.",
	"repealed": false
}