{
	"id": "273.02",
	"url": "https://www.revisor.mn.gov/statutes/cite/273.02",
	"title": "273.02 OMITTED PROPERTY.",
	"text": "If any real or personal property be omitted in the assessment of any year or years, and the property thereby escape taxation, or if any real property be undervalued by reason of failure to take into consideration the existence of buildings or improvements thereon, or be erroneously classified as a homestead, when such omission, undervaluation or erroneous classification is discovered the county auditor shall in the case of omitted property enter such property on the assessment and tax books for the year or years omitted, and in the case of property undervalued by reason of failure to take into consideration the existence of buildings or improvements thereon, or property erroneously classified as a homestead, shall correct the net tax capacity or classification thereof on the assessment and tax books and shall assess the property, and extend against the same on the tax list for the current year all arrearage of taxes properly accruing against it, including therein, in the case of personal property taxes, interest thereon at the rate of seven percent per annum from the time such taxes would have become delinquent, when the omission was caused by the failure of the owner to list the same. If any tax on any property liable to taxation is prevented from being collected for any year or years by reason of any erroneous proceedings, undervaluation by reason of failure to take into consideration the existence of buildings or improvements, erroneous classification as a homestead, or other cause, the amount of such tax which such property should have paid shall be added to the tax on such property for the current year.\nNothing in subdivisions 1 to 3 shall authorize the county auditor to enter omitted property on the assessment and tax books more than six years after the assessment date of the year in which the property was originally assessed or should have been assessed and nothing in subdivisions 1 to 3 shall authorize the county auditor to correct the net tax capacity or classification of real property as herein provided more than one year after December 1 of the year in which the property was assessed or should have been assessed.\nNothing in subdivisions 1 to 3 shall affect any rights in undervalued or erroneously classified property, acquired for value in good faith prior to the correction of the net tax capacity thereof by the county auditor as provided in this section. Any person whose rights are adversely affected by any action of the county auditor as provided in this subdivision may apply for a reduction of the net tax capacity under the provisions of section 375.192.\nNewly discovered iron ore shall be entered on the assessment books for the six years immediately preceding the year of discovery and taxed as omitted property. The tax on such omitted property shall be determined by applying the rates of levy for the respective years in which the property was omitted.\nAny taxpayer having paid real estate taxes on valuations of iron ore, considered to be commercially mineable, which was believed to have existed, and was subsequently determined not to exist, may apply to the commissioner of revenue for a refund of taxes paid thereon, as provided herein. Such application for refund shall be filed in the year in which it is determined that the iron ore does not exist. No refund shall be made for taxes paid or payable more than six years previous to the date of said application. The refunds shall be paid from the general fund.\nThe taxes collected in accordance with subdivision 4 shall be transmitted by the county treasurer to the commissioner of management and budget and deposited in the general fund. There shall be paid from the general fund the amount of refunds determined in accordance with subdivision 5.",
	"repealed": false
}