{
	"id": "256B.0671",
	"url": "https://www.revisor.mn.gov/statutes/cite/256B.0671",
	"title": "256B.0671 COVERED MENTAL HEALTH SERVICES.",
	"text": "(a) \"Clinical trainee\" means a staff person who is qualified under section 245I.04, subdivision 6.\n(b) \"Mental health practitioner\" means a staff person who is qualified under section 245I.04, subdivision 4.\n(c) \"Mental health professional\" means a staff person who is qualified under section 245I.04, subdivision 2.\n(a) An individual, organization, or government entity providing mental health services to a client under this section must obtain a criminal background study of each staff person or volunteer who is providing direct contact services to a client.\n(b) An individual, organization, or government entity providing mental health services to a client under this section must comply with all responsibilities that chapter 245I assigns to a license holder, except section 245I.011, subdivision 1, unless all of the individual's, organization's, or government entity's treatment staff are qualified as mental health professionals.\n(c) An individual, organization, or government entity providing mental health services to a client under this section must comply with the following requirements if all of the license holder's treatment staff are qualified as mental health professionals:\n(1) provider qualifications and scopes of practice under section 245I.04;\n(2) maintaining and updating personnel files under section 245I.07;\n(3) documenting under section 245I.08;\n(4) maintaining and updating client files under section 245I.09;\n(5) completing client assessments and treatment planning under section 245I.10;\n(6) providing clients with health services and medications under section 245I.11; and\n(7) respecting and enforcing client rights under section 245I.12.\n(a) Medical assistance covers adult day treatment (ADT) services that are provided under contract with the county board. Adult day treatment payment is subject to the conditions in paragraphs (b) to (e). The provider must make reasonable and good faith efforts to report individual client outcomes to the commissioner using instruments, protocols, and forms approved by the commissioner.\n(b) Adult day treatment is an intensive psychotherapeutic treatment to reduce or relieve the effects of mental illness on a client to enable the client to benefit from a lower level of care and to live and function more independently in the community. Adult day treatment services must be provided to a client to stabilize the client's mental health and to improve the client's independent living and socialization skills. Adult day treatment must consist of at least one hour of group psychotherapy and must include group time focused on rehabilitative interventions or other therapeutic services that a multidisciplinary team provides to each client. Adult day treatment services are not a part of inpatient or residential treatment services. The following providers may apply to become adult day treatment providers:\n(1) a hospital with Centers for Medicare and Medicaid Services approved hospital accreditation and licensed under sections 144.50 to 144.55;\n(2) a community mental health center under section 256B.0625, subdivision 5; or\n(3) an entity that is under contract with the county board to operate a program that meets the requirements of section 245.4712, subdivision 2, and Minnesota Rules, parts 9505.0170 to 9505.0475.\n(c) An adult day treatment services provider must:\n(1) ensure that the commissioner has approved of the organization as an adult day treatment provider organization;\n(2) ensure that a multidisciplinary team provides ADT services to a group of clients. A mental health professional must supervise each multidisciplinary staff person who provides ADT services;\n(3) make ADT services available to the client at least two days a week for at least three consecutive hours per day. ADT services may be longer than three hours per day, but medical assistance may not reimburse a provider for more than 15 hours per week;\n(4) provide ADT services to each client that includes group psychotherapy by a mental health professional or clinical trainee and daily rehabilitative interventions by a mental health professional, clinical trainee, or mental health practitioner; and\n(5) include ADT services in the client's individual treatment plan, when appropriate. The adult day treatment provider must:\n(i) complete a functional assessment of each client under section 245I.10, subdivision 9;\n(ii) notwithstanding section 245I.10, subdivision 8, review the client's progress and update the individual treatment plan at least every 90 days until the client is discharged from the program; and\n(iii) include a discharge plan for the client in the client's individual treatment plan.\n(d) To be eligible for adult day treatment, a client must:\n(1) be 18 years of age or older;\n(2) not reside in a nursing facility, hospital, institute of mental disease, or state-operated treatment center unless the client has an active discharge plan that indicates a move to an independent living setting within 180 days;\n(3) have the capacity to engage in rehabilitative programming, skills activities, and psychotherapy in the structured, therapeutic setting of an adult day treatment program and demonstrate measurable improvements in functioning resulting from participation in the adult day treatment program;\n(4) have a level of care assessment under section 245I.02, subdivision 19, recommending that the client participate in services with the level of intensity and duration of an adult day treatment program; and\n(5) have the recommendation of a mental health professional for adult day treatment services. The mental health professional must find that adult day treatment services are medically necessary for the client.\n(e) Medical assistance does not cover the following services as adult day treatment services:\n(1) services that are primarily recreational or that are provided in a setting that is not under medical supervision, including sports activities, exercise groups, craft hours, leisure time, social hours, meal or snack time, trips to community activities, and tours;\n(2) social or educational services that do not have or cannot reasonably be expected to have a therapeutic outcome related to the client's mental illness;\n(3) consultations with other providers or service agency staff persons about the care or progress of a client;\n(4) prevention or education programs that are provided to the community;\n(5) day treatment for clients with a primary diagnosis of a substance use disorder;\n(6) day treatment provided in the client's home;\n(7) psychotherapy for more than two hours per day; and\n(8) participation in meal preparation and eating that is not part of a clinical treatment plan to address the client's eating disorder.\n(a) Medical assistance covers an explanation of findings that a mental health professional or clinical trainee provides when the provider has obtained the authorization from the client or the client's representative to release the information.\n(b) A mental health professional or clinical trainee provides an explanation of findings to assist the client or related parties in understanding the results of the client's testing or diagnostic assessment and the client's mental illness, and provides professional insight that the client or related parties need to carry out a client's treatment plan. Related parties may include the client's family and other natural supports and other service providers working with the client.\n(c) An explanation of findings is not paid for separately when a mental health professional or clinical trainee explains the results of psychological testing or a diagnostic assessment to the client or the client's representative as part of the client's psychological testing or a diagnostic assessment.\n(a) Medical assistance covers child and family psychoeducation services provided to a child under age 21 and the child's family members, when determined to be medically necessary due to a mental health condition or diagnosed mental illness identified in the child's individual treatment plan and provided by a mental health professional who is qualified under section 245I.04, subdivision 2, and practicing within the scope of practice under section 245I.04, subdivision 3; a mental health practitioner who is qualified under section 245I.04, subdivision 4, and practicing within the scope of practice under section 245I.04, subdivision 5; or a clinical trainee who is qualified under section 245I.04, subdivision 6, and practicing within the scope of practice under section 245I.04, subdivision 7.\n(b) \"Child and family psychoeducation services\" means information or demonstration provided to an individual or family as part of an individual, family, multifamily group, or peer group session to explain, educate, and support the child and family in understanding a child's symptoms of mental illness, the impact on the child's development, and needed components of treatment and skill development so that the individual, family, or group can help the child to prevent relapse, prevent the acquisition of comorbid disorders, and achieve optimal mental health and long-term resilience.\n(c) Child and family psychoeducation services include individual, family, or group skills development or training to:\n(1) support the development of psychosocial skills that are medically necessary to rehabilitate the child to an age-appropriate developmental trajectory when the child's development was disrupted by a mental health condition or diagnosed mental illness; or\n(2) enable the child to self-monitor, compensate for, cope with, counteract, or replace skills deficits or maladaptive skills acquired over the course of the child's mental health condition or mental illness.\n(d) Skills development or training delivered to a child or the child's family under this subdivision must be targeted to the specific deficits related to the child's mental health condition or mental illness and must be prescribed in the child's individual treatment plan. Group skills training may be provided to multiple recipients who, because of the nature of their emotional, behavioral, or social functional ability, may benefit from interaction in a group setting.\n[See Note.]\n(a) Medical assistance covers intensive mental health outpatient treatment for dialectical behavior therapy. A dialectical behavior therapy provider must make reasonable and good faith efforts to report individual client outcomes to the commissioner using instruments and protocols that are approved by the commissioner.\n(b) \"Dialectical behavior therapy\" means an evidence-based treatment approach that a mental health professional or clinical trainee provides to a client or a group of clients in an intensive outpatient treatment program using a combination of individualized rehabilitative and psychotherapeutic interventions. A dialectical behavior therapy program involves: individual dialectical behavior therapy, group skills training, telephone coaching, and team consultation meetings.\n(c) To be eligible for dialectical behavior therapy, a client must:\n(1) have mental health needs that available community-based services cannot meet or that the client must receive concurrently with other community-based services;\n(2) have either:\n(i) a diagnosis of borderline personality disorder; or\n(ii) multiple mental health diagnoses, exhibit behaviors characterized by impulsivity or intentional self-harm, and be at significant risk of death, morbidity, disability, or severe dysfunction in multiple areas of the client's life;\n(3) be cognitively capable of participating in dialectical behavior therapy as an intensive therapy program and be able and willing to follow program policies and rules to ensure the safety of the client and others; and\n(4) be at significant risk of one or more of the following if the client does not receive dialectical behavior therapy:\n(i) having a mental health crisis;\n(ii) requiring a more restrictive setting such as hospitalization;\n(iii) decompensating; or\n(iv) engaging in intentional self-harm behavior.\n(d) Individual dialectical behavior therapy combines individualized rehabilitative and psychotherapeutic interventions to treat a client's suicidal and other dysfunctional behaviors and to reinforce a client's use of adaptive skillful behaviors. A mental health professional or clinical trainee must provide individual dialectical behavior therapy to a client. A mental health professional or clinical trainee providing dialectical behavior therapy to a client must:\n(1) identify, prioritize, and sequence the client's behavioral targets;\n(2) treat the client's behavioral targets;\n(3) assist the client in applying dialectical behavior therapy skills to the client's natural environment through telephone coaching outside of treatment sessions;\n(4) measure the client's progress toward dialectical behavior therapy targets;\n(5) help the client manage mental health crises and life-threatening behaviors; and\n(6) help the client learn and apply effective behaviors when working with other treatment providers.\n(e) Group skills training combines individualized psychotherapeutic and psychiatric rehabilitative interventions conducted in a group setting to reduce the client's suicidal and other dysfunctional coping behaviors and restore function. Group skills training must teach the client adaptive skills in the following areas: (1) mindfulness; (2) interpersonal effectiveness; (3) emotional regulation; and (4) distress tolerance.\n(f) Group skills training must be provided by two mental health professionals or by a mental health professional co-facilitating with a clinical trainee or a mental health practitioner. Individual skills training must be provided by a mental health professional, a clinical trainee, or a mental health practitioner.\n(g) Before a program provides dialectical behavior therapy to a client, the commissioner must certify the program as a dialectical behavior therapy provider. To qualify for certification as a dialectical behavior therapy provider, a provider must:\n(1) allow the commissioner to inspect the provider's program;\n(2) provide evidence to the commissioner that the program's policies, procedures, and practices meet the requirements of this subdivision and chapter 245I;\n(3) be enrolled as a MHCP provider; and\n(4) have a manual that outlines the program's policies, procedures, and practices that meet the requirements of this subdivision.\n(a) Medical assistance covers clinical care consultation for a person up to age 21 who is diagnosed with a complex mental health condition or a mental health condition that co-occurs with other complex and chronic conditions, when described in the person's individual treatment plan and provided by a mental health professional or a clinical trainee.\n(b) \"Clinical care consultation\" means communication from a treating mental health professional to other providers or educators not under the treatment supervision of the treating mental health professional who are working with the same client to inform, inquire, and instruct regarding the client's symptoms; strategies for effective engagement, care, and intervention needs; and treatment expectations across service settings and to direct and coordinate clinical service components provided to the client and family.\n(a) Medical assistance covers a client's neuropsychological assessment.\n(b) \"Neuropsychological assessment\" means a specialized clinical assessment of the client's underlying cognitive abilities related to thinking, reasoning, and judgment that is conducted by a qualified neuropsychologist. A neuropsychological assessment must include a face-to-face interview with the client, interpretation of the test results, and preparation and completion of a report.\n(c) A client is eligible for a neuropsychological assessment if the client meets at least one of the following criteria:\n(1) the client has a known or strongly suspected brain disorder based on the client's medical history or the client's prior neurological evaluation, including a history of significant head trauma, brain tumor, stroke, seizure disorder, multiple sclerosis, neurodegenerative disorder, significant exposure to neurotoxins, central nervous system infection, metabolic or toxic encephalopathy, fetal alcohol syndrome, or congenital malformation of the brain; or\n(2) the client has cognitive or behavioral symptoms that suggest that the client has an organic condition that cannot be readily attributed to functional psychopathology or suspected neuropsychological impairment in addition to functional psychopathology. The client's symptoms may include:\n(i) having a poor memory or impaired problem solving;\n(ii) experiencing change in mental status evidenced by lethargy, confusion, or disorientation;\n(iii) experiencing a deteriorating level of functioning;\n(iv) displaying a marked change in behavior or personality;\n(v) in a child or an adolescent, having significant delays in acquiring academic skill or poor attention relative to peers;\n(vi) in a child or an adolescent, having reached a significant plateau in expected development of cognitive, social, emotional, or physical functioning relative to peers; and\n(vii) in a child or an adolescent, significant inability to develop expected knowledge, skills, or abilities to adapt to new or changing cognitive, social, emotional, or physical demands.\n(d) The neuropsychological assessment must be completed by a neuropsychologist who:\n(1) was awarded a diploma by the American Board of Clinical Neuropsychology, the American Board of Professional Neuropsychology, or the American Board of Pediatric Neuropsychology;\n(2) earned a doctoral degree in psychology from an accredited university training program and:\n(i) completed an internship or its equivalent in a clinically relevant area of professional psychology;\n(ii) completed the equivalent of two full-time years of experience and specialized training, at least one of which is at the postdoctoral level, supervised by a clinical neuropsychologist in the study and practice of clinical neuropsychology and related neurosciences; and\n(iii) holds a current license to practice psychology independently according to sections 148.88 to 148.98;\n(3) is licensed or credentialed by another state's board of psychology examiners in the specialty of neuropsychology using requirements equivalent to requirements specified by one of the boards named in clause (1); or\n(4) was approved by the commissioner as an eligible provider of neuropsychological assessments prior to December 31, 2010.\n(a) Medical assistance covers neuropsychological testing for clients.\n(b) \"Neuropsychological testing\" means administering standardized tests and measures designed to evaluate the client's ability to attend to, process, interpret, comprehend, communicate, learn, and recall information and use problem solving and judgment.\n(c) Medical assistance covers neuropsychological testing of a client when the client:\n(1) has a significant mental status change that is not a result of a metabolic disorder and that has failed to respond to treatment;\n(2) is a child or adolescent with a significant plateau in expected development of cognitive, social, emotional, or physical function relative to peers;\n(3) is a child or adolescent with a significant inability to develop expected knowledge, skills, or abilities to adapt to new or changing cognitive, social, physical, or emotional demands; or\n(4) has a significant behavioral change, memory loss, or suspected neuropsychological impairment in addition to functional psychopathology, or other organic brain injury or one of the following:\n(i) traumatic brain injury;\n(ii) stroke;\n(iii) brain tumor;\n(iv) substance use disorder;\n(v) cerebral anoxic or hypoxic episode;\n(vi) central nervous system infection or other infectious disease;\n(vii) neoplasms or vascular injury of the central nervous system;\n(viii) neurodegenerative disorders;\n(ix) demyelinating disease;\n(x) extrapyramidal disease;\n(xi) exposure to systemic or intrathecal agents or cranial radiation known to be associated with cerebral dysfunction;\n(xii) systemic medical conditions known to be associated with cerebral dysfunction, including renal disease, hepatic encephalopathy, cardiac anomaly, sickle cell disease, and related hematologic anomalies, and autoimmune disorders, including lupus, erythematosus, or celiac disease;\n(xiii) congenital genetic or metabolic disorders known to be associated with cerebral dysfunction, including phenylketonuria, craniofacial syndromes, or congenital hydrocephalus;\n(xiv) severe or prolonged nutrition or malabsorption syndromes; or\n(xv) a condition presenting in a manner difficult for a clinician to distinguish between the neurocognitive effects of a neurogenic syndrome, including dementia or encephalopathy; and a major depressive disorder when adequate treatment for major depressive disorder has not improved the client's neurocognitive functioning; or another disorder, including autism, selective mutism, anxiety disorder, or reactive attachment disorder.\n(d) Neuropsychological testing must be administered or clinically supervised by a qualified neuropsychologist under subdivision 8, paragraph (c).\n(e) Medical assistance does not cover neuropsychological testing of a client when the testing is:\n(1) primarily for educational purposes;\n(2) primarily for vocational counseling or training;\n(3) for personnel or employment testing;\n(4) a routine battery of psychological tests given to the client at the client's inpatient admission or during a client's continued inpatient stay; or\n(5) for legal or forensic purposes.\n(a) Medical assistance covers psychological testing of a client.\n(b) \"Psychological testing\" means the use of tests or other psychometric instruments to determine the status of a client's mental, intellectual, and emotional functioning.\n(c) The psychological testing must:\n(1) be administered or supervised by a licensed psychologist qualified under section 245I.04, subdivision 2, clause (3), who is competent in the area of psychological testing; and\n(2) be validated in a face-to-face interview between the client and a licensed psychologist or a clinical trainee in psychology under the treatment supervision of a licensed psychologist under section 245I.06.\n(d) A licensed psychologist must supervise the administration, scoring, and interpretation of a client's psychological tests when a clinical psychology trainee, technician, psychometrist, or psychological assistant or a computer-assisted psychological testing program completes the psychological testing of the client. The report resulting from the psychological testing must be signed by the licensed psychologist who conducts the face-to-face interview with the client. The licensed psychologist or a staff person who is under treatment supervision must place the client's psychological testing report in the client's record and release one copy of the report to the client and additional copies to individuals authorized by the client to receive the report.\n(a) Medical assistance covers psychotherapy for a client.\n(b) \"Psychotherapy\" means treatment of a client with mental illness that applies to the most appropriate psychological, psychiatric, psychosocial, or interpersonal method that conforms to prevailing community standards of professional practice to meet the mental health needs of the client. Medical assistance covers psychotherapy if a mental health professional or a clinical trainee provides psychotherapy to a client.\n(c) \"Individual psychotherapy\" means psychotherapy that a mental health professional or clinical trainee designs for a client.\n(d) \"Family psychotherapy\" means psychotherapy that a mental health professional or clinical trainee designs for a client and one or more of the client's family members or primary caregiver whose participation is necessary to accomplish the client's treatment goals. Family members or primary caregivers participating in a therapy session do not need to be eligible for medical assistance for medical assistance to cover family psychotherapy. For purposes of this paragraph, \"primary caregiver whose participation is necessary to accomplish the client's treatment goals\" excludes shift or facility staff persons who work at the client's residence. Medical assistance payments for family psychotherapy are limited to face-to-face sessions during which the client is present throughout the session, unless the mental health professional or clinical trainee believes that the client's exclusion from the family psychotherapy session is necessary to meet the goals of the client's individual treatment plan. If the client is excluded from a family psychotherapy session, a mental health professional or clinical trainee must document the reason for the client's exclusion and the length of time that the client is excluded. The mental health professional must also document any reason that a member of the client's family is excluded from a psychotherapy session.\n(e) Group psychotherapy is appropriate for a client who, because of the nature of the client's emotional, behavioral, or social dysfunctions, can benefit from treatment in a group setting. For a group of three to eight clients, at least one mental health professional or clinical trainee must provide psychotherapy to the group. For a group of nine to 12 clients, a team of at least two mental health professionals or two clinical trainees or one mental health professional and one clinical trainee must provide psychotherapy to the group. Medical assistance will cover group psychotherapy for a group of no more than 12 persons.\n(f) A multiple-family group psychotherapy session is eligible for medical assistance if a mental health professional or clinical trainee designs the psychotherapy session for at least two but not more than five families. A mental health professional or clinical trainee must design multiple-family group psychotherapy sessions to meet the treatment needs of each client. If the client is excluded from a psychotherapy session, the mental health professional or clinical trainee must document the reason for the client's exclusion and the length of time that the client was excluded. The mental health professional or clinical trainee must document any reason that a member of the client's family was excluded from a psychotherapy session.\n(a) Medical assistance covers psychotherapy for crisis when a recipient is in need of an immediate response due to an increase of mental illness symptoms that put the recipient at risk of one of the following:\n(1) experiencing a life-threatening mental health crisis;\n(2) needing a higher level of care;\n(3) worsening symptoms without mental health intervention;\n(4) harm to self or others, or property damage; or\n(5) significant disruption of functioning in at least one life area.\n(b) \"Psychotherapy for crisis\" means treatment of a client to reduce the client's mental health crisis through immediate assessment and psychotherapeutic interventions. Psychotherapy for crisis must include:\n(1) emergency assessment of the crisis situation;\n(2) mental status exam;\n(3) psychotherapeutic interventions to reduce the crisis; and\n(4) development of a post-crisis plan that addresses the recipient's coping skills and community resources.\n(a) Medical assistance covers a client's partial hospitalization.\n(b) \"Partial hospitalization\" means a provider's time-limited, structured program of psychotherapy and other therapeutic services, as defined in United States Code, title 42, chapter 7, subchapter XVIII, part E, section 1395x(ff), that a multidisciplinary staff person provides in an outpatient hospital facility or community mental health center that meets Medicare requirements to provide partial hospitalization services to a client.\n(c) Partial hospitalization is an appropriate alternative to inpatient hospitalization for a client who is experiencing an acute episode of mental illness who meets the criteria for an inpatient hospital admission under Minnesota Rules, part 9505.0520, subpart 1, and who has family and community resources that support the client's residence in the community. Partial hospitalization consists of multiple intensive short-term therapeutic services for a client that a multidisciplinary staff person provides to a client to treat the client's mental illness.\nMedical assistance covers a client's diagnostic assessments that a mental health professional or clinical trainee completes under section 245I.10.",
	"repealed": false
}