{
	"id": "352.115",
	"url": "https://www.revisor.mn.gov/statutes/cite/352.115",
	"title": "352.115 RETIREMENT ANNUITY.",
	"text": "After separation from state service, any employee who has attained the age of at least 55 years is entitled, upon application, to a retirement annuity if the employee:\n(1) has received credit for at least three years of allowable service and was employed before July 1, 2010;\n(2) has received credit for at least five years of allowable service if employed after June 30, 2010, and terminated employment before July 1, 2023;\n(3) was actively employed on July 1, 2023, and has earned three years of allowable service prior to the employee's retirement application;\n(4) has three or more years of allowable service if employed after June 30, 2023; or\n(5) has received credit for at least 30 years of allowable service regardless of age.\nThe retirement annuity hereunder payable at normal retirement age or thereafter must be computed in accordance with the applicable provisions of the formula stated in subdivision 3, on the basis of the employee's average salary for the period of allowable service. This retirement annuity is known as the \"normal\" retirement annuity.\n(a) This paragraph, in conjunction with section 352.116, subdivision 1, applies to a person who became a covered employee or a member of a pension fund listed in section 356.30, subdivision 3, before July 1, 1989, unless paragraph (b), in conjunction with section 352.116, subdivision 1a, produces a higher annuity amount, in which case paragraph (b) applies. The employee's average salary, as defined in section 352.01, subdivision 14a, multiplied by 1.2 percent per year of allowable service for the first ten years and 1.7 percent for each later year of allowable service and pro rata for completed months less than a full year determines the amount of the retirement annuity to which the employee is entitled.\n(b) This paragraph applies to a person who has become at least 55 years old and first became a covered employee after June 30, 1989, and to any other covered employee who has become at least 55 years old and whose annuity amount, when calculated under this paragraph and in conjunction with section 352.116, subdivision 1a, is higher than it is when calculated under paragraph (a), in conjunction with section 352.116, subdivision 1. The employee's average salary, as defined in section 352.01, subdivision 14a, multiplied by 1.7 percent for each year of allowable service and pro rata for months less than a full year determines the amount of the retirement annuity to which the employee is entitled.\n[Repealed, 1983 c 128 s 36]\n[Repealed, 1983 c 128 s 36]\n[Repealed, 1965 c 230 s 18]\nApplication for annuity or optional annuity payment may be made by the employee at time of retirement, or by someone acting on behalf of the employee upon proof of authority satisfactory to the director.\n(a) The filing of an application for an annuity, refund, disability benefit, survivor benefit, death benefit, or other monthly benefit authorized by this chapter or chapter 3A, 352B, 352D, or 490 must comply with this subdivision.\n(b) Filing of an application under paragraph (a) is not complete until an original application and supporting documents are received in an office of the system or received by a person authorized by the director. An original application may not be an electronic copy or facsimile copy and if received in an office of the system, must be delivered by personal service or mail.\n(c) In this subdivision, \"supporting documents\" are:\n(1) documents sufficient to verify birth;\n(2) documents sufficient to verify marital status or establish the terms of a divorce, if applicable; and\n(3) the acknowledgment required by section 356.46, subdivision 3, paragraph (b).\nSupporting documents are not required to be original documents except as determined by the director.\nThe application for an annuity must not be made more than 60 days before the time the state employee or former state employee elects to begin collecting a retirement annuity. If the director determines an applicant for annuity has fulfilled the legal requirements for an annuity, the director shall authorize the annuity payment in accordance with this chapter and payment must be made as authorized. An annuity shall begin to accrue no earlier than 180 days before the date the application is filed with the director, but not before the day following the termination of state service or before the day the employee is eligible to retire by reason of both age and service requirements. The retirement annuity shall cease with the last payment which had accrued during the lifetime of the retired employee unless an optional annuity provided in section 352.116, subdivision 3, had been selected and had become payable. The joint and last survivor annuity shall cease with the last payment received by the survivor during the lifetime of the survivor. If a retired employee had not selected an optional annuity, or a survivor annuity is not payable under the option, and a spouse survives, the spouse is entitled only to the annuity for the calendar month in which the retired employee died. If an optional annuity is payable after the death of the retired employee, the survivor is entitled to the annuity for the calendar month in which the retired employee died.\nAll annuities, and disability benefits authorized by this chapter, must be paid in equal monthly installments and must not be increased, decreased, or revoked except as provided in this chapter.\n(a) Except for salary or wages received as a temporary employee of the legislature during a legislative session, if any retired employee again becomes entitled to receive salary or wages from any employer who employs state employees as that term is defined in section 352.01, subdivision 2, in a position covered by this chapter, the annuity or retirement allowance must cease the first of the month following the month that the retired employee has earned an amount equal to the annual maximum earnings allowable for that age for the continued receipt of full benefit amounts monthly under the federal old age, survivors, and disability insurance program as set by the secretary of health and human services under United States Code, title 42, section 403, in any calendar year. If the retired employee has not yet reached the minimum age for the receipt of Social Security benefits, the maximum earnings for the retired employee are equal to the annual maximum earnings allowable for the minimum age for the receipt of Social Security benefits.\n(b) The balance of the annual retirement annuity after cessation must be handled or disposed of as provided in section 356.47.\n(c) The annuity must be resumed the first of the month following the month that state service ends, or, if the retired employee is still employed at the beginning of the next calendar year, at the beginning of that calendar year, and payment must again end when the retired employee has earned the applicable reemployment earnings maximum specified in this subdivision. If the retired employee is granted a sick leave without pay, but not otherwise, the annuity or retirement allowance must be resumed during the period of sick leave.\n(d) No payroll deductions for the retirement fund may be made from the earnings of a reemployed retired employee.\n(e) No change may be made in the monthly amount of an annuity or retirement allowance because of the reemployment of an annuitant.\n(f) If a reemployed annuitant whose annuity is suspended under paragraph (a) is having insurance premium amounts withheld under section 356.87, subdivision 2, insurance premium amounts must continue to be withheld and transferred from the suspended portion of the annuity. The balance of the annual retirement annuity after cessation, after deduction of the insurance premium amounts, must be treated as specified in paragraph (b).\n(g) If a reemployed annuitant whose annuity is suspended under paragraph (a) has a former spouse receiving a portion of the annuity allowable under section 518.58, subdivision 1, the portion payable to the former spouse must continue to be paid.\nAny annuity accrued before the death of a retired employee, and any disability benefit accrued before the death of a disabled employee shall be paid to the beneficiary whom the retired employee or the disabled employee had last designated. If (1) no beneficiary has been so designated, or (2) the designated beneficiary dies before making claim for payment of an annuity or benefit, payment must be made to the surviving spouse, or, if none, to the employee's surviving children in equal shares or, if none, to the employee's surviving parents in equal shares or, if none, to the legal representative of the retired employee or disabled employee. If the designated beneficiary, surviving spouse, or legal representative entitled to the annuity does not apply for payment within five years from the date of death of the retired employee or disabled employee, the annuity or disability benefit which had accrued at the time of death must be credited to and become a part of the retirement fund.\nIf at the time of death a retired employee, a disabled employee, or a survivor has in possession commissioner of management and budget's payments covering a retirement annuity, disability benefit or survivor benefit from the retirement fund, in the absence of probate proceedings, and upon the return of the payments for cancellation, payment of the accrued annuity or benefit, shall be made as provided in subdivision 11, or 352.12, subdivision 4. Payments made under this subdivision shall be a bar to recovery by any other person or persons.\n[Repealed, 1981 c 224 s 276]\nA retirement annuity under this section and section 352.116 is eligible for postretirement adjustments under section 356.415.",
	"repealed": false
}