{
	"id": "237.162",
	"url": "https://www.revisor.mn.gov/statutes/cite/237.162",
	"title": "237.162 PUBLIC RIGHT-OF-WAY; DEFINITIONS.",
	"text": "The terms used in sections 237.162 and 237.163 have the meanings given to them in this section.\n\"Local government unit\" means a county, home rule charter or statutory city, town, or the Metropolitan Council.\n\"Public right-of-way\" means the area on, below, or above a public roadway, highway, street, cartway, bicycle lane, and public sidewalk in which the local government unit has an interest, including other dedicated rights-of-way for travel purposes and utility easements of local government units.\nA public right-of-way does not include the airwaves above a public right-of-way with regard to cellular or other nonwire telecommunications or broadcast service.\n(a) \"Telecommunications right-of-way user\" means a person owning or controlling a facility in the public right-of-way, or seeking to own or control a facility in the public right-of-way, that is used or is intended to be used for providing wireless service, or transporting telecommunications or other voice or data information.\n(b) A cable communication system defined and regulated under chapter 238, and telecommunications activities related to providing natural gas or electric energy services, a public utility as defined in section 216B.02, a municipality, a municipal gas or power agency organized under chapter 453 or 453A, or a cooperative electric association organized under chapter 308A, are not telecommunications right-of-way users for the purposes of this section and section 237.163, except to the extent these entities are offering wireless services.\n\"Excavate\" means to dig into or in any way remove, physically disturb, or penetrate a part of a public right-of-way.\n\"Obstruct\" means to place a tangible object in a public right-of-way so as to hinder free and open passage over that or any part of the right-of-way.\n\"Right-of-way permit\" means a permit to perform work in a public right-of-way, whether to excavate or obstruct the right-of-way.\n\"Manage the public right-of-way\" means the authority of a local government unit to do any or all of the following:\n(1) require registration;\n(2) require construction performance bonds and insurance coverage;\n(3) establish installation and construction standards;\n(4) establish and define location and relocation requirements for equipment and facilities;\n(5) establish coordination and timing requirements;\n(6) require telecommunications right-of-way users to submit, for right-of-way projects commenced after May 10, 1997, whether initiated by a local government unit or any telecommunications right-of-way user, project data reasonably necessary to allow the local government unit to develop a right-of-way mapping system, such as a geographical information mapping system;\n(7) require telecommunication right-of-way users to submit, upon request of a local government unit, existing data on the location of the user's facilities occupying the public right-of-way within the local government unit. The data may be submitted in the form maintained by the user and in a reasonable time after receipt of the request based on the amount of data requested;\n(8) establish right-of-way permitting requirements for street excavation and obstruction;\n(9) establish removal requirements for abandoned equipment or facilities, if required in conjunction with other right-of-way repair, excavation, or construction; and\n(10) impose reasonable penalties for unreasonable delays in construction.\n(a) \"Management costs\" or \"rights-of-way management costs\" means the actual costs a local government unit incurs in managing its public rights-of-way, and includes such costs, if incurred, as those associated with registering applicants; issuing, processing, and verifying right-of-way or small wireless facility permit applications; inspecting job sites and restoration projects; maintaining, supporting, protecting, or moving user equipment during public right-of-way work; determining the adequacy of right-of-way restoration; restoring work inadequately performed after providing notice and the opportunity to correct the work; and revoking right-of-way or small wireless facility permits.\n(b) Management costs do not include:\n(1) payment by a telecommunications right-of-way user for the use of the public right-of-way;\n(2) unreasonable fees of a third-party contractor used by a local government unit as part of managing its public rights-of-way, including but not limited to any third-party contractor fee tied to or based upon customer counts, access lines, revenue generated by the telecommunications right-of-way user, or revenue generated for a local government unit; or\n(3) the fees and cost of litigation relating to the interpretation of this section or section 237.163 or any ordinance enacted under those sections, or the local unit of government's fees and costs related to appeals taken pursuant to section 237.163, subdivision 5.\n\"Collocate\" or \"collocation\" means to install, mount, maintain, modify, operate, or replace a small wireless facility on, under, within, or adjacent to an existing wireless support structure that is owned privately or by a local government unit.\n\"Small wireless facility\" means:\n(1) a wireless facility that meets both of the following qualifications:\n(i) each antenna is located inside an enclosure of no more than six cubic feet in volume or, in the case of an antenna that has exposed elements, the antenna and all its exposed elements could fit within an enclosure of no more than six cubic feet; and\n(ii) all other wireless equipment associated with the small wireless facility, excluding electric meters, concealment elements, telecommunications demarcation boxes, battery backup power systems, grounding equipment, power transfer switches, cutoff switches, cable, conduit, vertical cable runs for the connection of power and other services, and any equipment concealed from public view within or behind an existing structure or concealment, is in aggregate no more than 28 cubic feet in volume; or\n(2) a micro wireless facility.\n\"Utility pole\" means a pole that is used in whole or in part to facilitate telecommunications or electric service.\n(a) \"Wireless facility\" means equipment at a fixed location that enables the provision of wireless services between user equipment and a wireless service network, including:\n(1) equipment associated with wireless service;\n(2) a radio transceiver, antenna, coaxial or fiber-optic cable, regular and backup power supplies, and comparable equipment, regardless of technological configuration; and\n(3) a small wireless facility.\n(b) \"Wireless facility\" does not include:\n(1) wireless support structures;\n(2) wireline backhaul facilities; or\n(3) coaxial or fiber-optic cables (i) between utility poles or wireless support structures, or (ii) that are not otherwise immediately adjacent to or directly associated with a specific antenna.\n\"Micro wireless facility\" means a small wireless facility that is no larger than 24 inches long, 15 inches wide, and 12 inches high, and whose exterior antenna, if any, is no longer than 11 inches.\n\"Wireless service\" means any service using licensed or unlicensed wireless spectrum, including the use of Wi-Fi, whether at a fixed location or by means of a mobile device, that is provided using wireless facilities. Wireless service does not include services regulated under Title VI of the Communications Act of 1934, as amended, including a cable service under United States Code, title 47, section 522, clause (6).\n\"Wireless support structure\" means a new or existing structure in a public right-of-way designed to support or capable of supporting small wireless facilities, as reasonably determined by a local government unit.\n\"Wireline backhaul facility\" means a facility used to transport communications data by wire from a wireless facility to a communications network.",
	"repealed": false
}