{
	"id": "326B.47",
	"url": "https://www.revisor.mn.gov/statutes/cite/326B.47",
	"title": "326B.47 UNLICENSED INDIVIDUALS.",
	"text": "(a) All unlicensed individuals, other than plumber's apprentices and individuals who have completed pipe laying training as prescribed by the commissioner, must be registered under subdivision 3.\n(b) A plumber's apprentice or registered unlicensed individual is authorized to assist in the installation of plumbing only while under the direct supervision of a master, restricted master, journeyworker, or restricted journeyworker plumber. The master, restricted master, journeyworker, or restricted journeyworker plumber is responsible for ensuring that all plumbing work performed by the plumber's apprentice or registered unlicensed individual complies with the Plumbing Code. The supervising master, restricted master, journeyworker, or restricted journeyworker must be licensed and must be employed by the same employer as the plumber's apprentice or registered unlicensed individual. Licensed individuals shall not permit plumber's apprentices or registered unlicensed individuals to perform plumbing work except under the direct supervision of an individual actually licensed to perform such work. Plumber's apprentices and registered unlicensed individuals shall not supervise the performance of plumbing work or make assignments of plumbing work to unlicensed individuals.\n(c) Contractors employing plumber's apprentices or registered unlicensed individuals to perform plumbing work shall maintain records establishing compliance with this subdivision that shall identify all plumber's apprentices and registered unlicensed individuals performing plumbing work, and shall permit the department to examine and copy all such records.\nA plumber's apprentice or registered unlicensed individual who has completed four years of practical plumbing experience is eligible to take the journeyworker plumbing examination. Up to 24 months of practical plumbing experience prior to becoming a plumber's apprentice or registered unlicensed individual may be applied to the four-year experience requirement. However, none of this practical plumbing experience may be applied if the individual did not have any practical plumbing experience in the 12-month period immediately prior to becoming a plumber's apprentice or registered unlicensed individual. The Plumbing Board may adopt rules to evaluate whether the individual's past practical plumbing experience is applicable in preparing for the journeyworker's examination. If two years after completing the training the individual has not taken the examination, the four years of experience shall be forfeited.\nThe commissioner may allow an extension of the two-year period for taking the exam for cases of hardship or other appropriate circumstances.\nAn unlicensed individual may register by completing and submitting to the commissioner an application form provided by the commissioner, with all fees required by section 326B.092. A completed application form must state the date the individual began training, the individual's age, schooling, previous experience, and employer, and other information required by the commissioner. The Plumbing Board may prescribe rules, not inconsistent with this section, for the registration of unlicensed individuals. Applications for initial registration may be submitted at any time. Registration must be renewed annually and shall be for the period from July 1 of each year to June 30 of the following year.",
	"repealed": false
}