{
	"id": "142E.11",
	"url": "https://www.revisor.mn.gov/statutes/cite/142E.11",
	"title": "142E.11 CHILD CARE AUTHORIZATIONS.",
	"text": "(a) When authorizing the amount of child care, the county agency must consider the amount of time the parent reports on the application or redetermination form that the child attends preschool, a Head Start program, or school while the parent is participating in an authorized activity.\n(b) Care must be authorized and scheduled with a provider based on the applicant's or participant's verified activity schedule when:\n(1) the family requests care from more than one provider per child;\n(2) the family requests care from a legal nonlicensed provider; or\n(3) an applicant or participant is employed by any child care center that is licensed by the Department of Children, Youth, and Families or has been identified as a high-risk Medicaid-enrolled provider.\n(c) If the family remains eligible at redetermination, a new authorization with fewer hours, the same hours, or increased hours may be determined.\n(a) Notwithstanding Minnesota Rules, chapter 3400, the amount of child care authorized under section 142E.12 for employment, education, or an MFIP employment plan shall continue at the same number of hours or more hours until redetermination, including:\n(1) when the other parent moves in and is employed or has an education plan under section 142E.12, subdivision 3, or has an MFIP employment plan; or\n(2) when the participant's work hours are reduced or a participant temporarily stops working or attending an approved education program. Temporary changes include, but are not limited to, a medical leave, seasonal employment fluctuations, or a school break between semesters.\n(b) The county may increase the amount of child care authorized at any time if the participant verifies the need for increased hours for authorized activities.\n(c) The county may reduce the amount of child care authorized if a parent requests a reduction or because of a change in:\n(1) the child's school schedule;\n(2) the custody schedule; or\n(3) the provider's availability.\n(d) The amount of child care authorized for a family subject to subdivision 1, paragraph (b), must change when the participant's activity schedule changes. Paragraph (a) does not apply to a family subject to subdivision 1, paragraph (b).\n(e) When a child reaches 13 years of age or a child with a disability reaches 15 years of age, the amount of child care authorized shall continue at the same number of hours or more hours until redetermination.\n[See Note.]\nAn applicant who is homeless and eligible for child care assistance is exempt from the activity participation requirements under this chapter for three months. The applicant under this subdivision is eligible for 60 hours of child care assistance per service period for three months from the date the county receives the application. Additional hours may be authorized as needed based on the applicant's participation in employment, education, or MFIP employment plan. To continue receiving child care assistance after the initial three months, the applicant must verify that the applicant meets eligibility and activity requirements for child care assistance under this chapter.\n[See Note.]\n(a) If a child uses any combination of the following providers paid by child care assistance, a parent must choose one primary provider and one secondary provider per child that can be paid by child care assistance:\n(1) an individual or child care center licensed under chapter 142B;\n(2) an individual or child care center or facility holding a valid child care license issued by another state or tribe; or\n(3) a child care center exempt from licensing under section 142B.05.\n(b) The amount of child care authorized with the secondary provider cannot exceed 20 hours per two-week service period, per child, and the amount of care paid to a child's secondary provider is limited under section 142E.17, subdivision 1. The total amount of child care authorized with both the primary and secondary provider cannot exceed the amount of child care allowed based on the parents' eligible activity schedule, the child's school schedule, and any other factors relevant to the family's child care needs.",
	"repealed": false
}