{
	"id": "477A.12",
	"url": "https://www.revisor.mn.gov/statutes/cite/477A.12",
	"title": "477A.12 ANNUAL APPROPRIATIONS; LANDS ELIGIBLE; CERTIFICATION OF ACREAGE.",
	"text": "The following amounts are annually appropriated to the commissioner of natural resources from the general fund for transfer to the commissioner of revenue. The commissioner of revenue shall pay the transferred funds to counties as required by sections 477A.11 to 477A.14. The amounts, based on the acreage as of July 1 of each year prior to the payment year, are:\n(1) $5.133 multiplied by the total number of acres of acquired natural resources land or, at the county's option three-fourths of one percent of the appraised value of all acquired natural resources land in the county, whichever is greater;\n(2) $5.133, multiplied by the total number of acres of transportation wetland or, at the county's option, three-fourths of one percent of the appraised value of all transportation wetland in the county, whichever is greater;\n(3) $5.133, multiplied by the total number of acres of wildlife management land, or, at the county's option, three-fourths of one percent of the appraised value of all wildlife management land in the county, whichever is greater;\n(4) 50 percent of the dollar amount as determined under clause (1), multiplied by the number of acres of military refuge land in the county;\n(5) $3, multiplied by the number of acres of county-administered other natural resources land in the county;\n(6) $5.133, multiplied by the total number of acres of land utilization project land in the county;\n(7) $3, multiplied by the number of acres of commissioner-administered other natural resources land in the county;\n(8) $0.18, multiplied by the total number of acres in the county eligible for payment under clauses (1) to (7), provided that the total number of acres in the county eligible for payment under clauses (1) to (7) is equal to or greater than 25 percent of the total acreage in the county;\n(9) $0.08, multiplied by the total number of acres in the county eligible for payment under clauses (1) to (7), provided that the total number of acres in the county eligible for payment under clauses (1) to (7) is equal to or greater than ten percent, but less than 25 percent of the total acreage in the county; and\n(10) without regard to acreage, and notwithstanding the rules adopted under section 84A.55, $300,000 for local assessments under section 84A.55, subdivision 9, that shall be divided and distributed to the counties containing state-owned lands within a conservation area in proportion to each county's percentage of the total annual ditch assessments.\n(a) Each county auditor shall certify to the Department of Natural Resources during July of each year prior to the payment year the number of acres of county-administered other natural resources land within the county. The Department of Natural resources may, in addition to the certification of acreage, require descriptive lists of land so certified. The commissioner of natural resources shall determine and certify to the commissioner of revenue by March 1 of the payment year:\n(1) the number of acres and most recent appraised value of acquired natural resources land, wildlife management land, and military refuge land within each county;\n(2) the number of acres of commissioner-administered natural resources land within each county;\n(3) the number of acres of county-administered other natural resources land within each county, based on the reports filed by each county auditor with the commissioner of natural resources; and\n(4) the number of acres of land utilization project land within each county.\n(b) The commissioner of transportation shall determine and certify to the commissioner of revenue by March 1 of the payment year the number of acres of transportation wetland and the appraised value of the land, but only if it exceeds 500 acres in a county.\n(c) Each auditor of a county that contains state-owned lands within a conservation area shall determine and certify to the commissioner of natural resources by May 31 of the payment year, the county's ditch assessments for state-owned lands subject to section 84A.55, subdivision 9. A joint certification for two or more counties may be submitted to the commissioner of natural resources through the Consolidated Conservation Counties Joint Powers Board. The commissioner of natural resources shall certify the ditch assessments to the commissioner of revenue by June 15 of the payment year.\n(d) The commissioner of revenue shall determine the distributions provided for in this section using: (1) the number of acres and appraised values certified by the commissioner of natural resources and the commissioner of transportation by March 1 of the payment year; and (2) ditch assessments under paragraph (c), by July 15 of the payment year.\nFor the purposes of this section, the appraised value of acquired natural resources land is the purchase price until the next six-year appraisal required under this subdivision. The appraised value of acquired natural resources land received as a donation is the value determined for the commissioner of natural resources by a licensed appraiser, or the county assessor's estimated market value if no appraisal is done. The appraised value must be determined by the county assessor every six years, except that the appraised value shall not be less than the 2022 or subsequent appraised value, if it is higher. All reappraisals shall be done in the same year as county assessors are required to assess exempt land under section 273.18.\nThe commissioner of revenue shall annually adjust the amounts in subdivision 1, clauses (1) to (10), as provided in section 270C.22, subdivision 1, except as provided in this subdivision. To determine the dollar amounts for payments in calendar year 2025, the commissioner shall determine the percentage change in the index for the 12-month period ending on August 31, 2024, and increase each of the unrounded dollar amounts in section 477A.12, subdivision 1, by that percentage change. For each subsequent year, the commissioner shall increase the dollar amounts by the percentage change in the index from August 31 of the year preceding the statutory year, to August 31 of the year preceding the taxable year. The commissioner shall round the amounts as adjusted to the nearest tenth of a cent.",
	"repealed": false
}