{
	"id": "122A.46",
	"url": "https://www.revisor.mn.gov/statutes/cite/122A.46",
	"title": "122A.46 EXTENDED LEAVES OF ABSENCE.",
	"text": "As used in this section, the term \"teachers\" shall have the meaning given it in section 122A.15, subdivision 1. The term \"teachers\" also includes any teacher in the classifications included in the professional state residential instructional unit, under section 179A.10, subdivision 2, clause (16).\nFor purposes of teachers included in the professional state residential instructional unit, the term \"school board\" includes the appointing authority as defined in section 43A.02, subdivision 5.\nThe board of any district may grant an extended leave of absence without salary to any full- or part-time elementary or secondary teacher who has been employed by the district for at least five years and has at least ten years of allowable service, as defined in section 354.05, subdivision 13, or the bylaws of the appropriate retirement association or ten years of full-time teaching service in Minnesota public elementary and secondary schools. The duration of an extended leave of absence under this section must be determined by mutual agreement of the board and the teacher at the time the leave is granted and shall be at least three but no more than five years. An extended leave of absence under this section shall be taken by mutual consent of the board and the teacher. If the school board denies a teacher's request, it must provide reasonable justification for the denial.\nExcept as provided in subdivisions 7 and 8, a teacher on an extended leave of absence pursuant to this section shall have the right to be reinstated to a position for which the teacher is licensed at the beginning of any school year which immediately follows a year of the extended leave of absence, unless the teacher fails to give the required notice of intention to return or is discharged or placed on unrequested leave of absence or the contract is terminated pursuant to section 122A.40 or 122A.41 while the teacher is on the extended leave. The board is not obligated to reinstate any teacher who is on an extended leave of absence pursuant to this section, unless the teacher advised the board of the intention to return before February 1 in the school year preceding the school year in which the teacher wishes to return or by February 1 in the calendar year in which the leave is scheduled to terminate.\nAny teacher who is reinstated to a teaching position after an extended leave of absence pursuant to this section shall retain seniority and continuing contract rights in the employing district as though the teacher had been teaching in the district during the period of the extended leave. This subdivision shall not be construed to require a board to reinstate a teacher to any particular position or to include the years spent on the extended leave of absence in the determination of a teacher's salary upon return to teaching in this district.\nThe years spent by a teacher on an extended leave of absence pursuant to this section shall not be included in the determination of salary upon return to teaching in the district. The credits earned by a teacher on an extended leave of absence pursuant to this section shall not be included in the determination of salary upon return to teaching in the district for a period equal to the time of the extended leave of absence.\nNothing within the provisions of this section shall be construed to limit the authority of a school board to grant any teacher a leave of absence which is not subject to the provisions of this section and sections 354.094 and 354A.091.\nA school board shall not be obligated to reinstate a teacher who takes a full-time or part-time position as a teacher in another Minnesota school district while on an extended leave of absence pursuant to this section. This subdivision shall not apply to a teacher who is employed as a substitute teacher.\nA school board shall not be obligated to reinstate a superintendent on an extended leave of absence pursuant to this section to a position in the district.\nA teacher on an extended leave of absence shall receive all of the health, accident, medical, surgical and hospitalization insurance or benefits, for both the teacher and the teacher's dependents, for which the teacher would otherwise be eligible if not on an extended leave. A teacher shall receive the coverage if such coverage is available from the school district's insurer, if the teacher requests the coverage, and if the teacher either (a) reimburses the district for the full amount of the premium necessary to maintain the coverage within one month preceding the district's payment of the premium, or (b) if the district is wholly or partially self-insured, pays the district, according to a schedule agreed upon by the teacher and the school board, an amount determined by the school board to be the amount that would be charged for the coverage chosen by the teacher if the school board purchased all health, accident, medical, surgical and hospitalization coverage for its teachers from an insurer. A school district may enter into an agreement with the exclusive bargaining representative of the teachers in the district where the district agrees, for an individual teacher, to pay all or a portion of the premium for such coverage. Any such agreement must include a sunset of eligibility to qualify for the payment.",
	"repealed": false
}