{
	"id": "174.07",
	"url": "https://www.revisor.mn.gov/statutes/cite/174.07",
	"title": "174.07 EXPIRATION OF REPORT MANDATES.",
	"text": "(a) If submission of a report by the commissioner to the legislature, including but not limited to chairs and ranking minority members of a legislative committee or the Legislative Coordinating Commission, is required by law, the requirement to submit the report expires in accordance with this section.\n(b) For a law enacted before January 1, 2023, the requirement to submit a report to the legislature expires as follows:\n(1) for an annual report, on January 1, 2025; or\n(2) for a biennial or less frequent report, on January 1, 2026.\n(c) For a law enacted on or after January 1, 2023, the requirement to submit a report to the legislature expires as follows:\n(1) for an annual report, three years after the date of enactment; or\n(2) for a biennial or less frequent report, five years after the date of enactment.\nBy February 15 annually, the commissioner must submit an expirations list to the chairs and ranking minority members of the legislative committees with jurisdiction over transportation finance and policy, the revisor of statutes, and the Legislative Reference Library. The list must identify (1) all reports set to expire under this section during the upcoming 12-month period, and (2) all reports in which the requirement for submission has expired in the past 12-month period.\nThis section does not apply to:\n(1) a law that establishes a requirement with general applicability for an agency or agencies to submit a report, including but not limited to reports and information under sections 14.05, subdivision 5, and 14.116;\n(2) a law that specifies a reporting expiration date or a date for the submission of a final report;\n(3) information required by law to be included in a budget submission to the legislature under section 16A.11;\n(4) the plans required under section 174.03, subdivisions 1a, 1b, and 1c;\n(5) the forecast information requirements under section 174.03, subdivision 9; and\n(6) the reports required under sections 161.088, subdivision 7; 161.089; 161.3203, subdivision 4; 165.03, subdivision 8; 174.03, subdivision 12; 174.185, subdivision 3; 174.247; 174.56, subdivisions 1 and 2; and 174.75, subdivision 3.",
	"repealed": false
}