{
	"id": "471.698",
	"url": "https://www.revisor.mn.gov/statutes/cite/471.698",
	"title": "471.698 FINANCE REPORT, FILE, PUBLISH OR POST; CITIES UNDER 2,500.",
	"text": "In any city with a population of less than 2,500 according to the latest federal census, the city clerk or chief financial officer shall:\n(a) prepare a detailed statement of the financial affairs of the city including operations of municipal hospitals and nursing homes, liquor stores, and public utility commissions in the style and form prescribed by the state auditor, for the preceding fiscal year showing all money received, with the sources, and respective amounts thereof; all disbursements for which orders have been drawn upon the treasurer; the amount of outstanding and unpaid orders; all accounts payable; all indebtedness; contingent liabilities; all accounts receivable; the amount of money remaining in the treasury; and all items necessary to show accurately the revenues and expenditures and financial position of the city;\n(b) file the statement in the clerk's or financial officer's office for the public inspection and present it to the city council within 45 days after the close of the fiscal year;\n(c)(1) publish the statement, or a summary of the statement in a form as prescribed by the state auditor, within 90 days after the close of the fiscal year in a qualified newspaper of general circulation in the city; or\n(2) if there is no qualified newspaper of general circulation in the city, the clerk shall, at the direction of the city council, post copies in three of the most public places in the city. It is not necessary to publish individual disbursements of less than $500, if disbursements aggregating $1,000 or more to any person, firm, or other entity are set forth in a schedule of major disbursements showing amounts paid out, to whom, and for what purpose, and are made a part of and published with the financial statement; and\n(d) submit within 90 days after the close of the fiscal year a copy of the statement to the state auditor in such summary form as the state auditor may prescribe.\nA municipal hospital or nursing home established before June 6, 1979, whose fiscal year is not a calendar year on August 1, 1980, is not subject to this subdivision but shall submit to the state auditor a detailed statement of its financial affairs audited by a certified public accountant, a public accountant or the state auditor no later than 120 days after the close of its fiscal year. It may also submit a summary financial report for the calendar year.\nAny city described in subdivision 1 may comply with the provisions of section 471.697, in which case the provisions of subdivision 1 shall not apply to the city.",
	"repealed": false
}