{
	"id": "169.447",
	"url": "https://www.revisor.mn.gov/statutes/cite/169.447",
	"title": "169.447 SCHOOL BUS AND HEAD START BUS SAFETY.",
	"text": "(a) The number of pupils or other authorized passengers transported in a school bus or Head Start bus must not be more than the number of pupils or passengers that can be fully seated. Seating capacity must be adjusted according to each passenger's individual physical size, but not more than the manufacturers' rated seating capacity.\n(b) No person shall stand in the school bus or Head Start bus when the bus is in motion.\nSchool buses and Head Start buses must be equipped with driver seat belts and seat belt assemblies of the type described in section 169.685, subdivision 3. A properly adjusted and fastened seat belt, including both the shoulder and lap belt when the vehicle is so equipped, shall be worn by the driver.\n(a) In addition to the requirements in section 169.4501, subdivision 1, a school bus may be equipped with an approved lap belt or an approved lap and shoulder belt installed for each passenger seating position on the bus. The design and installation of lap belts and lap and shoulder belts required under this paragraph must meet the standards of the commissioner established under paragraph (b).\n(b) The commissioner shall consider all concerns necessary to properly integrate lap belts or lap and shoulder belts into the current compartmentalization safety system and prescribe standards for the design and installation of lap and shoulder belts required under paragraph (a). The standards are not subject to chapter 14 and are specifically not subject to section 14.386.\n(c) This subdivision does not apply to specially equipped school buses under section 169.4504.\n(d) A passenger on a school bus equipped with lap belts or lap and shoulder belts must use these lap belts or lap and shoulder belts unless the passenger, or if the passenger is a minor, the passenger's parent or guardian, has notified the school district in writing that the passenger does not intend to wear the lap belt or lap and shoulder belt.\n(e) In an action for personal injury or wrongful death against a school district, a school bus operator under contract with a school district, or any agent or employee of a school district or operator, or against a volunteer, no such person or entity shall be held liable solely because the injured party was not wearing a safety belt; provided, however, that nothing contained herein shall be construed to grant immunity from liability for failure to:\n(1) maintain in operating order any equipment required by statute, rule, or school district policy; or\n(2) comply with an applicable statute, rule, or school district policy.\n(f) In an action for personal injury or wrongful death, a school district, a school bus contract operator, any agent or employee of a school district or operator, or a volunteer is not liable for failing to assist any child with the adjustment, fastening, unfastening, or other use of the lap belt or lap and shoulder belt.\n[Repealed, 1994 c 647 art 12 s 43]\nThe driver of a school bus or Head Start bus shall keep the aisle and emergency exit of a school bus or Head Start bus unobstructed at all times when children are being transported.\nA school bus may pull a trailer, as defined by section 169.011, subdivision 86, only when traveling to or from cocurricular or extracurricular activities, as defined in section 123B.49.\n[Repealed, 2004 c 294 art 2 s 34]",
	"repealed": false
}