{
	"id": "259A.65",
	"url": "https://www.revisor.mn.gov/statutes/cite/259A.65",
	"title": "259A.65 INTERSTATE COMPACT ON ADOPTION AND MEDICAL ASSISTANCE.",
	"text": "It is the purpose and policy of the state of Minnesota to:\n(1) enter into interstate agreements with agencies of other states to safeguard and protect the interests of children covered by an adoption assistance agreement when they are adopted across state lines or move to another state after adoption finalization; and\n(2) provide a framework for uniformity and consistency in administrative procedures when a child with special needs is adopted by a family in another state and for children adopted in Minnesota who move to another state.\nFor the purposes of this section, the terms defined in this subdivision have the meanings given them, unless the context clearly indicates otherwise.\n(a) \"Adoption assistance state\" means the state that certifies eligibility for Medicaid in an adoption assistance agreement.\n(b) \"Resident state\" means the state where the adopted child is a resident.\n(c) \"State\" means a state of the United States, the District of Columbia, the Commonwealth of Puerto Rico, the United States Virgin Islands, Guam, the Commonwealth of the Northern Mariana Islands, or a territory or possession of the United States.\nThe commissioner is authorized to develop, negotiate, and enter into one or more interstate compacts on behalf of this state with other states to implement Medicaid for children with adoption assistance agreements.\n(a) A compact must include:\n(1) a provision allowing all states to join the compact;\n(2) a provision for withdrawal from the compact upon written notice to the parties, effective one year after the notice is provided;\n(3) a requirement that the protections afforded under the compact continue in force for the duration of the adoption assistance from a party state other than the one in which the adopted child is a resident;\n(4) a requirement that each instance of adoption assistance to which the compact applies be covered by an adoption assistance agreement in writing between the adoptive parent and the state child welfare agency of the state that provides the adoption assistance, and that the agreement be expressly for the benefit of the adopted child and enforceable by the adoptive parent and the state agency providing the adoption assistance; and\n(5) other provisions necessary and appropriate for the proper administration of the compact.\n(b) A compact may contain provisions establishing requirements and entitlements to medical, developmental, child care, or other social services for the child under state law, even though the child and the adoptive parent are in a state other than the one responsible for or providing the services or funds to pay part or all of the costs.\n(a) The commissioner of human services shall:\n(1) provide Minnesota medical assistance for an adopted child who is title IV-E eligible;\n(2) provide Minnesota medical assistance for an adopted child who is not title IV-E eligible who:\n(i) was determined to have a special need for medical or rehabilitative care;\n(ii) is living in another state; and\n(iii) is covered by an adoption assistance agreement made by the commissioner for medical coverage or benefits when the child is not eligible for Medicaid in the child's residence state;\n(3) consider the holder of a medical assistance identification card under this subdivision as any other recipient of medical assistance under chapter 256B; and\n(4) process and make payments on claims for the recipient in the same manner as for other recipients of medical assistance.\n(b) Coverage must be limited to providers authorized by Minnesota's medical assistance program, and according to Minnesota's program requirements.\nThe adoptive parent shall cooperate with and abide by the Medicaid program requirements and procedures of the state which provide medical coverage.\nThe commissioner shall apply for and administer all relevant aid in accordance with state and federal law.",
	"repealed": false
}