{
	"id": "308A.911",
	"url": "https://www.revisor.mn.gov/statutes/cite/308A.911",
	"title": "308A.911 VOLUNTARY DISSOLUTION BY MEMBERS.",
	"text": "A regular or a special members' meeting may be called to consider dissolution of a cooperative.\nThe proposed dissolution must be submitted for approval at the members' meeting. The dissolution must be started if a quorum is present and the proposed dissolution is approved at a meeting by two-thirds of the votes cast, or for a cooperative with articles or bylaws requiring a greater proportion of the votes cast or other conditions for approval, the dissolution is approved by the proportion of votes cast or the number of total members required by the articles or bylaws and the conditions for approval in the articles or bylaws are satisfied.\nThe members retain the right to revoke the dissolution proceedings and the right to remove directors and fill vacancies on the board.\nBefore a cooperative begins dissolution, a notice of intent to dissolve must be filed with the secretary of state. The notice must contain:\n(1) the name of the cooperative;\n(2) the date and place of the members' meeting at which the resolution was approved; and\n(3) a statement that the requisite vote of the members approved the proposed dissolution.\nAfter the notice of intent to dissolve has been filed with the secretary of state, the cooperative may carry on its business only to the extent necessary for the winding up of the cooperative unless the members revoke the dissolution proceedings. The existence of the cooperative continues to the extent necessary to wind up the affairs of the cooperative until the dissolution proceedings are revoked or articles of dissolution are filed with the secretary of state.\nThe filing with the secretary of state of a notice of intent to dissolve does not affect a remedy in favor of the cooperative or a remedy against the cooperative or its directors, officers, or members in their capacities, except as provided in section 308A.981.",
	"repealed": false
}