{
	"id": "205A.10",
	"url": "https://www.revisor.mn.gov/statutes/cite/205A.10",
	"title": "205A.10 PROCEDURE.",
	"text": "The school district clerk shall prepare and have printed the necessary election materials, including ballots, for a school district election. The names must be arranged on school district ballots in the manner provided in section 204D.08, subdivision 3, for state elections.\nA school district election must be by secret ballot and must be held and the returns made in the manner provided for the state general election, as far as practicable. The vote totals from a ballot board established pursuant to section 203B.121 may be tabulated and reported by the school district as a whole rather than by precinct. For school district elections not held in conjunction with a statewide election, the school board shall appoint election judges as provided in section 204B.21, subdivision 2. The provisions of sections 204B.19, subdivision 5; 204B.21, subdivision 2; 204C.15; 204C.19; 206.83; and 206.86, subdivision 2, relating to party balance in appointment of judges and to duties to be performed by judges of different major political parties do not apply to school district elections not held in conjunction with a statewide election.\nBetween the third and tenth days after a school district election other than a recount of a special election conducted under section 126C.17, subdivision 9, or 475.59, the school board shall canvass the returns and declare the results of the election. After the time for contesting elections has passed, the school district clerk shall issue a certificate of election to each successful candidate. If there is a contest, the certificate of election to that office must not be issued until the outcome of the contest has been determined by the proper court. If there is a tie vote, the school board shall determine the result by lot. The clerk shall deliver the certificate of election to the successful candidate by personal service or certified mail. The successful candidate shall file an acceptance and oath of office in writing with the clerk within 30 days of the date of mailing or personal service. A person who fails to qualify prior to the time specified shall be deemed to have refused to serve, but that filing may be made at any time before action to fill the vacancy has been taken. The school district clerk shall certify the results of the election to the county auditor, and the clerk shall be the final custodian of the ballots and the returns of the election.\nA school district canvassing board shall perform the duties of the school board according to the requirements of this subdivision for a recount of a special election conducted under section 126C.17, subdivision 9, or 475.59.\nA losing candidate at a school district election may request a recount of the votes for that office subject to the requirements of section 204C.36.\nFor the purpose of a recount of a special election conducted under section 126C.17, subdivision 9, or 475.59, the school district canvassing board shall consist of one member of the school board other than the clerk, selected by the board, the clerk of the school board, the county auditor of the county in which the greatest number of school district residents maintain residence, the court administrator of the district court of the judicial district in which the greatest number of school district residents maintain residence, and the mayor or chair of the town board of the school district's most populous municipality. Any member of the canvassing board may appoint a designee to appear at the meeting of the board, except that no designee may be a candidate for public office. If one of the individuals fails to appear at the meeting of the canvassing board, the county auditor shall appoint an eligible voter of the school district, who must not be a member of the school board, to fill the vacancy. Not more than two school board members shall serve on the canvassing board at one time. Four members constitute a quorum.\nThe school board shall serve as the school district canvassing board for the election of school board members.",
	"repealed": false
}