{
	"id": "116D.045",
	"url": "https://www.revisor.mn.gov/statutes/cite/116D.045",
	"title": "116D.045 ENVIRONMENTAL IMPACT STATEMENTS; COSTS.",
	"text": "The board must by rule adopt procedures to:\n(1) assess the proposer of a specific action for the responsible governmental unit's reasonable costs of preparing, reviewing, and distributing the environmental impact statement. The costs must be determined by the responsible governmental unit according to the rules adopted by the board; and\n(2) authorize a responsible governmental unit to allow a proposer of a specific action to prepare a draft environmental impact statement according to section 116D.04, subdivision 2a, paragraph (k).\nIn the event of a disagreement between the proposer of the action and the responsible governmental unit over the cost of an environmental impact statement, the responsible governmental unit shall consult with the board, which may modify the cost or determine that the cost assessed by the responsible governmental unit is reasonable.\nAs necessary, the responsible governmental unit shall assess the project proposer for reasonable costs that the responsible governmental unit incurs in preparing, reviewing, and distributing the environmental impact statement and the proposer shall pay the assessed cost to the responsible governmental unit. Money received under this subdivision by a responsible governmental unit may be retained by the unit for the same purposes. Money received by a state agency must be credited to a special account and is appropriated to the agency to cover the assessed costs incurred.\nNo responsible governmental unit shall commence the preparation of an environmental impact statement until at least one-half of the assessed cost of the environmental impact statement is paid pursuant to subdivision 3. Other laws notwithstanding, no state agency may issue any permits for the construction or operation of a project for which an environmental impact statement is prepared until the assessed cost for the environmental impact statement has been paid in full.\n[Repealed, 1988 c 501 s 9]",
	"repealed": false
}