{
	"id": "3.971",
	"url": "https://www.revisor.mn.gov/statutes/cite/3.971",
	"title": "3.971 LEGISLATIVE AUDITOR.",
	"text": "The legislative auditor is the executive secretary of the commission. The legislative auditor shall be appointed by the commission for a six-year term and serve in the unclassified service. When in office, the legislative auditor may not at any time hold any other public office. The legislative auditor may not be removed from office before the expiration of the term of service except for cause after public hearing.\n(a) The legislative auditor shall establish a Financial Audits Division and a Program Evaluation Division to fulfill the duties prescribed in this section.\n(b) Each division may be supervised by a deputy auditor, appointed by the legislative auditor, with the approval of the commission, for a term coterminous with the legislative auditor's term. The deputy auditors may be removed before the expiration of their terms only for cause. The legislative auditor and deputy auditors may each appoint an administrative support specialist to serve at pleasure. The salaries and benefits of the legislative auditor, deputy auditors, and administrative support specialists shall be determined by the compensation plan approved by the Legislative Coordinating Commission. The deputy auditors may perform and exercise the powers, duties and responsibilities imposed by law on the legislative auditor when authorized by the legislative auditor.\n(c) The legislative auditor, deputy auditors, and administrative support specialists shall serve in the unclassified civil service, but all other employees of the legislative auditor shall serve in the classified civil service. Compensation for employees of the legislative auditor in the classified service shall be governed by a plan prepared by the legislative auditor and approved by the Legislative Coordinating Commission and the legislature under section 3.855, subdivision 3.\n(d) While in office, a person appointed deputy for the Financial Audit Division must hold an active license as a certified public accountant.\n(e) Notwithstanding section 43A.32, subdivisions 2 and 3, or any other law to the contrary, an employee of the legislative auditor is prohibited from being a candidate for a partisan elected public office.\n[Repealed, 1998 c 366 s 90]\nAll the powers, duties, and responsibilities of the Department of Public Examiner relating to the state of Minnesota, its departments and agencies as described in Minnesota Statutes 1971, section 215.03, and any other law concerning powers, duties, and responsibilities of the public examiner not otherwise dealt with by Laws 1973, chapter 492, are transferred to the legislative auditor. Nothing in this subdivision shall supersede the powers conferred upon the commissioner of management and budget under section 16A.055.\nIn addition to the legislative auditing duties concerning state financial matters, the legislative auditor shall also exercise and perform duties prescribed by rule of the legislature or either body of it or by the commission.\nThe legislature may, by rule, provide to the legislative auditor the testimonial powers that are conferred by law on legislative standing commissions or committees.\nThe legislative auditor shall audit the financial statements of the state of Minnesota required by section 16A.50 and, as resources permit, Minnesota State Colleges and Universities, the University of Minnesota, state agencies, departments, boards, commissions, offices, courts, and other organizations subject to audit by the legislative auditor, including, but not limited to, the State Agricultural Society, Agricultural Utilization Research Institute, Enterprise Minnesota, Inc., Minnesota Historical Society, ClearWay Minnesota, Minnesota Sports Facilities Authority, Metropolitan Council, Metropolitan Airports Commission, and Metropolitan Mosquito Control District. Financial audits must be conducted according to generally accepted government auditing standards. The legislative auditor shall see that all provisions of law respecting the appropriate and economic use of public funds and other public resources are complied with and may, as part of a financial audit or separately, investigate allegations of noncompliance.\nThe legislative auditor shall audit, as resources permit, information and data systems supported with public funds and operated by an organization listed in subdivision 6. The audits shall include an assessment of controls designed to protect government data, particularly government data classified as not public by chapter 13, from unauthorized access and use. The audits shall also include an assessment of organizations' compliance with other applicable legal requirements related to the operation of information and data systems and proper classification and protection of the data contained in the systems.\nThe legislative auditor shall conduct program evaluations to determine the degree to which the activities and programs entered into or funded by the state are accomplishing their goals and objectives, including a critical analysis of goals and objectives, measurement of program results and effectiveness, alternative means of achieving the same results, and efficiency in the allocation of resources. The legislative auditor shall recommend ways to improve the effectiveness of the programs, reduce the cost of providing state services, and eliminate services of one agency that overlap with or duplicate the services performed by another agency. At the direction of the commission the legislative auditor may conduct program evaluations of any state department, board, commission, or agency and any metropolitan agency, board, or commission created under chapter 473; or any program or activity established or funded, in whole or in part, by the state. After an evaluation report has been released, the legislative auditor may periodically conduct a follow-up review to assess what changes have occurred.\n[Repealed, 1Sp2003 c 1 art 2 s 136]\nThe legislative auditor may conduct a special review to: (1) fulfill a legal requirement; (2) investigate allegations that an individual or organization subject to audit by the legislative auditor may not have complied with legal requirements related to the use of public money, other public resources, or government data classified as not public; (3) respond to a legislative request for a review of an organization or program subject to audit by the legislative auditor; or (4) investigate allegations that an individual may not have complied with section 43A.38 or 43A.39.\nThe chief executive, financial, or information officers of an organization subject to audit under this section must promptly notify the legislative auditor when the officer obtains information indicating that public money or other public resources may have been used for an unlawful purpose, or when the officer obtains information indicating that government data classified by chapter 13 as not public may have been accessed by or provided to a person without lawful authorization. As necessary, the legislative auditor shall coordinate an investigation of the allegation with appropriate law enforcement officials.",
	"repealed": false
}