{
	"id": "9.031",
	"url": "https://www.revisor.mn.gov/statutes/cite/9.031",
	"title": "9.031 DEPOSITORIES FOR STATE FUNDS.",
	"text": "The Executive Council shall designate banks, trust companies, or credit unions within the state as depositories to receive state funds. The commissioner of management and budget is not liable for the safekeeping of the funds so lawfully deposited. The banks, trust companies, or credit unions so designated as depositories must:\n(1) have been organized for at least one year; or\n(2) have taken over or absorbed a bank, trust company, or credit union that has been organized for at least one year.\nTo the extent that state funds on deposit at the close of a depository's banking day exceed applicable deposit insurance coverage, the state shall require the depository to furnish and file with the commissioner of management and budget a corporate security bond to secure state funds deposited with it, or to deposit with the commissioner collateral security as provided in subdivision 3. The Executive Council shall approve the bond when the council is fully satisfied that the bond is in proper form, the securities sufficient, the depository prosperous and financially sound, and the capital stock claimed by it fully paid up and not impaired. Each depository bond shall provide that during the time the bond is in force the depository will pay all the state funds deposited with it to the commissioner of management and budget, free of exchange, at any place in the state designated by the commissioner of management and budget. If the deposit is a time deposit it shall be paid, together with interest, only when due. At any time the Executive Council or the commissioner of management and budget may require a new or additional bond from any depository.\n(a) In lieu of the corporate bond required in subdivision 2, a depository may deposit with the commissioner of management and budget collateral to secure state funds that are to be deposited with it. The Executive Council must approve the collateral.\n(b) The Executive Council shall not approve any collateral except:\n(1) United States government treasury bills, treasury notes, and treasury bonds;\n(2) issues of United States government agencies and instrumentalities, as quoted by a recognized industry quotation service available to the state;\n(3) general obligation securities of any state other than the state and its agencies or local government with taxing powers that is rated \"A\" or better by a national bond rating service, or revenue obligation securities of any state other than the state and its agencies or local government with taxing powers that is rated \"AA\" or better by a national bond rating service;\n(4) irrevocable standby letters of credit issued by Federal Home Loan Banks to the state accompanied by written evidence that the bank's public debt is rated \"AA\" or better by Moody's Investors Service, Inc., or Standard & Poor's Corporation; and\n(5) time deposits that are fully insured by any federal agency.\n(c) The collateral deposited shall be accompanied by an assignment thereof to the state, which assignment shall recite that:\n(1) the depository will pay all the state funds deposited with it to the commissioner of management and budget, free of exchange or other charge, at any place in this state designated by the commissioner of management and budget; if the deposit is a time deposit it shall be paid, together with interest, only when due; and\n(2) in case of default by the depository the state may sell the collateral, or as much of it as is necessary to realize the full amount due from the depository, and pay any surplus to the depository or its assigns.\n(d) Upon the direction of the Executive Council, the commissioner of management and budget, on behalf of the state, may reassign in writing to the depository any registered collateral pledged to the state by assignment thereon.\n(e) A depository may deposit collateral of less value than the total designation and may, at any time during the period of its designation, deposit additional collateral, withdraw excess collateral, and substitute other collateral for all or part of that on deposit. Approval of the Executive Council is not necessary for the withdrawal of excess collateral.\n(f) If the depository is not in default the commissioner of management and budget shall pay the interest collected on the deposited collateral to the depository.\n(g) In lieu of depositing collateral with the commissioner of management and budget, collateral may also be placed in safekeeping in a restricted account at a Federal Reserve bank, or in an account at a trust department of a commercial bank or other financial institution that is not owned or controlled by the financial institution furnishing the collateral. The selection shall be approved by the commissioner.\nA depository may furnish more than one bond or both bonds and collateral to secure state funds to be deposited with it. If both bonds and collateral are furnished the depository may withdraw all or any part of the collateral without in any way impairing the bond unless there is a provision in the bond that the collateral will not be withdrawn without the consent of the surety on the bond.\nThe Executive Council shall prescribe the maximum amount that may be deposited in each depository. In no case shall the amount of the deposit in excess of applicable deposit insurance coverage exceed:\n(1) the penalty on the bonds;\n(2) 90 percent of the market value of the bonds; or\n(3) the penalty on the bonds plus 90 percent of the market value of the collateral, if both are furnished.\nThe commissioner of management and budget may deposit in any qualified depository, in the name of the state, state funds in hand.\nThe Executive Council may permit any designated depository to receive from any official, department, institution, or other agency of the state special deposits of state moneys that have not been paid into the state treasury. All moneys so deposited are deemed deposited pursuant to such designation.\nUpon direction of the commissioner of management and budget a depository may receive and carry as a special deposit an amount of money withdrawn from the treasury that may be immediately required to pay principal or interest, or both, of maturing obligations of the state. Upon the direction of the commissioner of management and budget the depository may pay out of such deposit the maturing obligations and surrender them to the commissioner of management and budget for cancellation.\nThe Executive Council shall fix the rate of interest to be paid upon the special accounts authorized by this subdivision or may waive payment of interest if in its judgment the average amount deposited is not sufficient to justify charging interest.\nDepositories shall be divided into two classes to be known as active and inactive. A depository may be designated as a depository of both classes.\nAll state funds deposited in active depositories are subject to withdrawal by the commissioner of management and budget upon demand and no interest shall be charged on these deposits.\nSurplus funds not required to meet the state's current disbursements shall be deposited for a definite period in inactive depositories and interest shall be paid on these deposits at a rate of not less than one percent per annum nor more than the maximum rate authorized to be paid by Minnesota state banks other than savings banks. This rate shall be fixed by the Executive Council in accordance with the current rate upon similar deposits.\nWhen the Executive Council deems necessary it may require any depository of state funds or any surety on a depository bond to furnish a sworn statement of the financial condition of the depository or surety. Failure to render a statement within a reasonable time is sufficient ground for revocation of the designation.\nAny person who makes a false statement to the Executive Council with regard to the financial condition of a depository or the surety on a depository bond is guilty of a gross misdemeanor.\nThe closing of a depository is a default by the depository and no demand by the state or its commissioner of management and budget is necessary to establish the default. When a depository closes, any time deposit therein is immediately due and payable.\nIn any proceeding to wind up an insolvent depository of state funds the state is a preferred creditor.\nWhere a bond has been given by the depository the state may proceed either as a preferred creditor against the assets of the insolvent depository or as the obligee on the surety bond against the surety thereon or against both as the Executive Council deems advisable.\nIf the state receives or recovers any amount of its claim from the surety, the latter is not, by reason thereof, subrogated to the claim of the state against the assets of the insolvent depository as a preferred creditor.\nThe Executive Council may revoke its designation of any depository at any time. Upon revocation of an active depository the commissioner of management and budget shall withdraw the state funds deposited therein immediately and shall make no further deposits therein. Upon revocation of an inactive depository the commissioner of management and budget shall withdraw state funds deposited therein when they become due and shall make no further deposits therein.\nBanks and trust companies designated as depositories must have received ratings of \"outstanding\" or \"satisfactory\" as their most recent rating under United States Code, title 12, section 2906. If a state depository receives a rating that is below \"satisfactory,\" the Executive Council shall revoke its designation as a depository. The Executive Council may delay the effective date of the revocation if necessary to allow a reasonable period of time to arrange for a replacement depository.",
	"repealed": false
}