{
	"id": "60A.093",
	"url": "https://www.revisor.mn.gov/statutes/cite/60A.093",
	"title": "60A.093 REDUCTION FROM LIABILITY FOR REINSURANCE CEDED BY A DOMESTIC INSURER; COLLATERAL REQUIREMENTS.",
	"text": "A reduction from liability for reinsurance ceded by a domestic insurer to an assuming insurer not meeting the requirements of section 60A.092 shall be allowed in an amount not exceeding the liabilities carried by the ceding insurer. Such reduction shall be in the amount of funds held by or on behalf of the ceding insurer, including funds held in trust for the ceding insurer, as security for the payment of obligations under the reinsurance contract with the assuming insurer. Such security must be held in the United States subject to withdrawal solely by, and under the exclusive control of, the ceding insurer; or, in the case of a trust, held in a qualified United States financial institution. The funds held as security may be in any form of security acceptable to the commissioner or in the form of:\n(1) cash;\n(2) securities listed by the Securities Valuation Office of the National Association of Insurance Commissioners, including those deemed exempt from filing as defined by the Purposes and Procedures Manual of the Securities Valuation Office, and qualifying as admitted assets and, with the exception of United States treasury notes, readily marketable over a national exchange or NASDAQ with maturity dates within one year; or\n(3) clean, irrevocable, unconditional letters of credit issued or confirmed by a qualified United States financial institution no later than December 31 in respect of the year for which filing is being made, and in the possession of, or in trust for, the ceding insurer on or before the filing date of its annual statement.\nLetters of credit meeting applicable standards of issuer acceptability as of the dates of their issuance or confirmation must continue to be acceptable as security until their expiration, extension, renewal, modification, or amendment, whichever comes first.\nThe letter of credit of an institution failing the standards of subdivision 1, clause (3), continues to be acceptable for no more than 30 days.",
	"repealed": false
}