{
	"id": "297A.83",
	"url": "https://www.revisor.mn.gov/statutes/cite/297A.83",
	"title": "297A.83 APPLICATION FOR PERMIT.",
	"text": "(a) A retailer required to collect and remit sales taxes under section 297A.66 shall file with the commissioner an application for a permit.\n(b) A retailer making retail sales from outside this state to a destination within this state who is not required to obtain a permit under paragraph (a) may nevertheless voluntarily file an application for a permit.\n(c) The commissioner may require any person or class of persons obligated to file a use tax return under section 289A.11, subdivision 3, to file an application for a permit.\nThe application must be made on a form prescribed by the commissioner and indicate the name under which the applicant intends to transact business, the location of the applicant's place or places of business, and other information the commissioner may require. The application must be filed by the owner, if a natural person; by a member or partner, if the owner is an association or partnership; or by a person authorized to file the application, if the owner is a corporation.\n(a) The commissioner may decline to issue a permit to a retailer not maintaining a place of business in this state, or may cancel a permit previously issued to the retailer, if the commissioner believes that the tax can be collected more effectively from the persons using the property in this state. A refusal to issue or cancellation of a permit on such grounds does not affect the retailer's right to make retail sales from outside this state to destinations within this state.\n(b) If the commissioner considers it necessary for the efficient administration of the tax to regard a salesperson, representative, trucker, peddler, or canvasser as the agent of the dealer, distributor, supervisor, employer, or other person under whom that person operates or from whom the person obtains the tangible personal property sold, whether making sales personally or in behalf of that dealer, distributor, supervisor, employer, or other person, the commissioner may regard the salesperson, representative, trucker, peddler, or canvasser as such agent, and may regard the dealer, distributor, supervisor, employer, or other person as a retailer for the purposes of collecting the tax.",
	"repealed": false
}