{
	"id": "473.436",
	"url": "https://www.revisor.mn.gov/statutes/cite/473.436",
	"title": "473.436 COUNCIL; BORROWING MONEY.",
	"text": "MS 1984 [Repealed, 1Sp1985 c 10 s 123 subd 1]\nCertificates of indebtedness, bonds, or other obligations issued by the council to which tax levies have been pledged pursuant to section 473.446, subdivision 1, shall be proper for investment of any funds by any bank, savings bank, savings association, credit union, trust company, insurance company or public or municipal corporation, and may be pledged by any bank, savings bank, savings association, credit union, or trust company as security for the deposit of public moneys.\nCertificates of indebtedness, bonds, or other obligations of the council shall be deemed and treated as instrumentalities of a public government agency.\nMS 1984 [Repealed, 1Sp1985 c 10 s 123 subd 1]\nMS 1984 [Repealed, 1Sp1985 c 10 s 123 subd 1]\nOn or after the first day of any fiscal year, the council may borrow money which may be used or expended by the council for any purpose, including but not limited to current expenses, capital expenditures and the discharge of any obligation or indebtedness of the council. The indebtedness must be represented by a note or notes which may be issued from time to time in any denomination and sold at public or private sale pursuant to a resolution authorizing the issuance. The resolution must set forth the form and manner of execution of the notes and shall contain other terms and conditions the council deems necessary or desirable to provide security for the holders of the notes. The note or notes are payable from committed or appropriated money from taxes, grants or loans of the state or federal government made to the council, or other revenues of the council, and the money may be pledged to the payment of the notes. The council is authorized to pledge to the payment of the note or notes taxes levied by it under section 473.446, subdivision 1, clause (a), and if taxes are so pledged the council shall transfer amounts received from the levy to the council for payment of the note or notes. To the extent the notes are not paid from the grant or loan money pledged for the payment thereof, the principal and interest of the notes must be paid from any taxes received by the council and any income and revenue received by or accrued to the council during the fiscal year in which the note or notes were issued, or other money of the council lawfully available therefor.\nMS 1992 [Repealed, 1994 c 628 art 3 s 209]",
	"repealed": false
}