{
	"id": "626.5571",
	"url": "https://www.revisor.mn.gov/statutes/cite/626.5571",
	"title": "626.5571 MULTIDISCIPLINARY ADULT PROTECTION TEAM.",
	"text": "A county may establish a multidisciplinary adult protection team comprised of the director of the local welfare agency or designees, the county attorney or designees, the county sheriff or designees, and representatives of health care. In addition, representatives of mental health or other appropriate human service agencies, community corrections agencies, representatives from local tribal governments, local law enforcement agencies or designees thereof, adult advocate groups, and any other organization with relevant expertise may be added to the adult protection team.\nA multidisciplinary adult protection team may provide public and professional education, develop resources for prevention, intervention, and treatment, and provide case consultation to the local welfare agency to better enable the agency to carry out its functions under section 626.557 and to meet the community's needs. Case consultation may be performed by a committee of the team composed of the team members representing social services, law enforcement, the county attorney, health care, and persons directly involved in an individual case as determined by the case consultation committee. Case consultation includes a case review process that results in recommendations about services to be provided to the identified adult and family.\nThe local welfare agency may make available to members of the team for case consultation all records collected and maintained by the agency under section 626.557 and in connection with case consultation. Any member of the case consultation committee may share data, acquired in the member's professional capacity, with the committee to assist the committee in its function. Members prohibited from disclosing patient identifying information because of federal or state law shall seek consent from each patient or resident, or a guardian, conservator or legal representative, for the disclosure of appropriate data to the case consultation committee.",
	"repealed": false
}