{
	"id": "136A.32",
	"url": "https://www.revisor.mn.gov/statutes/cite/136A.32",
	"title": "136A.32 BONDS OF THE AUTHORITY.",
	"text": "The authority may from time to time issue revenue bonds for purposes of sections 136A.25 to 136A.42, and all such revenue bonds, notes, bond anticipation notes or other obligations of the authority issued pursuant to sections 136A.25 to 136A.42 shall be and are hereby declared to be negotiable for all purposes notwithstanding their payment from a limited source and without regard to any other law or laws. In anticipation of the sale of such revenue bonds, the authority may issue negotiable bond anticipation notes and may renew the same from time to time, but the maximum maturity of any such note, including renewals thereof, shall not exceed five years from the date of issue of the original note. Such notes shall be paid from any revenues of the authority available therefor and not otherwise pledged, or from the proceeds of sale of the revenue bonds of the authority in anticipation of which they were issued. The notes shall be issued in the same manner as the revenue bonds. Such notes and the resolution or resolutions authorizing the same may contain any provisions, conditions or limitations which a bond resolution or the authority may contain.\nThe revenue bonds and notes of every issue shall be payable solely out of revenues of the authority, subject only to any agreements with the holders of particular revenue bonds or notes pledging any particular revenues. Notwithstanding that revenue bonds and notes may be payable from a special fund, they shall be and be deemed to be, for all purposes, negotiable instruments, subject only to the provisions of the revenue bonds.\nThe revenue bonds may be issued as serial bonds or as term bonds, or the authority, in its discretion, may issue bonds of both types. The revenue bonds shall be authorized by resolution of the members of the authority and shall bear such date or dates, mature at such time or times, not exceeding 50 years from their respective dates, bear interest at such rate or rates, payable at such time or times, be in denominations, be in such form, either coupon or registered, carry such registration privileges, be executed in such manner, be payable in lawful money of the United States of America at such place or places, and be subject to such terms of redemption, as such resolution or resolutions may provide. The revenue bonds or notes may be sold at public or private sale for such price or prices as the authority shall determine. Pending preparation of the definitive bonds, the authority may issue interim receipts or certificates which shall be exchanged for such definite bonds. Bonds or notes may be executed by the manual or facsimile signatures of two officers of the authority, and the facsimile of any seal adopted by the authority may be imprinted thereon, so long as the signature of either one such officer is a manual signature or as the bonds are authenticated by the manual signature of an authorized officer of a corporate trustee appointed to authenticate the bonds under a trust agreement with the authority.\nAny resolution or resolutions authorizing any revenue bonds or any issue of revenue bonds may contain provisions, which shall be a part of the contract with the holders of the revenue bonds to be authorized, as to:\n(1) pledging all or any part of the revenues of a project or projects, any revenue producing contract or contracts made by the authority with any individual partnership, corporation or association or other body, public or private, to secure the payment of the revenue bonds or of any particular issue of revenue bonds, subject to such agreements with bondholders as may then exist;\n(2) the rentals, fees and other charges to be charged, and the amounts to be raised in each year thereby, and the use and disposition of the revenues;\n(3) the setting aside of reserves or sinking funds, and the regulation and disposition thereof;\n(4) limitations on the right of the authority or its agent to restrict and regulate the use of the project;\n(5) limitations on the purpose to which the proceeds of sale of any issue of revenue bonds then or thereafter to be issued may be applied and pledging such proceeds to secure the payment of the revenue bonds or any issue of the revenue bonds;\n(6) limitations on the issuance of additional bonds, the terms upon which additional bonds may be issued and secured and the refunding of outstanding bonds;\n(7) the procedure, if any, by which the terms of any contract with bondholders may be amended or abrogated, the amount of bonds the holders of which must consent thereto, and the manner in which such consent may be given;\n(8) limitations on the amount of moneys derived from the project to be expended for operating, administrative or other expenses of the authority;\n(9) defining the acts or omissions to act which shall constitute a default in the duties of the authority to holders of its obligations and providing the rights and remedies of such holders in the event of a default;\n(10) the mortgaging of a project and the site thereof for the purpose of securing the bondholders.\nNeither the members of the authority nor any person executing the revenue bonds or notes shall be liable personally on the revenue bonds or notes or be subject to any personal liability or accountability by reason of the issuance thereof.\nThe authority shall have power out of any funds available therefor to purchase its bonds or notes. The authority may hold, pledge, cancel or resell such bonds, subject to and in accordance with agreements with bondholders.\nThe authority may invest any bond proceeds, sinking funds or reserves in any securities authorized for investment of funds of municipalities pursuant to sections 118A.04 and 118A.05, including securities described in section 475.67, subdivision 8. In addition, such bond proceeds, sinking funds and reserves may be:\n(1) deposited in time deposits of any state or national bank subject to the limitations and requirements of chapter 118A; or\n(2) invested in repurchase agreements with, providing for the repurchase of securities described in the preceding sentence by, a bank qualified as a depository of money of the authority, a national or state bank in the United States that is a member of the Federal Reserve System and whose combined capital and surplus equals or exceeds $10,000,000, or a reporting dealer to the Federal Reserve Bank of New York. Power to make any such investment or deposit is subject to the provisions of any applicable covenant or restriction in a resolution or trust agreement of the authority.",
	"repealed": false
}