{
	"id": "244.19",
	"url": "https://www.revisor.mn.gov/statutes/cite/244.19",
	"title": "244.19 PROBATION SERVICES AND OFFICERS.",
	"text": "(a) If a county or Tribal Nation is not a Community Corrections Act jurisdiction under chapter 401, the county must, or the Tribal Nation may, provide adult misdemeanant and juvenile probation services to district courts according to subdivision 1b.\n(b) This section applies to CPO and non-CPO jurisdictions.\n(a) For purposes of this section, the terms defined in this subdivision have the meanings given them.\n(b) \"CPO jurisdiction\" means:\n(1) a county or Tribal Nation providing probation services under subdivision 1b, paragraph (b); or\n(2) a group of counties or Tribal Nations providing probation services under subdivision 1b, paragraph (c).\n(c) \"Non-CPO jurisdiction\" means a county, Tribal Nation, group of counties, or group of Tribal Nations receiving probation services under subdivision 1b, paragraph (d).\n(d) \"Tribal Nation\" means a federally recognized Tribal Nation within the boundaries of the state of Minnesota.\n(a) Adult misdemeanant and juvenile probation services for CPO and non-CPO jurisdictions must be provided according to this subdivision.\n(b) The court, with the approval of the county boards or respective Tribal Nation governments, may appoint one or more salaried county or Tribal probation officers to serve at the pleasure of the court.\n(c) If two or more counties or Tribal Nations offer probation services, the district court through the county boards or respective Tribal Nation governments may appoint common salaried county or Tribal probation officers to serve in the counties or Tribal Nations, or both, if applicable.\n(d) A county or Tribal Nation may request the commissioner of corrections to furnish probation services in accordance with this section, and the commissioner must furnish the services to any county or Tribal Nation that fails to provide its own probation officer according to paragraph (b) or (c).\n(e) If a county or Tribal Nation providing probation services under paragraph (b) or (c) asks the commissioner to furnish probation services or the legislature mandates the commissioner to furnish probation services, the probation officers and other employees displaced by the changeover must be employed by the commissioner at no loss of salary. Years of service in the county or Tribal probation department are to be given full credit for future sick leave and vacation accrual purposes. This paragraph applies to the extent consistent with state and Tribal law.\n(f) If a county or Tribal Nation receiving probation services under paragraph (d) decides to provide the services under paragraph (b) or (c), the probation officers and other employees displaced by the changeover must be employed by the county or Tribal Nation at no loss of salary. Years of service in the state are to be given full credit for future sick leave and vacation accrual purposes. This paragraph applies to the extent consistent with state and Tribal law.\n(g) In accordance with this section, a Tribal Nation may elect to provide probation services to the following individuals in any Tribal Nation or county in which the individuals reside:\n(1) an individual who is enrolled or eligible to be enrolled in a Tribal Nation; and\n(2) an individual who resides in an enrolled member's household.\n(a) A CPO jurisdiction:\n(1) must collaborate with the commissioner to develop a comprehensive plan under section 401.06; and\n(2) is subject to all applicable eligibility provisions under chapter 401 necessary to receive a subsidy under section 401.10.\n(b) A non-CPO jurisdiction is eligible to receive a subsidy under section 401.10 but is not a Community Corrections Act jurisdiction under chapter 401, and the commissioner:\n(1) is appropriated the jurisdiction's share of funding under section 401.10 for providing probation services; and\n(2) may seek reimbursement from the jurisdiction according to subdivision 5a.\nAs calculated by the community supervision formula under section 401.10, the commissioner must:\n(1) reimburse a CPO jurisdiction for the cost that the jurisdiction assumes under this section for providing probation services, including supervising juveniles committed to the commissioner of corrections; and\n(2) reimburse a non-CPO jurisdiction for the commissioner's provision of probation services to the jurisdiction under this section.\n(a) The commissioner of management and budget must place employees transferred to state service under subdivision 1b, paragraph (e), in the proper classifications in the classified service. Each employee is appointed without examination at no loss in salary or accrued vacation or sick leave benefits, but no additional accrual of vacation or sick leave benefits may occur until the employee's total accrued vacation or sick leave benefits fall below the maximum permitted by the state for the employee's position.\n(b) An employee appointed under subdivision 1b, paragraph (e), must serve a six-month probationary period. If an employee is not certified after the probationary period, the employee may appeal for a hearing within ten days to the commissioner of management and budget, who may uphold the decision not to certify, extend the probationary period, or certify the employee. An employee may not appeal the commissioner's initial decision until after exhausting labor contract remedies, and the commissioner's decision is final after appeal.\n(c) The state must negotiate the employees' seniority with the exclusive representative for the bargaining unit to which the employees are transferred. For purposes of computing seniority among those employees transferring from one county unit only, a transferred employee retains the same seniority position as the employee had within that county's probation office.\n(a) Nothing in this chapter relating to probation services is intended to infringe on the sovereignty of a Tribal Nation. Notwithstanding any other law to the contrary and to the extent consistent with a Tribal Nation's sovereignty, a Tribal Nation is subject to the same requirements and has the same authority as a county providing or receiving probation services under this section.\n(b) The Department of Corrections and Minnesota Management and Budget must consult with Tribal Nations and offer guidance as necessary to implement and fulfill the purposes of this chapter.\nMS 2022 [Repealed by amendment, 2023 c 52 art 17 s 4]\nAll county and Tribal Nation probation officers serving a district court:\n(1) must:\n(i) act under the orders of the court in reference to any person committed to their care by the court;\n(ii) provide probation services, including supervising juveniles committed to the commissioner of corrections, for all individuals on probation who reside in the counties and Tribal Nations that the officers serve;\n(iii) act under the orders of the commissioner in reference to any juvenile committed to their care by the commissioner;\n(iv) under the direction of the authority having power to appoint them, initiate programs for the welfare of persons coming within the jurisdiction of the court to prevent delinquency and crime and to rehabilitate within the community persons who come within the jurisdiction of the court and are properly subject to efforts to accomplish prevention and rehabilitation; and\n(v) under the direction of the court, cooperate with all law enforcement agencies, schools, child welfare agencies of a public or private character, and other groups concerned with preventing crime and delinquency and rehabilitating persons convicted of crime and delinquency;\n(2) in the performance of their duties have the general powers of a peace officer; and\n(3) are responsible for:\n(i) investigating any person as may be required by the court before, during, or after the trial or hearing and furnishing to the court information and assistance as may be required;\n(ii) supervising any person before, during, or after trial or hearing when directed by the court; and\n(iii) keeping records and making reports to the court as the court may order.\n[Repealed, 1Sp2003 c 2 art 6 s 7]\n[Repealed, 1998 c 367 art 7 s 15; 1998 c 408 s 11]\nFor a non-CPO jurisdiction, the commissioner must, out of appropriations provided under subdivision 5a, paragraph (b), pay probation officers the salary and all benefits fixed by the state law or applicable bargaining unit and all necessary expenses, including secretarial service, office equipment and supplies, postage, telephone services, and travel and subsistence.\n(a) At least every six months, the commissioner must bill for the total cost and expenses incurred by the commissioner on behalf of each non-CPO jurisdiction that has received probation services. The commissioner must notify each non-CPO jurisdiction of the cost and expenses, and the jurisdiction must pay to the commissioner the amount due for reimbursement.\n(b) Each CPO and non-CPO jurisdiction must reimburse the Department of Corrections for the total cost and expenses of the probation services as incurred by the commissioner, excluding the cost and expense of services provided under the state's obligation for adult felony supervision in section 244.20. Money received under this paragraph from a non-CPO jurisdiction must be annually appropriated to the commissioner for providing probation services to the jurisdiction.\n(c) Objections by a non-CPO jurisdiction to all allocation of cost and expenses must be presented to and determined by the commissioner.\n(d) In addition to the billing and reimbursement requirements under this section, invoicing and payments for probation services are as provided under sections 401.14 and 401.15.\nThe county commissioners of any county of not more than 200,000 population shall, when requested to do so by the juvenile judge, provide probation officers with suitable offices, and may provide equipment, and secretarial help needed to render the required services.\nMS 2022 [Repealed by amendment, 2023 c 52 art 17 s 4]\nMS 2022 [Repealed by amendment, 2023 c 52 art 17 s 4]\nMS 2022 [Repealed by amendment, 2023 c 52 art 17 s 4]",
	"repealed": false
}