{
	"id": "115.01",
	"url": "https://www.revisor.mn.gov/statutes/cite/115.01",
	"title": "115.01 DEFINITIONS.",
	"text": "The following words and phrases when used in this chapter and, with respect to the pollution of the waters of the state, in chapter 116, unless the context clearly indicates otherwise, shall have the meanings ascribed to them in this section.\nMS 1990 [Renumbered subd 17]\n\"Agency\" means the Minnesota Pollution Control Agency.\nMS 1990 [Renumbered subd 8]\n\"Depository\" means: (a) a disposal facility or stabilization and containment facility for hazardous waste as defined in section 115A.03; and (b) a radioactive waste management facility as defined in section 116C.71, subdivision 7.\nMS 1990 [Renumbered subd 9]\n\"Discharge\" means the addition of any pollutant to the waters of the state or to any disposal system.\nMS 1990 [Renumbered subd 13]\n\"Disposal system\" means a system for disposing of sewage, industrial waste and other wastes, and includes sewer systems and treatment works.\nMS 1990 [Renumbered subd 18]\n\"Groundwater\" means water contained below the surface of the earth in the saturated zone including, without limitation, all waters whether under confined, unconfined, or perched conditions, in near-surface unconsolidated sediment or regolith, or in rock formations deeper underground.\nMS 1990 [Renumbered subd 21]\n\"Hazardous waste\" means waste as defined in section 116.06, subdivision 11.\nMS 1990 [Renumbered subd 5]\n\"Industrial waste\" means any liquid, gaseous or solid waste substance resulting from any process of industry, manufacturing trade or business or from the development of any natural resource.\n\"Microplastics\" means particles of plastic less than 500 micrometers in size.\n\"Nanoplastics\" means plastic particles less than or equal to 100 nanometers in size.\nMS 1990 [Renumbered subd 22]\n\"Other wastes\" mean garbage, municipal refuse, decayed wood, sawdust, shavings, bark, lime, sand, ashes, offal, oil, tar, chemicals, dredged spoil, solid waste, incinerator residue, sewage sludge, munitions, chemical wastes, biological materials, radioactive materials, heat, wrecked or discarded equipment, rock, cellar dirt or municipal or agricultural waste, and all other substances not included within the definitions of sewage and industrial waste set forth in this chapter which may pollute or tend to pollute the waters of the state.\n\"Person\" means the state or any agency or institution thereof, any municipality, governmental subdivision, public or private corporation, individual, partnership, or other entity, including, but not limited to, association, commission or any interstate body, and includes any officer or governing or managing body of any municipality, governmental subdivision, or public or private corporation, or other entity.\n\"Plastic\" means a synthetic material made from linking monomers through a chemical reaction to create a polymer chain that can be molded or extruded at high heat into various solid forms that retain their defined shapes during their life cycle and after disposal. Plastic does not mean natural polymers that have not been chemically modified.\nMS 1990 [Renumbered subd 2]\n\"Point source\" means any discernible, confined and discrete conveyance, including, but not limited to, any pipe, ditch, channel, tunnel, conduit, well, discrete fissure, container, rolling stock, concentrated animal feeding operation, or vessel or other floating craft, from which pollutants are or may be discharged.\nMS 1990 [Renumbered subd 4]\n\"Pollutant\" means any sewage, industrial waste, or other wastes, as defined in this chapter, discharged into a disposal system or to waters of the state.\nMS 1990 [Renumbered subd 12]\n\"Pollution of water,\" \"water pollution,\" or \"pollute the water\" means: (a) the discharge of any pollutant into any waters of the state or the contamination of any waters of the state so as to create a nuisance or render such waters unclean, or noxious, or impure so as to be actually or potentially harmful or detrimental or injurious to public health, safety or welfare, to domestic, agricultural, commercial, industrial, recreational or other legitimate uses, or to livestock, animals, birds, fish or other aquatic life; or (b) the alteration made or induced by human activity of the chemical, physical, biological, or radiological integrity of waters of the state.\nMS 1990 [Renumbered subd 20]\n\"Potable water\" means water which is or may be used as a source of supply for human consumption including drinking, culinary use, food processing, and other similar purposes, and which is suitable for such uses in its untreated state or when treated using generally recognized treatment methods.\nMS 1990 [Renumbered subd 11]\n\"Radioactive waste\" means high-level radioactive waste as defined in section 116C.71, subdivision 2f, and low-level radioactive waste as defined in article II of the Midwest Interstate Low-Level Radioactive Waste Compact, as enacted by section 116C.831.\nMS 1990 [Renumbered subd 19]\n\"Schedule of compliance\" means a schedule of remedial measures including an enforceable sequence of actions or operations leading to compliance with an effluent limitation, other limitation, prohibition, or standard.\nMS 1990 [Renumbered subd 16]\n\"Sewage\" means the water-carried waste products from residences, public buildings, institutions or other buildings, or any mobile source, including the excrementitious or other discharge from the bodies of human beings or animals, together with such groundwater infiltration and surface water as may be present.\nMS 1990 [Renumbered subd 7]\n\"Sewer system\" means pipelines or conduits, pumping stations, and force mains, and all other constructions, devices, and appliances appurtenant thereto, used for conducting sewage or industrial waste or other wastes to a point of ultimate disposal.\nMS 1990 [Renumbered subd 15]\n\"Standards\" means effluent standards, effluent limitations, standards of performance for new sources, water quality standards, pretreatment standards, and prohibitions.\nMS 1990 [Renumbered subd 14]\n\"Toxic pollutants\" means those pollutants, or combinations of pollutants, including disease-causing agents, which after discharge and upon exposure, ingestion, inhalation or assimilation into any organism, either directly from the environment or indirectly by ingestion through food chains, will, on the basis of information available to the agency, cause death, disease, behavioral abnormalities, cancer, genetic mutations, physiological malfunctions, including malfunctions in reproduction, or physical deformation, in such organisms or their offspring.\nMS 1990 [Renumbered subd 6]\n\"Treatment works\" means any plant, disposal field, lagoon, dam, pumping station, constructed drainage ditch or surface water intercepting ditch, incinerator, area devoted to sanitary land fills, or other works not specifically mentioned herein, installed for the purpose of treating, stabilizing or disposing of sewage, industrial waste, or other wastes.\nMS 1990 [Renumbered subd 3]\n\"Waters of the state\" means all streams, lakes, ponds, marshes, watercourses, waterways, wells, springs, reservoirs, aquifers, irrigation systems, drainage systems and all other bodies or accumulations of water, surface or underground, natural or artificial, public or private, which are contained within, flow through, or border upon the state or any portion thereof.",
	"repealed": false
}