{
	"id": "182.653",
	"url": "https://www.revisor.mn.gov/statutes/cite/182.653",
	"title": "182.653 RIGHTS AND DUTIES OF EMPLOYERS.",
	"text": "Rights and duties of employers include but are not limited to those specified in this section.\nEach employer shall furnish to each of its employees conditions of employment and a place of employment free from recognized hazards that are causing or are likely to cause death or serious injury or harm to its employees.\nEach employer shall comply with occupational safety and health standards or rules promulgated pursuant to this chapter.\nEach employer shall refrain from any unreasonable restraint on the right of the commissioner or an authorized representative of the commissioner to inspect the employer's place of business. Each employer shall assist the commissioner, or an authorized representative of the commissioner, in the performance of inspection duties by supplying or by making available information dealing with injury reports, general safety records, and other records required under this chapter, and any necessary personnel or necessary inspection aids.\nAn employer who is a manufacturer of a hazardous substance or a mixture of substances shall provide an employer who purchases the substance with the information necessary for the purchasing employer to comply with subdivision 4b. A manufacturer of equipment which may generate a harmful physical agent environment approximating that allowed by the standard adopted by the commissioner, shall provide an employer who purchases the equipment with the information necessary for the purchasing employer to comply with subdivision 4c. The information shall be provided at the time of purchase and shall be current, accurate, and complete for each substance, equipment, or mixture.\nFor a mixture of hazardous substances, the manufacturer may provide the information required by this section on the entire product mixture, instead of on each hazardous substance in it, if all of the following conditions are met: hazard test information exists on the mixture itself or adequate information exists to form a valid judgment of the hazardous properties of the mixture itself and the manufacturer indicates that the conclusions drawn are from some source other than direct testing on the mixture; information on the mixture will be as effective in protecting employee health as information on the ingredients; and the hazardous substances in the mixture are identified together, with the information on the mixture.\n(a) Prior to an employee's initial assignment to a workplace where the employee may be routinely exposed to a hazardous substance or harmful physical agent, the employer shall provide training concerning the hazardous substance or harmful physical agent. The employer shall provide additional instruction whenever the employee may be routinely exposed to any additional hazardous substance or harmful physical agent. The term \"routinely exposed\" includes the exposure of an employee to a hazardous substance when assigned to work in an area where a hazardous substance has been spilled.\n(b) For each hazardous substance to which the employee may be routinely exposed, the employer's training program shall include:\n(1) the name or names of the substance including any generic or chemical name, trade name, and commonly used name;\n(2) the level, if any and if known, at which exposure to the substance has been restricted according to standards adopted by the commissioner, or, if no standard has been adopted, according to guidelines established by competent professional groups including but not limited to the American Industrial Hygiene Association, the American Conference of Governmental Industrial Hygienists, the Center for Disease Control, the Bureau of Radiological Health, and the American National Standards Institute;\n(3) the primary routes of entry and the known acute and chronic effects of exposure at hazardous levels;\n(4) the known symptoms of the effects;\n(5) any potential for flammability, explosion, or reactivity of the substance;\n(6) appropriate emergency treatment;\n(7) the known proper conditions for safe use of and exposure to the substance;\n(8) procedures for cleanup of leaks and spills;\n(9) the name, phone number and address of the manufacturer of the hazardous substance; and\n(10) a written copy of all of the above information which shall be readily accessible in the area or areas in which the hazardous substance is used or handled.\n(c) Employees who have been routinely exposed to a hazardous substance prior to the effective date of Laws 1983, chapter 316, and who continue to be routinely exposed to that hazardous substance after the effective date of Laws 1983, chapter 316, shall be trained with respect to that hazardous substance within six months of the effective date of Laws 1983, chapter 316.\n(d) Training to update the information required to be provided under this subdivision shall be repeated at intervals no greater than one year.\n(e) Every employer shall maintain current information for training under this subdivision or for information requests by employees under section 182.654, subdivision 10.\n(f) This subdivision does not apply to any employer engaged in a farming operation.\n(g) This subdivision does not apply to any nonpublic school or any school district before January 1, 1985.\n(h) Any technically qualified individual shall be notified of and may elect to participate in any training or update programs required to be provided under this subdivision to employees who are not technically qualified individuals. The employer shall make a reasonable attempt to allow technically qualified individuals to attend training or update programs which may be held during the employee's scheduled work hours.\n(a) For each harmful physical agent to which an employee may be routinely exposed, the employer's training program shall include the information required by the standard for that physical agent as determined by the commissioner, including but not limited to:\n(1) the name or names of the physical agent including any commonly used synonym;\n(2) the level, if any and if known, at which exposure to the physical agent has been restricted according to standards adopted by the commissioner, or, if no standard has been adopted, according to guidelines established by competent professional groups including but not limited to the American Conference of Governmental Industrial Hygienists, the Center for Disease Control, the Bureau of Radiological Health, and the American National Standards Institute;\n(3) the known acute and chronic effects of exposure at hazardous levels;\n(4) the known symptoms of the effects;\n(5) appropriate emergency treatment;\n(6) the known proper conditions for safe use of and exposure to the physical agent;\n(7) the name, phone number and address, if appropriate, of the manufacturer of the equipment which generates the harmful physical agent; and\n(8) a written copy of all of the above information which shall be readily accessible in the area or areas in which the harmful physical agent is present and where the employee may be exposed to the agent through use, handling or otherwise.\n(b) Employees who have been routinely exposed to a harmful physical agent prior to the effective date of Laws 1983, chapter 316, and who continue to be routinely exposed to that harmful physical agent after the effective date of Laws 1983, chapter 316, shall be trained with respect to that harmful physical agent within six months of the effective date of Laws 1983, chapter 316.\n(c) Training to update the information required to be provided under this subdivision shall be repeated at intervals no greater than one year.\n(d) Every employer shall maintain current information for training under this subdivision or for information requests by employees under section 182.654, subdivision 10.\n(e) This subdivision does not apply to any employer engaged in a farming operation.\n(f) Any technically qualified individual shall be notified of and may elect to participate in any training or update programs required to be provided under this subdivision to employees who are not technically qualified individuals. The employer shall make a reasonable attempt to allow technically qualified individuals to attend training or update programs which may be held during the employee's scheduled work hours.\nEach employer who is in the business of providing a service of collection, processing, or disposal of waste regulated pursuant to the federal Resource Conservation and Recovery Act, Public Law 94-580, shall provide employees who are routinely exposed to this waste a general safety training program approved by the commissioner. This training program shall be appropriate for the seriousness of the safety hazards commonly encountered by the employees and shall include: training concerning the general safety hazards involved in the collection, processing, or disposal of the waste; proper safety procedures to avoid the deleterious effects of these hazards; and common symptoms of the deleterious effects. Training shall be provided to employees within 60 days of the commissioner's approval of the training program, or, if the employee is employed after this 60-day period, prior to the employees' initial assignment where they will be routinely exposed to waste. The employer's safety training program shall be submitted to the commissioner for approval within two months of the effective date of Laws 1983, chapter 316. Refresher courses reviewing the information of the training program shall be given to employees at intervals no greater than one year.\nEach employer who is engaged in a farming operation and employs more than ten employees or who is engaged in a farming operation and maintains a temporary labor camp and employs any of its residents, shall comply with a training program, developed by the commissioner, concerning the hazardous substances and harmful physical agents to which the employees are routinely exposed. The commissioner shall develop this training program in consultation with experts in agricultural work environment hazards. The program shall be designed to fulfill the same purposes as training under subdivisions 4b and 4c, but take into account factors unique to farming operations. These factors shall include but not be limited to the fact that many agricultural employees' primary language is Spanish and the fact that many chemicals used by agricultural employers are labeled under the Federal Insecticide, Fungicide, and Rodenticide Act. The commissioner shall complete implementation of this program by March 1, 1986.\nEach employer shall provide training according to a program developed by the commissioner by rule with approval of the commissioner of health to its employees routinely exposed to an infectious agent. The training shall include the information required by the rule for that agent as developed by the commissioner and shall include, if known, names of infectious agents to which the employee is routinely exposed, proper techniques for the employee to avoid self-contamination, and symptoms and effects of contamination. Training shall be provided upon the initial assignment of the employee to a job where that person will be routinely exposed to an infectious agent. Existing in-service, hospital licensure or certification programs which the commissioner determines substantially comply with the rules adopted pursuant to this subdivision may be certified by the commissioner to satisfy all or a part of the rules.\nInfectious agent does not include an agent being developed or regularly utilized by a technically qualified individual in a research, medical research, medical diagnostic, or medical educational laboratory or in a health care facility or in a clinic associated with a laboratory or health care facility, or in a pharmacy registered and licensed under chapter 151.\nTraining to update the information required to be provided under this subdivision shall be repeated at intervals no greater than one year.\nAny technically qualified individual shall be notified of and may elect to participate in any training or update programs required to be provided under this subdivision to employees who are not technically qualified individuals. The employer shall make a reasonable attempt to allow technically qualified individuals to attend training or update programs which may be held during the employee's scheduled work hours.\nEvery employer shall have the right to request that their employees sign statements that they have received appropriate training under this subdivision, once training has been completed.\nAny employer or association of employers is entitled to participate in the development, revision and revocation of standards by submission of comments on proposed standards, participation in hearings on proposed standards, or by requesting the development of standards on a given issue, under section 182.655.\nAny employer is entitled, under section 182.655, to seek an order granting a variance from an occupational safety and health standard.\nAny employer is entitled, under section 182.668, to protection of trade secrets and other legally privileged communications.\n(a) An employer covered by this section must establish a written work place accident and injury reduction program that promotes safe and healthful working conditions and is based on clearly stated goals and objectives for meeting those goals. The program must describe:\n(1) how managers, supervisors, and employees are responsible for implementing the program and how continued participation of management will be established, measured, and maintained;\n(2) the methods used to identify, analyze, and control new or existing hazards, conditions, and operations;\n(3) how the plan will be communicated to all affected employees so that they are informed of work-related hazards and controls;\n(4) how work place accidents will be investigated and corrective action implemented; and\n(5) how safe work practices and rules will be enforced.\n(b) An employer must conduct and document a review of the work place accident and injury reduction program at least annually and document how procedures set forth in the program are met.\nThe commissioner shall adopt, in accordance with section 182.655, a rule specifying a list of either standard industrial classifications of employers or North American industry classifications of employers who must comply with subdivision 8. The commissioner shall demonstrate the need to include each industrial classification on the basis of the safety record or workers' compensation record of that industry segment. An employer must comply with subdivision 8 six months following the date the standard industrial classification or North American industry classification that applies to the employer is placed on the list. The list shall be updated every five years.\nThe commissioner's rulemaking authority for the purpose of implementing subdivision 8 is limited to specifying the list of standard industrial classifications as provided in subdivision 9.",
	"repealed": false
}