{
	"id": "123A.05",
	"url": "https://www.revisor.mn.gov/statutes/cite/123A.05",
	"title": "123A.05 STATE-APPROVED ALTERNATIVE PROGRAM ORGANIZATION.",
	"text": "(a) A district may establish an area learning center, alternative learning program, or contract alternative in accordance with sections 124D.68, subdivision 3, paragraph (d), and 124D.69.\n(b) An area learning center is encouraged to cooperate with a service cooperative, an intermediate school district, a local education and employment transitions partnership, public and private secondary and postsecondary institutions, public agencies, businesses, and foundations. Except for a district located in a city of the first class, an area learning center must be established in cooperation with other districts and must serve the geographic area of at least two districts. An area learning center must provide comprehensive educational services to enrolled secondary students throughout the year, including a daytime school within a school or separate site for both high school and middle school level students.\n(c) An alternative learning program may serve the students of one or more districts, may designate which grades are served, and may make program hours and a calendar optional.\n(d) A contract alternative is an alternative learning program operated by a private organization that has contracted with a school district to provide educational services for students under section 124D.68, subdivision 2.\nEach district that is a member of an area learning center or alternative learning program must reserve revenue in an amount equal to the sum of (1) at least 90 and no more than 100 percent of the district average general education revenue per adjusted pupil unit minus an amount equal to the product of the formula allowance according to section 126C.10, subdivision 2, times .0466, calculated without basic skills revenue, local optional revenue, and transportation sparsity revenue, times the number of pupil units attending an area learning center or alternative learning program under this section, plus (2) the amount of basic skills revenue generated by pupils attending the area learning center or alternative learning program. The amount of reserved revenue under this subdivision may only be spent on program costs associated with the area learning center or alternative learning program.\nA state-approved alternative program shall have access to the district's regular education programs, special education programs, technology facilities, and staff. It may contract with individuals or postsecondary institutions. It shall seek the involvement of community education programs, postsecondary institutions, interagency collaboratives, culturally based organizations, mutual assistance associations, and other community resources, businesses, and other federal, state, and local public agencies.\nA pupil who does not reside in the district may attend a state-approved alternative program without consent of the school board of the district of residence.",
	"repealed": false
}