{
	"id": "340A.29",
	"url": "https://www.revisor.mn.gov/statutes/cite/340A.29",
	"title": "340A.29 OFF-SALE PACKAGING REQUIREMENTS FOR CERTAIN SMALL BREWERS.",
	"text": "Notwithstanding any law to the contrary, and in addition to the off-sale of malt liquor allowed under section 340A.28, a brewer licensed under section 340A.301, subdivision 6, clause (c), (i), or (j), that produces 7,500 barrels or less of malt liquor annually may be issued a license by a municipality for off-sale at its licensed premises of up to 128 ounces per customer per day of malt liquor that has been produced and packaged by the brewer, as provided in subdivision 2. The license must be approved by the commissioner. The amount of malt liquor sold at off-sale under this section must be included in calculating the annual barrel limit imposed in section 340A.28, subdivision 1.\nMalt liquor authorized for off-sale pursuant to subdivision 1 must be packaged in a container or combination of containers that is in compliance with the provisions of Minnesota Rules, parts 7515.1080 to 7515.1120.\nAny brand sold under this section must be made available for sale to a malt liquor wholesaler, other than a wholesaler owned in whole or in part by a brewer as allowed in section 340A.301, subdivision 9.\nNotwithstanding the 7,500 barrel limit in subdivision 1, a brewer licensed under section 340A.301, subdivision 6, clause (c), (i), or (j), that produced more than 5,500 barrels but not more than 13,500 barrels of malt liquor in calendar year 2021, as demonstrated by records from the Department of Revenue, may be issued a license under this section, provided that a brewer is only allowed to make the sales authorized in this section until the brewer's production exceeds its 2021 production amount by 2,000 barrels.\nThe commissioner may by rule establish reporting requirements for brewers making off-sales of malt liquor under this section to ensure compliance with the 128 ounce limit in subdivision 1.\nAll other requirements of this chapter not inconsistent with this section apply.",
	"repealed": false
}