{
	"id": "25.35",
	"url": "https://www.revisor.mn.gov/statutes/cite/25.35",
	"title": "25.35 LABELING.",
	"text": "(a) A commercial feed, except a customer formula feed, must be accompanied by a label bearing the following information:\n(1) the product name and the brand name, if any, under which the commercial feed is distributed;\n(2) the guaranteed analysis, stated in terms the commissioner requires by rule, to advise the user of the composition of the feed or to support claims made in the labeling. The substances or elements must be determinable by laboratory methods such as the methods published by the AOAC International or other generally recognized methods;\n(3) the common or usual name of each ingredient used in the manufacture of the commercial feed. The commissioner may by rule permit the use of a collective term for a group of ingredients which perform a similar function, or may exempt commercial feeds or any group of commercial feeds from this requirement on finding that an ingredient statement is not required in the interest of consumers;\n(4) the name and principal mailing address of the manufacturer or the person responsible for distributing the commercial feed;\n(5) adequate directions for use for all commercial feeds containing drugs and for such other feeds as the commissioner may require by rule as necessary for their safe and effective use;\n(6) precautionary statements which the commissioner determines by rule are necessary for the safe and effective use of the commercial feed; and\n(7) a quantity statement.\n(b) A customer formula feed must be accompanied by a label, invoice, delivery slip, or other shipping document bearing the following information:\n(1) name and address of the manufacturer;\n(2) name and address of the purchaser;\n(3) date of delivery;\n(4) the product name and either (i) the quantity of each commercial feed and each other ingredient used in the mixture, or (ii) a guaranteed analysis and list of ingredients in paragraph (a), clauses (2) and (3);\n(5) adequate directions for use for all customer formula feeds containing drugs and for other feeds the commissioner requires by rule as necessary for their safe and effective use;\n(6) precautionary statements the commissioner determines by rule are necessary for the safe and effective use of the customer formula feed;\n(7) if a product containing a drug is used:\n(i) the purpose of the medication (claim statement); and\n(ii) the established name of each active drug ingredient and the level of each drug used in the final mixture expressed in a manner required by the commissioner by rule;\n(8) for a customer formula feed for which the formula is developed by someone other than the manufacturer, a disclaimer may be included on the label stating \"THIS FEED IS A CUSTOMER FORMULA FEED DEVELOPED BY SOMEONE OTHER THAN THE MANUFACTURER. THE MANUFACTURER DOES NOT CLAIM, REPRESENT, WARRANT, OR GUARANTEE, AND IS NOT RESPONSIBLE FOR THE NUTRITIONAL ADEQUACY OF THIS FEED OR THE NUTRITIONAL SUITABILITY OF THIS FEED FOR ITS INTENDED PURPOSE.\"; and\n(9) a quantity statement.\n(c) The manufacturer of a customer formula feed the formula of which is developed by someone other than the manufacturer is not responsible or liable for the nutritional adequacy or the nutritional suitability of the feed for its intended purpose if: (1) the manufacturer does not make a claim of nutritional adequacy for the customer formula feed and does not make a claim for nutritional suitability of the feed for its intended purpose; and (2) the manufacturer includes the disclaimer in paragraph (b), clause (8). A person other than the manufacturer who develops or recommends a formula for a customer formula feed is responsible for providing to the manufacturer of the feed the appropriate labeling information and for providing the appropriate use information to the feed manufacturer.",
	"repealed": false
}