{
	"id": "462.15",
	"url": "https://www.revisor.mn.gov/statutes/cite/462.15",
	"title": "462.15 MAP, PLAT, PARCEL LIST MADE, FILED; TAX, ASSESSMENTS.",
	"text": "As soon as such condemnation proceedings have been completed, it shall be the duty of such council to cause maps or plats of such restricted residence district to be made, with a list of the parcels of land within such district, and to file one of such maps and list duly certified by the president of the council and the city clerk, in each of the following offices: the office of the city engineer, the office of the county recorder of the county and the office of the city clerk, and the same shall be prima facie evidence of the full and complete condemnation and establishment of the restricted residence district. As soon as the assessments are confirmed, the city clerk, or the court administrator of the district court, as the case may be, shall transmit a copy thereof duly certified, to the auditor of the county in which the lands lie. The county auditor shall include the same in the next general tax list for the collection of state, county, and city taxes against the several tracts or parcels of land and the assessments shall be collected with and as a part of, and subject to the same penalties, costs, and interest, as, the general taxes. Such assessments shall be set down in the tax books in an appropriate column to be headed \"Restricted Residence District Assessments\" and when collected a separate account thereof shall be kept by the county auditor and the same transmitted to the treasurer of the city and placed to the credit of the proper fund. The city council may by resolution determine that the amount of such assessments shall be collected in from one to five equal annual installments and in such case the county auditor shall include one of the equal annual installments of assessments with and as a part of the taxes upon each parcel of land therein described for each year for the number of years into which the assessment is by the city council divided, together with annual interest as hereinafter provided. With the first installment the auditor shall include interest upon the entire assessment from the date of the assessment to the time when the tax books including the first installment are delivered by the county auditor to the county treasurer and thereafter the auditor shall include in the taxes for each year one of such installments, together with one year's interest upon such installment and all subsequent installments at the same rate, each of which, together with such interest, shall be collected with the annual taxes upon such land, together with like penalties and interest in case of default, all of which shall be collected with and enforced as the annual taxes and credited to the proper city fund. Any parcel assessed may be discharged from the assessment at any time after the receipt of the assessment by the county auditor by paying all installments that have gone into the hands of the county treasurer, as aforesaid, with accrued interest, penalties, and costs, as above provided, and by paying all subsequent installments; or any parcel assessed may be discharged from the assessment by presenting certificates or bonds sold against such assessments as herein provided sufficient in amount to cover all installments due on such parcel and accrued interest, penalties, and costs, and all installments yet to accrue, by surrendering such certificates or bonds to the county treasurer for cancellation or having endorsed thereon such installments, interest, penalties, and costs. The assessment shall be a lien on the land from the time of the making thereof as against the owner and every person in any way interested in the land. The owner of the land and any person interested therein may defend against such assessment at the time of application for judgment in the regular proceedings for the enforcement of delinquent taxes, but such assessment shall not be deemed invalid because of any irregularity provided the notices have been published substantially as required, and no defense shall be allowed except upon the ground that the cost of the improvement is substantially less than the amount of the assessment, and then only to the extent of the difference between the assessment and the actual cost. Assessments made under sections 462.12 to 462.17 shall be called Restricted Residence District Assessments of the city of ................ and numbered consecutively. When an assessment is certified, as aforesaid, by the city clerk to the county auditor a duplicate thereof shall be sent to the city comptroller and all such assessments shall be sufficiently identified by the name and number, as aforesaid.",
	"repealed": false
}