{
	"id": "272.193",
	"url": "https://www.revisor.mn.gov/statutes/cite/272.193",
	"title": "272.193 NUMBERING TRACTS.",
	"text": "All parcels of land included in the code system of any county shall be numbered progressively or by a separate number series beginning with No. 1 in each forty, government lot, or platted tract. The code assigned to a parcel of land shall give the code number assigned to it, the name of the owner, the section, township and range numbers, and if unplatted the number of acres contained in said parcel, and if platted, or if situated within the incorporated limits of a city, the lot or lots and block numbers, the name of the addition or subdivision under which it was platted and the name of the city in which it is situated as well as the book and page of the record in which the instrument conveying title to such parcel of land is recorded in the office of the county recorder. If the owner of a parcel of land, which has theretofore been coded under the county code system, as hereinbefore provided, shall convey a portion of such parcel of land, which is described by metes and bounds, the county auditor shall cancel the original code number and assign a new number and code to the remaining portion. The auditor shall assign a code number or numbers to the portion or portions conveyed in the same manner, as herein provided for assigning an original code number to a parcel. When a code is canceled the county auditor shall write opposite such code number the word \"canceled\" and shall note on the record the new code numbers subsequently assigned to said parcel of land.\nThe code to be used for any parcel of land, as provided herein, shall substantially conform to one of the following illustrations:\n\"Revised Description Number 1, John Doe, a specific part of Section 10, Township 128, Range 46, 31.40 Acres, as described in Book 12 of Deeds, at Page 46, in the office of the county recorder.\"\n\"Revised Description Number 4, Richard Roe, a specific part of Section 12, City of Wheaton, 11.20 Acres, as described in Book 48 of Deeds, at Page 12, in the office of the county recorder.\"\n\"Revised Description Number 6, John Doe, a specific part of Lot 1, Auditor's Plat 14, Township 128, Range 46, as described in Book 84 of Deeds, at Page 2, in the office of the county recorder.\"\n\"Revised Description Number 8, John Doe, a specific part of Lot 6, Block 4, S. C. Odenburg's First Addition to the City of Wheaton, as described in Book 93 of Deeds, at Page 43, in the office of the county recorder.\"\n\"Revised Description No. 1 of the NE 1/4 of NE 1/4, Section 1, Township 55, Range 25, as described in Deed Book 83, Page 10, in the office of the county recorder.\"\n\"Revised Description No. 1 of Government Lot 1, Section 2, Township 55, Range 25, as described in Deed Book 84, Page 27.\"\n\"Revised Description No. 2 of Outlot A of Auditor's Subdivision No. 56, as described in Deed Book 75, Page 32.\"",
	"repealed": false
}