{
	"id": "246.50",
	"url": "https://www.revisor.mn.gov/statutes/cite/246.50",
	"title": "246.50 CARE OF CLIENTS AT STATE FACILITIES; DEFINITIONS.",
	"text": "For the purposes of sections 246.50 to 246.55, the terms set out in this section shall have the meanings ascribed to them.\n\"Commissioner\" means the commissioner of human services of the state of Minnesota.\n\"State facility\" means any state facility owned or operated by the state of Minnesota and under the programmatic direction or fiscal control of the executive board, except the Minnesota Sex Offender Program under chapter 246B. State facility includes regional treatment centers; the state nursing homes; state-operated, community-based programs; and other facilities owned or operated by the state and under the executive board's control.\n[Repealed, 1989 c 282 art 2 s 219]\n\"Client\" means any person receiving services at a state facility, whether or not those services require occupancy of a bed overnight.\n[Repealed, 1989 c 282 art 2 s 219]\n\"Cost of care\" means the usual and customary fee charged by the executive board for services provided to clients. The executive board shall establish the usual and customary fee to appropriately bill services to all payers and shall include the costs related to the operations of any program offered by the state.\n\"Relatives\" means the spouse and parents of a client in that order of liability for cost of care.\n\"Client's county\" means the county of financial responsibility under section 256G.02, except that where a client with no residence in this state is committed while serving a sentence at a correctional facility, \"client's county\" means the county from which the client was sentenced.\n\"Local social services agency\" means the local social services agency of the client's county, the county of commitment, any local social services agency possessing information regarding the financial circumstances of the client or the client's relatives, or any local social services agency requested by the executive board to investigate the financial circumstances of a client or the client's relatives.\n[Repealed, 1989 c 282 art 2 s 219]\n\"State-operated community-based program\" means any program operated in the community including community behavioral health hospitals, crisis centers, residential facilities, outpatient services, and other community-based services developed and operated by the state and under the executive board's control.\n\"Health plan company\" has the meaning given it in section 62Q.01, subdivision 4, and also includes:\n(1) a demonstration provider as defined in section 256B.69, subdivision 2, paragraph (b);\n(2) a county or group of counties participating in county-based purchasing according to section 256B.692; and\n(3) a children's mental health collaborative under contract to provide medical assistance for individuals enrolled in the prepaid medical assistance and MinnesotaCare programs under sections 245.493 to 245.495.",
	"repealed": false
}