{
	"id": "122A.56",
	"url": "https://www.revisor.mn.gov/statutes/cite/122A.56",
	"title": "122A.56 FACULTY EXCHANGE AND TEMPORARY ASSIGNMENT PROGRAM.",
	"text": "A program of faculty collaboration is established to allow Minnesota school districts and postsecondary institutions to arrange temporary placements in each other's institutions. These arrangements must be made on a voluntary cooperative basis between a school district and postsecondary institution, or between postsecondary institutions. Exchanges between postsecondary institutions may occur among campuses in the same system or in different systems.\nEach participating school district and postsecondary institution may determine the way in which the staff member's time is to be used, but it must be in a way that promotes understanding of the needs of each educational system or institution. For example, a public school educator may teach courses, provide counseling and tutorial services, assist with the preparation of future educators, or take professional development courses. A postsecondary teacher might teach courses at the school district, counsel students, or work in school administration. Participation need not be limited to one school or institution and may involve other groups including service cooperatives.\nTemporary placements made under the program must not have a negative effect on participants' salaries, seniority, or other benefits. Notwithstanding sections 123B.02, subdivision 14, and 122A.16, a member of the staff of a postsecondary institution may teach in an elementary or secondary school or perform a service, agreed upon according to this section, for which a license would otherwise be required without holding the applicable license. In addition, a licensed educator employed by a school district may teach or perform a service, agreed upon according to this section, at a postsecondary institution without meeting the applicable qualifications of the postsecondary institution. A district is not subject to section 127A.43 as a result of entering into an agreement according to this section that enables a postsecondary educator to teach or provide services in the district. All arrangements and details regarding the exchange must be mutually agreed to by each participating school district and postsecondary institution before implementation.\nAn educator who held a temporary position or an exchanged position under this section must be continued in or restored to the position previously held, or to a position of like seniority, status, and pay upon return. Retirement benefits under an employer-sponsored pension or retirement plan must not be reduced because of time spent on an exchange or temporary position under this section.\nAn educator who is continued in or restored to a position in accordance with subdivision 4:\n(1) must be continued or restored without loss of seniority; and\n(2) may participate in insurance or other benefits offered by the employer under its established rules and practices.",
	"repealed": false
}