{
	"id": "144.7065",
	"url": "https://www.revisor.mn.gov/statutes/cite/144.7065",
	"title": "144.7065 FACILITY REQUIREMENTS TO REPORT, ANALYZE, AND CORRECT.",
	"text": "Each facility shall report to the commissioner the occurrence of any of the adverse health care events described in subdivisions 2 to 7 as soon as is reasonably and practically possible, but no later than 15 working days after discovery of the event. The report shall be filed in a format specified by the commissioner and shall identify the facility but shall not include any identifying information for any of the health care professionals, facility employees, or patients involved. The commissioner may consult with experts and organizations familiar with patient safety when developing the format for reporting and in further defining events in order to be consistent with industry standards.\nEvents reportable under this subdivision are:\n(1) surgery or other invasive procedure performed on a wrong body part that is not consistent with the documented informed consent for that patient. Reportable events under this clause do not include situations requiring prompt action that occur in the course of surgery or situations whose urgency precludes obtaining informed consent;\n(2) surgery or other invasive procedure performed on the wrong patient;\n(3) the wrong surgical or other invasive procedure performed on a patient that is not consistent with the documented informed consent for that patient. Reportable events under this clause do not include situations requiring prompt action that occur in the course of surgery or situations whose urgency precludes obtaining informed consent;\n(4) retention of a foreign object in a patient after surgery or other invasive procedure, excluding objects intentionally implanted as part of a planned intervention and objects present prior to surgery that are intentionally retained; and\n(5) death during or immediately after surgery or other invasive procedure of a normal, healthy patient who has no organic, physiologic, biochemical, or psychiatric disturbance and for whom the pathologic processes for which the operation is to be performed are localized and do not entail a systemic disturbance.\nEvents reportable under this subdivision are:\n(1) patient death or serious injury associated with the use of contaminated drugs, devices, or biologics provided by the facility when the contamination is the result of generally detectable contaminants in drugs, devices, or biologics regardless of the source of the contamination or the product;\n(2) patient death or serious injury associated with the use or function of a device in patient care in which the device is used or functions other than as intended. \"Device\" includes, but is not limited to, catheters, drains, and other specialized tubes, infusion pumps, and ventilators; and\n(3) patient death or serious injury associated with intravascular air embolism that occurs while being cared for in a facility, excluding deaths associated with neurosurgical procedures known to present a high risk of intravascular air embolism.\nEvents reportable under this subdivision are:\n(1) a patient of any age, who does not have decision-making capacity, discharged to the wrong person;\n(2) patient death or serious injury associated with patient disappearance, excluding events involving adults who have decision-making capacity; and\n(3) patient suicide, attempted suicide resulting in serious injury, or self-harm resulting in serious injury or death while being cared for in a facility due to patient actions after admission to the facility, excluding deaths resulting from self-inflicted injuries that were the reason for admission to the facility.\nEvents reportable under this subdivision are:\n(1) patient death or serious injury associated with a medication error, including, but not limited to, errors involving the wrong drug, the wrong dose, the wrong patient, the wrong time, the wrong rate, the wrong preparation, or the wrong route of administration, excluding reasonable differences in clinical judgment on drug selection and dose;\n(2) patient death or serious injury associated with unsafe administration of blood or blood products;\n(3) maternal death or serious injury associated with labor or delivery in a low-risk pregnancy while being cared for in a facility, including events that occur within 42 days postdelivery and excluding deaths from pulmonary or amniotic fluid embolism, acute fatty liver of pregnancy, or cardiomyopathy;\n(4) death or serious injury of a neonate associated with labor or delivery in a low-risk pregnancy;\n(5) stage 3 or 4 or unstageable ulcers acquired after admission to a facility, excluding progression from stage 2 to stage 3 if stage 2 was recognized upon admission;\n(6) artificial insemination with the wrong donor sperm or wrong egg;\n(7) patient death or serious injury associated with a fall while being cared for in a facility;\n(8) the irretrievable loss of an irreplaceable biological specimen; and\n(9) patient death or serious injury resulting from the failure to follow up or communicate laboratory, pathology, or radiology test results.\nEvents reportable under this subdivision are:\n(1) patient death or serious injury associated with an electric shock while being cared for in a facility, excluding events involving planned treatments such as electric countershock;\n(2) any incident in which a line designated for oxygen or other gas to be delivered to a patient contains the wrong gas or is contaminated by toxic substances;\n(3) patient death or serious injury associated with a burn incurred from any source while being cared for in a facility; and\n(4) patient death or serious injury associated with the use or lack of restraints or bedrails while being cared for in a facility.\nEvents reportable under this subdivision are:\n(1) any instance of care ordered by or provided by someone impersonating a physician, nurse, pharmacist, or other licensed health care provider;\n(2) abduction of a patient of any age;\n(3) sexual assault on a patient within or on the grounds of a facility; and\n(4) death or serious injury of a patient or staff member resulting from a physical assault that occurs within or on the grounds of a facility.\nDeath or serious injury of a patient associated with the introduction of a metallic object into the MRI area are reportable events under this subdivision.\nFollowing the occurrence of an adverse health care event, the facility must conduct a root cause analysis of the event. In conducting the root cause analysis, the facility must consider as one of the factors staffing levels and the impact of staffing levels on the event. Following the analysis, the facility must: (1) implement a corrective action plan to implement the findings of the analysis or (2) report to the commissioner any reasons for not taking corrective action. If the root cause analysis and the implementation of a corrective action plan are complete at the time an event must be reported, the findings of the analysis and the corrective action plan must be included in the report of the event. The findings of the root cause analysis and a copy of the corrective action plan must otherwise be filed with the commissioner within 60 days of the event.\nThe commissioner must design the reporting system so that a facility may file by electronic means the reports required under this section. The commissioner shall encourage a facility to use the electronic filing option when that option is feasible for the facility.\n(a) Adverse health events described in subdivisions 2 to 6 do not constitute \"maltreatment,\" \"neglect,\" or \"a physical injury that is not reasonably explained\" under section 626.557 or chapter 260E and are excluded from the reporting requirements of section 626.557 and chapter 260E, provided the facility makes a determination within 24 hours of the discovery of the event that this section is applicable and the facility files the reports required under this section in a timely fashion.\n(b) A facility that has determined that an event described in subdivisions 2 to 6 has occurred must inform persons who are mandated reporters under section 260E.06 or 626.5572, subdivision 16, of that determination. A mandated reporter otherwise required to report under section 260E.06 or 626.557, subdivision 3, paragraph (e), is relieved of the duty to report an event that the facility determines under paragraph (a) to be reportable under subdivisions 2 to 6.\n(c) The protections and immunities applicable to voluntary reports under section 626.557 and chapter 260E are not affected by this section.\n(d) Notwithstanding section 626.557, chapter 260E, or any other provision of Minnesota statute or rule to the contrary, a lead agency under section 260E.14, subdivision 1, paragraphs (a), (b), and (c), a lead investigative agency under section 626.5572, subdivision 13, the commissioner of health, or the director of the Office of Health Facility Complaints is not required to conduct an investigation of or obtain or create investigative data or reports regarding an event described in subdivisions 2 to 6. If the facility satisfies the requirements described in paragraph (a), the review or investigation shall be conducted and data or reports shall be obtained or created only under sections 144.706 to 144.7069, except as permitted or required under sections 144.50 to 144.564, or as necessary to carry out the state's certification responsibility under the provisions of sections 1864 and 1867 of the Social Security Act. If a licensed health care provider reports an event to the facility required to be reported under subdivisions 2 to 6 in a timely manner, the provider's licensing board is not required to conduct an investigation of or obtain or create investigative data or reports regarding the individual reporting of the events described in subdivisions 2 to 6.\n(e) Data contained in the following records are nonpublic and, to the extent they contain data on individuals, confidential data on individuals, as defined in section 13.02:\n(1) reports provided to the commissioner under sections 147.155, 147A.155, 148.267, 151.301, and 153.255;\n(2) event reports, findings of root cause analyses, and corrective action plans filed by a facility under this section; and\n(3) records created or obtained by the commissioner in reviewing or investigating the reports, findings, and plans described in clause (2).\nFor purposes of the nonpublic data classification contained in this paragraph, the reporting facility shall be deemed the subject of the data.",
	"repealed": false
}