{
	"id": "332.73",
	"url": "https://www.revisor.mn.gov/statutes/cite/332.73",
	"title": "332.73 NOTICE TO CREDITOR OF COERCED DEBT.",
	"text": "(a) Before taking an affirmative action under section 332.74, a debtor must, by certified mail, notify a creditor that the debt or a portion of a debt on which the creditor demands payment is coerced debt and request that the creditor cease all collection activity on the coerced debt. The notification and request must be in writing and include documentation. If not already included in documentation, the notification must include a signed statement that includes:\n(1) an assertion that the debtor is a victim of domestic abuse, economic abuse, or sex or labor trafficking;\n(2) a recitation of the facts supporting the claim that the debt is coerced; and\n(3) if only a portion of the debt is claimed to be coerced debt, an itemization of the portion of the debt that is claimed to be coerced debt.\n(b) The creditor, within 30 days of the date the notification and request is received, must notify the debtor in writing of the creditor's decision to either immediately cease all collection activity or continue to pursue collection. If a creditor ceases collection but subsequently decides to resume collection activity, the creditor must notify the debtor ten days prior to the date the collection activity resumes.\n(c) A debtor must not proceed with an action under section 332.74 until the 30-day period provided under paragraph (a) has expired.\nA creditor may sell or assign a debt for which the creditor has been notified is coerced debt to another party if the creditor selling or assigning the debt includes notification to the buyer or assignee that the debtor has asserted the debt is coerced debt.\nThe fact that a creditor ceases collection activity under this section or section 332.74 does not create an inference or presumption regarding the validity or invalidity of a debt for which a debtor is liable or not liable. The exercise or nonexercise of rights under this section is not a waiver of any other debtor or creditor rights or defenses.",
	"repealed": false
}