{
	"id": "458D.18",
	"url": "https://www.revisor.mn.gov/statutes/cite/458D.18",
	"title": "458D.18 GENERAL POWERS OF BOARD.",
	"text": "The board shall have all powers which may be necessary or convenient to discharge the duties imposed upon it by law. Such powers shall include those herein specified, but the express grant or enumeration of powers shall not be deemed to limit the generality or scope of the grant of power contained in this subdivision.\nThe board may sue or be sued.\nThe board may enter into any contract necessary or proper for the exercise of its powers or the accomplishment of its purposes.\nThe board shall have the power to adopt rules and regulations relating to the board's responsibilities and may provide penalties for the violation thereof of imprisonment for not more than 90 days or the payment of a fine or civil penalty of not more than $1,000, or both, for each violation. Any rule or regulation prescribing a penalty for violation shall be published at least once in a newspaper having general circulation in the district. Such violations may be prosecuted before any court in the district having jurisdiction of misdemeanors, and every such court shall have jurisdiction of such violations. Any peace officer of any municipality in the district may make arrests for such violations committed anywhere in the district in like manner and with like effect as for violations of village ordinances or for statutory misdemeanors. All fines collected in such cases shall be deposited in the treasury of the board, or may be allocated between the board and the municipality in which such prosecution occurs on such basis as the board and the municipality agree.\nThe board may accept gifts, may apply for and accept grants or loans of money or other property from the United States, the state, or any person for any of its purposes, may enter into any agreement required in connection herewith, and may hold, use and dispose of such money or property in accordance with the terms of the gift, grant, loan or agreement relating thereto and, with respect to any loans or grants of funds or real or personal property or other assistance from any state or federal government or any agency or instrumentality thereof, the board and, where appropriate, one or more local government units, may contract to do and perform all acts and things required as a condition or consideration therefor pursuant to state or federal law or regulations, whether or not included among the powers otherwise granted to the board or such local government unit by sections 458D.01 to 458D.24 or any other law or charter.\nThe board may act under the provisions of section 471.59, or any other appropriate law providing for joint or cooperative action between government units whether or not such joint or cooperative action is with one or more governmental units located outside the district in this or any other state.\nThe board may conduct research studies and programs, collect and analyze data, prepare reports, maps, charts, and tables, and conduct all necessary hearings and investigations in connection with the design, construction and operation of the district disposal system; and may advise and assist other government units on system planning matters within the scope of its powers, duties and objectives.\nThe board may employ on such terms as it deems advisable, persons or firms performing engineering, legal or other services of a professional nature; requiring any employee to obtain and file with it an individual bond of fidelity insurance policy; and procure insurance in such amounts as it deems necessary against liability of the board or its officers or both, for personal injury or death and property damage or destruction, with the force and effect stated in chapter 466, and against risks of damage to or destruction of any of its facilities, equipment, or other property as it deems necessary.\nThe board may acquire by purchase, lease, condemnation, gift, or grant, any real or personal property including positive and negative easements and water and air rights, and it may construct, enlarge, improve, replace, repair, maintain, and operate any interceptor, treatment works, or water facilities determined to be necessary or convenient for the collection and disposal of sewage in the district. Any local government unit and the commissioners of highways and natural resources are authorized to convey to or permit the use of any such facilities owned or controlled by it, by the board, subject to the rights of the holders of any bonds issued with respect thereto, with or without compensation, without an election or approval by any other government unit or agency. All powers conferred by this subdivision may be exercised both within or without the district as may be necessary for the exercise by the board of its powers or the accomplishments of its purposes. The board may hold, lease, convey or otherwise dispose of such property for its purposes upon such terms and in such manner as it shall deem advisable. Unless otherwise provided, the right to acquire lands and property rights by condemnation shall be exercised in accordance with sections 117.012 to 117.56, and shall apply to any property or interest therein owned by any local government unit; provided, that no such property devoted to an actual public use at the time, or held to be devoted to such use within a reasonable time, shall be so acquired unless a court of competent jurisdiction shall determine that the use proposed by the board is paramount to such use. Except in case of property in actual public use, the board may take possession of any property for which condemnation proceedings have been commenced at any time after the issuance of a court order appointing commissioners for its condemnation.\nThe board may construct or maintain its systems or facilities in, along, on, under, over, or through public streets, bridges, viaducts, and other public rights-of-way without first obtaining a franchise from any local government unit having jurisdiction over them; but such facilities shall be constructed and maintained in accordance with the ordinances and resolutions of any such government unit relating to construction, installation, and maintenance of similar facilities on such public properties and shall not unnecessarily obstruct the public use of such rights-of-way.\nThe board may sell, lease or otherwise dispose of any real or personal property acquired by it which is no longer required for accomplishment of its purposes. Such property may be sold in the manner provided by section 469.065, insofar as practical. The board may give such notice of sale as it shall deem appropriate. When the board determines that any property or any part of the district disposal system which has been acquired from a local government unit without compensation is no longer required but is required as a local facility by the government unit from which it was acquired, the board may by resolution transfer it to such government unit.\nThe board may contract with the United States or any agency thereof, any state or agency thereof, the Head of the Lakes Council of Governments or any other multistate public entity with jurisdiction over any part of the district, the Arrowhead Regional Development Commission or any other regional public entity in the state with jurisdiction over any part of the district, or any other municipal or public corporation, or governmental subdivision or agency or political subdivision in any state, for the joint use of any facility owned by the board or such entity, for the operation by such entity of any system or facility of the board, or for the performance on the board's behalf of any service, including but not limited to planning, on such terms as may be agreed upon by the contracting parties. Unless designated by the board as a local sanitary sewer facility, any treatment works or interceptor jointly used, or operated on behalf of the board, as provided in this subdivision, shall be deemed to be operated by the board for the purposes of including said facilities in the district disposal system.",
	"repealed": false
}