{
	"id": "549.35",
	"url": "https://www.revisor.mn.gov/statutes/cite/549.35",
	"title": "549.35 REGISTRATION; SURETY BOND.",
	"text": "A person shall not act as a transferee, attempt to acquire structured settlement payment rights through a transfer from a payee who resides in this state, or file a structured settlement transfer proceeding unless the person is registered with the secretary to do business in this state as a structured settlement purchase company.\nA person may apply pursuant to this section with the secretary for a registration to do business in this state as a structured settlement purchase company. An application for an initial or renewed registration must be submitted on a form prescribed by the secretary. An initial or renewed registration is valid for one year from the date it is issued, expires one year after it is issued, and may be renewed annually by the registrant on or before the expiration date.\n(a) Each initial or renewal application must contain a sworn certification by an owner; officer; director or manager of the applicant, if the applicant is not a natural person; or by the applicant if the applicant is a natural person, certifying that:\n(1) the applicant has secured a surety bond payable to the state, has been issued a letter of credit, or has posted a cash bond in the amount of $50,000. The security device must be in a form satisfactory to the secretary and must run to the state for the benefit of any payee claimant to secure the faithful performance of the obligation of the structured settlement purchase company under the law, and the secretary shall have no other duty than to receive the sworn certification of surety bond; and\n(2) the applicant shall comply with sections 549.30 to 549.41 when acting as a structured settlement purchase company and filing structured settlement transfer proceedings.\n(b) A surety bond, letter of credit, or cash bond obtained under this section must be effective concurrently with the registration of the applicant and must remain in effect for not less than three years after the expiration or termination of the registration. The surety bond, letter of credit, or cash bond must be renewed each year as needed to keep it continuously in effect when the registration of the applicant is renewed.\nNo later than ten days after a judgment is obtained against a structured settlement purchase company by a payee, the structured settlement purchase company shall file a notice with the secretary and, if applicable, the surety which issued the surety bond used by the structured settlement purchase company to satisfy the requirements under subdivision 3. The notice must contain:\n(1) a copy of the judgment;\n(2) the name and address of the judgment creditor; and\n(3) the status of the matter, including whether the judgment will be appealed or has been paid or satisfied.\n(a) The liability of the surety which issued a surety bond used by a structured settlement purchase company to satisfy the requirements under subdivision 3 must not be affected by a:\n(1) breach of contract, breach of warranty, failure to pay a premium, or other act or omission of the structured settlement purchase company; or\n(2) insolvency or bankruptcy of the structured settlement purchase company.\n(b) Except as otherwise provided in section 549.36, a transfer order signed by a court of competent jurisdiction pursuant to section 549.40 constitutes a qualified order under United States Code, title 26, section 5891. If a transferee to which the transfer order applies is not registered as a structured settlement purchase company pursuant to this section at the time the transfer order is signed, the transfer order does not constitute a qualified order under United States Code, title 26, section 5891.\n(a) A surety which issued a surety bond used by a structured settlement purchase company to satisfy the requirements under subdivision 3 and the structured settlement purchase company which obtained the surety bond shall not cancel or modify the surety bond during the term for which it is issued unless the surety or the structured settlement purchase company provides written notice to the secretary at least 20 days before the effective date of the cancellation or modification.\n(b) If a surety bond used by a structured settlement purchase company to satisfy the requirements of subdivision 3 is modified so as to make the surety bond not comply with any provision of sections 549.30 to 549.41, or the surety bond is canceled, the registration of the structured settlement purchase company expires on the effective date of the modification or cancellation unless a new surety bond, letter of credit, or cash bond which complies with sections 549.30 to 549.41, is filed with the secretary on or before the effective date of the modification or cancellation.\n(c) A modification or cancellation of a surety bond used by a structured settlement purchase company to satisfy the requirements of subdivision 3 does not affect any liability of the bonded surety company incurred before the modification or cancellation of the surety bond.\n(a) An assignee is not required to register as a structured settlement purchase company to acquire structured settlement payment rights or to take security interest in structured settlement payment rights that were transferred by the payee to a structured settlement purchase company.\n(b) An employee of a structured settlement purchase company, if acting on behalf of the structured settlement purchase company in connection with a transfer, is not required to be registered.\n$700 shall be paid to the secretary of state at the time of making an initial registration application and $200 for a renewal under this section.",
	"repealed": false
}