{
	"id": "192.88",
	"url": "https://www.revisor.mn.gov/statutes/cite/192.88",
	"title": "192.88 NATIONAL GUARD MUTUAL ASSISTANCE COUNTERDRUG ACTIVITIES COMPACT.",
	"text": "The National Guard Mutual Assistance Counterdrug Activities Compact is ratified, enacted into law, and entered into by this state as a party with any other state or province which, pursuant to Article 2 of the compact has legally joined in it in the form substantially as follows:\nThe party states solemnly agree:\nARTICLE 1\nPURPOSE\nThe purposes of this compact are to:\nA. provide for mutual assistance and support among the party states in the utilization of the National Guard in drug interdiction, counterdrug, and demand reduction activities;\nB. permit the National Guard of this state to enter into mutual assistance and support agreements, on the basis of need, with one or more law enforcement agencies operating within this state, for activities within this state, or with a National Guard of one or more other states, whether said activities are within or without this state, in order to facilitate and coordinate efficient, cooperative enforcement efforts directed toward drug interdiction, counterdrug activities, and demand reduction;\nC. permit the National Guard of this state to act as a receiving and a responding state as defined within this compact and to ensure the prompt and effective delivery of National Guard personnel, assets, and services to agencies or areas that are in need of increased support and presence;\nD. permit and encourage a high degree of flexibility in the deployment of National Guard forces in the interest of efficiency;\nE. maximize the effectiveness of the National Guard in those situations which call for its utilization under this compact;\nF. provide protection for the rights of National Guard personnel when performing duty in other states in counterdrug activities; and\nG. ensure uniformity of state laws in the area of National Guard involvement in interstate counterdrug activities by incorporating said uniform laws within the compact.\nARTICLE 2\nENTRY INTO FORCE AND WITHDRAWAL\nA. This compact shall enter into force when enacted into law by any two states. Thereafter, this compact shall become effective as to any other state upon its enactment thereof.\nB. Any party state may withdraw from this compact by enacting a statute repealing the same, but no such withdrawal shall take effect until one year after the governor of the withdrawing state has given notice in writing of such withdrawal to the governors of all other party states.\nARTICLE 3\nMUTUAL ASSISTANCE AND SUPPORT\nA. As used in this article:\n1. \"Drug interdiction and counterdrug activities\" means the use of National Guard personnel, while not in federal service, in any law enforcement support activities that are intended to reduce the supply or use of illegal drugs in the United States. The activities include, but are not limited to:\n(a) providing information obtained during either the normal course of military training or operations or during counterdrug activities to federal, state, and local law enforcement officials that may be relevant to a violation of any federal or state law within the jurisdiction of such officials;\n(b) making available any equipment (including associated supplies or spare parts), base facilities, or research facilities of the National Guard to any federal, state, or local civilian law enforcement official for law enforcement purposes, in accordance with other applicable law or regulation;\n(c) providing available National Guard personnel to train federal, state, or local civilian law enforcement in the operation and maintenance of equipment, including equipment made available above, in accordance with other applicable law;\n(d) providing available National Guard personnel to operate and maintain equipment provided to federal, state, or local law enforcement officials pursuant to activities defined and referred to in this compact;\n(e) operation and maintenance of equipment and facilities of the National Guard or law enforcement agencies used for the purposes of drug interdiction and counterdrug activities;\n(f) providing available National Guard personnel to operate equipment for the detection, monitoring, and communication of the movement of air, land, and sea traffic, to facilitate communications in connection with law enforcement programs, to provide transportation for civilian law enforcement personnel, and to operate bases of operations for civilian law enforcement personnel;\n(g) providing available National Guard personnel, equipment, and support for administrative, interpretive, analytic, or other purposes;\n(h) providing available National Guard personnel and equipment to aid federal, state, and local officials and agencies otherwise involved in the prosecution or incarceration of individuals processed within the criminal justice system who have been arrested for criminal acts involving the use, distribution, or transportation of controlled substances as defined in United States Code, title 21, section 801 et seq. or otherwise by law, in accordance with applicable law.\n2. \"Demand reduction\" means providing available National Guard personnel, equipment, support, and coordination to federal, state, local, and civic organizations, institutions, and agencies for the purposes of the prevention of drug abuse and the reduction in the demand for illegal drugs.\n3. \"Requesting state\" means that state whose governor requested assistance in the area of counterdrug activities.\n4. \"Responding state\" means the state furnishing assistance, or requested to furnish assistance, in the area of counterdrug activities.\n5. \"Law enforcement agency\" means a lawfully established federal, state, or local public agency that is responsible for the prevention and detection of crime and the enforcement of penal, traffic, regulatory, game, immigration, postal, customs, or controlled substances laws.\n6. \"Official\" means the appointed, elected, designated, or otherwise duly selected representative of an agency, institution, or organization authorized to conduct those activities for which support is requested.\n7. \"Mutual assistance and support agreement\" or \"agreement\" means an agreement between the National Guard of this state and one or more law enforcement agencies or between the National Guard of this state and the National Guard of one or more other states, consistent with the purposes of this compact.\n8. \"Party state\" refers to a state that has lawfully enacted this compact.\n9. \"State\" means each of the several states of the United States, the District of Columbia, the Commonwealth of Puerto Rico, or a territory or possession of the United States.\nB. Upon the request of a governor of a party state for assistance in the area of drug interdiction and counterdrug activities and demand reduction, the governor of a responding state shall have authority under this compact to send without the borders of his or her state and place under the temporary operational control of the appropriate National Guard or other military authorities of the requesting state, for the purposes of providing such requested assistance, all or any part of the National Guard forces of his or her state as he or she may deem necessary, and the exercise of his or her discretion in this regard shall be conclusive.\nC. The governor of a party state may, within his or her discretion, withhold the National Guard forces of his or her state from such use and recall any forces or part or member thereof previously deployed in a requesting state.\nD. The National Guard of this state is hereby authorized to engage in counterdrug activities and demand reduction.\nE. The adjutant general of this state, in order to further the purposes of this compact, may enter into a mutual assistance and support agreement with one or more law enforcement agencies of this state, including federal law enforcement agencies operating within this state, or with the National Guard of one or more other party states to provide personnel, assets, and services in the area of counterdrug activities, and demand reduction provided that all parties to the agreement are not specifically prohibited by law to perform said activities.\nF. The agreement must set forth the powers, rights, and obligations of the parties to the agreement, where applicable, as follows:\n1. its duration;\n2. the organization, composition, and nature of any separate legal entity created thereby;\n3. the purpose of the agreement;\n4. the manner of financing the agreement and establishing and maintaining its budget;\n5. the method to be employed in accomplishing the partial or complete termination of the agreement and for disposing of property upon such partial or complete termination;\n6. provision for administering the agreement, which may include creation of a joint board responsible for such administration;\n7. the manner of acquiring, holding, and disposing of real and personal property used in this agreement, if necessary;\n8. the minimum standards for National Guard personnel implementing the provisions of this agreement;\n9. the minimum insurance required of each party to the agreement, if necessary;\n10. the chain of command or delegation of authority to be followed by National Guard personnel acting under the provisions of the agreement;\n11. the duties and authority that the National Guard personnel of each party state may exercise; and\n12. any other necessary and proper matters.\nAgreements prepared under the provisions of this statute are exempt from any general law pertaining to intergovernmental agreements.\nG. As a condition precedent to an agreement becoming effective under this article, the agreement must be submitted to and receive approval of the Office of the Attorney General of Minnesota. The attorney general of Minnesota may delegate his or her approval authority to the appropriate attorney for the Minnesota National Guard subject to those conditions which he or she decides are appropriate. The delegation must be in writing.\n1. The attorney general, or his or her agent in the Minnesota National Guard as stated above, shall approve an agreement submitted to him or her under this article unless he or she finds that it is not in proper form, does not meet the requirements set forth in this article, or otherwise does not conform to the laws of Minnesota. If the attorney general disapproves an agreement, he or she shall provide a written explanation to the adjutant general of the Minnesota National Guard.\n2. If the attorney general, or his or her authorized agent as stated above, does not disapprove an agreement within 30 days after its submission to him or her, it is considered approved by him or her.\nH. Whenever National Guard forces of any party state are engaged in the performance of duties, in the area of drug interdiction and counterdrug activities and demand reduction, pursuant to orders, they shall not be held personally liable for any acts or omissions which occur during the performance of their duty.\nARTICLE 4\nRESPONSIBILITIES\nA. Nothing in this compact shall be construed as a waiver of any benefits, privileges, immunities, or rights otherwise provided for National Guard personnel performing duty pursuant to United States Code, title 32, nor shall anything in this compact be construed as a waiver of coverage provided for under the Federal Tort Claims Act. In the event that National Guard personnel performing counterdrug activities do not receive rights, benefits, privileges, and immunities otherwise provided for National Guard personnel as stated above, the following provisions shall apply:\n1. Whenever National Guard forces of any responding state are engaged in another state in carrying out the purposes of this compact, the members thereof so engaged shall have the same powers, duties, rights, privileges, and immunities as members of National Guard forces of the requesting state. The requesting state shall save and hold members of the National Guard forces of responding states harmless from civil liability, except as otherwise provided herein, for acts or omissions which occurred in the performance of their duty while engaged in carrying out the purposes of this compact, whether responding forces are serving the requesting state within the borders of the responding state or are attached to the requesting state for purposes of operational control.\n2. Subject to the provisions of paragraphs 3, 4, and 5 of this article, all liability that may arise under the laws of the requesting state or the responding states, on account of or in connection with a request for assistance or support, shall be assumed and borne by the requesting state.\n3. Any responding state rendering aid or assistance pursuant to this compact shall be reimbursed by the requesting state for any loss or damage to, or expense incurred in the operation of, any equipment answering a request for aid, and for the cost of the materials, transportation, and maintenance of National Guard personnel and equipment incurred in connection with such request, provided that nothing herein contained shall prevent any responding state from assuming such loss, damage, expense, or other cost.\n4. Unless there is a written agreement to the contrary, each party shall provide, in the same amounts and manner as if they were on duty within their state, for pay and allowances of the personnel of its National Guard units while engaged without the state pursuant to this compact and while going to and returning from such duty pursuant to this compact.\n5. Each party state providing for the payment of compensation and death benefits to injured members and the representatives of deceased members of its National Guard forces in case such members sustain injuries or are killed within their own state shall provide for the payment of compensation and death benefits in the same manner and on the same terms in the event such members sustain injury or are killed while rendering assistance or support pursuant to this compact. Such benefits and compensation shall be deemed items of expense reimbursable pursuant to paragraph 3 of this article.\nB. Officers and enlisted personnel of the National Guard performing duties subject to proper orders pursuant to this compact shall be subject to and governed by the provisions of their home state Code of Military Justice whether they are performing duties within or without their home state. In the event that any National Guard member commits, or is suspected of committing, a criminal offense while performing duties pursuant to this compact without his or her home state, he or she may be returned immediately to his or her home state and said home state shall be responsible for any disciplinary action to be taken. However, nothing in this paragraph shall abrogate the general criminal jurisdiction of the state in which the offense occurred.\nARTICLE 5\nDELEGATION\nNothing in this compact shall be construed to prevent the governor of a party state from delegating any of his or her responsibilities or authority respecting the National Guard, provided that such delegation is otherwise in accordance with law. For purposes of this compact, however, the governor shall not delegate the power to request assistance from another state.\nARTICLE 6\nLIMITATIONS\nNothing in this compact shall:\n1. authorize or permit National Guard units or personnel to be placed under the operational control of any person not having the National Guard rank or status required by law for the command in question; or\n2. deprive a properly convened court of jurisdiction over an offense or a defendant merely because of the fact that the National Guard, while performing duties pursuant to this compact, was utilized in achieving an arrest or indictment.\nARTICLE 7\nCONSTRUCTION AND SEVERABILITY\nThis compact shall be liberally construed so as to effectuate the purposes thereof. The provisions of this compact shall be severable and if any phrase, clause, sentence, or provision of this compact is declared to be contrary to the Constitution of the United States or of any state or the applicability thereof to any government, agency, person, or circumstance is held invalid, the validity of the remainder of this compact and the applicability thereof to any government, agency, person, or circumstance shall not be affected thereby. If this compact shall be held contrary to the constitution of any state participating herein, the compact shall remain in full force and effect as to the remaining party states and in full force and effect as to the state affected as to all severable matters.",
	"repealed": false
}