{
	"id": "469.45",
	"url": "https://www.revisor.mn.gov/statutes/cite/469.45",
	"title": "469.45 CITY TAX AUTHORITY.",
	"text": "(a) Notwithstanding section 477A.016 or any other contrary provision of law, ordinance, or city charter, and in addition to any taxes the city may impose on these transactions under another statute or law, the city of Rochester may, by ordinance, impose at a rate or rates, determined by the city, any of the following taxes:\n(1) a tax on the gross receipts from the furnishing for consideration of lodging and related services as defined in section 297A.61, subdivision 3, paragraph (g), clause (2); the city may choose to impose a differential tax based on the number of rooms in the facility;\n(2) a tax on the gross receipts of food and beverages sold primarily for consumption on the premises by restaurants and places of refreshment that occur in the city of Rochester; the city may elect to impose the tax in a defined district of the city; and\n(3) a tax on the admission receipts to entertainment and recreational facilities, as defined by ordinance, in the city of Rochester.\n(b) The provisions of section 297A.99, subdivisions 4 to 13, govern the administration, collection, and enforcement of any tax imposed by the city under paragraph (a).\n(c) The proceeds of any taxes imposed under this subdivision, less refunds and costs of collection, must be used by the city only to meet its share of obligations for public infrastructure projects contained in the development plan and approved by the corporation, including any associated financing costs or to pay any other costs qualifying as a local matching contribution under section 469.47, subdivision 4. Any tax imposed under paragraph (a) expires at the earlier of December 31, 2049, or when the city council determines that sufficient funds have been raised from the tax plus all other local funding sources authorized in Laws 2013, chapter 143, article 10, to meet the city obligation for financing public infrastructure projects contained in the development plan and approved by the corporation, including any associated financing costs.\nThe city may elect to extend the existing local sales and use tax under Laws 2013, chapter 143, article 10, section 13, or to impose an additional rate of up to one quarter of one percent tax on sales and use under Laws 2013, chapter 143, article 10, section 11. The proceeds of any extended or additional taxes imposed under this subdivision, less refunds and costs of collection, must be used by the city only to meet its share of obligations for public infrastructure projects contained in the development plan and approved by the corporation, including all financing costs. Revenues collected in any year to meet the obligations must be used for payment of obligations or expenses for public infrastructure projects approved by the corporation or of any other costs qualifying as a local matching contribution under section 469.47, subdivision 4.\n(a) If the city or the county elects to use tax abatement under sections 469.1812 to 469.1815 to finance costs of public infrastructure projects, including all financing costs, the special rules under this subdivision apply. Taxes abated for public infrastructure projects must be used only for obligations or other infrastructure projects approved by the corporation.\n(b) The limitations under section 469.1813, subdivision 6, do not apply to the city or the county.\n(c) The limitations under section 469.1813, subdivision 8, do not apply and property taxes abated by the city or the county to finance costs of public infrastructure projects are not included for purposes of applying section 469.1813, subdivision 8, to the use of tax abatement for other purposes of the city or the county; however, the total amount of property taxes abated by the city and the county under this authority must not exceed $87,750,000.\nIf the city elects to establish one or more redevelopment tax increment financing districts within the area of the destination medical center development district to fund public infrastructure projects, the requirements, definitions, limitations, or restrictions in the following statutes do not apply: sections 469.174, subdivisions 10 and 25, clause (2); 469.176, subdivisions 4j, 4l, and 5; and 469.1763, subdivisions 2, 3, and 4. The provisions of this subdivision expire effective for tax increments expended after December 31, 2049. After that date, the provisions of section 469.1763, subdivision 4, apply to any remaining unspent or unobligated increments.",
	"repealed": false
}