{
	"id": "62Q.47",
	"url": "https://www.revisor.mn.gov/statutes/cite/62Q.47",
	"title": "62Q.47 ALCOHOLISM, MENTAL HEALTH, AND CHEMICAL DEPENDENCY SERVICES.",
	"text": "(a) All health plans, as defined in section 62Q.01, that provide coverage for alcoholism, mental health, or chemical dependency services, must comply with the requirements of this section.\n(b) Cost-sharing requirements and benefit or service limitations for outpatient mental health and outpatient chemical dependency and alcoholism services, except for persons seeking chemical dependency services under section 245G.05, must not place a greater financial burden on the insured or enrollee, or be more restrictive than those requirements and limitations for outpatient medical services.\n(c) Cost-sharing requirements and benefit or service limitations for inpatient hospital mental health services, psychiatric residential treatment facility services, and inpatient hospital and residential chemical dependency and alcoholism services, except for persons seeking chemical dependency services under section 245G.05, must not place a greater financial burden on the insured or enrollee, or be more restrictive than those requirements and limitations for inpatient hospital medical services.\n(d) A health plan company must not impose an NQTL with respect to mental health and substance use disorders in any classification of benefits unless, under the terms of the health plan as written and in operation, any processes, strategies, evidentiary standards, or other factors used in applying the NQTL to mental health and substance use disorders in the classification are comparable to, and are applied no more stringently than, the processes, strategies, evidentiary standards, or other factors used in applying the NQTL with respect to medical and surgical benefits in the same classification.\n(e) All health plans must meet the requirements of the federal Mental Health Parity Act of 1996, Public Law 104-204; Paul Wellstone and Pete Domenici Mental Health Parity and Addiction Equity Act of 2008; the Affordable Care Act; and any amendments to, and federal guidance or regulations issued under, those acts.\n(f) The commissioner may require information from health plan companies to confirm that mental health parity is being implemented by the health plan company. Information required may include comparisons between mental health and substance use disorder treatment and other medical conditions, including a comparison of prior authorization requirements, drug formulary design, claim denials, rehabilitation services, and other information the commissioner deems appropriate.\n(g) Regardless of the health care provider's professional license, if the service provided is consistent with the provider's scope of practice and the health plan company's credentialing and contracting provisions, mental health therapy visits and medication maintenance visits shall be considered primary care visits for the purpose of applying any enrollee cost-sharing requirements imposed under the enrollee's health plan.\n(h) All health plan companies offering health plans that provide coverage for alcoholism, mental health, or chemical dependency benefits shall provide reimbursement for the benefits delivered through the psychiatric Collaborative Care Model, which must include the following Current Procedural Terminology or Healthcare Common Procedure Coding System billing codes:\n(1) 99492;\n(2) 99493;\n(3) 99494;\n(4) G2214; and\n(5) G0512.\nThis paragraph does not apply to managed care plans or county-based purchasing plans when the plan provides coverage to public health care program enrollees under chapter 256B or 256L.\n(i) The commissioner of commerce shall update the list of codes in paragraph (h) if any alterations or additions to the billing codes for the psychiatric Collaborative Care Model are made.\n(j) \"Psychiatric Collaborative Care Model\" means the evidence-based, integrated behavioral health service delivery method described at Federal Register, volume 81, page 80230, which includes a formal collaborative arrangement among a primary care team consisting of a primary care provider, a care manager, and a psychiatric consultant, and includes but is not limited to the following elements:\n(1) care directed by the primary care team;\n(2) structured care management;\n(3) regular assessments of clinical status using validated tools; and\n(4) modification of treatment as appropriate.\n(k) By June 1 of each year, beginning June 1, 2021, the commissioner of commerce, in consultation with the commissioner of health, shall submit a report on compliance and oversight to the chairs and ranking minority members of the legislative committees with jurisdiction over health and commerce. The report must:\n(1) describe the commissioner's process for reviewing health plan company compliance with United States Code, title 42, section 18031(j), any federal regulations or guidance relating to compliance and oversight, and compliance with this section and section 62Q.53;\n(2) identify any enforcement actions taken by either commissioner during the preceding 12-month period regarding compliance with parity for mental health and substance use disorders benefits under state and federal law, summarizing the results of any market conduct examinations. The summary must include: (i) the number of formal enforcement actions taken; (ii) the benefit classifications examined in each enforcement action; and (iii) the subject matter of each enforcement action, including quantitative and nonquantitative treatment limitations;\n(3) detail any corrective action taken by either commissioner to ensure health plan company compliance with this section, section 62Q.53, and United States Code, title 42, section 18031(j); and\n(4) describe the information provided by either commissioner to the public about alcoholism, mental health, or chemical dependency parity protections under state and federal law.\nThe report must be written in nontechnical, readily understandable language and must be made available to the public by, among other means as the commissioners find appropriate, posting the report on department websites. Individually identifiable information must be excluded from the report, consistent with state and federal privacy protections.",
	"repealed": false
}