{
	"id": "168.1295",
	"url": "https://www.revisor.mn.gov/statutes/cite/168.1295",
	"title": "168.1295 STATE PARKS AND TRAILS PLATES.",
	"text": "(a) The commissioner shall issue state parks and trails plates to an applicant who:\n(1) is a registered owner of a passenger automobile, recreational vehicle, one-ton pickup truck, or motorcycle;\n(2) pays a fee in the amount specified for special plates under section 168.12, subdivision 5;\n(3) pays the registration tax required under section 168.013;\n(4) pays the fees required under this chapter;\n(5) contributes a minimum of $60 annually to the state parks and trails donation account established in section 85.056; and\n(6) complies with this chapter and rules governing registration of motor vehicles and licensing of drivers.\n(b) The state parks and trails plate application must indicate that the contribution specified under paragraph (a), clause (5), is a minimum contribution to receive the plate and that the applicant may make an additional contribution to the account.\n(c) State parks and trails plates may be personalized according to section 168.12, subdivision 2a.\nAfter consultation with interested groups, the commissioners of natural resources and public safety shall jointly select a suitable symbol for use by the commissioner of public safety to design the state parks and trails plates.\nContributions under this section must not be refunded.\nNotwithstanding section 168.12, subdivision 1, on payment of a transfer fee of $5, plates issued under this section may be transferred to another passenger automobile registered to the person to whom the plates were issued.\nContributions under subdivision 1, paragraph (a), clause (5), must be paid to the commissioner and credited to the state parks and trails donation account established in section 85.056. The other fees collected under this section must be deposited in the driver and vehicle services operating account under section 299A.705.\nThe commissioner shall maintain a record of the number of plates issued under this section.\nSpecial plates issued under this section are not subject to section 168.1293, subdivision 2.",
	"repealed": false
}