{
	"id": "469.314",
	"url": "https://www.revisor.mn.gov/statutes/cite/469.314",
	"title": "469.314 DESIGNATION OF JOB OPPORTUNITY BUILDING ZONES.",
	"text": "(a) The commissioner, in consultation with the commissioner of revenue, shall designate not more than ten job opportunity building zones and not more than one create automotive recovery zone. In making the designations, the commissioner shall consider need and likelihood of success to yield the most economic development and revitalization of economically distressed rural areas of Minnesota.\n(b) In addition to the designations under paragraph (a), the commissioner may, in consultation with the commissioners of agriculture and revenue, designate up to five agricultural processing facility zones.\n(c) The commissioner may, upon designation of a zone, modify the development plan, including the boundaries of the zone or subzones, if in the commissioner's opinion a modified plan would better meet the objectives of the job opportunity building zone program. The commissioner shall notify the applicant of the modification and provide a statement of the reasons for the modifications.\n(a) In evaluating applications to determine the need for designation of a job opportunity building zone, the commissioner shall consider the following factors as indicators of need:\n(1) the percentage of the population that is below 200 percent of the poverty rate, compared with the state as a whole;\n(2) the extent to which the area's average weekly wage is significantly lower than the state average weekly wage;\n(3) the amount of property in or near the proposed zone that is deteriorated or underutilized;\n(4) the extent to which the median sale price of housing units in the area is below the state median;\n(5) the extent to which the median household income of the area is lower than the state median household income;\n(6) the extent to which the area experienced a population loss during the 20-year period ending the year before the application is made;\n(7) the extent to which an area has experienced sudden or severe job loss as a result of closing of businesses or other employers;\n(8) the extent to which property in the area would remain underdeveloped or nonperforming due to physical characteristics;\n(9) the extent to which the area has substantial real property with adequate infrastructure and energy to support new or expanded development; and\n(10) the extent to which the business startup or expansion rates are significantly lower than the respective rate for the state.\n(b) In applying the need indicators, the best available data should be used. If reported data are not available for the proposed zone, data for the smallest area that is available and includes the area of the proposed zone may be used. The commissioner may require applicants to provide data to demonstrate how the area meets one or more of the indicators of need.\nIn determining the likelihood of success of a proposed zone, the commissioner shall consider:\n(1) the strength and viability of the proposed development goals, objectives, and strategies in the development plan;\n(2) whether the development plan is creative and innovative in comparison to other applications;\n(3) local public and private commitment to development of the proposed zone and the potential cooperation of surrounding communities;\n(4) existing resources available to the proposed zone;\n(5) how the designation of the zone would relate to other economic and community development projects and to regional initiatives or programs;\n(6) how the regulatory burden will be eased for businesses operating in the proposed zone;\n(7) proposals to establish and link job creation and job training; and\n(8) the extent to which the development is directed at encouraging and that designation of the zone is likely to result in the creation of high-paying jobs.\n(a) The schedule in paragraphs (b) to (f) applies to the designation of job opportunity building zones. Paragraph (g) applies to the designation of a create automotive recovery zone.\n(b) The commissioner shall publish the form for applications and any procedural, form, or content requirements for applications by no later than August 1, 2003. The commissioner may publish these requirements on the Internet, in the State Register, or by any other means the commissioner determines appropriate to disseminate the information to potential applicants for designation.\n(c) Applications must be submitted by October 15, 2003.\n(d) The commissioner shall designate the zones by no later than December 31, 2003.\n(e) The designation of the zones takes effect January 1, 2004.\n(f) The commissioner may reserve one or more of the ten authorized zones for a second round of designations in calendar year 2004. If the commissioner chooses to reserve designations for this purpose, the commissioner shall establish the schedule for the second round of designations, notwithstanding the dates in paragraphs (c), (d), and (e). The commissioner shall allow a period of at least 90 days for submission of applications after notification of the second round. A zone designated in the second round takes effect on January 1, 2005.\n(g) The commissioner may accept applications for a create automotive recovery zone at any time before January 1, 2016. The commissioner may designate a create automotive recovery zone at any time after December 31, 2011, and before January 1, 2016, but only if the applicant has entered a written agreement with a qualified business committing to make a capital investment of at least $100,000,000 to improve or retrofit a motor vehicle assembly facility located in the zone.\nThe commissioner shall have as a goal the geographic distribution of zones around the state.\nThe commissioner's actions in establishing procedures, requirements, and making determinations to administer sections 469.310 to 469.320 are not a rule for purposes of chapter 14 and are not subject to the Administrative Procedure Act contained in chapter 14 and are not subject to section 14.386.",
	"repealed": false
}