{
	"id": "86B.313",
	"url": "https://www.revisor.mn.gov/statutes/cite/86B.313",
	"title": "86B.313 PERSONAL WATERCRAFT; REGULATIONS.",
	"text": "(a) In addition to requirements of other laws relating to watercraft, a person may not operate or permit the operation of a personal watercraft:\n(1) without each person on board the personal watercraft wearing a wearable personal flotation device that is approved by the United States Coast Guard (USCG) and has a USCG label indicating the flotation device either is approved for or does not prohibit use with personal watercraft;\n(2) between one hour before sunset and 9:30 a.m.;\n(3) at greater than slow-no wake speed within 150 feet of:\n(i) a shoreline;\n(ii) a dock;\n(iii) a swimmer;\n(iv) a raft used for swimming or diving; or\n(v) a moored, anchored, or nonmotorized watercraft;\n(4) while towing a person on water skis, a kneeboard, an inflatable craft, or any other device unless:\n(i) an observer is on board; or\n(ii) the personal watercraft is equipped with factory-installed or factory-specified accessory mirrors that give the operator a wide field of vision to the rear;\n(5) without the lanyard-type engine cutoff switch being attached to the person, clothing, or personal flotation device of the operator, if the personal watercraft is equipped by the manufacturer with such a device;\n(6) if any part of the spring-loaded throttle mechanism has been removed, altered, or tampered with so as to interfere with the return-to-idle system;\n(7) to chase or harass wildlife;\n(8) through emergent or floating vegetation at other than a slow-no wake speed;\n(9) in a manner that unreasonably or unnecessarily endangers life, limb, or property, including weaving through congested watercraft traffic, jumping the wake of another watercraft within 150 feet of the other watercraft, or operating the watercraft while facing backward;\n(10) in any other manner that is not reasonable and prudent; or\n(11) without a personal watercraft rules decal, issued by the commissioner, attached to the personal watercraft so as to be in full view of the operator.\n(b) Paragraph (a), clause (3), does not apply to a person operating a personal watercraft to launch or land a person on water skis, a kneeboard, or similar device by the most direct route to open water.\nExcept in the case of an emergency, a person under the age of 13 years may not operate or be permitted to operate a personal watercraft, regardless of horsepower. It is unlawful for the owner of a personal watercraft to permit the personal watercraft to be operated contrary to this subdivision.\n[See Note.]\nExcept in the case of an emergency, a person 13 years of age or over but less than 18 years of age may not operate a personal watercraft, regardless of horsepower, without possessing a valid watercraft operator's permit as required by section 86B.305, unless there is a person 21 years of age or older on board the craft. In addition to the permit requirement, a person 13 years of age operating a personal watercraft must remain under visual supervision by a person who is 21 years of age or older. An owner of a personal watercraft may not permit the personal watercraft to be operated contrary to this subdivision.\n[See Note.]\n(a) A dealer of personal watercraft shall distribute a summary of the laws and rules governing the operation of personal watercraft and, upon request, shall provide instruction to a purchaser regarding:\n(1) the laws and rules governing personal watercraft; and\n(2) the safe operation of personal watercraft.\n(b) Each dealer of personal watercraft shall have the person who purchases a personal watercraft sign a form provided by the commissioner acknowledging that the purchaser has been provided a copy of the laws and rules regarding personal watercraft operation and has read them. The form must be retained by the dealer for six months following the date of signature and must be made available for inspection by sheriff's deputies or conservation officers during normal business hours.\n[See Note.]",
	"repealed": false
}