{
	"id": "72A.491",
	"url": "https://www.revisor.mn.gov/statutes/cite/72A.491",
	"title": "72A.491 DEFINITIONS.",
	"text": "For the purposes of sections 72A.49 to 72A.505, the following terms have the meanings given them.\n\"Adverse underwriting decision\" means any of the following actions with respect to insurance transactions involving insurance coverage that is individually underwritten:\n(1) denial, in whole or in part, of coverage that was requested in writing to the insurer;\n(2) termination or reduction of insurance coverage or policy;\n(3) failure of an insurance agent to apply for coverage with a specific insurer that the agent represents and that is specifically requested by an applicant;\n(4) placement by an insurer or insurance agent of a risk with a residual market mechanism, an unauthorized insurer, or an insurer that specializes in substandard risks;\n(5) charging a higher rate on the basis of information that differs from that which the applicant or policyholder furnished for property or casualty coverage;\n(6) an offer to insure at higher than standard rates for life, health, or disability coverage; or\n(7) the rescission of a policy.\n\"Affiliate\" or \"affiliated\" means a person who directly, or indirectly through one or more intermediaries, controls, is controlled by, or is under common control with another person.\n\"Applicant\" means any person who seeks to contract for insurance coverage from an insurer.\n\"Consumer report\" means any written, oral, or other communication of information bearing on a person's credit worthiness, credit standing, credit capacity, character, general reputation, personal characteristics, or mode of living that is used or expected to be used in connection with an insurance transaction.\n\"Consumer reporting agency\" means any person who:\n(1) regularly engages, in whole or in part, in the practice of assembling or preparing consumer reports for a monetary fee;\n(2) obtains information primarily from sources other than insurers; and\n(3) furnishes consumer reports to other persons.\n\"Control,\" \"controlled by,\" or \"under common control with\" means the possession, direct or indirect, of the power to direct or cause the direction of the management and policies of a person, whether through the ownership of voting securities, by contract other than a commercial contract for goods or nonmanagement services, or otherwise, unless the power is the result of an official position with or corporate office held by the person.\n\"Health care institution\" means any facility or institution that is licensed to provide health care services to natural persons.\n\"Health professional\" means any person licensed or certified to provide health care services to natural persons.\n\"Health record information\" means personal information that:\n(1) relates to an individual's physical or mental condition, health history, or health treatment; and\n(2) is obtained from a health professional or health care institution, from the individual, or from the individual's spouse, parent, legal guardian, or other person.\n\"Individual\" means any natural person who:\n(1) in the case of property or casualty insurance is a past, present, or proposed named insured or certificate holder;\n(2) in the case of life, health, or disability insurance is a past, present, or proposed principal insured or certificate holder;\n(3) is a past, present, or proposed policy owner;\n(4) is a past or present applicant;\n(5) is a past or present claimant; or\n(6) derived, derives, or is proposed to derive insurance coverage under an insurance policy or certificate subject to sections 72A.49 to 72A.505.\n(a) \"Insurance-support organization\" means any person who regularly engages, in whole or in part, in the practice of assembling or collecting information about persons for the primary purpose of providing the information to an insurer or insurance agent for insurance transactions, including:\n(1) the furnishing of consumer reports or investigative consumer reports to an insurer or insurance agent for use in connection with an insurance transaction; and\n(2) the collection of personal information from insurers, insurance agents, or other insurance-support organizations to detect or prevent fraud, material misrepresentation, or material nondisclosure in connection with insurance underwriting or insurance claim activity.\n(b) Insurance-support organizations do not include insurance agents, government institutions, insurers, health care institutions, or health professionals.\n\"Insurance transaction\" means any transaction that involves:\n(1) the determination of an individual's eligibility for an insurance coverage, benefit, or payment; or\n(2) the servicing of an insurance application, policy, contract, or certificate.\n\"Insurer\" means any insurance company, risk retention group as defined under section 60E.02, service plan corporation as defined under section 62C.02, health maintenance organization as defined under section 62D.02, fraternal benefit society regulated under chapter 64B, township mutual company regulated under chapter 67A, joint self-insurance plan or multiple employer trust regulated under chapter 60F, 62H, or section 471.617, subdivision 2, and persons administering a self-insurance plan as defined under section 60A.23, subdivision 8, paragraph (2), clauses (a) and (d).\n\"Insurer that specializes in substandard risks\" means an insurer whose rates and market orientation are directed at risks other than preferred or standard risks.\n\"Investigative consumer report\" means all or part of a consumer report in which information about a person's character, general reputation, personal characteristics, or mode of living is obtained through personal interviews with the person's neighbors, friends, associates, acquaintances, or others who may have knowledge concerning these items of information.\n\"Personal information\" means any individually identifiable information gathered in connection with an insurance transaction from which judgments can be made about an individual's character, habits, avocations, finances, occupation, general reputation, credit, health, or any other personal characteristics. The term includes the individual's name and address and health record information, but does not include privileged information. Personal information does not include health record information maintained by a health maintenance organization as defined under section 62D.02, subdivision 4, in its capacity as a health provider.\n\"Policyholder\" means any individual who is a present named insured, a present policy owner, or a present group certificate holder.\n(a) \"Privileged information\" means any individually identifiable information that:\n(1) relates to a claim for insurance benefits or a civil or criminal proceeding; or\n(2) is collected in connection with or in reasonable anticipation of a claim for insurance benefits or civil or criminal proceeding.\n(b) Information otherwise meeting the definition of privileged information under paragraph (a) must be considered personal information if it is disclosed in violation of section 72A.502.\n\"Residual market mechanism\" means an association, organization, or other entity created under the laws of this state to provide insurance coverage to any person who is unable to obtain coverage through ordinary methods in the normal insurance markets.\n\"Signed\" means a written signature or an electronic signature as defined in section 325L.02, paragraph (h).\n\"Termination of insurance coverage\" or \"termination of an insurance policy\" means either a cancellation or nonrenewal of an insurance policy, in whole or in part, for any reason other than the failure to pay a premium as required by the policy.\n\"Unauthorized insurer\" means an insurance company that has not been granted a certificate of authority by the commissioner to transact the business of insurance in this state.",
	"repealed": false
}