{
	"id": "62A.44",
	"url": "https://www.revisor.mn.gov/statutes/cite/62A.44",
	"title": "62A.44 APPLICATIONS.",
	"text": "No individual Medicare supplement plan shall be issued or delivered in this state unless a signed and completed copy of the application for insurance is left with the applicant at the time application is made.\n(a) Application forms shall include the following questions designed to elicit information as to whether, as of the date of the application, the applicant has another Medicare supplement or other health insurance policy or certificate in force or whether a Medicare supplement policy or certificate is intended to replace any other accident and sickness policy or certificate presently in force. A supplementary application or other form to be signed by the applicant and agent containing the questions and statements may be used.\n\"(1) You do not need more than one Medicare supplement policy or certificate.\n(2) If you purchase this policy, you may want to evaluate your existing health coverage and decide if you need multiple coverages.\n(3) You may be eligible for benefits under Medicaid and may not need a Medicare supplement policy or certificate.\n(4) The benefits and premiums under your Medicare supplement policy or certificate can be suspended, if requested, during your entitlement to benefits under Medicaid for 24 months. You must request this suspension within 90 days of becoming eligible for Medicaid. If you are no longer entitled to Medicaid, your policy or certificate will be reinstated if requested within 90 days of losing Medicaid eligibility.\n(5) Counseling services may be available in Minnesota to provide advice concerning medical assistance through state Medicaid, Qualified Medicare Beneficiaries (QMBs), and Specified Low-Income Medicare Beneficiaries (SLMBs).\nTo the best of your knowledge:\n(1) Do you have another Medicare supplement policy or certificate in force?\n(a) If so, with which company?\n(b) If so, do you intend to replace your current Medicare supplement policy with this policy or certificate?\n(2) Do you have any other health insurance policies that provide benefits which this Medicare supplement policy or certificate would duplicate?\n(a) If so, please name the company.\n(b) What kind of policy?\n(3) Are you covered for medical assistance through the state Medicaid program? If so, which of the following programs provides coverage for you?\n(a) Specified Low-Income Medicare Beneficiary (SLMB),\n(b) Qualified Medicare Beneficiary (QMB), or\n(c) full Medicaid Beneficiary?\"\n(b) Agents shall list any other health insurance policies they have sold to the applicant.\n(1) List policies sold that are still in force.\n(2) List policies sold in the past five years that are no longer in force.\n(c) In the case of a direct response issuer, a copy of the application or supplemental form, signed by the applicant, and acknowledged by the insurer, shall be returned to the applicant by the insurer on delivery of the policy or certificate.\n(d) Upon determining that a sale will involve replacement of Medicare supplement coverage, any issuer, other than a direct response issuer, or its agent, shall furnish the applicant, before issuance or delivery of the Medicare supplement policy or certificate, a notice regarding replacement of Medicare supplement coverage. One copy of the notice signed by the applicant and the agent, except where the coverage is sold without an agent, shall be provided to the applicant and an additional signed copy shall be retained by the issuer. A direct response issuer shall deliver to the applicant at the time of the issuance of the policy or certificate the notice regarding replacement of Medicare supplement coverage.\n(e) The notice required by paragraph (d) for an issuer shall be provided in substantially the following form in no less than 12-point type:\n\"NOTICE TO APPLICANT REGARDING REPLACEMENT\nOF MEDICARE SUPPLEMENT INSURANCE\n(Insurance company's name and address)\nSAVE THIS NOTICE! IT MAY BE IMPORTANT TO YOU IN THE FUTURE.\nAccording to (your application) (information you have furnished), you intend to terminate existing Medicare supplement insurance and replace it with a policy or certificate to be issued by (Company Name) Insurance Company. Your new policy or certificate will provide 30 days within which you may decide without cost whether you desire to keep the policy or certificate.\nYou should review this new coverage carefully. Compare it with all accident and sickness coverage you now have. If, after due consideration, you find that purchase of this Medicare supplement coverage is a wise decision you should terminate your present Medicare supplement policy. You should evaluate the need for other accident and sickness coverage you have that may duplicate this policy.\nSTATEMENT TO APPLICANT BY ISSUER, AGENT, (BROKER OR OTHER REPRESENTATIVE): I have reviewed your current medical or health insurance coverage. To the best of my knowledge this Medicare supplement policy will not duplicate your existing Medicare supplement policy because you intend to terminate the existing Medicare supplement policy. The replacement policy or certificate is being purchased for the following reason(s) (check one):\nDo not cancel your present policy or certificate until you have received your new policy or certificate and you are sure that you want to keep it.\n*Signature not required for direct response sales.\"\n[See Note.]\n(a) For any Medicare supplement plan as defined in section 62A.3099, any requirement that a signature of an insured be obtained by an agent or insurer is satisfied if:\n(1) the consent is obtained by telephonic or electronic enrollment by the group policyholder or insured. A verification of the enrollment information must be provided to the applicant;\n(2) the telephonic or electronic enrollment provides necessary and reasonable safeguards to ensure the accuracy, retention, and prompt retrieval of records; and\n(3) the telephonic or electronic enrollment provides necessary and reasonable safeguards to ensure that the confidentiality of individual information and privileged information as defined in section 72A.491, subdivision 19, is maintained.\n(b) The insurer shall make available, upon request of the commissioner, records that will demonstrate the insurer's ability to confirm enrollment and coverage.",
	"repealed": false
}