{
	"id": "256B.042",
	"url": "https://www.revisor.mn.gov/statutes/cite/256B.042",
	"title": "256B.042 THIRD-PARTY LIABILITY.",
	"text": "When the state agency provides, pays for, or becomes liable for medical care, it shall have a lien for the cost of the care upon any and all causes of action or recovery rights under any policy, plan, or contract providing benefits for health care or injury, which accrue to the person to whom the care was furnished, or to the person's legal representatives, as a result of the illness or injuries which necessitated the medical care. For purposes of this section, \"state agency\" includes prepaid health plans under contract with the commissioner according to sections 256B.69 and 256L.12 and Minnesota Statutes 2009 Supplement, section 256D.03, subdivision 4, paragraph (c); children's mental health collaboratives under section 245.493; demonstration projects for persons with disabilities under section 256B.77; nursing facilities under the alternative payment demonstration project under section 256B.434; and county-based purchasing entities under section 256B.692.\n(a) The state agency may perfect and enforce its lien by following the procedures set forth in sections 514.69, 514.70 and 514.71, and its verified lien statement shall be filed with the appropriate court administrator in the county of financial responsibility. The verified lien statement shall contain the following: the name and address of the person to whom medical care was furnished, the date of injury, the name and address of the vendor or vendors furnishing medical care, the dates of the service, the amount claimed to be due for the care, and, to the best of the state agency's knowledge, the names and addresses of all persons, firms, or corporations claimed to be liable for damages arising from the injuries. This section shall not affect the priority of any attorney's lien.\n(b) The state agency is not subject to any limitations period referred to in section 514.69 or 514.71 and has one year from the date notice is first received by it under subdivision 4, paragraph (c), even if the notice is untimely, or one year from the date medical bills are first paid by the state agency, whichever is later, to file its verified lien statement. The state agency may commence an action to enforce the lien within one year of (1) the date the notice required by subdivision 4, paragraph (c), is received or (2) the date the recipient's cause of action is concluded by judgment, award, settlement, or otherwise, whichever is later.\n(c) If the notice required in subdivision 4 is not provided by any of the parties to the claim at any stage of the claim, the state agency will have one year from the date the state agency learns of the lack of notice to commence an action. If amounts on the claim or cause of action are paid and the amount required to be paid to the state agency under subdivision 5, is not paid to the state agency, the state agency may commence an action to recover on the lien against any or all of the parties or entities which have either paid or received the payments.\nThe attorney general shall represent the commissioner to enforce the lien created under this section or, if no action has been brought, may initiate and prosecute an independent action on behalf of the commissioner against a person, firm, or corporation that may be liable to the person to whom the care was furnished.\nAny prepaid health plan providing services under sections 256B.69 and 256L.12 and Minnesota Statutes 2009 Supplement, section 256D.03, subdivision 4, paragraph (c); children's mental health collaboratives under section 245.493; demonstration projects for persons with disabilities under section 256B.77; nursing homes under the alternative payment demonstration project under section 256B.434; or the county-based purchasing entity providing services under section 256B.692 may retain legal representation to enforce their lien created under this section or, if no action has been brought, may initiate and prosecute an independent action on their behalf against a person, firm, or corporation that may be liable to the person to whom the care or payment was furnished.\nThe state agency must be given notice of monetary claims against a person, firm, or corporation that may be liable to pay part or all of the cost of medical care when the state agency has paid or become liable for the cost of that care. Notice must be given as follows:\n(a) Applicants for medical assistance shall notify the state or local agency of any possible claims when they submit the application. Recipients of medical assistance shall notify the state or local agency of any possible claims when those claims arise.\n(b) A person providing medical care services to a recipient of medical assistance shall notify the state agency when the person has reason to believe that a third party may be liable for payment of the cost of medical care.\n(c) A party to a claim upon which the state agency may be entitled to a lien under this section shall notify the state agency of its potential lien claim at each of the following stages of a claim:\n(1) when a claim is filed;\n(2) when an action is commenced; and\n(3) when a claim is concluded by payment, award, judgment, settlement, or otherwise.\nEvery party involved in any stage of a claim under this subdivision is required to provide notice to the state agency at that stage of the claim. However, when one of the parties to the claim provides notice at that stage, every other party to the claim is deemed to have provided the required notice at that stage of the claim. If the required notice under this paragraph is not provided to the state agency, all parties to the claim are deemed to have failed to provide the required notice. A party to a claim includes the injured person or the person's legal representative, the plaintiff, the defendants, or persons alleged to be responsible for compensating the injured person or plaintiff, and any other party to the cause of action or claim, regardless of whether the party knows the state agency has a potential or actual lien claim.\nNotice given to the local agency is not sufficient to meet the requirements of paragraphs (b) and (c).\nUpon any judgment, award, or settlement of a cause of action, or any part of it, upon which the state agency has filed its lien, including compensation for liquidated, unliquidated, or other damages, reasonable costs of collection, including attorney fees, must be deducted first. The full amount of medical assistance paid to or on behalf of the person as a result of the injury must be deducted next, and paid to the state agency. The rest must be paid to the medical assistance recipient or other plaintiff. The plaintiff, however, must receive at least one-third of the net recovery after attorney fees and other collection costs.",
	"repealed": false
}