{
	"id": "125A.62",
	"url": "https://www.revisor.mn.gov/statutes/cite/125A.62",
	"title": "125A.62 DUTIES OF THE BOARD OF THE MINNESOTA STATE ACADEMIES.",
	"text": "The board of the Minnesota State Academies shall govern the State Academy for the Deaf and the State Academy for the Blind. The board must promote academic standards based on high expectation and an assessment system to measure academic performance toward the achievement of those standards. The board must focus on the academies' needs as a whole and not prefer one school over the other. The board of the Minnesota State Academies shall consist of nine persons. The members of the board shall be appointed by the governor with the advice and consent of the senate. One member must be from the seven-county metropolitan area, one member must be from greater Minnesota, and one member may be appointed at-large. The board must be composed of:\n(1) one present or former superintendent of an independent school district;\n(2) one present or former special education director;\n(3) the commissioner of education or the commissioner's designee;\n(4) one member of the blind community;\n(5) one member of the deaf community;\n(6) two members of the general public with business, administrative, or financial expertise;\n(7) one nonvoting, unpaid ex officio member appointed by the site council for the State Academy for the Deaf; and\n(8) one nonvoting, unpaid ex officio member appointed by the site council for the State Academy for the Blind.\nThe membership terms, compensation, removal of members, and filling of vacancies shall be as provided for in section 15.0575. Notwithstanding section 15.0575, a member may serve not more than two consecutive four-year terms.\nAll meetings of the board shall be as provided in chapter 13D and must be held in Faribault.\nThe board must do what is necessary to provide the most beneficial and least restrictive program of education for each pupil at the academies who is disabled by visual disability or deafness.\nTo the extent required in school districts, the board must establish a process for the academies to include parent and community input in the planning, evaluation, and reporting of curriculum and pupil achievement.\nThe board must establish, and appoint members to, a site council at each academy. The site councils shall exercise power and authority granted by the board. The board must appoint to each site council the exclusive representative's employee designee from each exclusive representative at the academies. The site councils may make a recommendation to the governor regarding board appointments no more than 30 days after receiving the list of applicants from the governor.\nThe board is the trustee of the academies' property. Securities and money, including income from the property, must be deposited in the state treasury according to section 16A.275. The deposits are subject to the order of the board.\nThe board, through the chief administrators of the academies, may apply for all competitive grants administered by agencies of the state and other government or nongovernment sources. Application may not be made for grants over which the board has discretion. Any funds received under this subdivision are appropriated and dedicated for the purpose for which they are granted. The board must annually by February 1 report to the education policy and finance committees of the legislature the amount of money it received under this subdivision and the purpose for which it was granted.",
	"repealed": false
}