{
	"id": "629.75",
	"url": "https://www.revisor.mn.gov/statutes/cite/629.75",
	"title": "629.75 DOMESTIC ABUSE NO CONTACT ORDER.",
	"text": "(a) A domestic abuse no contact order is an order issued by a court against a defendant in a criminal proceeding or a juvenile offender in a delinquency proceeding for:\n(1) domestic abuse as defined in section 518B.01, subdivision 2;\n(2) harassment or stalking under section 609.749 when committed against a family or household member as defined in section 518B.01, subdivision 2;\n(3) violation of an order for protection under section 518B.01, subdivision 14; or\n(4) violation of a prior domestic abuse no contact order under this section or Minnesota Statutes 2008, section 518B.01, subdivision 22.\n(b) A domestic abuse no contact order may be issued as a pretrial order before final disposition of the underlying criminal case or as a postconviction probationary order. A domestic abuse no contact order is independent of any condition of pretrial release or probation imposed on the defendant. A domestic abuse no contact order may be issued in addition to a similar restriction imposed as a condition of pretrial release or probation. In the context of a postconviction probationary order, a domestic abuse no contact order may be issued for an offense listed in paragraph (a) or for a conviction for any offense arising out of the same set of circumstances as an offense listed in paragraph (a).\n(c) A no contact order under this section shall be issued in a proceeding that is separate from but held immediately following a proceeding in which any pretrial release or sentencing issues are decided.\n(a) As used in this subdivision \"qualified domestic violence-related offense\" has the meaning given in section 609.02, subdivision 16.\n(b) Except as otherwise provided in paragraphs (c) and (d), a person who knows of the existence of a domestic abuse no contact order issued against the person and violates the order is guilty of a misdemeanor.\n(c) A person is guilty of a gross misdemeanor who violates this subdivision within ten years of a previous qualified domestic violence-related offense conviction or adjudication of delinquency. Upon a gross misdemeanor conviction under this paragraph, the defendant must be sentenced to a minimum of ten days' imprisonment and must be ordered to participate in counseling or other appropriate programs selected by the court as provided in section 518B.02. Notwithstanding section 609.135, the court must impose and execute the minimum sentence provided in this paragraph for gross misdemeanor convictions.\n(d) A person is guilty of a felony and may be sentenced to imprisonment for not more than five years or to payment of a fine of not more than $10,000, or both, if the person violates this subdivision:\n(1) within ten years of the first of two or more previous qualified domestic violence-related offense convictions or adjudications of delinquency; or\n(2) while possessing a dangerous weapon, as defined in section 609.02, subdivision 6. Upon a felony conviction under this paragraph in which the court stays imposition or execution of sentence, the court shall impose at least a 30-day period of incarceration as a condition of probation. The court also shall order that the defendant participate in counseling or other appropriate programs selected by the court. Notwithstanding section 609.135, the court must impose and execute the minimum sentence provided in this paragraph for felony convictions.\nA person may be prosecuted under subdivision 2 at the place where any call is made or received or, in the case of wireless or electronic communication or any communication made through any available technologies, where the actor or victim resides, or in the jurisdiction of the victim's designated address if the victim participates in the address confidentiality program established under chapter 5B.\nA peace officer shall arrest without a warrant and take into custody a person whom the peace officer has probable cause to believe has violated a domestic abuse no contact order, even if the violation of the order did not take place in the presence of the peace officer, if the existence of the order can be verified by the officer. The person shall be held in custody for at least 36 hours, excluding the day of arrest, Sundays, and holidays, unless the person is released earlier by a judge or judicial officer. A peace officer acting in good faith and exercising due care in making an arrest pursuant to this subdivision is immune from civil liability that might result from the officer's actions.",
	"repealed": false
}