{
	"id": "273.128",
	"url": "https://www.revisor.mn.gov/statutes/cite/273.128",
	"title": "273.128 CERTIFICATION OF LOW-INCOME RENTAL PROPERTY.",
	"text": "(a) Low-income rental property classified as class 4d(1) under section 273.13, subdivision 25, is entitled to valuation under this section if at least 20 percent of the units in the rental housing property meet any of the following qualifications:\n(1) the units are subject to a housing assistance payments contract under Section 8 of the United States Housing Act of 1937, as amended;\n(2) the units are rent-restricted and income-restricted units of a qualified low-income housing project receiving tax credits under section 42(g) of the Internal Revenue Code;\n(3) the units are financed by the Rural Housing Service of the United States Department of Agriculture and receive payments under the rental assistance program pursuant to section 521(a) of the Housing Act of 1949, as amended; or\n(4) the units are subject to rent and income restrictions under the terms of financial assistance provided to the rental housing property by the federal government or the state of Minnesota, or a local unit of government, as evidenced by a document recorded against the property.\nThe restrictions must require assisted units to be occupied by residents whose household income at the time of initial occupancy does not exceed 60 percent of the greater of area or state median income, adjusted for family size, as determined by the United States Department of Housing and Urban Development. The restriction must also require the rents for assisted units to not exceed 30 percent of 60 percent of the greater of area or state median income, adjusted for family size, as determined by the United States Department of Housing and Urban Development.\n(b) The owner of a property certified as class 4d(1) under this section must use the property tax savings received from the 4d(1) classification for one or more of the following eligible uses: property maintenance, property security, improvements to the property, rent stabilization, or increases to the property's replacement reserve account. To maintain the class 4d(1) classification, the property owner must annually reapply and certify to the Housing Finance Agency that the property tax savings were used for one or more eligible uses.\n(c) In order to meet the requirements of this section, property which received the 4d(1) classification in the prior year must demonstrate compliance with paragraph (b).\nA property owner must receive approval by resolution of the governing body of the city or town where the property is located before submitting an initial application to the Housing Finance Agency, as required under subdivision 2, for property that has not, in whole or in part, been classified as class 4d(1) under section 273.13, subdivision 25, prior to assessment year 2024. A property owner that receives approval as required under this subdivision, and the certification made under subdivision 3, shall not be required to seek approval under this subdivision prior to submitting an application under subdivision 2 in each subsequent year. If the property is located in a city or town in which the net tax capacity of 4d(1) property did not exceed two percent of the total net tax capacity in the city or town in the prior assessment year, the property owner does not need to receive approval under this subdivision. The commissioner of revenue must annually certify to the Housing Finance Agency a list of the cities and towns in which the net tax capacity of 4d(1) property exceeded two percent of the total net tax capacity in the prior assessment year.\n(a) Application for certification under this section must be filed by March 31 of the levy year, or at a later date if the Housing Finance Agency deems practicable. The application must be filed with the Housing Finance Agency, on a form prescribed by the agency, and must contain the information required by the Housing Finance Agency.\n(b) Each application must include:\n(1) the property tax identification number; and\n(2) evidence that the property meets the requirements of subdivisions 1 and 1a.\n(c) The Housing Finance Agency may charge an application fee approximately equal to the costs of processing and reviewing the applications but not to exceed $10 per unit. If imposed, the applicant must pay the application fee to the Housing Finance Agency. The fee must be deposited in the housing development fund.\nBy June 1 of each levy year, the Housing Finance Agency must certify to the appropriate county or city assessors, the specific properties that are qualified under this section and the number of units in the building that qualify. In making the certification, the Housing Finance Agency may rely on the application and any other supporting information that the agency deems necessary from the property owner.",
	"repealed": false
}