{
	"id": "169.81",
	"url": "https://www.revisor.mn.gov/statutes/cite/169.81",
	"title": "169.81 HEIGHT AND LENGTH LIMITATIONS.",
	"text": "(a) Except as provided in paragraph (b), no vehicle unladen or with load shall exceed a height of 13 feet six inches.\n(b) A double-deck bus may not exceed a height of 14 feet three inches. Any carrier operating a double-deck bus exceeding 13 feet six inches shall obtain from the commissioner, with respect to highways under the commissioner's jurisdiction, and from local authorities, with respect to highways under their jurisdiction, an annual permit to operate the bus upon any highway under the jurisdiction of the party granting the permit. Annual permits shall be issued in accordance with applicable provisions of section 169.86. The fee for an annual permit issued by the commissioner is as provided in section 169.86, subdivision 5.\n(a) Statewide, no single vehicle may exceed 45 feet in overall length, including load and front and rear bumpers, except mobile cranes, which may not exceed 48 feet in overall length.\n(b) Statewide, no semitrailer may exceed 48 feet in overall length, including bumper and load, but excluding non-cargo-carrying equipment, such as refrigeration units or air compressors, necessary for safe and efficient operation and located on the end of the semitrailer adjacent to the truck-tractor. However, statewide, a single semitrailer may exceed 48 feet, but not 53 feet, if the distance from the kingpin to the centerline of the rear axle group of the semitrailer does not exceed 43 feet.\n(c) Statewide, no single trailer may have an overall length exceeding 45 feet, including the tow bar assembly but exclusive of rear bumpers that do not increase the overall length by more than six inches.\n(d) For determining compliance with this subdivision, the length of the semitrailer or trailer must be determined separately from the overall length of the combination of vehicles.\n(e) No semitrailer or trailer used in a three-vehicle combination may have an overall length in excess of 28-1/2 feet, exclusive of:\n(1) non-cargo-carrying accessory equipment, including refrigeration units or air compressors and upper coupler plates, necessary for safe and efficient operation, located on the end of the semitrailer or trailer adjacent to the truck or truck-tractor;\n(2) the tow bar assembly; and\n(3) lower coupler equipment that is a fixed part of the rear end of the first semitrailer or trailer.\n(a) Statewide, no combination of vehicles coupled together may consist of more than two units, except as provided in paragraph (b).\n(b) Three-unit combinations may only be used as provided for in subdivisions 3, paragraph (c); 3c; 8; and 10. Further, vehicles transporting milk from the point of production to the point of first processing may consist of no more than three units. Mount combinations, consisting of a truck or truck-tractor transporting similar vehicles by having the front axle of the transported vehicle mounted onto the center of the rear part of the preceding vehicle, may be used.\n(a) Statewide, except on the highways identified under provisions in paragraph (c), no combination of vehicles may exceed a total length of 75 feet.\n(b) However, the total length limitation does not apply to combinations of vehicles transporting:\n(1) telephone poles, electric light and power poles, piling, or pole-length pulpwood; or\n(2) pipe or other objects by a public utility when required for emergency or repair of public service facilities or when operated under special permits as provided in section 169.86.\nThese combinations of vehicles must be equipped with sufficient clearance markers, or lamps for night transportation, on both sides and upon the extreme ends of a projecting load to clearly mark the dimensions of the load.\n(c) The following combination of vehicles regularly engaged in the transportation of commodities, property, or equipment may operate only on divided highways having four or more lanes of travel, and on other highways as may be designated by the commissioner of transportation subject to section 169.87, subdivision 1, and subject to the approval of the authority having jurisdiction over the highway, for the purpose of providing reasonable access between the divided highways of four or more lanes of travel and terminals, facilities for food, fuel, repair, and rest, and points of loading and unloading for household goods carriers, livestock carriers, or for the purpose of providing continuity of route:\n(1) a truck-tractor and semitrailer exceeding 75 feet in length;\n(2) a combination of vehicles including a truck-tractor and semitrailer drawing one additional semitrailer which may be equipped with an auxiliary dolly;\n(3) a combination of vehicles including a truck-tractor and semitrailer drawing one full trailer;\n(4) a truck-tractor and semitrailer designed and used exclusively for the transportation of motor vehicles or boats and exceeding an overall length of 75 feet including the load; and\n(5) a truck or truck-tractor transporting similar vehicles by having the front axle of the transported vehicle mounted onto the center or rear part of the preceding vehicle, defined in Code of Federal Regulations, title 49, sections 390.5 and 393.5 as drive-away saddlemount combinations or drive-away saddlemount vehicle transporter combinations, when the overall length exceeds 75 feet but does not exceed 97 feet.\n(d) Vehicles operated under the provisions of this section must conform to the standards for those vehicles prescribed by the United States Department of Transportation, Federal Highway Administration, Bureau of Motor Carrier Safety, as amended.\n[Repealed, 1983 c 198 s 15]\n[Repealed, 1983 c 198 s 15]\nNotwithstanding subdivision 3, a recreational vehicle combination may be operated without a permit if:\n(1) the combination does not consist of more than three vehicles, and the towing rating of the full-size pickup truck or recreational truck-tractor is equal to or greater than the total weight of all vehicles being towed;\n(2) the combination does not exceed 70 feet in length;\n(3) the operator of the combination is at least 18 years of age;\n(4) the trailer is only carrying watercraft, motorcycles, motorized bicycles, off-highway motorcycles, snowmobiles, all-terrain vehicles, motorized golf carts, or equestrian equipment or supplies, and meets all requirements of law;\n(5) the vehicles in the combination are connected to the full-size pickup truck or recreational truck-tractor and each other in conformity with section 169.82; and\n(6) the combination is not operated within the seven-county metropolitan area, as defined in section 473.121, subdivision 2, during the hours of 6:00 a.m. to 9:00 a.m. and 4:00 p.m. to 7:00 p.m. on Mondays through Fridays.\nNotwithstanding subdivisions 2a and 3, a combination consisting of a single-unit truck or a pickup truck and not more than two two-wheeled automobile tow dollies may be operated without a permit when:\n(1) the combination is operated by an employee or agent of an automobile tow dolly manufacturer or a truck rental company;\n(2) no vehicle is being transported on either dolly; and\n(3) the combination does not exceed 50 feet in length.\nNotwithstanding subdivision 2, a motor carrier of passengers registered under section 221.0252 may operate without a permit an articulated bus of up to 61 feet in length.\nAn aerodynamic device that meets the requirements under Code of Federal Regulations, title 23, section 658.16 (b)(4), is excluded from each calculation of length under subdivision 2, 3, or 3c, including (1) total vehicle length; and (2) length of a semitrailer or trailer, whether in a vehicle combination or not.\nThe load upon any vehicle operated alone, or the load upon the front vehicle of a combination of vehicles, shall not extend more than three feet beyond the front wheels of such vehicle or the front bumper of such vehicle if it is equipped with such a bumper.\n(a) A vehicle must not be driven or moved on any highway unless the vehicle is so constructed, loaded, or the load securely covered as to prevent any of its load from dropping, sifting, leaking, blowing, or otherwise escaping.\n(b) Notwithstanding paragraph (a), a vehicle or combination of vehicles may:\n(1) drop sand to secure traction;\n(2) sprinkle water or other substances to clean or maintain the roadway; or\n(3) leak liquid from thawing sugar beets only if transporting unprocessed sugar beets.\n(c) This subdivision does not apply to motor vehicles operated by a farmer or the farmer's agent when transporting produce such as small grains, shelled corn, soybeans, or other farm produce of a size and density not likely to cause injury to persons or damage to property on escaping in small amounts from a vehicle.\n(d) A violation of this subdivision by a vehicle that is carrying farm produce and that is not exempted under paragraph (c) is a petty misdemeanor.\nNo vehicle that has a cargo area without a rear wall may be driven or moved on a trunk highway with a load of cut firewood of less than three feet in length unless the rear of the cargo area is covered with a material of sufficient strength to prevent any part of the load from escaping from the rear. No person shall transport firewood in any vehicle in an unsafe manner. Violation of this subdivision is a petty misdemeanor except that a peace officer may issue a citation that amounts to a warning (1) for a first offense, and (2) if, in the judgment of the citing peace officer at the site, the load of firewood is made safe for transport.\n(a) The driver of a vehicle transporting sand, gravel, aggregate, dirt, lime rock, silica, or similar material shall ensure that the cargo compartment of the vehicle is securely covered if:\n(1) the vertical distance from the top of an exterior wall of the cargo compartment to the load, when measured downward along the inside surface of the wall, is less than six inches; or\n(2) the horizontal distance from the top of an exterior wall of the cargo compartment to the load is less than two feet.\n(b) The driver shall not operate a vehicle to transport sand, gravel, aggregate, dirt, lime rock, silica, or similar material in or on any part of the vehicle other than in the cargo container. The driver shall clean the vehicle of loose sand, gravel, aggregate, dirt, lime rock, silica, or similar material before the vehicle is moved on a road, street, or highway following loading or unloading.\n(c) A driver of a vehicle used to transport garbage, rubbish, trash, debris, or similar material is not required to cover the transported material as long as (1) the vehicle is being operated at a speed less than 30 miles per hour, (2) the vehicle is not being operated on an interstate highway, and (3) no part of the load escapes from the vehicle. A driver shall immediately retrieve material that escapes from the vehicle, when safe to do so.\n[Repealed, 1967 c 215 s 2]\n[Repealed, 1983 c 198 s 15]\nNotwithstanding the provisions of subdivisions 2 and 3, a farm truck as defined in section 168.002, subdivision 8, including a single-unit truck or a combination of vehicles of no more than two units and otherwise not exceeding the size and weight limitations prescribed by law, and a livestock or poultry truck, including a single-unit truck or a combination of vehicles of no more than two units and not otherwise exceeding the size and weight limitations prescribed by law, owned or operated by a livestock or poultry carrier and used primarily for transporting livestock or poultry for hire, may draw one additional two-wheel trailer, the loaded weight of which does not exceed 3,000 pounds, for the sole purpose of transporting a livestock or poultry loading chute; provided that such two-wheel trailer shall not be drawn by a two-unit combination on the public highways of this state beyond a ten-mile radius of the home post office of the owner or operator of the two-unit combination. The two-wheel trailer used solely for transporting a livestock or poultry chute is special mobile equipment.\nSubdivision 8 shall not apply to the seven-county metropolitan area.\nNotwithstanding any other provision of this section or any other law to the contrary, a pickup truck used primarily in the production or transportation of liquid fertilizer, anhydrous ammonia, or any agricultural commodity as defined in section 17.53, subdivision 2, may draw not to exceed two empty trailers when the resulting combination does not exceed the size and weight limitations otherwise prescribed by law. A pickup truck when drawing two trailers shall not be operated on the highways of this state beyond a 35-mile radius of the home post office of the owner of the pickup truck nor at a speed exceeding 35 miles per hour.\n(a) For purposes of this subdivision, the following terms have the meanings given them:\n(1) \"automobile transporter\" means any vehicle combination designed and used to transport assembled highway vehicles, including truck camper units;\n(2) \"stinger-steered combination automobile transporter\" means a truck tractor semitrailer having the fifth wheel located on a drop frame located behind and below the rear-most axle of the power unit; and\n(3) \"backhaul\" means the return trip of a vehicle transporting cargo or general freight, including when carrying goods back over all or part of the same route.\n(b) Stinger-steered combination automobile transporters having a length of 80 feet or less may be operated on interstate highways and other highways designated in this section, and in addition may carry a load that extends the length by four feet or less in the front of the vehicle and six feet or less in the rear of the vehicle.\n(c) An automobile transporter may transport cargo or general freight on a backhaul, provided it complies with weight limitations for a truck tractor and semitrailer combination under section 169.824.\nAn unladen power unit may tow two trailers or semitrailers when the combination (1) is not used to carry property, (2) does not exceed 82 feet in length, and (3) has a total gross weight that does not exceed 26,000 pounds. The trailers or semitrailers must consist of inventory property of a manufacturer, distributor, or dealer of the trailers or semitrailers.",
	"repealed": false
}