{
	"id": "520.32",
	"url": "https://www.revisor.mn.gov/statutes/cite/520.32",
	"title": "520.32 DEPOSIT OF SECURITIES IN CENTRAL DEPOSITORY.",
	"text": "Notwithstanding any other provision of law, any fiduciary, as defined in sections 520.01 or 520.21, holding securities in its fiduciary capacity, any bank or trust company holding securities as a custodian or managing agent, and any bank or trust company holding securities as custodian for a fiduciary is authorized to deposit or arrange for the deposit of such securities in a clearing corporation, as defined in section 336.8-102. When such securities are so deposited, certificates representing securities of the same class of the same issuer may be merged and held in bulk in the name of the nominee of such clearing corporation with any other such securities deposited in such clearing corporation by any person regardless of the ownership of such securities, and certificates of small denomination may be merged into one or more certificates of larger denomination. The records of such fiduciary and the records of such bank or trust company acting as custodian, as managing agent or as custodian for a fiduciary shall at all times show the name of the party for whose account the securities are so deposited. Title to such securities may be transferred by bookkeeping entry on the books of such clearing corporation without physical delivery of certificates representing such securities. A bank or trust company so depositing securities pursuant to this section shall be subject to such rules as, in the case of state chartered institutions, the state Department of Commerce and, in the case of national banking associations, the comptroller of the currency may from time to time issue. A bank or trust company acting as custodian for a fiduciary shall, on demand by the fiduciary, certify in writing to the fiduciary the securities so deposited by such bank or trust company in such clearing corporation for the account of such fiduciary. A fiduciary shall, on demand by any party to a judicial proceeding for the settlement of such fiduciary's account or on demand by the attorney for such party, certify in writing to such party the securities deposited by such fiduciary in such clearing corporation for its account as such fiduciary.\nThis section shall apply to any fiduciary holding securities in its fiduciary capacity, and to any bank or trust company holding securities as a custodian, managing agent or custodian for a fiduciary, acting on February 14, 1974 or who thereafter may act regardless of the date of the agreement, instrument or court order by which it is appointed and regardless of whether or not such fiduciary, custodian, managing agent or custodian for a fiduciary owns capital stock of such clearing corporation.",
	"repealed": false
}