{
	"id": "103H.005",
	"url": "https://www.revisor.mn.gov/statutes/cite/103H.005",
	"title": "103H.005 DEFINITIONS.",
	"text": "The definitions in this section apply to this chapter.\n\"Agricultural chemical\" means a pesticide, fertilizer, plant amendment, or soil amendment.\n\"Health risk limits\" means a concentration of a substance or chemical adopted by rule of the commissioner of health that is a potential drinking water contaminant because of a systemic or carcinogenic toxicological result from consumption.\n\"Best management practices\" means practicable voluntary practices that are capable of preventing and minimizing degradation of groundwater, considering economic factors, availability, technical feasibility, implementability, effectiveness, and environmental effects. Best management practices apply to schedules of activities; design and operation standards; restrictions of practices; maintenance procedures; management plans; practices to prevent site releases, spillage, or leaks; application and use of chemicals; drainage from raw material storage; operating procedures; treatment requirements; and other activities causing groundwater degradation.\n\"Common detection\" means detection of a pollutant that is not due to misuse or unusual or unique circumstances, but is likely to be the result of normal use of a product or a practice.\n\"Degradation\" means changing groundwater from its natural condition by human activities.\n\"Fertilizer\" has the meaning given in section 18C.005, subdivision 11.\n\"Groundwater\" means groundwater as defined in section 115.01, subdivision 6.\n\"Pesticide\" has the meaning given in section 18B.01, subdivision 18.\n\"Plant amendment\" has the meaning given in section 18C.005, subdivision 25.\n\"Pollutant\" means a chemical or substance for which a health risk limit has been adopted.\n\"Pollution\" means degradation of groundwater by a pollutant.\n\"Sensitive area\" means a geographic area defined by natural features where there is a significant risk of groundwater degradation from activities conducted at or near the land surface.\n\"Soil amendment\" has the meaning given in section 18C.005, subdivision 34.\n\"Water resource protection requirements\" means requirements adopted by rule for one or more pollutants intended to prevent and minimize pollution of groundwater. Water resource protection requirements include design criteria, standards, operation and maintenance procedures, practices to prevent releases, spills, leaks, and incidents, restrictions on use and practices, and treatment requirements.",
	"repealed": false
}