{
	"id": "290B.05",
	"url": "https://www.revisor.mn.gov/statutes/cite/290B.05",
	"title": "290B.05 MAXIMUM PROPERTY TAX AMOUNT AND DEFERRED PROPERTY TAX AMOUNT.",
	"text": "The commissioner shall determine each qualifying homeowner's \"annual maximum property tax amount\" following approval of the homeowner's initial application and following the receipt of a resumption of eligibility certification. The \"annual maximum property tax amount\" equals three percent of the homeowner's total household income for the year preceding either the initial application or the resumption of eligibility certification, whichever is applicable. Following approval of the initial application, the commissioner shall determine the qualifying homeowner's \"maximum allowable deferral.\" No tax may be deferred relative to the appropriate assessment year for any homeowner whose total household income for the previous year exceeds $96,000. No tax shall be deferred in any year in which the homeowner does not meet the program qualifications in section 290B.03. The maximum allowable total deferral is equal to 75 percent of the assessor's estimated market value for the year, less the balance of any mortgage loans and other amounts secured by liens against the property at the time of application, including any unpaid and delinquent special assessments and interest and any delinquent property taxes, penalties, and interest, but not including property taxes payable during the year.\nOn or before December 1 of the year of initial application, the commissioner shall certify to the county auditor of the county in which the qualifying homestead is located (1) the annual maximum property tax amount; and (2) the maximum allowable deferral. On or before December 1 of any year in which a homeowner files a resumption of eligibility certification, the commissioner shall certify to the county auditor the new annual maximum property tax amount to be used in calculating the deferral for subsequent years.\nWhen final property tax amounts for the following year have been determined, the county auditor shall calculate the \"deferred property tax amount.\" The deferred property tax amount is equal to the lesser of (1) the maximum allowable deferral for the year; or (2) the difference between (i) the total amount of property taxes and special assessments levied upon the qualifying homestead by all taxing jurisdictions and (ii) the maximum property tax amount. For this purpose \"special assessments\" includes any assessment, fee, or other charge that may by law, and which does, appear on the property tax statement for the property for collection under the laws applicable to the enforcement of real estate taxes. Any tax attributable to new improvements made to the property after the initial application has been approved under section 290B.04, subdivision 2, must be excluded when determining any subsequent deferred property tax amount. The county auditor shall annually, on or before April 15, certify to the commissioner of revenue the property tax deferral amounts determined under this subdivision by property and by owner.\nThe total amount of deferred taxes and interest on a property, when added to (1) the balance owing on any mortgages on the property at the time of initial application; and (2) other amounts secured by liens on the property at the time of the initial application, may not exceed 75 percent of the assessor's current estimated market value of the property.",
	"repealed": false
}