{
	"id": "279.03",
	"url": "https://www.revisor.mn.gov/statutes/cite/279.03",
	"title": "279.03 INTEREST ON DELINQUENT PROPERTY TAXES.",
	"text": "Section 549.09 applies with respect to judgments arising out of petitions for review filed pursuant to chapter 278.\nInterest shall commence on the first day of January following the year in which the taxes become due, but the county treasurer need not calculate interest on unpaid taxes and penalties on the tax list returned to the county auditor pursuant to section 279.01.\nIf interest is payable for a portion of a year, the interest is calculated only for the months that the taxes or penalties remain unpaid, and for this purpose a portion of a month is deemed to be a whole month.\n(a) Except as provided in paragraphs (b) and (c), interest on delinquent property taxes, penalties, and costs unpaid on or after January 1 is payable at the per annum rate determined in section 270C.40, subdivision 5. The maximum per annum rate is 14 percent if the rate specified under section 270C.40, subdivision 5, exceeds 14 percent. The rate is subject to change on January 1 of each year.\n(b) If a person is the owner of one or more parcels of property on which taxes are delinquent, and the delinquent taxes are more than 25 percent of the prior year's school district levy, interest on the delinquent property taxes, penalties, and costs unpaid is payable at twice the rate determined under paragraph (a) for the year.\n(c) A county board, by resolution, may establish an interest rate lower than the interest rate determined under paragraph (a).\n(a) Except as provided in paragraph (b), amounts included in composite judgments authorized by section 279.37, subdivision 1, are subject to interest at the rate calculated under subdivision 1a. During each calendar year, interest shall accrue on the unpaid balance of the composite judgment from the time it is confessed until it is paid. The interest rate established at the time the judgment is confessed is fixed for the duration of that judgment.\n(b) A confession of judgment covering any part of a parcel classified as 1a or 1b, and used as the homestead of the owner, is subject to interest at the rate provided in section 279.37, subdivision 2, paragraph (b). This paragraph does not apply to a relative homestead under section 273.124, subdivision 1, paragraph (c).",
	"repealed": false
}