{
	"id": "475.60",
	"url": "https://www.revisor.mn.gov/statutes/cite/475.60",
	"title": "475.60 SALE OF BONDS.",
	"text": "All obligations shall be negotiated and sold by the governing body, except when authority therefor is delegated by the governing body or by the charter of the municipality to a board, department, or officers of the municipality. Except as provided in subdivision 2 all obligations shall be sold at competitive sale after notice given as provided in subdivision 3.\nThe requirements as to public sale shall not apply:\n(1) to obligations issued under the provisions of a home rule charter or of a law specifically authorizing a different method of sale, or authorizing them to be issued in such manner or on such terms and conditions as the governing body may determine;\n(2) to obligations sold by an issuer in an amount not exceeding the total sum of $1,200,000 in any 12-month period;\n(3) to obligations issued by a governing body other than a school board in anticipation of the collection of taxes or other revenues appropriated for expenditure in a single year, if sold in accordance with the most favorable of two or more proposals solicited privately;\n(4) to obligations sold to any board, department, or agency of the United States of America or of the state of Minnesota, in accordance with rules or regulations promulgated by such board, department, or agency;\n(5) to obligations issued to fund pension and retirement fund liabilities under section 475.52, subdivision 6, obligations issued with tender options under section 475.54, subdivision 5a, crossover refunding obligations referred to in section 475.67, subdivision 13, and any issue of obligations comprised in whole or in part of obligations bearing interest at a rate or rates which vary periodically referred to in section 475.56;\n(6) to obligations to be issued for a purpose, in a manner, and upon terms and conditions authorized by law, if the governing body of the municipality, on the advice of bond counsel or special tax counsel, determines that interest on the obligations cannot be represented to be excluded from gross income for purposes of federal income taxation;\n(7) to obligations issued in the form of an installment purchase contract, lease purchase agreement, or other similar agreement;\n(8) to obligations sold under a bond reinvestment program; and\n(9) if the municipality has retained an independent municipal adviser, obligations which the governing body determines shall be sold by private negotiation.\nThe notice of sale to prospective bidders, where required, shall specify the maximum principal amount of the obligations, the place of receipt and consideration of bids and other details as to the obligations and terms of sale as the governing body or the municipality's authorized financial consultant deems suitable. The notice shall either specify the date and time for receipt of bids or specify the manner in which notice of the date or amount of the sale will be given to prospective bidders. Notification of prospective bidders shall be given by mail, facsimile, electronic data transmission or other form of communication common to the municipal bond trade at least two days (omitting Saturdays, Sundays, and legal holidays) before the date for receipt of bids to at least five firms determined by the governing body or its financial consultant to be prospective bidders, or shall be published in a newspaper or other periodical which circulates throughout the state and furnishes financial news as part of its service. Failure to give the notice as described in this subdivision shall not affect the validity of the obligations. Bids may be accepted by facsimile or other electronic transmission or in writing as specified by the governing body or its financial consultant. The governing body may employ an agent to receive and open the bids at any place within or outside the corporate limits of the municipality, in the presence of an officer of the municipality or the officer's designee, but the obligations shall not be sold except by action of the governing body or authorized officers of the municipality after communication of the bids to them. Additional notice may be given for such time and in such manner as the governing body deems suitable. At the time and place so fixed, the bids shall be considered and the offer complying with the terms of sale and deemed most favorable shall be accepted, but the governing body may reject any and all such offers, in which event, or if no offers have been received, it may award the obligations to any person who within 30 days thereafter presents an offer complying with the terms of sale and deemed more favorable than any received previously, or upon like notice the governing body may invite other bids upon the same or different terms and conditions.\nIn lieu of calling for bids, obligations may be sold on public subscription, after notice given in the manner required for public sale. Such notice of call for public subscription shall specify the interest rate and all terms of sale, including the date and place of delivery of the obligations.\nNo contract for the sale and delivery of obligations shall be enforceable unless made in accordance with this section.\nAny officer of any municipality who shall enter into or approve any contract or agreement for the sale of obligations contrary to the provisions hereof or which lessens, restricts or tends to prevent competitive bidding shall be guilty of a misdemeanor.\nA municipality, after it has contracted for the sale of obligations, may enter into a contract for the future purchase of securities described in section 118A.04, for a purchase price, including accrued interest on it, not in excess of the sale price of the obligations, excluding accrued interest on them. The contract shall provide a settlement date for the purchase of the securities which is not earlier than the anticipated delivery date of the obligations.\nAny officer of a municipality charged with the responsibility of issuing bonds for or on behalf of the municipality is authorized to enter into written agreements or contracts relating to the continuing disclosure of information necessary to comply with, or facilitate the issuance of bonds in accordance with, federal securities laws, rules and regulations, including securities and exchange commission rules and regulations, section 240.15c2-12. An agreement may comprise covenants with purchasers and holders of bonds set forth in the resolution authorizing the issuance of the bonds, or a separate document authorized by resolution.",
	"repealed": false
}