{
	"id": "115B.405",
	"url": "https://www.revisor.mn.gov/statutes/cite/115B.405",
	"title": "115B.405 EXCLUDED FACILITIES.",
	"text": "The owner or operator of a qualified facility may apply to the commissioner for exclusion from the landfill cleanup program under sections 115B.39, 115B.40, 115B.41, 115B.412, and 115B.43. Applications for qualified facilities defined in section 115B.39, subdivision 2, paragraph (o), clause (1), must be received by the commissioner by February 1, 1995. Applications for qualified facilities defined in section 115B.39, subdivision 2, paragraph (o), clause (2), must be received by the commissioner by December 31, 1999. The owner or operator of a qualified facility that is subject to a federal cleanup order or that includes any portion that is tax-forfeited may not apply for exclusion under this section. In addition to other information required by the commissioner, an application must include a disclosure of all financial assurance accounts established for the facility. Applications for exclusion must:\n(1) show that the operator or owner is complying with the agency's rules adopted under section 116.07, subdivision 4h, and is complying with a financial assurance plan for the facility that the commissioner has approved after determining that the plan is adequate to provide for closure, postclosure care, and contingency action;\n(2) demonstrate that the facility is closed or is in compliance with a closure schedule approved by the commissioner; and\n(3) include a waiver of all claims for recovery of costs incurred under sections 115B.01 to 115B.20 and the federal Superfund Act at or related to a qualified facility.\nWithin 90 days after the commissioner has received a complete application for exclusion, the commissioner shall notify the owner or operator if the facility is excluded. If the commissioner finds that the facility does not satisfy the requirements for exclusion, the commissioner shall notify the owner or operator of that fact.\n(a) A person may not use any property described in the most recent agency permit issued for an excluded facility in any way that disturbs the integrity of the final cover, liners, or any other components of any containment system, or the function of the facility's monitoring systems, unless the agency finds that the disturbance:\n(1) is necessary to the proposed use of the property and will not increase the potential hazard to human health or the environment; or\n(2) is necessary to reduce a threat to human health or the environment.\n(b) Before any transfer of ownership of property described in paragraph (a), the owner must obtain approval from the commissioner. The commissioner shall approve a transfer if the owner can demonstrate to the satisfaction of the commissioner that persons and property will not be exposed to undue risk from releases of hazardous substances or pollutants or contaminants.\n(c) After obtaining approval from the commissioner, the owner shall record with the county recorder of the county in which the property is located an affidavit containing a legal description of the property that discloses to any potential transferee:\n(1) that the land has been used as a mixed municipal solid waste disposal facility;\n(2) the identity, quantity, location, condition, and circumstances of the disposal and any release of hazardous substances or pollutants or contaminants from the facility to the full extent known or reasonably ascertainable; and\n(3) that the use of the property or some portion of it may be restricted as provided in paragraph (a).\n(d) An owner must also file an affidavit within 60 days after any material change in any matter required to be disclosed under paragraph (c), with respect to property for which an affidavit has already been recorded. If the owner or any subsequent owner of the property removes the waste from the facility together with any residues, liner, and contaminated underlying and surrounding soil, that owner may record an affidavit indicating the removal. Failure to record an affidavit as provided in this paragraph does not affect or prevent any transfer of ownership of the property.\n(e) The county recorder shall record all affidavits presented in accordance with paragraphs (c) and (d). The affidavits must be recorded in a manner that will ensure their disclosure in the ordinary course of a title search of the subject property.\n(f) This subdivision is enforceable under sections 115.071 and 116.072.\nIf the commissioner determines that the owner or operator of an excluded facility did not complete the terms of an approved closure plan by the date in the plan, the commissioner shall complete closure at the facility and may seek cost recovery against the owner or operator under section 115B.17, subdivision 6.",
	"repealed": false
}