{
	"id": "326A.01",
	"url": "https://www.revisor.mn.gov/statutes/cite/326A.01",
	"title": "326A.01 DEFINITIONS.",
	"text": "When used in this chapter, the terms in this section have the meanings given.\n\"Attest\" means providing any of the following services:\n(1) an audit or other engagement performed in accordance with the Statements on Auditing Standards (SAS);\n(2) an audit or other engagement performed in accordance with the Generally Accepted Government Auditing Standards (GAGAS);\n(3) a review of a financial statement performed in accordance with the Statements on Standards for Accounting and Review Services (SSARS);\n(4) an examination of prospective financial information performed in accordance with the Statements on Standards for Attestation Engagements (SSAE);\n(5) an engagement performed in accordance with the standards of the Public Company Accounting Oversight Board (PCAOB); and\n(6) an examination, review, or agreed-upon procedures engagement performed in accordance with SSAE, other than an examination described in clause (4).\n\"Board\" means the Minnesota Board of Accountancy established under section 326A.02 or its predecessor under prior law.\n\"Certificate\" means a certificate as a certified public accountant issued under section 326A.04, or corresponding provisions of prior law, or a corresponding certificate as certified public accountant issued after examination under the law of any other state.\n\"Client\" means a person or entity that agrees with a licensee, a person registered under section 326A.06, paragraph (b), or the person's or licensee's employers to receive any professional service.\n\"Compilation\" means the provision of a service performed in accordance with Statements on Standards for Accounting and Review Services (SSARS) that presents in the form of financial statements information that is the representation of management or owners without undertaking to express any assurance on the statements.\n\"CPA firm\" means a sole proprietorship, a corporation, a partnership, or any other form of organization issued a permit under section 326A.05.\n\"License\" means a certificate issued under section 326A.04, a permit issued under section 326A.05, or a certificate or permit issued under corresponding provisions of prior law.\n\"Licensee\" means the holder of a license.\n\"Manager\" means a manager of a limited liability company.\n\"Member\" means a member of a limited liability company.\n\"Peer review\" means an independent study, appraisal, or review of one or more aspects of the professional work of a licensee or CPA firm that issues attest or compilation reports, or the professional work of a person registered under section 326A.06, paragraph (b), by persons who are not affiliated with the licensee or CPA firm being reviewed.\n\"Permit\" means a permit to practice as a CPA firm issued under section 326A.05, or corresponding provisions of prior law, or under corresponding provisions of the laws of other states.\n\"Principal place of business\" means the office location designated by the licensee for purposes of substantial equivalency and reciprocity.\n\"Professional\" means arising out of or related to the specialized knowledge or skills associated with certified public accountants or persons registered under section 326A.06, paragraph (b).\n\"Report,\" when used with reference to an attest or compilation service, means an opinion, report, or other form of language that states or implies assurance as to the reliability of the attested information or compiled financial statements and that also includes or is accompanied by a statement or implication that the person or firm issuing it has special knowledge or competence in accounting or auditing. Such a statement or implication of special knowledge or competence may arise from use by the issuer of the report of names or titles indicating that the person or firm is an accountant or auditor, or from the language of the report itself. The term \"report\" includes any form of language that disclaims an opinion when the form of language is conventionally understood to imply any positive assurance as to the reliability of the attested information or compiled financial statements referred to or special competence on the part of the person or firm issuing the language. It includes any other form of language that is conventionally understood to imply such assurance or such special knowledge or competence.\n\"State\" means any state of the United States, the District of Columbia, Puerto Rico, the U.S. Virgin Islands, the Commonwealth of the Northern Mariana Islands, and Guam; except that \"this state\" means the state of Minnesota.\n\"Substantial equivalency\" is a determination by the Board of Accountancy or its designee that the education, examination, and experience requirements contained in the statutes and administrative rules of another jurisdiction are comparable to, or exceed the education requirements in section 326A.03, subdivisions 3 and 6, paragraph (a), examination requirements in section 326A.03, subdivision 4, paragraph (a), and experience requirements in section 326A.03, subdivision 6, paragraph (b), or that an individual CPA's education, examination, and experience qualifications are comparable to or exceed the education, examination, and experience requirements in this subdivision. For purposes of ascertaining substantial equivalency under the provisions of this chapter, the board shall take into account the qualifications of the individual without regard to the sequence in which experience, education, or examination were attained.",
	"repealed": false
}