{
	"id": "60A.0787",
	"url": "https://www.revisor.mn.gov/statutes/cite/60A.0787",
	"title": "60A.0787 PROCESSING CHANGE OF OWNERSHIP OR BENEFICIARY REQUESTS.",
	"text": "Upon receipt of a properly completed request for change of ownership or beneficiary of a policy and, if applicable, the completed questionnaire described in this section, the insurer shall respond in writing within 30 calendar days with written acknowledgment confirming that the change has been effected or specifying the reasons why the requested change cannot be processed. The insurer shall not unreasonably delay effecting change of ownership or beneficiary and shall not otherwise interfere with any permitted settlement contract entered into in this state.\nIf the insurer receives a request for change of ownership or beneficiary within the four-year period commencing with the date the policy is issued, the insurer may require, as a condition of effecting the requested change, that the policyowner complete and return a written questionnaire designed to determine whether the change request relates to or is made in accordance with a settlement contract and if so, whether the circumstances described in section 60A.0785 are present. The questionnaire shall be in a form approved by the commissioner and shall include, but not be limited to, the following:\n(1) the definition of settlement contract;\n(2) an inquiry regarding whether the request for change of ownership or beneficiary relates to or is made in accordance with a settlement contract;\n(3) if the answer to clause (2) is \"yes,\" then an inquiry regarding whether the circumstances described in section 60A.0785 are present;\n(4) a disclosure that presenting false material information, or concealing material information, in connection with the questionnaire is defined under the laws of this state as a fraudulent act; and\n(5) a signed certification by the policyowner that the answers and information provided in and pursuant to the questionnaire are true and complete to the best of the policyowner's knowledge and belief.\nNothing in this section should be interpreted to limit an insurer's ability to make other inquiries to detect STOLI practices.\nNothing in sections 60A.078 to 60A.0789 shall prohibit a fraternal benefit society regulated under chapter 64B from enforcing the terms of its bylaws or rules regarding permitted beneficiaries and owners.",
	"repealed": false
}