{
	"id": "144.1505",
	"url": "https://www.revisor.mn.gov/statutes/cite/144.1505",
	"title": "144.1505 HEALTH PROFESSIONALS CLINICAL TRAINING EXPANSION AND RURAL AND UNDERSERVED CLINICAL ROTATIONS GRANT PROGRAMS.",
	"text": "For purposes of this section, the following definitions apply:\n(1) \"eligible advanced practice registered nurse program\" means a program that is located in Minnesota and is currently accredited as a master's, doctoral, or postgraduate level advanced practice registered nurse program by the Commission on Collegiate Nursing Education or by the Accreditation Commission for Education in Nursing, or is a candidate for accreditation;\n(2) \"eligible dental therapy program\" means a dental therapy education program or advanced dental therapy education program that is located in Minnesota and is either:\n(i) approved by the Board of Dentistry; or\n(ii) currently accredited by the Commission on Dental Accreditation;\n(3) \"eligible mental health professional program\" means a program that is located in Minnesota and is listed as a mental health professional program by the appropriate accrediting body for clinical social work, psychology, marriage and family therapy, or licensed professional clinical counseling, or is a candidate for accreditation;\n(4) \"eligible pharmacy program\" means a program that is located in Minnesota and is currently accredited as a doctor of pharmacy program by the Accreditation Council on Pharmacy Education;\n(5) \"eligible physician assistant program\" means a program that is located in Minnesota and is currently accredited as a physician assistant program by the Accreditation Review Commission on Education for the Physician Assistant, or is a candidate for accreditation;\n(6) \"mental health professional\" means an individual providing clinical services in the treatment of mental illness who meets one of the qualifications under section 245.462, subdivision 18;\n(7) \"eligible physician training program\" means a physician residency training program located in Minnesota and that is currently accredited by the accrediting body or has presented a credible plan as a candidate for accreditation;\n(8) \"eligible dental program\" means a dental education program or a dental residency training program located in Minnesota and that is currently accredited by the accrediting body or has presented a credible plan as a candidate for accreditation; and\n(9) \"project\" means a project to establish or expand clinical training for physician assistants, advanced practice registered nurses, pharmacists, dental therapists, advanced dental therapists, or mental health professionals in Minnesota.\n(a) For advanced practice provider clinical training expansion grants, the commissioner of health shall award health professional training site grants to eligible physician assistant, advanced practice registered nurse, pharmacy, dental therapy, and mental health professional programs to plan and implement expanded clinical training. A planning grant shall not exceed $75,000, and a three-year training grant shall not exceed $300,000 per project. The commissioner may provide a one-year, no-cost extension for grants.\n(b) For health professional rural and underserved clinical rotations grants, the commissioner of health shall award health professional training site grants to eligible physician, physician assistant, advanced practice registered nurse, pharmacy, dentistry, dental therapy, and mental health professional programs to augment existing clinical training programs to add rural and underserved rotations or clinical training experiences, such as credential or certificate rural tracks or other specialized training. For physician and dentist training, the expanded training must include rotations in primary care settings such as community clinics, hospitals, health maintenance organizations, or practices in rural communities.\n(c) Funds may be used for:\n(1) establishing or expanding rotations and clinical training;\n(2) recruitment, training, and retention of students and faculty;\n(3) connecting students with appropriate clinical training sites, internships, practicums, or externship activities;\n(4) travel and lodging for students;\n(5) faculty, student, and preceptor salaries, incentives, or other financial support;\n(6) development and implementation of cultural competency training;\n(7) evaluations;\n(8) training site improvements, fees, equipment, and supplies required to establish, maintain, or expand a training program; and\n(9) supporting clinical education in which trainees are part of a primary care team model.\nEligible physician assistant, advanced practice registered nurse, pharmacy, dental therapy, dental, physician, and mental health professional programs seeking a grant shall apply to the commissioner. Applications must include a description of the number of additional students who will be trained using grant funds; attestation that funding will be used to support an increase in the number of clinical training slots; a description of the problem that the proposed project will address; a description of the project, including all costs associated with the project, sources of funds for the project, detailed uses of all funds for the project, and the results expected; and a plan to maintain or operate any component included in the project after the grant period. The applicant must describe achievable objectives, a timetable, and roles and capabilities of responsible individuals in the organization. Applicants applying under subdivision 2, paragraph (b), must include information about length of training and training site settings, geographic location of rural sites, and rural populations expected to be served.\nThe commissioner shall review each application to determine whether or not the application is complete and whether the program and the project are eligible for a grant. In evaluating applications, the commissioner shall score each application based on factors including, but not limited to, the applicant's clarity and thoroughness in describing the project and the problems to be addressed, the extent to which the applicant has demonstrated that the applicant has made adequate provisions to ensure proper and efficient operation of the training program once the grant project is completed, the extent to which the proposed project is consistent with the goal of increasing access to primary care and mental health services for rural and underserved urban communities, the extent to which the proposed project incorporates team-based primary care, and project costs and use of funds.\nThe commissioner shall determine the amount of a grant to be given to an eligible program based on the relative score of each eligible program's application, including rural locations as applicable under subdivision 2, paragraph (b), other relevant factors discussed during the review, and the funds available to the commissioner. Appropriations made to the program do not cancel and are available until expended. During the grant period, the commissioner may require and collect from programs receiving grants any information necessary to evaluate the program.",
	"repealed": false
}