{
	"id": "110A.24",
	"url": "https://www.revisor.mn.gov/statutes/cite/110A.24",
	"title": "110A.24 ELECTION; TIME, PLACE, PURPOSE, RULES.",
	"text": "The board of directors of the district shall fix the hour and place, within the boundaries of the district, of each election and shall preside. If the district is divided into election divisions, the board in its discretion may fix a place of election within each election division, and the directors who represent that division shall preside.\nEvery person or corporation which is a party to a contract with the district for the purchase of water to be furnished by the district, may cast one vote at each election for each director to be elected. In case election divisions are provided for, each person or corporation entitled to vote by reason of being a party to a contract shall select the division in which the person or corporation shall vote, which selection shall be made under rules established by the board of directors.\nThe board shall at least 20 days prior to the date of election, mail to each person or corporation entitled to vote, at the person's or corporation's last known place of residence or business, a notice stating the time, place, and purpose of the election or, in the alternative, publish in each county in which lands within the district lie, in a newspaper of general circulation in the county, once each week for at least two successive weeks before the time of election, a notice that the election will be held giving the purpose, time and place.\nAt the hour and place of the election, the presiding directors shall call the roll of those entitled to vote, and the number of votes to which each is entitled. They shall make a record of the qualified voters present and prescribe the manner of casting ballots and canvassing votes. If election divisions are provided for, but the election is held at one place within the district instead of being held in each division, the board shall call the roll for each division and conduct the election for each division separately. All costs incident to the election of directors shall be paid by the district.\nThe candidate for director required to fill an existing vacancy or to succeed an outgoing director who receives the highest number of votes cast shall be declared elected.",
	"repealed": false
}