{
	"id": "149A.93",
	"url": "https://www.revisor.mn.gov/statutes/cite/149A.93",
	"title": "149A.93 TRANSPORTATION OF DEAD HUMAN BODIES.",
	"text": "After removal from the place of death to any location where the body is held awaiting final disposition, further transportation of the body shall require a certificate of removal. The certificate of removal shall contain the information required in the format as furnished by the commissioner.\nA certificate of removal is required when:\n(1) legal and physical custody of the body is transferred;\n(2) a body is transported by public transportation; or\n(3) a body is removed from the state.\nA copy of the certificate of removal shall be retained by the funeral establishment or representative of the legal entity releasing legal and physical custody of the body. The original certificate of removal shall accompany the remains to the legal entity to which custody is transferred. The funeral establishment releasing the custody of the remains shall retain a copy of the certificate of removal for a period of three calendar years following the date of the transfer of custody. Following this period, and subject to any other laws requiring retention of records, the funeral establishment may then place the records in storage or reduce them to microfilm, microfiche, laser disc, or any other method that can produce an accurate reproduction of the original record, for retention for a period of ten calendar years from the date of the removal of the body. At the end of this period and subject to any other laws requiring retention of records, the funeral establishment may destroy the records by shredding, incineration, or any other manner that protects the privacy of the individuals identified in the records.\nA disposition permit is required before a body can be buried, entombed, alkaline hydrolyzed, cremated, or, effective July 1, 2025, naturally reduced. No disposition permit shall be issued until a fact of death record has been completed and filed with the state registrar of vital records.\nUntil the body is delivered for final disposition, the disposition permit shall be in possession of the person in physical or legal custody of the body, or attached to the transportation container which holds the body. At the place of final disposition, legal and physical custody of the body shall pass with the filing of the disposition permit with the person in charge of that place.\nWhen a death occurs outside of the state and the body travels into or through this state, the body must be accompanied by a permit for burial, removal, or other disposition issued in accordance with the laws and rules of the state where the death occurred.\nA dead human body may be transported by means of private vehicle or private aircraft, provided that the body must be encased in an appropriate container, that meets the following standards:\n(1) promotes respect for and preserves the dignity of the dead human body;\n(2) shields the body from being viewed from outside of the conveyance;\n(3) has ample enclosed area to accommodate a cot, stretcher, rigid tray, casket, alternative container, alkaline hydrolysis container, or cremation container in a horizontal position;\n(4) is designed to permit loading and unloading of the body without excessive tilting of the cot, stretcher, rigid tray, casket, alternative container, alkaline hydrolysis container, or cremation container; and\n(5) if used for the transportation of more than one dead human body at one time, the vehicle must be designed so that a body or container does not rest directly on top of another body or container and that each body or container is secured to prevent the body or container from excessive movement within the conveyance.\nA vehicle that is a dignified conveyance and was specified for use by the deceased or by the family of the deceased may be used to transport the body to the place of final disposition.\nWhen a dead human body is transported by public transportation, it must be properly embalmed and enclosed in a casket or alternative container and an appropriate outside shipping container. All applicable regulations and policies of the carrier must be followed. When transportation is by any private vehicle or aircraft, the outside shipping container may be omitted or the casket or alternative container and the outside container may both be omitted and, in such case, the body shall be wrapped in a sheet that is impervious to liquids, covered in such a manner that the body cannot be viewed, encased in a secure pouch, and placed on a cot, stretcher, or rigid tray.\nA dead human body may be transported by unlicensed personnel according to section 149A.90. A licensed mortician or funeral director who directs the transport of a dead human body by unlicensed personnel shall be held strictly accountable for compliance with this chapter.\n[Repealed, 2007 c 114 s 75]",
	"repealed": false
}