{
	"id": "260.012",
	"url": "https://www.revisor.mn.gov/statutes/cite/260.012",
	"title": "260.012 DUTY TO ENSURE PLACEMENT PREVENTION AND FAMILY REUNIFICATION; REASONABLE EFFORTS.",
	"text": "(a) Once a child alleged to be in need of protection or services is under the court's jurisdiction, the court shall ensure that reasonable efforts, including culturally appropriate services and practices, by the social services agency are made to prevent placement or to eliminate the need for removal and to reunite the child with the child's family at the earliest possible time, and the court must ensure that the responsible social services agency makes reasonable efforts to finalize an alternative permanent plan for the child as provided in paragraph (e). In determining reasonable efforts to be made with respect to a child and in making those reasonable efforts, the child's best interests, health, and safety must be of paramount concern. Reasonable efforts to prevent placement and for rehabilitation and reunification are always required except upon a determination by the court that a petition has been filed stating a prima facie case that:\n(1) the parent has subjected a child to egregious harm as defined in section 260C.007, subdivision 14;\n(2) the parental rights of the parent to another child have been terminated involuntarily;\n(3) the child is an abandoned infant under section 260C.301, subdivision 2, paragraph (a), clause (2);\n(4) the parent's custodial rights to another child have been involuntarily transferred to a relative under Minnesota Statutes 2010, section 260C.201, subdivision 11, paragraph (d), clause (1), section 260C.515, subdivision 4, or a similar law of another jurisdiction;\n(5) the parent has committed sexual abuse as defined in section 260E.03, against the child or another child of the parent;\n(6) the parent has committed an offense that requires registration as a predatory offender under section 243.166, subdivision 1b, paragraph (a) or (b); or\n(7) the provision of services or further services for the purpose of reunification is futile and therefore unreasonable under the circumstances.\n(b) When the court makes one of the prima facie determinations under paragraph (a), either permanency pleadings under section 260C.505, or a termination of parental rights petition under sections 260C.141 and 260C.301 must be filed. A permanency hearing under sections 260C.503 to 260C.521 must be held within 30 days of this determination.\n(c) In the case of an Indian child, in proceedings under sections 260B.178, 260C.178, 260C.201, 260C.202, 260C.204, 260C.301, or 260C.503 to 260C.521, the juvenile court must make findings and conclusions consistent with the Indian Child Welfare Act of 1978, United States Code, title 25, section 1901 et seq., as to the provision of active efforts. In cases governed by the Indian Child Welfare Act of 1978, United States Code, title 25, section 1901, the responsible social services agency must provide active efforts as required under United States Code, title 25, section 1911(d).\n(d) \"Reasonable efforts to prevent placement\" means:\n(1) the agency has made reasonable efforts to prevent the placement of the child in foster care by working with the family to develop and implement a safety plan that is individualized to the needs of the child and the child's family and may include support persons from the child's extended family, kin network, and community; or\n(2) the agency has demonstrated to the court that, given the particular circumstances of the child and family at the time of the child's removal, there are no services or efforts available that could allow the child to safely remain in the home.\n(e) \"Reasonable efforts to finalize a permanent plan for the child\" means due diligence by the responsible social services agency to:\n(1) reunify the child with the parent or guardian from whom the child was removed;\n(2) assess a noncustodial parent's ability to provide day-to-day care for the child and, where appropriate, provide services necessary to enable the noncustodial parent to safely provide the care, as required by section 260C.219;\n(3) conduct a relative search to identify and provide notice to adult relatives, and engage relatives in case planning and permanency planning, as required under section 260C.221;\n(4) consider placing the child with relatives in the order specified in section 260C.212, subdivision 2, paragraph (a);\n(5) place siblings removed from their home in the same home for foster care or adoption, or transfer permanent legal and physical custody to a relative. Visitation between siblings who are not in the same foster care, adoption, or custodial placement or facility shall be consistent with section 260C.212, subdivision 2; and\n(6) when the child cannot return to the parent or guardian from whom the child was removed, to plan for and finalize a safe and legally permanent alternative home for the child, and considers permanent alternative homes for the child inside or outside of the state, preferably with a relative in the order specified in section 260C.212, subdivision 2, paragraph (a), through adoption or transfer of permanent legal and physical custody of the child.\n(f) Reasonable efforts are made upon the exercise of due diligence by the responsible social services agency to use culturally appropriate and available services to meet the individualized needs of the child and the child's family. Services may include those provided by the responsible social services agency and other culturally appropriate services available in the community. The responsible social services agency must select services for a child and the child's family by collaborating with the child's family and, if appropriate, the child. At each stage of the proceedings when the court is required to review the appropriateness of the responsible social services agency's reasonable efforts as described in paragraphs (a), (d), and (e), the social services agency has the burden of demonstrating that:\n(1) the agency has made reasonable efforts to prevent placement of the child in foster care, including that the agency considered or established a safety plan according to paragraph (d), clause (1);\n(2) the agency has made reasonable efforts to eliminate the need for removal of the child from the child's home and to reunify the child with the child's family at the earliest possible time;\n(3) the agency has made reasonable efforts to finalize a permanent plan for the child pursuant to paragraph (e);\n(4) the agency has made reasonable efforts to finalize an alternative permanent home for the child, and considered permanent alternative homes for the child in or out of the state, preferably with a relative in the order specified in section 260C.212, subdivision 2, paragraph (a); or\n(5) reasonable efforts to prevent placement and to reunify the child with the parent or guardian are not required. The agency may meet this burden by stating facts in a sworn petition filed under section 260C.141, by filing an affidavit summarizing the agency's reasonable efforts or facts that the agency believes demonstrate that there is no need for reasonable efforts to reunify the parent and child, or through testimony or a certified report required under juvenile court rules.\n(g) Once the court determines that reasonable efforts for reunification are not required because the court has made one of the prima facie determinations under paragraph (a), the court may only require the agency to make reasonable efforts for reunification after a hearing according to section 260C.163, if the court finds that there is not clear and convincing evidence of the facts upon which the court based the court's prima facie determination. If there is clear and convincing evidence that the child is in need of protection or services, the court may find the child in need of protection or services and order any of the dispositions available under section 260C.201, subdivision 1. Reunification of a child with a parent is not required if the parent has been convicted of:\n(1) a violation of, or an attempt or conspiracy to commit a violation of, sections 609.185 to 609.20; 609.222, subdivision 2; or 609.223 in regard to another child of the parent;\n(2) a violation of section 609.222, subdivision 2; or 609.223, in regard to the child;\n(3) a violation of, or an attempt or conspiracy to commit a violation of, United States Code, title 18, section 1111(a) or 1112(a), in regard to another child of the parent;\n(4) committing sexual abuse as defined in section 260E.03, against the child or another child of the parent; or\n(5) an offense that requires registration as a predatory offender under section 243.166, subdivision 1b, paragraph (a) or (b).\n(h) The juvenile court, in proceedings under sections 260B.178, 260C.178, 260C.201, 260C.202, 260C.204, 260C.301, or 260C.503 to 260C.521, shall make findings and conclusions as to the provision of reasonable efforts. When determining whether reasonable efforts have been made by the agency, the court shall consider whether services to the child and family were:\n(1) selected in collaboration with the child's family and, if appropriate, the child;\n(2) tailored to the individualized needs of the child and child's family;\n(3) relevant to the safety, protection, and well-being of the child;\n(4) adequate to meet the individualized needs of the child and family;\n(5) culturally appropriate;\n(6) available and accessible;\n(7) consistent and timely; and\n(8) realistic under the circumstances.\nIn the alternative, the court may determine that the provision of services or further services for the purpose of rehabilitation is futile and therefore unreasonable under the circumstances or that reasonable efforts are not required as provided in paragraph (a).\n(i) This section does not prevent out-of-home placement for the treatment of a child with a mental disability when it is determined to be medically necessary as a result of the child's diagnostic assessment or the child's individual treatment plan indicates that appropriate and necessary treatment cannot be effectively provided outside of a residential or inpatient treatment program and the level or intensity of supervision and treatment cannot be effectively and safely provided in the child's home or community and it is determined that a residential treatment setting is the least restrictive setting that is appropriate to the needs of the child.\n(j) If continuation of reasonable efforts to prevent placement or reunify the child with the parent or guardian from whom the child was removed is determined by the court to be inconsistent with the permanent plan for the child or upon the court making one of the prima facie determinations under paragraph (a), reasonable efforts must be made to place the child in a timely manner in a safe and permanent home and to complete whatever steps are necessary to legally finalize the permanent placement of the child.\n(k) Reasonable efforts to place a child for adoption or in another permanent placement may be made concurrently with reasonable efforts to prevent placement or to reunify the child with the parent or guardian from whom the child was removed. When the responsible social services agency decides to concurrently make reasonable efforts for both reunification and permanent placement away from the parent under paragraph (a), the agency shall disclose the agency's decision and both plans for concurrent reasonable efforts to all parties and the court. When the agency discloses the agency's decision to proceed with both plans for reunification and permanent placement away from the parent, the court's review of the agency's reasonable efforts shall include the agency's efforts under both plans.",
	"repealed": false
}