{
	"id": "289A.37",
	"url": "https://www.revisor.mn.gov/statutes/cite/289A.37",
	"title": "289A.37 ASSESSMENTS; ERRONEOUS REFUNDS; JOINT INCOME TAX RETURNS.",
	"text": "[Repealed, 2005 c 151 art 1 s 117]\n(a) Except as provided in paragraph (b), an erroneous refund occurs when the commissioner issues a payment to a person that exceeds the amount the person is entitled to receive under law. An erroneous refund is considered an underpayment of tax on the date issued.\n(b) To the extent that the amount paid does not exceed the amount claimed by the taxpayer, an erroneous refund does not include the following:\n(1) any amount of a refund or credit paid pursuant to a claim for refund filed by a taxpayer, including but not limited to refunds of claims made under section 290.06, subdivision 23; 290.067; 290.0671; 290.0672; 290.0674; 290.0675; 290.0677; 290.068; 290.0681; or 290.0692; or chapter 290A; or\n(2) any amount paid pursuant to a claim for refund of an overpayment of tax filed by a taxpayer.\n(c) The commissioner may make an assessment to recover an erroneous refund at any time within two years from the issuance of the erroneous refund. If all or part of the erroneous refund was induced by fraud or misrepresentation of a material fact, the assessment may be made at any time.\n(d) Assessments of amounts that are not erroneous refunds under paragraph (b) must be conducted under sections 289A.38 to 289A.382.\n[Repealed, 2005 c 151 art 1 s 117]\n[Repealed, 2005 c 151 art 1 s 117]\n[Repealed, 2005 c 151 art 1 s 117]\nIf a joint income tax return is filed by spouses, an order of assessment may be a single joint notice. If the commissioner has been notified by either spouse that that spouse's address has changed and if that spouse requests it, then, instead of the single joint notice mailed to the last known address of the spouses, a duplicate or original of the joint notice must be sent to the requesting spouse at the address designated by the requesting spouse. The other joint notice must be mailed to the other spouse at that spouse's last known address. An assessment is not invalid for failure to send it to a spouse if the spouse actually receives the notice in the same period as if it had been mailed to that spouse at the correct address or if the spouse has failed to provide an address to the commissioner other than the last known address.",
	"repealed": false
}