{
	"id": "115B.05",
	"url": "https://www.revisor.mn.gov/statutes/cite/115B.05",
	"title": "115B.05 LIABILITY FOR ECONOMIC LOSS, DEATH, PERSONAL INJURY, AND DISEASE; LIMITATIONS AND DEFENSES.",
	"text": "Except as otherwise provided in subdivisions 2 to 10, and notwithstanding any other provision or rule of law, any person who is responsible for the release of a hazardous substance from a facility is strictly liable for the following damages which result from the release or to which the release significantly contributes:\n(1) all damages for actual economic loss including:\n(i) any injury to, destruction of, or loss of any real or personal property, including relocation costs;\n(ii) any loss of use of real or personal property;\n(iii) any loss of past or future income or profits resulting from injury to, destruction of, or loss of real or personal property without regard to the ownership of the property; and\n(2) all damages for death, personal injury, or disease including:\n(i) any medical expenses, rehabilitation costs or burial expenses;\n(ii) any loss of past or future income, or loss of earning capacity; and\n(iii) damages for pain and suffering, including physical impairment.\nThere is no liability under this section for damages which result from the release of a pollutant or contaminant.\nExcept for a third party who is subject to liability under section 176.061, subdivision 5, there is no liability under this section for the death, personal injury or disease of an employee which is compensable under chapter 176 as an injury or disease arising out of and in the course of employment.\nThe liability of a political subdivision under this section is subject to the limits imposed under section 466.04, subdivision 1.\nA person who accepts only household refuse for transport to a treatment or disposal facility is not liable under this section for the release or threatened release of any hazardous substance unless that person knew or reasonably should have known that the hazardous substance was present in the refuse. For the purpose of this subdivision, household refuse means garbage, trash, or septic tank sanitary wastes generated by single or multiple residences, hotels, motels, restaurants and other similar facilities.\n(a) It is a defense to liability under this section that the release or threatened release was caused solely by:\n(1) an act of God;\n(2) an act of war;\n(3) an act of vandalism or sabotage; or\n(4) an act or omission of a third party or the plaintiff.\n(b) \"Third party\" for the purposes of paragraph (a), clause (4), does not include an employee or agent of the defendant, or a person in the chain of responsibility for the generation, transportation, storage, treatment, or disposal of the hazardous substance.\n(c) The defenses provided in paragraph (a), clauses (3) and (4), apply only if the defendant establishes that the defendant exercised due care with respect to the hazardous substance concerned, taking into consideration the characteristics of the hazardous substance in light of all relevant facts and circumstances which the defendant knew or should have known, and that the defendant took precautions against foreseeable acts or omissions and the consequences that could foreseeably result from those acts or omissions.\nWhen the agency or the federal Environmental Protection Agency assumes control over any release or threatened release of a hazardous substance by taking removal actions at the site of the release, the persons responsible for the release are not liable under sections 115B.01 to 115B.15 for any subsequent release of the hazardous substance from another facility to which it has been removed.\nIt is a defense to liability under this section that:\n(1) the release or threatened release was from a hazardous waste facility as defined under section 115A.03, for which a permit had been issued pursuant to section 116.07 or pursuant to subtitle C of the Solid Waste Disposal Act, United States Code, title 42, section 6921 et seq., the hazardous substance was specifically identified in the permit, and the release was within the limits allowed in the permit for release of that substance;\n(2) the hazardous substance released was specifically identified in a federal or state permit and the release is within the limits allowed in the permit;\n(3) the release resulted from circumstances identified and reviewed and made a part of the public record of a federal or state agency with respect to a permit issued or modified under federal or state law, and the release conformed with the permit;\n(4) the release was any part of an emission or discharge into the air or water and the emission or discharge was subject to a federal or state permit and was in compliance with control rules or regulations adopted pursuant to state or federal law;\n(5) the release was the introduction of any hazardous substance into a publicly owned treatment works and the substance was specified in, and is in compliance with, applicable pretreatment standards specified for that substance under state and federal law; or\n(6) liability has been assumed by the federal postclosure liability fund under United States Code, title 42, section 9607(k).\nIt is a defense to liability under this section that the damages resulted from acts taken or omitted in preparation for, or in the course of rendering care, assistance, or advice to the commissioner or agency pursuant to section 115B.17 or in accordance with the national hazardous substance response plan pursuant to the federal Superfund Act, under United States Code, title 42, section 9605, or at the direction of an on-scene coordinator appointed under that plan, with respect to any release or threatened release of a hazardous substance.\nAny person claiming a defense provided in subdivisions 6 to 9 has the burden to prove all elements of the defense by a preponderance of the evidence.",
	"repealed": false
}