{
	"id": "148.645",
	"url": "https://www.revisor.mn.gov/statutes/cite/148.645",
	"title": "148.645 OCCUPATIONAL THERAPY LICENSURE COMPACT.",
	"text": "ARTICLE I\nTITLE\nThis statute shall be known and cited as the occupational therapist licensure compact.\nARTICLE II\nDEFINITIONS\nAs used in this compact, and except as otherwise provided, the following definitions shall apply:\n(A) \"Active duty military\" means full-time duty status in the active uniformed service of the United States, including members of the National Guard and Reserve on active duty orders pursuant to United States Code, title 10, sections 1209 and 1211.\n(B) \"Adverse action\" means any administrative, civil, equitable, or criminal action permitted by a state's laws which is imposed by a licensing board or other authority against an occupational therapist or occupational therapy assistant, including actions against an individual's license or compact privilege such as censure, revocation, suspension, probation, monitoring of the licensee, or restriction on the licensee's practice.\n(C) \"Alternative program\" means a nondisciplinary monitoring process approved by an occupational therapy licensing board.\n(D) \"Compact privilege\" means the authorization, which is equivalent to a license, granted by a remote state to allow a licensee from another member state to practice as an occupational therapist or practice as an occupational therapy assistant in the remote state under its laws and rules. The practice of occupational therapy occurs in the member state where the patient or client is located at the time of the patient or client encounter.\n(E) \"Continuing competence\" or \"continuing education\" means a requirement, as a condition of license renewal, to provide evidence of participation in, and completion of, educational and professional activities relevant to practice or area of work.\n(F) \"Current significant investigative information\" means investigative information that a licensing board, after an inquiry or investigation that includes notification and an opportunity for the occupational therapist or occupational therapy assistant to respond, if required by state law, has reason to believe is not groundless and, if proven true, would indicate more than a minor infraction.\n(G) \"Data system\" means a repository of information about licensees, including but not limited to license status, investigative information, compact privileges, and adverse actions.\n(H) \"Encumbered license\" means a license in which an adverse action restricts the practice of occupational therapy by the licensee or said adverse action has been reported to the National Practitioners Data Bank (NPDB).\n(I) \"Executive committee\" means a group of directors elected or appointed to act on behalf of, and within the powers granted to them by, the commission.\n(J) \"Home state\" means the member state that is the licensee's primary state of residence.\n(K) \"Impaired practitioner\" means an individual whose professional practice is adversely affected by substance abuse, addiction, or other health-related conditions.\n(L) \"Investigative information\" means information, records, or documents received or generated by an occupational therapy licensing board pursuant to an investigation.\n(M) \"Jurisprudence requirement\" means the assessment of an individual's knowledge of the laws and rules governing the practice of occupational therapy in a state.\n(N) \"Licensee\" means an individual who currently holds an authorization from the state to practice as an occupational therapist or as an occupational therapy assistant.\n(O) \"Member state\" means a state that has enacted the compact.\n(P) \"Occupational therapist\" means an individual who is licensed by a state to practice occupational therapy.\n(Q) \"Occupational therapy assistant\" means an individual who is licensed by a state to assist in the practice of occupational therapy.\n(R) \"Occupational therapy,\" \"occupational therapy practice,\" and \"the practice of occupational therapy\" mean the care and services provided by an occupational therapist or an occupational therapy assistant as set forth in the member state's statutes and regulations.\n(S) \"Occupational therapy compact commission\" or \"commission\" means the national administrative body whose membership consists of all states that have enacted the compact.\n(T) \"Occupational therapy licensing board\" or \"licensing board\" means the agency of a state that is authorized to license and regulate occupational therapists and occupational therapy assistants.\n(U) \"Primary state of residence\" means the state, also known as the home state, in which an occupational therapist or occupational therapy assistant who is not active duty military declares a primary residence for legal purposes as verified by driver's license, federal income tax return, lease, deed, mortgage, or voter registration or other verifying documentation as further defined by commission rules.\n(V) \"Remote state\" means a member state other than the home state where a licensee is exercising or seeking to exercise the compact privilege.\n(W) \"Rule\" means a regulation promulgated by the commission that has the force of law.\n(X) \"State\" means any state, commonwealth, district, or territory of the United States of America that regulates the practice of occupational therapy.\n(Y) \"Single-state license\" means an occupational therapist or occupational therapy assistant license issued by a member state that authorizes practice only within the issuing state and does not include a compact privilege in any other member state.\n(Z) \"Telehealth\" means the application of telecommunication technology to deliver occupational therapy services for assessment, intervention, or consultation.\nARTICLE III\nSTATE PARTICIPATION IN THE COMPACT\n(A) To participate in the compact, a member state shall:\n(1) license occupational therapists and occupational therapy assistants;\n(2) participate fully in the commission's data system, including but not limited to using the commission's unique identifier as defined in rules of the commission;\n(3) have a mechanism in place for receiving and investigating complaints about licensees;\n(4) notify the commission, in compliance with the terms of the compact and rules, of any adverse action or the availability of investigative information regarding a licensee;\n(5) implement or utilize procedures for considering the criminal history records of applicants for an initial compact privilege. These procedures shall include the submission of fingerprints or other biometric-based information by applicants for the purpose of obtaining an applicant's criminal history record information from the Federal Bureau of Investigation and the agency responsible for retaining that state's criminal records;\n(i) A member state shall, within a time frame established by the commission, require a criminal background check for a licensee seeking or applying for a compact privilege whose primary state of residence is that member state by receiving the results of the Federal Bureau of Investigation criminal record search, and shall use the results in making licensure decisions.\n(ii) Communication between a member state, the commission, and among member states regarding the verification of eligibility for licensure through the compact shall not include any information received from the Federal Bureau of Investigation relating to a federal criminal records check performed by a member state under Public Law 92-544;\n(6) comply with the rules of the commission;\n(7) utilize only a recognized national examination as a requirement for licensure pursuant to the rules of the commission; and\n(8) have continuing competence or education requirements as a condition for license renewal.\n(B) A member state shall grant the compact privilege to a licensee holding a valid unencumbered license in another member state in accordance with the terms of the compact and rules.\n(C) Member states may charge a fee for granting a compact privilege.\n(D) A member state shall provide for the state's delegate to attend all occupational therapy compact commission meetings.\n(E) Individuals not residing in a member state shall continue to be able to apply for a member state's single-state license as provided under the laws of each member state. However, the single-state license granted to these individuals shall not be recognized as granting the compact privilege in any other member state.\n(F) Nothing in this compact shall affect the requirements established by a member state for the issuance of a single-state license.\nARTICLE IV\nCOMPACT PRIVILEGE\n(A) To exercise the compact privilege under the terms and provisions of the compact, the licensee shall:\n(1) hold a license in the home state;\n(2) have a valid United States Social Security number or national practitioner identification number;\n(3) have no encumbrance on any state license;\n(4) be eligible for a compact privilege in any member state in accordance with Article IV, (D), (F), (G), and (H);\n(5) have paid all fines and completed all requirements resulting from any adverse action against any license or compact privilege, and two years have elapsed from the date of such completion;\n(6) notify the commission that the licensee is seeking the compact privilege within a remote state or states;\n(7) pay any applicable fees, including any state fee, for the compact privilege;\n(8) complete a criminal background check in accordance with Article III, (A)(5). The licensee shall be responsible for the payment of any fee associated with the completion of a criminal background check;\n(9) meet any jurisprudence requirements established by the remote state or states in which the licensee is seeking a compact privilege; and\n(10) report to the commission adverse action taken by any nonmember state within 30 days from the date the adverse action is taken.\n(B) The compact privilege is valid until the expiration date of the home state license. The licensee must comply with the requirements of Article IV, (A), to maintain the compact privilege in the remote state.\n(C) A licensee providing occupational therapy in a remote state under the compact privilege shall function within the laws and regulations of the remote state.\n(D) Occupational therapy assistants practicing in a remote state shall be supervised by an occupational therapist licensed or holding a compact privilege in that remote state.\n(E) A licensee providing occupational therapy in a remote state is subject to that state's regulatory authority. A remote state may, in accordance with due process and that state's laws, remove a licensee's compact privilege in the remote state for a specific period of time, impose fines, or take any other necessary actions to protect the health and safety of its citizens. The licensee may be ineligible for a compact privilege in any state until the specific time for removal has passed and all fines are paid.\n(F) If a home state license is encumbered, the licensee shall lose the compact privilege in any remote state until the following occur:\n(1) the home state license is no longer encumbered; and\n(2) two years have elapsed from the date on which the home state license is no longer encumbered in accordance with Article IV, (F)(1).\n(G) Once an encumbered license in the home state is restored to good standing, the licensee must meet the requirements of Article IV, (A), to obtain a compact privilege in any remote state.\n(H) If a licensee's compact privilege in any remote state is removed, the individual may lose the compact privilege in any other remote state until the following occur:\n(1) the specific period of time for which the compact privilege was removed has ended;\n(2) all fines have been paid and all conditions have been met;\n(3) two years have elapsed from the date of completing requirements for Article IV, (H)(1) and (2); and\n(4) the compact privileges are reinstated by the commission and the compact data system is updated to reflect reinstatement.\n(I) If a licensee's compact privilege in any remote state is removed due to an erroneous charge, privileges shall be restored through the compact data system.\n(J) Once the requirements of Article IV, (H), have been met, the licensee must meet the requirements in Article IV, (A), to obtain a compact privilege in a remote state.\nARTICLE V\nOBTAINING A NEW HOME STATE LICENSE BY VIRTUE OF COMPACT PRIVILEGE\n(A) An occupational therapist or occupational therapy assistant may hold a home state license, which allows for compact privileges in member states, in only one member state at a time.\n(B) If an occupational therapist or occupational therapy assistant changes their primary state of residence by moving between two member states:\n(1) the occupational therapist or occupational therapy assistant shall file an application for obtaining a new home state license by virtue of a compact privilege, pay all applicable fees, and notify the current and new home state in accordance with applicable rules adopted by the commission;\n(2) upon receipt of an application for obtaining a new home state license by virtue of compact privilege, the new home state shall verify that the occupational therapist or occupational therapy assistant meets the pertinent criteria outlined in Article IV via the data system, without need for primary source verification except for:\n(i) an FBI fingerprint-based criminal background check if not previously performed or updated pursuant to applicable rules adopted by the commission in accordance with Public Law 92-544;\n(ii) other criminal background checks as required by the new home state; and\n(iii) submission of any requisite jurisprudence requirements of the new home state;\n(3) the former home state shall convert the former home state license into a compact privilege once the new home state has activated the new home state license in accordance with applicable rules adopted by the commission;\n(4) notwithstanding any other provision of this compact, if the occupational therapist or occupational therapy assistant cannot meet the criteria in Article IV, the new home state shall apply its requirements for issuing a new single-state license; and\n(5) the occupational therapist or the occupational therapy assistant shall pay all applicable fees to the new home state in order to be issued a new home state license.\n(C) If an occupational therapist or occupational therapy assistant changes their primary state of residence by moving from a member state to a nonmember state, or from a nonmember state to a member state, the state criteria shall apply for issuance of a single-state license in the new state.\n(D) Nothing in this compact shall interfere with a licensee's ability to hold a single-state license in multiple states; however, for the purposes of this compact, a licensee shall have only one home state license.\n(E) Nothing in this compact shall affect the requirements established by a member state for the issuance of a single-state license.\nARTICLE VI\nACTIVE DUTY MILITARY PERSONNEL OR THEIR SPOUSES\nActive duty military personnel, or their spouses, shall designate a home state where the individual has a current license in good standing. The individual may retain the home state designation during the period the service member is on active duty. Subsequent to designating a home state, the individual shall only change their home state through application for licensure in the new state or through the process described in Article V.\nARTICLE VII\nADVERSE ACTIONS\n(A) A home state shall have exclusive power to impose adverse action against an occupational therapist's or occupational therapy assistant's license issued by the home state.\n(B) In addition to the other powers conferred by state law, a remote state shall have the authority, in accordance with existing state due process law, to:\n(1) take adverse action against an occupational therapist's or occupational therapy assistant's compact privilege within that member state; and\n(2) issue subpoenas for both hearings and investigations that require the attendance and testimony of witnesses as well as the production of evidence. Subpoenas issued by a licensing board in a member state for the attendance and testimony of witnesses or the production of evidence from another member state shall be enforced in the latter state by any court of competent jurisdiction, according to the practice and procedure of that court applicable to subpoenas issued in proceedings pending before that court. The issuing authority shall pay any witness fees, travel expenses, mileage, and other fees required by the service statutes of the state in which the witnesses or evidence are located.\n(C) For purposes of taking adverse action, the home state shall give the same priority and effect to reported conduct received from a member state as it would if the conduct had occurred within the home state. In so doing, the home state shall apply its own state laws to determine appropriate action.\n(D) The home state shall complete any pending investigations of an occupational therapist or occupational therapy assistant who changes their primary state of residence during the course of the investigations. The home state, where the investigations were initiated, shall also have the authority to take appropriate action and shall promptly report the conclusions of the investigations to the compact commission data system. The occupational therapy compact commission data system administrator shall promptly notify the new home state of any adverse actions.\n(E) A member state, if otherwise permitted by state law, may recover from the affected occupational therapist or occupational therapy assistant the costs of investigations and disposition of cases resulting from any adverse action taken against that occupational therapist or occupational therapy assistant.\n(F) A member state may take adverse action based on the factual findings of the remote state, provided that the member state follows its own procedures for taking the adverse action.\n(G) Joint Investigations:\n(1) In addition to the authority granted to a member state by its respective state occupational therapy laws and regulations or other applicable state law, any member state may participate with other member states in joint investigations of licensees.\n(2) Member states shall share any investigative, litigation, or compliance materials in furtherance of any joint or individual investigation initiated under the compact.\n(H) If an adverse action is taken by the home state against an occupational therapist's or occupational therapy assistant's license, the occupational therapist's or occupational therapy assistant's compact privilege in all other member states shall be deactivated until all encumbrances have been removed from the state license. All home state disciplinary orders that impose adverse action against an occupational therapist's or occupational therapy assistant's license shall include a statement that the occupational therapist's or occupational therapy assistant's compact privilege is deactivated in all member states during the pendency of the order.\n(I) If a member state takes adverse action, the member state shall promptly notify the administrator of the data system. The administrator of the data system shall promptly notify the home state of any adverse actions by remote states.\n(J) Nothing in this compact shall override a member state's decision that participation in an alternative program may be used in lieu of adverse action.\nARTICLE VIII\nESTABLISHMENT OF THE OCCUPATIONAL THERAPY COMPACT COMMISSION\n(A) The compact member states hereby create and establish a joint public agency known as the occupational therapy compact commission:\n(1) The commission is an instrumentality of the compact states.\n(2) Except as provided under paragraph (I), venue is proper and judicial proceedings by or against the commission shall be brought solely and exclusively in a court of competent jurisdiction where the principal office of the commission is located. The commission may waive venue and jurisdictional defenses to the extent it adopts or consents to participate in alternative dispute resolution proceedings.\n(3) Nothing in this compact shall be construed to be a waiver of sovereign immunity.\n(B) Membership, Voting, and Meetings:\n(1) Each member state shall have and be limited to one delegate selected by that member state's licensing board.\n(2) The delegate shall be either:\n(i) a current member of the licensing board who is an occupational therapist, occupational therapy assistant, or public member; or\n(ii) an administrator of the licensing board.\n(3) Any delegate may be removed or suspended from office as provided by the law of the state from which the delegate is appointed.\n(4) The member state board shall fill any vacancy occurring in the commission within 90 days.\n(5) Each delegate shall be entitled to one vote with regard to the promulgation of rules and creation of bylaws and shall otherwise have an opportunity to participate in the business and affairs of the commission. A delegate shall vote in person or by such other means as provided in the bylaws. The bylaws may provide for delegates' participation in meetings by telephone or other means of communication.\n(6) The commission shall meet at least once during each calendar year. Additional meetings shall be held as set forth in the bylaws.\n(7) The commission shall establish by rule a term of office for delegates.\n(C) The commission shall have the following powers and duties:\n(1) establish a code of ethics for the commission;\n(2) establish the fiscal year of the commission;\n(3) establish bylaws;\n(4) maintain its financial records in accordance with the bylaws;\n(5) meet and take such actions as are consistent with the provisions of this compact and the bylaws;\n(6) promulgate uniform rules to facilitate and coordinate implementation and administration of this compact. The rules shall have the force and effect of law and shall be binding in all member states;\n(7) bring and prosecute legal proceedings or actions in the name of the commission, provided that the standing of any state occupational therapy licensing board to sue or be sued under applicable law shall not be affected;\n(8) purchase and maintain insurance and bonds;\n(9) borrow, accept, or contract for services of personnel, including but not limited to employees of a member state;\n(10) hire employees, elect or appoint officers, fix compensation, define duties, grant such individuals appropriate authority to carry out the purposes of the compact, and establish the commission's personnel policies and programs relating to conflicts of interest, qualifications of personnel, and other related personnel matters;\n(11) accept any and all appropriate donations and grants of money, equipment, supplies, materials, and services, and receive, utilize, and dispose of the same; provided that at all times the commission shall avoid any appearance of impropriety or conflict of interest;\n(12) lease, purchase, accept appropriate gifts or donations of, or otherwise own, hold, improve, or use any property, real, personal, or mixed; provided that at all times the commission shall avoid any appearance of impropriety;\n(13) sell, convey, mortgage, pledge, lease, exchange, abandon, or otherwise dispose of any property real, personal, or mixed;\n(14) establish a budget and make expenditures;\n(15) borrow money;\n(16) appoint committees, including standing committees composed of members, state regulators, state legislators or their representatives, and consumer representatives, and other interested persons as may be designated in this compact and the bylaws;\n(17) provide and receive information from, and cooperate with, law enforcement agencies;\n(18) establish and elect an executive committee; and\n(19) perform other functions as may be necessary or appropriate to achieve the purposes of this compact consistent with the state regulation of occupational therapy licensure and practice.\n(D) The Executive Committee:\n(1) The executive committee shall have the power to act on behalf of the commission according to the terms of this compact.\n(2) The executive committee shall be composed of nine members:\n(i) seven voting members who are elected by the commission from the current membership of the commission;\n(ii) one ex-officio, nonvoting member from a recognized national occupational therapy professional association; and\n(iii) one ex-officio, nonvoting member from a recognized national occupational therapy certification organization.\n(3) The ex-officio members will be selected by their respective organizations.\n(4) The commission may remove any member of the executive committee as provided in the bylaws.\n(5) The executive committee shall meet at least annually.\n(6) The executive committee shall have the following duties and responsibilities:\n(i) recommend to the entire commission changes to the rules or bylaws, changes to this compact legislation, fees paid by compact member states such as annual dues, and any commission compact fee charged to licensees for the compact privilege;\n(ii) ensure compact administration services are appropriately provided, contractual or otherwise;\n(iii) prepare and recommend the budget;\n(iv) maintain financial records on behalf of the commission;\n(v) monitor compact compliance of member states and provide compliance reports to the commission;\n(vi) establish additional committees as necessary; and\n(vii) perform other duties as provided in rules or bylaws.\n(E) Meetings of the Commission:\n(1) All meetings shall be open to the public, and public notice of meetings shall be given in the same manner as required under the rulemaking provisions in Article X.\n(2) The commission or the executive committee or other committees of the commission may convene in a closed, nonpublic meeting if the commission or executive committee or other committees of the commission must discuss:\n(i) noncompliance of a member state with its obligations under the compact;\n(ii) the employment, compensation, discipline, or other matters, practices, or procedures related to specific employees or other matters related to the commission's internal personnel practices and procedures;\n(iii) current, threatened, or reasonably anticipated litigation;\n(iv) negotiation of contracts for the purchase, lease, or sale of goods, services, or real estate;\n(v) accusing any person of a crime or formally censuring any person;\n(vi) disclosure of trade secrets or commercial or financial information that is privileged or confidential;\n(vii) disclosure of information of a personal nature where disclosure would constitute a clearly unwarranted invasion of personal privacy;\n(viii) disclosure of investigative records compiled for law enforcement purposes;\n(ix) disclosure of information related to any investigative reports prepared by or on behalf of or for use of the commission or other committee charged with responsibility of investigation or determination of compliance issues pursuant to the compact; or\n(x) matters specifically exempted from disclosure by federal or member state statute.\n(3) If a meeting, or portion of a meeting, is closed pursuant to this provision, the commission's legal counsel or designee shall certify that the meeting may be closed and shall reference each relevant exempting provision.\n(4) The commission shall keep minutes that fully and clearly describe all matters discussed in a meeting and shall provide a full and accurate summary of actions taken, and the reasons therefore, including a description of the views expressed. All documents considered in connection with an action shall be identified in such minutes. All minutes and documents of a closed meeting shall remain under seal, subject to release by a majority vote of the commission or order of a court of competent jurisdiction.\n(F) Financing of the Commission:\n(1) The commission shall pay, or provide for the payment of, the reasonable expenses of its establishment, organization, and ongoing activities.\n(2) The commission may accept any and all appropriate revenue sources, donations, and grants of money, equipment, supplies, materials, and services.\n(3) The commission may levy on and collect an annual assessment from each member state or impose fees on other parties to cover the cost of the operations and activities of the commission and its staff, which must be in a total amount sufficient to cover its annual budget as approved by the commission each year for which revenue is not provided by other sources. The aggregate annual assessment amount shall be allocated based upon a formula to be determined by the commission, which shall promulgate a rule binding upon all member states.\n(4) The commission shall not incur obligations of any kind prior to securing the funds adequate to meet the same; nor shall the commission pledge the credit of any of the member states, except by and with the authority of the member state.\n(5) The commission shall keep accurate accounts of all receipts and disbursements. The receipts and disbursements of the commission shall be subject to the audit and accounting procedures established under its bylaws. However, all receipts and disbursements of funds handled by the commission shall be audited yearly by a certified or licensed public accountant, and the report of the audit shall be included in and become part of the annual report of the commission.\n(G) Qualified Immunity, Defense, and Indemnification:\n(1) The members, officers, executive director, employees, and representatives of the commission shall be immune from suit and liability, either personally or in their official capacity, for any claim for damage to or loss of property or personal injury or other civil liability caused by or arising out of any actual or alleged act, error, or omission that occurred, or that the person against whom the claim is made had a reasonable basis for believing occurred within the scope of commission employment, duties, or responsibilities; provided that nothing in this paragraph shall be construed to protect any such person from suit or liability for any damage, loss, injury, or liability caused by the intentional or willful or wanton misconduct of that person.\n(2) The commission shall defend any member, officer, executive director, employee, or representative of the commission in any civil action seeking to impose liability arising out of any actual or alleged act, error, or omission that occurred within the scope of commission employment, duties, or responsibilities, or that the person against whom the claim is made had a reasonable basis for believing occurred within the scope of commission employment, duties, or responsibilities; provided that nothing herein shall be construed to prohibit that person from retaining their own counsel; and provided further, that the actual or alleged act, error, or omission did not result from that person's intentional or willful or wanton misconduct.\n(3) The commission shall indemnify and hold harmless any member, officer, executive director, employee, or representative of the commission for the amount of any settlement or judgment obtained against that person arising out of any actual or alleged act, error, or omission that occurred within the scope of commission employment, duties, or responsibilities, or that such person had a reasonable basis for believing occurred within the scope of commission employment, duties, or responsibilities; provided that the actual or alleged act, error, or omission did not result from the intentional or willful or wanton misconduct of that person.\n(H) Notwithstanding paragraph (G), clause (1), the liability of the executive director, employees, or representatives of the interstate commission, acting within the scope of their employment or duties, may not exceed the limits of liability set forth under the constitution and laws of this state for state officials, employees, and agents. This paragraph expressly incorporates section 3.736, and neither expands nor limits the rights and remedies provided under that statute.\n(I) Except for a claim alleging a violation of this compact, a claim against the commission, its executive director, employees, or representatives alleging a violation of the constitution and laws of this state may be brought in any county where the plaintiff resides. Nothing in this paragraph creates a private right of action.\n(J) Nothing in this compact shall be construed as a limitation on the liability of any licensee for professional malpractice or misconduct, which shall be governed solely by any other applicable state laws.\nARTICLE IX\nDATA SYSTEM\n(A) The commission shall provide for the development, maintenance, and utilization of a coordinated database and reporting system containing licensure, adverse action, and investigative information on all licensed individuals in member states.\n(B) A member state shall submit a uniform data set to the data system on all individuals to whom this compact is applicable, utilizing a unique identifier, as required by the rules of the commission, including:\n(1) identifying information;\n(2) licensure data;\n(3) adverse actions against a license or compact privilege;\n(4) nonconfidential information related to alternative program participation;\n(5) any denial of application for licensure and the reason or reasons for such denial;\n(6) other information that may facilitate the administration of this compact, as determined by the rules of the commission; and\n(7) current significant investigative information.\n(C) Current significant investigative information and other investigative information pertaining to a licensee in any member state will only be available to other member states.\n(D) The commission shall promptly notify all member states of any adverse action taken against a licensee or an individual applying for a license. Adverse action information pertaining to a licensee in any member state will be available to any other member state.\n(E) Member states contributing information to the data system may designate information that may not be shared with the public without the express permission of the contributing state.\n(F) Any information submitted to the data system that is subsequently required to be expunged by the laws of the member state contributing the information shall be removed from the data system.\nARTICLE X\nRULEMAKING\n(A) The commission shall exercise its rulemaking powers pursuant to the criteria set forth in this Article and the rules adopted thereunder. Rules and amendments shall become binding as of the date specified in each rule or amendment.\n(B) The commission shall promulgate reasonable rules in order to effectively and efficiently achieve the purposes of the compact. Notwithstanding the foregoing, in the event the commission exercises its rulemaking authority in a manner that is beyond the scope of the purposes of the compact, or the powers granted hereunder, then such an action by the commission shall be invalid and have no force and effect.\n(C) If a majority of the legislatures of the member states rejects a rule, by enactment of a statute or resolution in the same manner used to adopt the compact within four years of the date of adoption of the rule, then such rule shall have no further force and effect in any member state.\n(D) Rules or amendments to the rules shall be adopted at a regular or special meeting of the commission.\n(E) Prior to promulgation and adoption of a final rule or rules by the commission, and at least 30 days in advance of the meeting at which the rule will be considered and voted upon, the commission shall file a notice of proposed rulemaking:\n(1) on the website of the commission or other publicly accessible platform; and\n(2) on the website of each member state occupational therapy licensing board or other publicly accessible platform or the publication in which each state would otherwise publish proposed rules.\n(F) The notice of proposed rulemaking shall include:\n(1) the proposed time, date, and location of the meeting in which the rule will be considered and voted upon;\n(2) the text of the proposed rule or amendment and the reason for the proposed rule;\n(3) a request for comments on the proposed rule from any interested person; and\n(4) the manner in which interested persons may submit notice to the commission of their intention to attend the public hearing and any written comments.\n(G) Prior to adoption of a proposed rule, the commission shall allow persons to submit written data, facts, opinions, and arguments, which shall be made available to the public.\n(H) The commission shall grant an opportunity for a public hearing before it adopts a rule or amendment if a hearing is requested by:\n(1) at least 25 persons;\n(2) a state or federal governmental subdivision or agency; or\n(3) an association or organization having at least 25 members.\n(I) If a hearing is held on the proposed rule or amendment, the commission shall publish the place, time, and date of the scheduled public hearing. If the hearing is held via electronic means, the commission shall publish the mechanism for access to the electronic hearing:\n(1) All persons wishing to be heard at the hearing shall notify the executive director of the commission or other designated member in writing of their desire to appear and testify at the hearing not less than five business days before the scheduled date of the hearing.\n(2) Hearings shall be conducted in a manner providing each person who wishes to comment a fair and reasonable opportunity to comment orally or in writing.\n(3) All hearings will be recorded. A copy of the recording will be made available on request.\n(4) Nothing in this Article shall be construed as requiring a separate hearing on each rule. Rules may be grouped for the convenience of the commission at hearings required by this Article.\n(J) Following the scheduled hearing date, or by the close of business on the scheduled hearing date if the hearing was not held, the commission shall consider all written and oral comments received.\n(K) If no written notice of intent to attend the public hearing by interested parties is received, the commission may proceed with promulgation of the proposed rule without a public hearing.\n(L) The commission shall, by majority vote of all members, take final action on the proposed rule and shall determine the effective date of the rule, if any, based on the rulemaking record and the full text of the rule.\n(M) Upon determination that an emergency exists, the commission may consider and adopt an emergency rule without prior notice, opportunity for comment, or hearing; provided that the usual rulemaking procedures provided in the compact and in this Article shall be retroactively applied to the rule as soon as reasonably possible, in no event later than 90 days after the effective date of the rule. For the purposes of this provision, an emergency rule is one that must be adopted immediately in order to:\n(1) meet an imminent threat to public health, safety, or welfare;\n(2) prevent a loss of commission or member state funds;\n(3) meet a deadline for the promulgation of an administrative rule that is established by federal law or rule; or\n(4) protect public health and safety.\n(N) The commission or an authorized committee of the commission may direct revisions to a previously adopted rule or amendment for purposes of correcting typographical errors, errors in format, errors in consistency, or grammatical errors. Public notice of any revisions shall be posted on the website of the commission. The revision shall be subject to challenge by any person for a period of 30 days after posting. The revision may be challenged only on grounds that the revision results in a material change to a rule. A challenge shall be made in writing and delivered to the chair of the commission prior to the end of the notice period. If no challenge is made, the revision will take effect without further action. If the revision is challenged, the revision may not take effect without the approval of the commission.\nARTICLE XI\nOVERSIGHT, DISPUTE RESOLUTION, AND ENFORCEMENT\n(A) Oversight:\n(1) The executive, legislative, and judicial branches of state government in each member state shall enforce this compact and take all actions necessary and appropriate to effectuate the compact's purposes and intent. The provisions of this compact and the rules promulgated hereunder shall have standing as statutory law.\n(2) All courts shall take judicial notice of the compact and the rules in any judicial or administrative proceeding in a member state pertaining to the subject matter of this compact which may affect the powers, responsibilities, or actions of the commission.\n(3) The commission shall be entitled to receive service of process in any such proceeding, and shall have standing to intervene in such a proceeding for all purposes. Failure to provide service of process to the commission shall render a judgment or order void as to the commission, this compact, or promulgated rules.\n(B) Default, Technical Assistance, and Termination:\n(1) If the commission determines that a member state has defaulted in the performance of its obligations or responsibilities under this compact or the promulgated rules, the commission shall:\n(i) provide written notice to the defaulting state and other member states of the nature of the default, the proposed means of curing the default, or any other action to be taken by the commission; and\n(ii) provide remedial training and specific technical assistance regarding the default.\n(2) If a state in default fails to cure the default, the defaulting state may be terminated from the compact upon an affirmative vote of a majority of the member states, and all rights, privileges, and benefits conferred by this compact may be terminated on the effective date of termination. A cure of the default does not relieve the offending state of obligations or liabilities incurred during the period of default.\n(3) Termination of membership in the compact shall be imposed only after all other means of securing compliance have been exhausted. Notice of intent to suspend or terminate shall be given by the commission to the governor, the majority and minority leaders of the defaulting state's legislature, and each of the member states.\n(4) A state that has been terminated is responsible for all assessments, obligations, and liabilities incurred through the effective date of termination, including obligations that extend beyond the effective date of termination.\n(5) The commission shall not bear any costs related to a state that is found to be in default or that has been terminated from the compact, unless agreed upon in writing between the commission and the defaulting state.\n(6) The defaulting state may appeal the action of the commission by petitioning the United States District Court for the District of Columbia or the federal district where the commission has its principal offices. The prevailing member shall be awarded all costs of such litigation, including reasonable attorney fees.\n(C) Dispute Resolution:\n(1) Upon request by a member state, the commission shall attempt to resolve disputes related to the compact that arise among member states and between member and nonmember states.\n(2) The commission shall promulgate a rule providing for both mediation and binding dispute resolution for disputes as appropriate.\n(D) Enforcement:\n(1) The commission, in the reasonable exercise of its discretion, shall enforce the provisions and rules of this compact.\n(2) By majority vote, the commission may initiate legal action in the United States District Court for the District of Columbia or the federal district where the commission has its principal offices against a member state in default to enforce compliance with the provisions of the compact and its promulgated rules and bylaws. The relief sought may include both injunctive relief and damages. In the event that judicial enforcement is necessary, the prevailing member shall be awarded all costs of such litigation, including reasonable attorney fees.\n(3) The remedies herein shall not be the exclusive remedies of the commission. The commission may pursue any other remedies available under federal or state law.\nARTICLE XII\nDATE OF IMPLEMENTATION OF THE INTERSTATE COMMISSION FOR OCCUPATIONAL THERAPY PRACTICE AND ASSOCIATED RULES, WITHDRAWAL, AND AMENDMENT\n(A) The compact shall come into effect on the date on which the compact statute is enacted into law in the tenth member state. The provisions, which become effective at that time, shall be limited to the powers granted to the commission relating to assembly and the promulgation of rules. Thereafter, the commission shall meet and exercise rulemaking powers necessary to the implementation and administration of the compact.\n(B) Any state that joins the compact subsequent to the commission's initial adoption of the rules shall be subject to the rules as they exist on the date on which the compact becomes law in that state. Any rule that has been previously adopted by the commission shall have the full force and effect of law on the day the compact becomes law in that state.\n(C) Any member state may withdraw from this compact by enacting a statute repealing the same:\n(1) A member state's withdrawal shall not take effect until six months after enactment of the repealing statute.\n(2) Withdrawal shall not affect the continuing requirement of the withdrawing state's occupational therapy licensing board to comply with the investigative and adverse action reporting requirements of this compact prior to the effective date of withdrawal.\n(D) Nothing contained in this compact shall be construed to invalidate or prevent any occupational therapy licensure agreement or other cooperative arrangement between a member state and a nonmember state that does not conflict with the provisions of this compact.\n(E) This compact may be amended by the member states. No amendment to this compact shall become effective and binding upon any member state until it is enacted into the laws of all member states.\nARTICLE XIII\nCONSTRUCTION AND SEVERABILITY\nThis compact shall be liberally construed so as to effectuate the purposes thereof. The provisions of this compact shall be severable and if any phrase, clause, sentence, or provision of this compact is declared to be contrary to the constitution of any member state or of the United States or the applicability thereof to any government, agency, person, or circumstance is held invalid, the validity of the remainder of this compact and the applicability thereof to any government, agency, person, or circumstance shall not be affected thereby. If this compact shall be held contrary to the constitution of any member state, the compact shall remain in full force and effect as to the remaining member states and in full force and effect as to the member state affected as to all severable matters.\nARTICLE XIV\nBINDING EFFECT OF COMPACT AND OTHER LAWS\n(A) A licensee providing occupational therapy in a remote state under the compact privilege shall function within the laws and regulations of the remote state.\n(B) Nothing herein prevents the enforcement of any other law of a member state that is not inconsistent with the compact.\n(C) Any laws in a member state in conflict with the compact are superseded to the extent of the conflict.\n(D) Any lawful actions of the commission, including all rules and bylaws promulgated by the commission, are binding upon the member states.\n(E) All agreements between the commission and the member states are binding in accordance with their terms.\n(F) In the event any provision of the compact exceeds the constitutional limits imposed on the legislature of any member state, the provision shall be ineffective to the extent of the conflict with the constitutional provision in question in that member state.",
	"repealed": false
}