{
	"id": "171.019",
	"url": "https://www.revisor.mn.gov/statutes/cite/171.019",
	"title": "171.019 REAL ID ACT CONFORMITY; LIMITATIONS.",
	"text": "For purposes of this section, \"federal change\" means a modification or addition to REAL ID Act requirements, made by the federal government after May 19, 2017, with respect to: legal requirements; processes; policies and procedures; or data collection, storage, and dissemination. Federal change includes but is not limited to a modification:\n(1) in what constitutes an official purpose under Code of Federal Regulations, title 6, part 37;\n(2) in the machine-readable technology standards for a license or Minnesota identification card;\n(3) in the information provided on the face of the license or Minnesota identification card;\n(4) that relates to dissemination of state-provided data to or among federal agencies, other states, organizations operating under agreement among the states, or private entities; or\n(5) that imposes an identifiable cost for the state of Minnesota.\n(a) The commissioner must establish a license and a Minnesota identification card that meets the requirements of the REAL ID Act, including but not limited to documentation requirements, administrative processes, electronic validation or verification of data, and card design and marking, as provided under this chapter.\n(b) The commissioner must establish a license and Minnesota identification card that:\n(1) is not acceptable for federal identification under the REAL ID Act, but complies with Code of Federal Regulations, title 6, section 37.71; and\n(2) meets the requirements under this chapter, including but not limited to section 171.12, subdivision 7b.\n(c) The commissioner must establish an enhanced driver's license or enhanced identification card as provided in this chapter.\nCompliance under subdivision 2, paragraph (a), is limited to those requirements of the REAL ID Act and any rules or regulations promulgated pursuant to the REAL ID Act in effect as of May 19, 2017. The commissioner may not take any action to implement or meet the requirements of a federal change.\n(a) Upon identification of an impending or completed federal change, the commissioner must notify the chairs and ranking minority members of the legislative committees having jurisdiction over transportation policy and finance, public safety, and data practices, and the Legislative Commission on Data Practices and Personal Data Privacy. Notification must be submitted as required under section 3.195, except that printed copies are not required.\n(b) Notification under this subdivision must include a review of the federal change, an initial analysis of data practices impacts, and any preliminary estimates of implementation costs, including the availability of additional federal funds.\n(a) Unless specifically provided otherwise, a driver's license, instruction permit, or provisional license includes any noncompliant license. Unless specifically provided otherwise, a Minnesota identification card includes any noncompliant identification card.\n(b) A noncompliant license does not include an enhanced driver's license, and a noncompliant identification card does not include an enhanced identification card.",
	"repealed": false
}