{
	"id": "329.12",
	"url": "https://www.revisor.mn.gov/statutes/cite/329.12",
	"title": "329.12 LICENSE REQUIRED FOR CERTAIN SALES; FALSE AFFIDAVIT.",
	"text": "It shall be unlawful for any transient merchant to advertise, represent, or hold forth as being sold for an insurance, bankrupt, insolvent, assignee, trustee, testator, executor, administrator, receiver, syndicate, wholesaler or manufacturer, or closing out sale, or as a sale of any goods, wares, and merchandise, damaged by smoke, fire, water, or otherwise, or in any similar form, unless such transient merchant shall file with the auditor of the county in which the application for license is filed and issued for such purpose an affidavit at the same time the application is filed, showing all the facts relating to the reasons and character of such sale so to be advertised or represented, and showing that such sale is in fact as is to be advertised and represented, including a statement of the names of the persons from whom the goods, wares, and merchandise so to be advertised or represented were obtained, the date of the delivery to the person applying for the license, and the place from which the goods, wares, and merchandise were last taken, and all details necessary to exactly locate and fully itemize all goods, wares, and merchandise to be sold. If such affidavit shall fail to show that such sale is of the character as the same is intended to be advertised or represented as shown in such affidavit, and fails to disclose the facts as herein required, then such auditor shall refuse the applicant a license for such sale. Should license be issued to such applicant, then such license shall state that such person is authorized and licensed to sell such goods, wares, and merchandise, and advertise and represent and hold forth the same as being sold as such insurance, bankrupt, insolvent, assignee, trustee, testator, executor, administrator, receiver, syndicate, wholesaler or manufacturer, or closing out sale, or as a sale of any goods, wares, and merchandise, damaged by smoke, fire, water, or otherwise, or in any similar manner present other facts as shown in such affidavit. The affidavit shall be sworn to before a person authorized to administer oaths by such person so applying for such license, or, if a partnership, by a member of such partnership, or, if a corporation, by one of the officers of such corporation. Every person making a false statement of any fact in such affidavit shall be guilty of perjury, and shall be punished for such offense as is provided by the Criminal Code of this state.",
	"repealed": false
}