{
	"id": "352.021",
	"url": "https://www.revisor.mn.gov/statutes/cite/352.021",
	"title": "352.021 MINNESOTA STATE RETIREMENT SYSTEM.",
	"text": "(a) There is established the general state employees retirement plan of the Minnesota State Retirement System for state employees.\n(b) The general state employees retirement plan is a continuation of the State Employees Retirement Association.\nEvery person who becomes a state employee as defined in section 352.01 is covered by the general state employees retirement plan. Acceptance of state employment or continuance in state service is deemed to be consent to have deductions made from salary for deposit to the credit of the account of the state employee in the retirement fund.\n(a) Any person who is appointed by the governor or lieutenant governor who is not already covered by the general state employees retirement plan under this chapter and who is not an employee listed in section 352D.02, subdivision 1, paragraph (c), may request, in writing, an exemption from coverage by the plan.\n(b) To qualify for this exemption, the request must be made within 90 days from the date of entering upon the duties of the position to which the person is appointed.\n(c) After making the request, a person requesting the exemption is not entitled to coverage by the general state employees retirement plan while employed in the position that entitled that person to an exemption from coverage.\nMS 1957 [Repealed, Ex1959 c 6 s 34]\nWhen a former employee who has withdrawn accumulated contributions reenters employment in a position entitled to coverage under the general state employees retirement plan, the employee must be covered by the plan on the same basis as a new employee and is not entitled to allowable service credit for any former service. The annuity rights forfeited when taking a refund can only be restored as provided in section 352.23.\nMS 1994 [Repealed, 1995 c 262 art 1 s 26]\nAn annuity under this chapter must be computed under the law in effect as of the last day for which the employee receives pay, or if on medical leave, the day that the leave terminates. However, if the employee has returned to covered employment following a termination, the employee must have earned at least six months of allowable service following a return to employment as a state employee in order to qualify for improved benefits resulting from any law change enacted subsequent to that termination.",
	"repealed": false
}