{
	"id": "153B.30",
	"url": "https://www.revisor.mn.gov/statutes/cite/153B.30",
	"title": "153B.30 LICENSURE.",
	"text": "An application for a license shall be submitted to the board in the format required by the board and shall be accompanied by the required fee, which is nonrefundable.\n(a) To be eligible for licensure as an orthotist, prosthetist, or prosthetist orthotist, an applicant shall meet orthotist, prosthetist, or prosthetist orthotist certification requirements of either the American Board for Certification in Orthotics, Prosthetics, and Pedorthics or the Board of Certification/Accreditation in effect at the time of the individual's application for licensure and be in good standing with the certifying board.\n(b) To be eligible for licensure as a pedorthist, an applicant shall meet the pedorthist certification requirements of either the American Board for Certification in Orthotics, Prosthetics, and Pedorthics or the Board of Certification/Accreditation that are in effect at the time of the individual's application for licensure and be in good standing with the certifying board.\n(c) To be eligible for licensure as an orthotic or prosthetic assistant, an applicant shall meet the orthotic or prosthetic assistant certification requirements of the American Board for Certification in Orthotics, Prosthetics, and Pedorthics that are in effect at the time of the individual's application for licensure and be in good standing with the certifying board.\n(d) To be eligible for licensure as an orthotic fitter, an applicant shall meet the orthotic fitter certification requirements of either the American Board for Certification in Orthotics, Prosthetics, and Pedorthics or the Board of Certification/Accreditation that are in effect at the time of the individual's application for licensure and be in good standing with the certifying board.\nA license to practice is valid for a term of up to 24 months beginning on January 1 or commencing after initially fulfilling the license requirements and ending on December 31 of the following year.",
	"repealed": false
}