{
	"id": "148B.37",
	"url": "https://www.revisor.mn.gov/statutes/cite/148B.37",
	"title": "148B.37 REFUSAL TO GRANT LICENSE; SUSPENSION OR REVOCATION OF LICENSE; DISCIPLINARY ACTION.",
	"text": "(a) The board may take disciplinary action as described under paragraph (b) against a licensee or applicant who the board, after a hearing under the contested case provisions of chapter 14, determines:\n(1) is incompetent to practice marriage and family therapy, or is found to engage in the practice of marriage and family therapy in a manner harmful or dangerous to a client or to the public;\n(2) is convicted by a court of competent jurisdiction of a crime that the board determines is of a nature to render the convicted person unfit to practice marriage and family therapy. The board should compile, maintain, and publish a list of such crimes;\n(3) has violated a provision of sections 148B.29 to 148B.392 or one or more of the rules of the board;\n(4) has obtained or attempted to obtain a license or license renewal by bribery or fraudulent representation;\n(5) has knowingly made a false statement on a form required by the board for licensing or license renewal; or\n(6) has failed to obtain continuing education credits required by the board.\n(b) If grounds for disciplinary action exist under paragraph (a), the board may take one or more of the following disciplinary actions:\n(1) refuse to grant or renew a license;\n(2) revoke a license;\n(3) suspend a license;\n(4) impose limitations on the practice of the licensee;\n(5) impose conditions on the practice of the licensee;\n(6) impose a civil penalty not exceeding $10,000 for each separate violation, the amount of the civil penalty to be fixed so as to deprive the licensee of any economic advantage gained by reason of the violation charged, or to discourage repeated violations;\n(7) impose a fee to reimburse the board for all or part of the cost of the proceedings resulting in disciplinary action including but not limited to the amount paid by the board for services from the Office of Administrative Hearings, attorney fees, court reporters, witnesses, reproduction of records, board members' per diem compensation, board staff time, and expense incurred by board members and staff;\n(8) censure or reprimand the licensee; or\n(9) take any other action justified by the facts of the case.\nIn a proceeding for the suspension or revocation of the right to practice or other disciplinary or adverse action involving sexual contact with a client or former client, the board or administrative law judge shall not consider evidence of the client's previous sexual conduct nor shall any reference to this conduct be made during the proceedings or in the findings, except by motion of the complainant, unless the evidence would be admissible under the applicable provisions of section 609.347, subdivision 3.\nFor reasons it considers sufficient and upon a vote of five of its members, the board may restore a license that has been revoked, reduce a period of suspension, or withdraw a reprimand.",
	"repealed": false
}