{
	"id": "515A.3-115",
	"url": "https://www.revisor.mn.gov/statutes/cite/515A.3-115",
	"title": "515A.3-115 LIEN FOR ASSESSMENTS.",
	"text": "(a) The association has a lien on a unit for any assessment levied against that unit from the time the assessment becomes payable. The association's lien may be foreclosed as provided by the laws of this state as if it were a lien under a mortgage containing a power of sale but the association shall give reasonable notice of its action to all lienholders of the unit whose interest would be affected. The rights of the parties shall be the same as those provided by law except that the period of redemption for unit owners shall be six months from the date of sale. Unless the declaration otherwise provides, fees, charges, late charges, and interest charges pursuant to section 515A.3-102(a), (9), and (11) are enforceable as assessments under this section.\n(b) A lien under this section is prior to all other liens and encumbrances on a unit except (1) liens and encumbrances recorded before the recordation of the declaration, (2) any recorded mortgage on the unit securing a first mortgage holder, and (3) liens for real estate taxes and other governmental assessments or charges against the unit. This subsection does not affect the priority of mechanics' or material suppliers' liens.\n(c) Recording of the declaration constitutes record notice and perfection of the lien, and no further recordation of any claim of lien for assessment under this section is required.\n(d) Proceedings to enforce an assessment must be instituted within three years after the last installment of the assessment becomes payable.\n(e) Unit owners at the time an assessment is payable are personally liable to the association for payment of the assessments.\n(f) A foreclosure sale, judgment, or decree in any action, proceeding, or suit brought under this section shall include costs and reasonable attorney's fees for the prevailing party.\n(g) The association shall furnish to a unit owner or the owner's authorized agent upon written request of the unit owner or the authorized agent a recordable statement setting forth the amount of unpaid assessments currently levied against the owner's unit. The statement shall be furnished within ten business days after receipt of the request and is binding on the association and every unit owner.",
	"repealed": false
}