{
	"id": "124E.15",
	"url": "https://www.revisor.mn.gov/statutes/cite/124E.15",
	"title": "124E.15 TRANSPORTATION.",
	"text": "(a) A charter school must comply with all pupil transportation requirements in section 123B.88, subdivision 1. A charter school must not require parents to surrender their rights to pupil transportation under section 123B.88, subdivision 2.\n(b) A charter school must notify the district in which the school is located and the commissioner by July 1 of its first fiscal year of operation if it will provide its own transportation or use the transportation services of the district in which it is located. For each subsequent year of operation, a charter school must give that district and the commissioner notice by March 1 for the following fiscal year.\n(c) If a charter school elects to provide transportation for pupils, the charter school must provide the transportation within the district in which the charter school is located. The state must pay transportation aid to the charter school according to section 124E.23.\n(d) For pupils who reside outside the district in which the charter school is located, the charter school is not required to provide or pay for transportation between the pupil's residence and the border of the district in which the charter school is located. The charter school may reimburse a parent for costs of transportation from the pupil's residence to the border of the district in which the charter school is located if the pupil is from a family whose income is at or below the poverty level, as determined by the federal government. The reimbursement may not exceed the pupil's actual cost of transportation or 15 cents per mile traveled, whichever is less. Reimbursement may not be paid for more than 250 miles per week.\n(e) If a charter school does not elect to provide transportation, the district in which the school is located must provide transportation, according to sections 123B.88, subdivision 6, governing transporting nonresident pupils, and 124D.03, subdivision 8, for a pupil residing in the same district in which the charter school is located. The district in which the charter school is located may provide transportation, according to sections 123B.88, subdivision 6, and 124D.03, subdivision 8, governing open enrollment transportation, for a pupil residing in a different district. If the district provides the transportation, the scheduling of routes, manner and method of transportation, control and discipline of the pupils, and any other matter relating to the transportation of pupils under this paragraph is within the sole discretion, control, and management of the district.\n(f) The charter school must provide the parent or guardian with information about transportation when a pupil enrolls.",
	"repealed": false
}