{
	"id": "116.05",
	"url": "https://www.revisor.mn.gov/statutes/cite/116.05",
	"title": "116.05 COOPERATION.",
	"text": "All state departments and agencies are hereby directed to cooperate with the Pollution Control Agency and its commissioner and assist them in the performance of their duties, and are authorized to enter into necessary agreements with the agency, and the Pollution Control Agency is authorized to cooperate and to enter into necessary agreements with other departments and agencies of the state, with municipalities, with other states, with the federal government and its agencies and instrumentalities, in the public interest and in order to control pollution under this chapter and chapter 115.\nUpon the request of the Pollution Control Agency the governor may, by order, require any department or agency of the state to furnish such assistance to the agency or its commissioner in the performance of its duties or in the exercise of the commissioner's powers imposed by law, as the governor may, in the order, designate or specify; and with the consent of the department or agency concerned, the governor may direct all or part of the cost or expense for the amount of such assistance to be paid from the general fund or appropriation in such amount as the governor may deem just and proper.\n(a) The Pollution Control Agency through its commissioner may designate air quality control regions which shall as far as practical follow regional boundaries designated by state statutes or executive order, and consider other jurisdictional boundaries, urban-industrial concentrations and other factors including atmospheric conditions and necessary procedures to provide adequate implementation of air quality standards. Within a designated air quality control region the Pollution Control Agency may by contract delegate its administrative powers to local governmental authorities to be exercised by such authorities within the region and within their own jurisdictional boundaries.\n(b) Local governmental authorities which are delegated administrative powers shall have legal authority to conduct such activities, and, in conducting such activities, may enter into contracts, employ personnel, expend funds, acquire property and adopt ordinances for such purposes. Such ordinances may include provisions establishing permit or license requirements and fees therefor.\n(c) With the approval of the Pollution Control Agency, local governmental authorities with jurisdiction wholly or in part within a designated region may enter into an agreement as provided by chapter 471 to exercise jointly all or some of the powers delegated by agreement with the Pollution Control Agency. The term \"local governmental authorities\" as used herein includes every city, county, town or other political subdivision and any agency of the state of Minnesota, or subdivision thereof, having less than statewide jurisdiction.",
	"repealed": false
}