{
	"id": "62J.72",
	"url": "https://www.revisor.mn.gov/statutes/cite/62J.72",
	"title": "62J.72 DISCLOSURE OF HEALTH CARE PROVIDER INFORMATION.",
	"text": "(a) A health plan company, as defined under section 62J.70, subdivision 3, a health care network cooperative as defined under section 62R.04, subdivision 3, and a health care provider as defined under section 62J.70, subdivision 2, shall, during open enrollment, upon enrollment, and annually thereafter, provide enrollees with a description of the general nature of the reimbursement methodologies used by the health plan company, health insurer, or health coverage plan to pay providers. The description must explain clearly any aspect of the reimbursement methodology that creates a financial incentive for the health care provider to limit or restrict the health care provided to enrollees. An entity required to disclose shall also disclose if no reimbursement methodology is used that creates a financial incentive for the health care provider to limit or restrict the health care provided to enrollees. This description may be incorporated into the member handbook, subscriber contract, certificate of coverage, or other written enrollee communication. The general reimbursement methodology shall be made available to employers at the time of open enrollment.\n(b) Health plan companies, health care network cooperatives, and providers must, upon request, provide an enrollee with specific information regarding the reimbursement methodology, including, but not limited to, the following information:\n(1) a concise written description of the provider payment plan, including any incentive plan applicable to the enrollee;\n(2) a written description of any incentive to the provider relating to the provision of health care services to enrollees, including any compensation arrangement that is dependent on the amount of health coverage or health care services provided to the enrollee, or the number of referrals to or utilization of specialists; and\n(3) a written description of any incentive plan that involves the transfer of financial risk to the health care provider.\n(c) The disclosure statement describing the general nature of the reimbursement methodologies must comply with the Readability of Insurance Policies Act in chapter 72C and must be filed with and approved by the commissioner prior to its use.\n(d) A disclosure statement that has been filed with the commissioner for approval under paragraph (c) is deemed approved 30 days after the date of filing, unless approved or disapproved by the commissioner on or before the end of that 30-day period.\n(e) The disclosure statement describing the general nature of the reimbursement methodologies must be provided upon request in English, Spanish, Vietnamese, and Hmong. In addition, reasonable efforts must be made to provide information contained in the disclosure statement to other non-English-speaking enrollees.\n(f) Health plan companies and providers may enter into agreements to determine how to respond to enrollee requests received by either the provider or the health plan company. This subdivision does not require disclosure of specific amounts paid to a provider, provider fee schedules, provider salaries, or other proprietary information of a specific health plan company or health insurer or health coverage plan or provider.\nIn the event a health plan company prepares a written disclosure as specified in subdivision 1, in a manner that explicitly makes a comparison of the financial incentives between the providers with whom it contracts, it must describe the incentives that occur at the provider level.\nA health plan company and health care provider shall provide patients and enrollees with a copy of an explicit and intelligible bill whenever the patient or enrollee is sent a bill and is responsible for paying any portion of that bill. The bills must contain descriptive language sufficient to be understood by the average patient or enrollee. This subdivision does not apply to a flat co-pay paid by the patient or enrollee at the time the service is required.\nHealth care providers as defined in section 62J.70, subdivision 2, clause (1), need not individually provide information required under this section if it has been provided by another individual or entity that is subject to this section.",
	"repealed": false
}