{
	"id": "169.58",
	"url": "https://www.revisor.mn.gov/statutes/cite/169.58",
	"title": "169.58 IDENTIFICATION LAMPS.",
	"text": "Any vehicle or combination of vehicles having a width including load thereon at any part in excess of 80 inches or which exceeds 30 feet in overall length may be equipped with identification lamps on the front displaying three amber or white lights and identification lamps on the rear displaying three red lights, and when so equipped the lights in each such group shall be evenly spaced not less than 6 nor more than 12 inches apart, along a horizontal line as near to the top of the vehicle as practicable, and these lights shall be visible from a distance of 500 feet to the front and rear, respectively, of the vehicle.\nUpon obtaining a permit from the commissioner of public safety, any motor vehicles operated by an active member of a volunteer fire department authorized by or contracting with any city, town, or township in this state, an emergency medical first responder, or an ambulance crew member may be equipped with a lamp emitting a red light to the front of such vehicle. The lens of such lamp shall be not more than three inches in diameter. Such lamp shall be lighted only when the member of the volunteer fire department, ambulance crew member, or emergency medical first responder is responding to an emergency call in connection with duties as a volunteer firefighter, ambulance crew member, or responder. The commissioner of public safety is hereby authorized to issue permits on applications of a member of a volunteer fire department properly certified to by the chief of said volunteer fire department, and on applications for emergency medical first responders or ambulance crew members. The commissioner of public safety must be notified immediately upon the termination of membership in a volunteer fire department or when an ambulance or permitted emergency medical first responder ceases operations.\nThe commissioner of public safety, upon application therefor, may issue a permit to any certificated volunteer ambulance driver authorizing the driver to equip any privately owned motor vehicle operated by the driver with a lamp emitting a red light to the front of the vehicle. The lamps shall conform to specifications adopted by the commissioner. The lamp shall be lighted only when the driver is proceeding to the location of an ambulance in response to an emergency call. The application shall be in the form prescribed by the commissioner and shall contain verification satisfactory to the commissioner of the applicant's status as a certificated volunteer ambulance driver. Any permit issued shall expire immediately upon termination of the permittee's employment as a volunteer ambulance driver.\nA vehicle engaged in deliveries to residences may display a lighting device mounted on the vehicle, which may project a red light to the front if the sign projects one or more additional colors to the front.\n(a) For purposes of this subdivision, the definitions in section 65B.472, subdivision 1, apply except that \"transportation network company vehicle\" has the meaning given to \"personal vehicle\" in section 65B.472, subdivision 1, paragraph (c).\n(b) A transportation network company vehicle may be equipped with no more than two removable, interior-mounted, trade dress identifying devices as provided by the transportation network company that are designed to assist riders in identifying and communicating with drivers. The identifying device may be illuminated and emit a steady beam of solid colored light in any direction when the driver is logged into the digital network. The identifying device must not: (1) display the colors red, amber, or blue; (2) project a flashing, oscillating, alternating, or rotating light; or (3) project a glaring or dazzling light.\n(a) An animal-drawn vehicle must be equipped with an identification lamp or lamps that indicate the vehicle's presence and are visible from a distance of at least 500 feet from both the front and the rear. The lighting requirement under this subdivision may be met using a lamp powered by energy generated from the vehicle's movement.\n(b) This subdivision does not apply to an animal-drawn vehicle that: (1) operates exclusively between the hours of sunrise and sunset and never during periods of reduced visibility, inclement weather, or insufficient light; or (2) never operates on a public roadway.",
	"repealed": false
}