{
	"id": "62U.04",
	"url": "https://www.revisor.mn.gov/statutes/cite/62U.04",
	"title": "62U.04 PAYMENT REFORM; HEALTH CARE COSTS; QUALITY OUTCOMES.",
	"text": "The commissioner of health shall develop a plan to create transparent prices, encourage greater provider innovation and collaboration across points on the health continuum in cost-effective, high-quality care delivery, reduce the administrative burden on providers and health plans associated with submitting and processing claims, and provide comparative information to consumers on variation in health care cost and quality across providers.\nThe commissioner of health shall develop a uniform method of calculating providers' relative cost of care, defined as a measure of health care spending including resource use and unit prices, and relative quality of care. In developing this method, the commissioner must address the following issues:\n(1) provider attribution of costs and quality;\n(2) appropriate adjustment for outlier or catastrophic cases;\n(3) appropriate risk adjustment to reflect differences in the demographics and health status across provider patient populations, using generally accepted and transparent risk adjustment methodologies and case mix adjustment;\n(4) specific types of providers that should be included in the calculation;\n(5) specific types of services that should be included in the calculation;\n(6) appropriate adjustment for variation in payment rates;\n(7) the appropriate provider level for analysis;\n(8) payer mix adjustments, including variation across providers in the percentage of revenue received from government programs; and\n(9) other factors that the commissioner and the advisory committee, established under subdivision 3, determine are needed to ensure validity and comparability of the analysis.\n(a) The commissioner shall develop a peer grouping system for providers that incorporates both provider risk-adjusted cost of care and quality of care, and for specific conditions as determined by the commissioner. For purposes of the final establishment of the peer grouping system, the commissioner shall not contract with any private entity, organization, or consortium of entities that has or will have a direct financial interest in the outcome of the system.\n(b) The commissioner shall establish an advisory committee comprised of representatives of health care providers, health plan companies, consumers, state agencies, employers, academic researchers, and organizations that work to improve health care quality in Minnesota. The advisory committee shall meet no fewer than three times per year. The commissioner shall consult with the advisory committee in developing and administering the peer grouping system, including but not limited to the following activities:\n(1) establishing peer groups;\n(2) selecting quality measures;\n(3) recommending thresholds for completeness of data and statistical significance for the purposes of public release of provider peer grouping results;\n(4) considering whether adjustments are necessary for facilities that provide medical education, level 1 trauma services, neonatal intensive care, or inpatient psychiatric care;\n(5) recommending inclusion or exclusion of other costs; and\n(6) adopting patient attribution and quality and cost-scoring methodologies.\n(a) The commissioner shall disseminate information to providers on their total cost of care, total resource use, total quality of care, and the total care results of the grouping developed under subdivision 3 in comparison to an appropriate peer group. Data used for this analysis must be the most recent data available. Any analyses or reports that identify providers may only be published after the provider has been provided the opportunity by the commissioner to review the underlying data in order to verify, consistent with the recommendations developed pursuant to subdivision 3c, paragraph (d), and adopted by the commissioner, the accuracy and representativeness of any analyses or reports and submit comments to the commissioner or initiate an appeal under subdivision 3b. Upon request, providers shall be given any data for which they are the subject of the data. The provider shall have 60 days to review the data for accuracy and initiate an appeal as specified in subdivision 3b.\n(b) The commissioner shall disseminate information to providers on their condition-specific cost of care, condition-specific resource use, condition-specific quality of care, and the condition-specific results of the grouping developed under subdivision 3 in comparison to an appropriate peer group. Data used for this analysis must be the most recent data available. Any analyses or reports that identify providers may only be published after the provider has been provided the opportunity by the commissioner to review the underlying data in order to verify, consistent with the recommendations developed pursuant to subdivision 3c, paragraph (d), and adopted by the commissioner, the accuracy and representativeness of any analyses or reports, and submit comments to the commissioner or initiate an appeal under subdivision 3b. Upon request, providers shall be given any data for which they are the subject of the data. The provider shall have 60 days to review the data for accuracy and initiate an appeal as specified in subdivision 3b.\nThe commissioner shall establish a process to resolve disputes from providers regarding the accuracy of the data used to develop analyses or reports or errors in the application of standards or methodology established by the commissioner in consultation with the advisory committee. When a provider submits an appeal, the provider shall:\n(1) clearly indicate the reason or reasons for the appeal;\n(2) provide any evidence, calculations, or documentation to support the reason for the appeal; and\n(3) cooperate with the commissioner, including allowing the commissioner access to data necessary and relevant to resolving the dispute.\nThe commissioner shall cooperate with the provider during the data review period specified in subdivisions 3a and 3c by giving the provider information necessary for the preparation of an appeal.\nIf a provider does not meet the requirements of this subdivision, a provider's appeal shall be considered withdrawn. The commissioner shall not publish peer grouping results for a provider until the appeal has been resolved.\n(a) The commissioner may publicly release summary data related to the peer grouping system as long as the data do not contain information or descriptions from which the identity of individual hospitals, clinics, or other providers may be discerned.\n(b) The commissioner may publicly release analyses or results related to the peer grouping system that identify hospitals, clinics, or other providers only if the following criteria are met:\n(1) the results, data, and summaries, including any graphical depictions of provider performance, have been distributed to providers at least 120 days prior to publication;\n(2) the commissioner has provided an opportunity for providers to verify and review data for which the provider is the subject consistent with the recommendations developed pursuant to subdivision 3c, paragraph (d), and adopted by the commissioner;\n(3) the results meet thresholds of validity, reliability, statistical significance, representativeness, and other standards that reflect the recommendations of the advisory committee, established under subdivision 3; and\n(4) any public report or other usage of the analyses, reports, or data used by the state clearly notifies consumers about how to use and interpret the results, including any limitations of the data and analyses.\n(c) After publishing the first public report, the commissioner shall, no less frequently than annually, publish information on providers' total cost, total resource use, total quality, and the results of the total care portion of the peer grouping process, as well as information on providers' condition-specific cost, condition-specific resource use, and condition-specific quality, and the results of the condition-specific portion of the peer grouping process. The results that are published must be on a risk-adjusted basis, including case mix adjustments.\n(d) The commissioner shall convene a work group comprised of representatives of physician clinics, hospitals, their respective statewide associations, and other relevant stakeholder organizations to make recommendations on data to be made available to hospitals and physician clinics to allow for verification of the accuracy and representativeness of the provider peer grouping results.\n(a) Prior to disseminating data to providers under subdivision 3a or publishing information under subdivision 3c, the commissioner, in consultation with the advisory committee, shall ensure the scientific and statistical validity and reliability of the results according to the standards described in paragraph (b). If additional time is needed to establish the scientific validity, statistical significance, and reliability of the results, the commissioner may delay the dissemination of data to providers under subdivision 3a, or the publication of information under subdivision 3c.\nThe commissioner must disseminate the information to providers under subdivision 3a at least 120 days before publishing results under subdivision 3c.\n(b) The commissioner's assurance of valid, timely, and reliable clinic and hospital peer grouping performance results shall include, at a minimum, the following:\n(1) use of the best available evidence, research, and methodologies; and\n(2) establishment of explicit minimum reliability thresholds for both quality and costs developed in collaboration with the subjects of the data and the users of the data, at a level not below nationally accepted standards where such standards exist.\nIn achieving these thresholds, the commissioner shall not aggregate clinics that are not part of the same system or practice group. The commissioner shall consult with and solicit feedback from the advisory committee and representatives of physician clinics and hospitals during the peer grouping data analysis process to obtain input on the methodological options prior to final analysis and on the design, development, and testing of provider reports.\n(a) All health plan companies, dental organizations, and third-party administrators shall submit encounter data on a monthly basis to a private entity designated by the commissioner of health. The data shall be submitted in a form and manner specified by the commissioner subject to the following requirements:\n(1) the data must be de-identified data as described under the Code of Federal Regulations, title 45, section 164.514;\n(2) the data for each encounter must include an identifier for the patient's health care home if the patient has selected a health care home, data on contractual value-based payments, and data deemed necessary by the commissioner to uniquely identify claims in the individual health insurance market;\n(3) the data must include enrollee race and ethnicity, to the extent available, for claims incurred on or after January 1, 2023; and\n(4) except for the data described in clauses (2) and (3), the data must not include information that is not included in a health care claim, dental care claim, or equivalent encounter information transaction that is required under section 62J.536.\n(b) The commissioner or the commissioner's designee shall only use the data submitted under paragraph (a) to carry out the commissioner's responsibilities in this section, including supplying the data to providers so they can verify their results of the peer grouping process consistent with the recommendations developed pursuant to subdivision 3c, paragraph (d), and adopted by the commissioner and, if necessary, submit comments to the commissioner or initiate an appeal.\n(c) Data on providers collected under this subdivision are private data on individuals or nonpublic data, as defined in section 13.02. Notwithstanding the data classifications in this paragraph, data on providers collected under this subdivision may be released or published as authorized in subdivision 11. The commissioner or the commissioner's designee shall establish procedures and safeguards to protect the integrity and confidentiality of any data that it maintains.\n(d) The commissioner or the commissioner's designee shall not publish analyses or reports that identify, or could potentially identify, individual patients.\n(e) The commissioner shall compile summary information on the data submitted under this subdivision. The commissioner shall work with its vendors to assess the data submitted in terms of compliance with the data submission requirements and the completeness of the data submitted by comparing the data with summary information compiled by the commissioner and with established and emerging data quality standards to ensure data quality.\n(a) All health plan companies, dental organizations, and third-party administrators shall submit, on a monthly basis, data on their contracted prices with health care providers and dental care providers to a private entity designated by the commissioner of health for the purposes of performing the analyses required under this subdivision. Data on contracted prices submitted under this paragraph must include data on supplemental contractual value-based payments paid to health care providers. The data shall be submitted in the form and manner specified by the commissioner of health.\n(b) The commissioner or the commissioner's designee shall only use the data submitted under this subdivision to carry out the commissioner's responsibilities under this section, including supplying the data to providers so they can verify their results of the peer grouping process consistent with the recommendations developed pursuant to subdivision 3c, paragraph (d), and adopted by the commissioner and, if necessary, submit comments to the commissioner or initiate an appeal.\n(c) Data collected under this subdivision are private data on individuals or nonpublic data as defined in section 13.02. Notwithstanding the definition of summary data in section 13.02, subdivision 19, summary data prepared under this section may be derived from nonpublic data. Notwithstanding the data classifications in this paragraph, data on providers collected under this subdivision may be released or published as authorized in subdivision 11. The commissioner shall establish procedures and safeguards to protect the integrity and confidentiality of any data that it maintains.\n(a) The commissioner shall not require a self-insurer governed by the federal Employee Retirement Income Security Act of 1974 (ERISA) to comply with this section.\n(b) A third-party administrator must annually notify the self-insurers whose health plans are administered by the third-party administrator that the self-insurer may elect to have the third-party administrator submit encounter data, data on contracted prices, and data on nonclaims-based payments under subdivisions 4, 5, and 5b, from the self-insurer's health plan for the upcoming plan year. This notice must be provided in a form and manner specified by the commissioner. After receiving responses from self-insurers, a third-party administrator must, in a form and manner specified by the commissioner, report to the commissioner:\n(1) the number of self-insured clients that elected to have the third-party administrator submit encounter data, data on contracted prices, and data on nonclaims-based payments from the self-insurer's health plan for the upcoming plan year, along with the number of covered lives, claims volume, and aggregated claim value;\n(2) the number of self-insured clients that declined to have the third-party administrator submit encounter data, data on contracted prices, and data on nonclaims-based payments from the self-insurer's health plan for the upcoming plan year, along with the number of covered lives, claims volume, and aggregated claim value; and\n(3) data deemed necessary by the commissioner to assure the quality of the submitted data.\n(c) Data collected under this subdivision are private data on individuals or nonpublic data as defined in section 13.02. Notwithstanding the definition of summary data in section 13.02, subdivision 19, summary data prepared under this subdivision may be derived from nonpublic data. The commissioner shall establish procedures and safeguards to protect the integrity and confidentiality of any data maintained by the commissioner.\n(a) Beginning January 1, 2025, all health plan companies and third-party administrators shall submit to a private entity designated by the commissioner of health all nonclaims-based payments made to health care providers. The data shall be submitted in a form, manner, and frequency specified by the commissioner. Nonclaims-based payments are payments to health care providers designed to pay for value of health care services over volume of health care services and include alternative payment models or incentives, payments for infrastructure expenditures or investments, and payments for workforce expenditures or investments. Nonclaims-based payments submitted under this subdivision must, to the extent possible, be attributed to a health care provider in the same manner in which claims-based data are attributed to a health care provider and, where appropriate, must be combined with data collected under subdivisions 4 to 5a in analyses of health care spending.\n(b) Data collected under this subdivision are private data on individuals or nonpublic data as defined in section 13.02. Notwithstanding the definition of summary data in section 13.02, subdivision 19, summary data prepared under this subdivision may be derived from nonpublic data. The commissioner shall establish procedures and safeguards to protect the integrity and confidentiality of any data maintained by the commissioner.\n(c) The commissioner shall consult with health plan companies, hospitals, health care providers, and the commissioner of human services in developing the data reported under this subdivision and standardized reporting forms.\nThe commissioner may contract with a private entity or consortium of entities to develop the standards. The private entity or consortium must be nonprofit and have governance that includes representatives from the following stakeholder groups: health care providers, health plan companies, hospitals, consumers, employers or other health care purchasers, and state government. The entity or consortium must ensure that the representatives of stakeholder groups in the aggregate reflect all geographic areas of the state. No one stakeholder group shall have a majority of the votes on any issue or hold extraordinary powers not granted to any other governance stakeholder.\nThe commissioner of health shall convene a work group to develop strategies for engaging consumers in understanding the importance of health care cost and quality, specifically as it relates to health care outcomes, consumer out-of-pocket costs, and variations in health care cost and quality across providers. The work group shall develop strategies to assist consumers in becoming advocates for higher value health care and a more efficient, effective health care system. The work group shall make recommendations to the commissioner and the legislature by January 1, 2010, and shall identify specific action steps needed to achieve the recommendations.\n(a) Nothing in this section shall prohibit group purchasers and health care providers, upon mutual agreement, from entering into arrangements that establish package prices for a comprehensive set of services or separately for the cost of care for specific health conditions in addition to the baskets of care established in section 62U.05, in order to give providers the flexibility to innovate on ways to reduce health care costs while improving overall quality of care and health outcomes.\n(b) The commissioner of health may convene working groups of private sector payers and health care providers to discuss and develop new strategies for reforming health care payment systems to promote innovative care delivery that reduces health care costs and improves quality.\nFor product renewals or for new products that are offered:\n(1) the commissioner of management and budget may use the information and methods developed under subdivisions 3 to 3d to strengthen incentives for members of the state employee group insurance program to use high-quality, low-cost providers;\n(2) political subdivisions, as defined in section 13.02, subdivision 11, that offer health benefits to their employees may offer plans that differentiate providers on their cost and quality performance and create incentives for members to use better-performing providers;\n(3) health plan companies may use the information and methods developed under subdivisions 3 to 3d to develop products that encourage consumers to use high-quality, low-cost providers; and\n(4) health plan companies that issue health plans in the individual market or the small employer market may offer at least one health plan that uses the information developed under subdivisions 3 to 3d to establish financial incentives for consumers to choose higher-quality, lower-cost providers through enrollee cost-sharing or selective provider networks.\nNotwithstanding subdivisions 3, 3a, 3b, 3c, and 3d, the commissioner shall suspend the development and implementation of the provider peer grouping system required under this section. This suspension shall continue until the legislature authorizes the commissioner to resume this activity.\n(a) Notwithstanding subdivision 4, paragraph (b), and subdivision 5, paragraph (b), the commissioner or the commissioner's designee shall only use the data submitted under subdivisions 4, 5, 5a, and 5b for the purposes authorized in this subdivision and in subdivision 13:\n(1) to evaluate the performance of the health care home program as authorized under section 62U.03, subdivision 7;\n(2) to study, in collaboration with the reducing avoidable readmissions effectively (RARE) campaign, hospital readmission trends and rates;\n(3) to analyze variations in health care costs, quality, utilization, and illness burden based on geographical areas or populations;\n(4) to evaluate the state innovation model (SIM) testing grant received by the Departments of Health and Human Services, including the analysis of health care cost, quality, and utilization baseline and trend information for targeted populations and communities;\n(5) to compile one or more public use files of summary data or tables that must:\n(i) be available to the public for no or minimal cost by March 1, 2016, and available by web-based electronic data download by June 30, 2019;\n(ii) not identify individual patients but that may identify the rendering or billing hospital, clinic, or medical practice so long as no individual health professionals are identified and the commissioner finds the data to be accurate, valid, and suitable for publication for such use;\n(iii) be updated by the commissioner, at least annually, with the most current data available; and\n(iv) contain clear and conspicuous explanations of the characteristics of the data, such as the dates of the data contained in the files, the absence of costs of care for uninsured patients or nonresidents, and other disclaimers that provide appropriate context; and\n(6) to conduct analyses of the impact of health care transactions on health care costs, market consolidation, and quality under section 145D.01, subdivision 6.\n(b) The commissioner may publish the results of the authorized uses identified in paragraph (a). The data published under this paragraph may identify hospitals, clinics, and medical practices so long as no individual health professionals are identified and the commissioner finds the data to be accurate, valid, and suitable for publication for such use.\n(a) The commissioner of health shall convene a work group to develop a framework for the expanded use of the all-payer claims database established under this section. The work group shall develop recommendations based on the following questions and other topics as identified by the work group:\n(1) what should the parameters be for allowable uses of the all-payer claims data collected under this section, beyond the uses authorized in subdivision 11;\n(2) what type of advisory or governing body should guide the release of data from the all-payer claims database;\n(3) what type of funding or fee structure would be needed to support the expanded use of all-payer claims data;\n(4) what should the mechanisms be by which the data would be released or accessed, including the necessary information technology infrastructure to support the expanded use of the data under different assumptions related to the number of potential requests and manner of access;\n(5) what are the appropriate privacy and security protections needed for the expanded use of the all-payer claims database; and\n(6) what additional resources might be needed to support the expanded use of the all-payer claims database, including expected resources related to information technology infrastructure, review of proposals, maintenance of data use agreements, staffing an advisory body, or other new efforts.\n(b) The commissioner of health shall appoint the members to the work group as follows:\n(1) two members recommended by the Minnesota Medical Association;\n(2) two members recommended by the Minnesota Hospital Association;\n(3) two members recommended by the Minnesota Council of Health Plans;\n(4) one member who is a data practices expert from the Department of Administration;\n(5) three members who are academic researchers with expertise in claims database analysis;\n(6) two members representing two state agencies determined by the commissioner;\n(7) one member representing the Minnesota Health Care Safety Net Coalition; and\n(8) three members representing consumers.\n(c) The commissioner of health shall submit a report on the recommendations of the work group to the chairs and ranking minority members of the legislative committees and divisions with jurisdiction over health and human services, judiciary, and civil law by February 1, 2015. In considering the recommendations provided in the report, the legislature may consider whether the currently authorized uses of the all-payer claims data under this section should continue to be authorized.\n(a) The commissioner or the commissioner's designee shall make the data submitted under subdivisions 4, 5, 5a, and 5b, including data classified as private or nonpublic, available to individuals and organizations engaged in research on, or efforts to effect transformation in, health care outcomes, access, quality, disparities, or spending, provided the use of the data serves a public benefit. Data made available under this subdivision may not be used to:\n(1) create an unfair market advantage for any participant in the health care market in Minnesota, including health plan companies, payers, and providers;\n(2) reidentify or attempt to reidentify an individual in the data; or\n(3) publicly report contract details between a health plan company and provider and derived from the data.\n(b) To implement paragraph (a), the commissioner shall:\n(1) establish detailed requirements for data access; a process for data users to apply to access and use the data; legally enforceable data use agreements to which data users must consent; a clear and robust oversight process for data access and use, including a data management plan, that ensures compliance with state and federal data privacy laws; agreements for state agencies and the University of Minnesota to ensure proper and efficient use and security of data; and technical assistance for users of the data and for stakeholders;\n(2) develop a fee schedule to support the cost of expanded access to and use of the data, provided the fees charged under the schedule do not create a barrier to access or use for those most affected by disparities; and\n(3) create a research advisory group to advise the commissioner on applications for data use under this subdivision, including an examination of the rigor of the research approach, the technical capabilities of the proposed user, and the ability of the proposed user to successfully safeguard the data.",
	"repealed": false
}