{
	"id": "352.965",
	"url": "https://www.revisor.mn.gov/statutes/cite/352.965",
	"title": "352.965 MINNESOTA STATE DEFERRED COMPENSATION PLAN.",
	"text": "(a) The Minnesota deferred compensation plan is established. For purposes of this section, \"plan\" means the Minnesota deferred compensation plan, unless the context clearly indicates otherwise. The Minnesota State Retirement System shall administer the plan.\n(b) The purpose of the plan is to provide a means for a public employee to contribute a portion of the employee's compensation to a tax-deferred investment account. The plan is an eligible tax-deferred compensation plan under section 457(b) of the Internal Revenue Code, United States Code, title 26, section 457(b), and the applicable regulations under Code of Federal Regulations, title 26, parts 1.457-3 to 1.457-10.\n(c) The board of directors of the Minnesota State Retirement System is the plan trustee and plan sponsor. The board's executive director is the plan administrator. Fiduciary activities of the plan must be undertaken in a manner consistent with chapter 356A.\n(d) The executive director, with the approval of the board of directors, shall adopt and amend, as required to maintain tax-qualified status, a written plan document specifying the material terms and conditions for eligibility, benefits, applicable limitations, and the time and form under which benefit distributions can be made. With the approval of the board of directors, the executive director may also establish policies and procedures necessary for the administration of the deferred compensation plan.\n(e) The plan document must include provisions that are necessary to cause the plan to be an eligible deferred compensation plan within the meaning of section 457(b) of the Internal Revenue Code. The plan document may provide additional administrative and substantive provisions consistent with state law, provided that those provisions do not cause the plan to fail to be an eligible deferred compensation plan within the meaning of section 457(b) of the Internal Revenue Code and may include provisions for certain optional features and services.\n(f) The board of directors may authorize the executive director to establish and administer a Roth 457 plan if authorized by the Internal Revenue Code or a Roth individual retirement account as defined under section 408A of the Internal Revenue Code.\n(g) All amounts contributed to the deferred compensation plan and all earnings on those amounts must be held in trust, in custodial accounts, or in qualifying annuity contracts for the exclusive benefit of the plan participants and beneficiaries, as required by section 457(g) of the Internal Revenue Code and in accordance with sections 356.001 and 356A.06, subdivision 1.\n(h) The information and data maintained in the accounts of the participants and beneficiaries are private data and must not be disclosed to anyone other than the participant or beneficiary pursuant to a court order or under section 356.49.\n(i) The plan document is not subject to the rule adoption process under the Administrative Procedure Act, including section 14.386, but must conform with applicable federal and state laws.\n(a) At the request of an officer or employee of the state, an officer or employee of a political subdivision, or an employee covered by a retirement fund in section 356.20, subdivision 2, the appointing authority shall defer the payment of part of the compensation of the public officer or employee through payroll deduction.\n(b) The amount to be deferred must be as provided in an agreement between the officer or employee and the plan sponsor. The agreement must be in a form specified by the executive director of the Minnesota State Retirement System and must be consistent with the requirements for an eligible plan under federal and state tax laws, regulations, and rulings.\nThe public employer must complete implementation of the deferred compensation plan within 45 days of the request as provided in subdivision 2. If the public employer fails to implement the deferred compensation plan, the public employer may not defer compensation under any existing or new deferred compensation plan from the date of the request until the date on which the deferred compensation plan provided for in this section is implemented. Upon the petition of a public officer or employee, the executive director of the Minnesota State Retirement System may order the public officer's or employee's public employer to implement the deferred compensation plan provided for in this section and may enforce that order in appropriate legal proceedings.\nAvailable investments are those investments chosen by the State Board of Investment under section 356.645 for the plan.\nAll amounts contributed to the deferred compensation plan and all earnings on those amounts must be held for the exclusive benefit of the plan participants and beneficiaries. These amounts must be held in trust, in custodial accounts, or in qualifying annuity contracts as required by federal law in accordance with section 356A.06, subdivision 1.\nExcept as authorized in section 356.24, subdivision 1, clause (5), employer contributions are prohibited.\n[Repealed, 2014 c 296 art 13 s 28]\n(a) The reasonable and necessary administrative expenses of the deferred compensation plan may be charged to plan participants in the form of an annual fee, an asset-based fee, a percentage of the contributions to the plan, or a combination thereof, as set forth in the plan document. The executive director of the system at the direction of the board of directors shall establish procedures to carry out this section including allocation of administrative costs of the plan to participants. Processes and procedures shall be set forth in the plan document. Fees cannot be charged on contributions and investment returns attributable to contributions made to the Minnesota supplemental investment funds before July 1, 1992.\n(b) The plan document must conform to federal and state tax laws, regulations, and rulings, and is not subject to the Administrative Procedure Act.\n(c) The executive director may contract with a third party to perform administrative and record keeping functions. The executive director may solicit bids and negotiate such contracts. Participating employers must provide the necessary data to the third-party record keeper as determined by the executive director. The third-party record keeper and the Minnesota State Retirement System shall follow the data privacy provisions under chapter 13. The third-party record keeper may not solicit participants for any product or services not related to the deferred compensation plan.\n(d) The board of directors may authorize a third-party investment consultant to provide investment information and advice if the offering of such information and advice is consistent with the investment advice requirements applicable to private plans under Title VI, subtitle A, of the Pension Protection Act of 2006, Public Law 109-280, section 601.\nExcept as provided in this section, no provisions of this chapter or other law specifically referring to this chapter applies to this section unless the Minnesota deferred compensation plan is specifically referenced.\nNo amount of deferred compensation is assignable or subject to execution, levy, attachment, garnishment, or other legal process, except as provided in section 518.58, 518.581, or 518A.53.\nThe plan document shall establish procedures to assist in locating participants. If a participant cannot be located the participant's benefits shall be deemed abandoned and the provisions of section 356.65 shall apply to their disposition.",
	"repealed": false
}