{
	"id": "302A.021",
	"url": "https://www.revisor.mn.gov/statutes/cite/302A.021",
	"title": "302A.021 APPLICATION AND ELECTION.",
	"text": "A corporation incorporated under chapter 300 that has not subsequently become governed by chapter 301 and that was incorporated for a purpose or purposes for which a corporation may be incorporated under this chapter may elect to become governed by this chapter.\nA corporation incorporated under sections 301.01 to 301.67 may elect, on or after July 1, 1981 and before January 1, 1984, to become governed by this chapter. A corporation incorporated under sections 301.01 to 301.67 and 319A.01 to 319A.22 may elect, on or after July 1, 1981 and before January 1, 1984, to become governed by this chapter and sections 319A.01 to 319A.22.\nIf the articles of an electing corporation include a provision prohibited by this chapter or omit a provision required by this chapter or are otherwise inconsistent with this chapter, the electing corporation shall amend its articles to conform to the requirements of this chapter. The appropriate provisions of the corporation's articles or bylaws or the law by which it was governed before the effective date of the election made pursuant to this section control the manner of adoption of the amendment.\nAn election by a corporation to become governed by this chapter shall be made by resolution approved by the affirmative vote of the holders of the same proportion or number of the voting power of the shares entitled to vote that is required for amendment of the articles of the corporation prior to the election. The resolution, and articles of amendment if required, shall be filed with the secretary of state and is effective upon filing. If no amendment of the articles is required, the resolution shall state that the articles of the corporation conform to the requirements of this chapter.\nUpon filing an election pursuant to subdivision 4, all provisions of the bylaws that are consistent with this chapter remain or become effective and all provisions of the bylaws that are inconsistent with this chapter cease to be effective.\nFrom July 1, 1981 to December 31, 1983, inclusive, a corporation incorporated for a purpose or purposes for which a corporation may be incorporated under this chapter may be incorporated either under this chapter or under sections 301.01 to 301.67, or, if applicable, sections 301.01 to 301.67 and 319A.01 to 319A.22.\nA corporation in existence on January 1, 1984 and incorporated under another statute of this state for a purpose or purposes for which a corporation may be incorporated under this chapter or, if applicable, this chapter and chapter 319A, other than a corporation incorporated under chapter 300 that has not subsequently become governed by chapter 301, that has not elected before January 1, 1984 to become subject to this chapter, becomes governed by this chapter or, if applicable, this chapter and chapter 319A, on January 1, 1984 as fully as though the corporation had been incorporated under this chapter or, if applicable, this chapter and chapter 319A. All provisions of the articles and bylaws of the corporation that may be included in the articles or bylaws under this chapter remain in effect. All provisions of the articles and bylaws of the corporation that are inconsistent with this chapter cease to be effective on January 1, 1984. Any provisions required by this chapter to be contained in the articles that do not appear in the articles are read into them as a matter of law.\nA corporation incorporated under chapter 300 in existence on August 1, 2006, becomes governed by this chapter on August 1, 2006, as fully as though the corporation had been incorporated under this chapter, except as specifically otherwise provided by law.\n(a) If the articles of a corporation described in subdivision 1 or 2 and electing to become governed by this chapter or, if applicable, this chapter and chapter 319A, or described in subdivision 7, do not contain a provision specifying the proportion of the voting power of the shares required for approval of amendments to the articles, plans of merger or exchange, or sales of assets, a shareholder or shareholders holding more than one-third of the voting power of all the shares entitled to vote for any or all of the above mentioned actions may, by signed written demand filed with the secretary of state, amend the articles of the corporation to include a provision requiring the approval of the holders of two-thirds of the voting power of the shares entitled to vote for any or all of the above mentioned actions for which no required majority was specified, notwithstanding any provisions of section 302A.135, 302A.613 or 302A.661 to the contrary. Notice that the demand has been filed shall be given by the shareholder to an officer of the corporation, but failure to give the notice does not invalidate the demand.\n(b) A shareholder or shareholders holding more than one-third of the voting power of the shares entitled to vote for dissolution of a corporation described in subdivision 1 or 2 and electing to become governed by this chapter or, if applicable, this chapter and chapter 319A, or described in subdivision 7, may, by signed written demand filed with the secretary of state, amend the articles of the corporation to include a provision requiring the approval of the holders of two-thirds of the voting power of the shares for the authorization of the dissolution of the corporation, notwithstanding the provisions of section 302A.721. Notice that the demand has been filed shall be given by the shareholder to an officer of the corporation, but failure to give the notice does not invalidate the demand.\n(c) A signed written demand by the shareholders of a corporation pursuant to paragraph (a) or (b) is valid only if filed with the secretary of state before January 1, 1984 or, in the case of a corporation described in subdivision 7, before April 1, 1984.\nEffective January 1, 1984, a corporation incorporated for a purpose or purposes for which a corporation may be incorporated under this chapter shall be incorporated only under this chapter.\nChapters 301, 316, and 556 do not apply to a corporation incorporated under or governed by this chapter.",
	"repealed": false
}