{
	"id": "169.14",
	"url": "https://www.revisor.mn.gov/statutes/cite/169.14",
	"title": "169.14 SPEED LIMITS, ZONES; RADAR.",
	"text": "No person shall drive a vehicle on a highway at a speed greater than is reasonable and prudent under the conditions. Every driver is responsible for becoming and remaining aware of the actual and potential hazards then existing on the highway and must use due care in operating a vehicle. In every event speed shall be so restricted as may be necessary to avoid colliding with any person, vehicle or other conveyance on or entering the highway in compliance with legal requirements and the duty of all persons to use due care.\nThe driver's license of a person who violates any speed limit established in this section, by driving in excess of 100 miles per hour, is revoked for six months under section 171.17, or for a longer minimum period of time applicable under section 169A.53, 169A.54, or 171.174.\n(a) Where no special hazard exists the following speeds shall be lawful, but any speeds in excess of such limits shall be prima facie evidence that the speed is not reasonable or prudent and that it is unlawful; except that the speed limit within any municipality shall be a maximum limit and any speed in excess thereof shall be unlawful:\n(1) 30 miles per hour in an urban district;\n(2) 65 miles per hour on noninterstate expressways, as defined in section 160.02, subdivision 18b, and noninterstate freeways, as defined in section 160.02, subdivision 19;\n(3) 55 miles per hour in locations other than those specified in this section;\n(4) 70 miles per hour on interstate highways outside the limits of any urbanized area with a population of greater than 50,000 as defined by order of the commissioner of transportation;\n(5) 65 miles per hour on interstate highways inside the limits of any urbanized area with a population of greater than 50,000 as defined by order of the commissioner of transportation;\n(6) ten miles per hour in alleys;\n(7) 25 miles per hour in residential roadways if adopted by the road authority having jurisdiction over the residential roadway; and\n(8) 35 miles per hour in a rural residential district if adopted by the road authority having jurisdiction over the rural residential district.\n(b) A speed limit adopted under paragraph (a), clause (7), is not effective unless the road authority has erected signs designating the speed limit and indicating the beginning and end of the residential roadway on which the speed limit applies.\n(c) A speed limit adopted under paragraph (a), clause (8), is not effective unless the road authority has erected signs designating the speed limit and indicating the beginning and end of the rural residential district for the roadway on which the speed limit applies.\n(d) Notwithstanding section 609.0331 or 609.101 or other law to the contrary, a person who violates a speed limit established in this subdivision, or a speed limit designated on an appropriate sign under subdivision 4, 5, 5b, 5c, or 5e, by driving 20 miles per hour or more in excess of the applicable speed limit, is assessed an additional surcharge equal to the amount of the fine imposed for the speed violation, but not less than $25.\nNotwithstanding subdivision 2, the speed limit is increased by ten miles per hour over the posted speed limit when the driver:\n(1) is on a two-lane highway having one lane for each direction of travel;\n(2) is on a highway with a posted speed limit that is equal to or higher than 55 miles per hour;\n(3) is overtaking and passing another vehicle proceeding in the same direction of travel; and\n(4) meets the requirements in section 169.18.\n(a) The driver of any vehicle shall, consistent with the requirements, drive at an appropriate reduced speed when approaching or passing an authorized emergency vehicle stopped with emergency lights flashing on any street or highway, when approaching and crossing an intersection or railway grade crossing, when approaching and going around a curve, when approaching a hill crest, when traveling upon any narrow or winding roadway, and when special hazards exist with respect to pedestrians or other traffic or by reason of weather or highway conditions.\n(b) A person who fails to reduce speed appropriately when approaching or passing an authorized emergency vehicle stopped with emergency lights flashing on a street or highway shall be assessed an additional surcharge equal to the amount of the fine imposed for the speed violation, but not less than $25.\nOn determining upon the basis of an engineering and traffic investigation that any speed set forth in this section is greater or less than is reasonable or safe under the conditions found to exist on any trunk highway or upon any part thereof, the commissioner may erect appropriate signs designating a reasonable and safe speed limit thereat, which speed limit shall be effective when such signs are erected. Any speeds in excess of such limits shall be prima facie evidence that the speed is not reasonable or prudent and that it is unlawful; except that any speed limit within any municipality shall be a maximum limit and any speed in excess thereof shall be unlawful. On determining upon that basis that a part of the trunk highway system outside a municipality should be a zone of maximum speed limit, the commissioner may establish that part as such a zone by erecting appropriate signs showing the beginning and end of the zone, designating a reasonable and safe speed therefor, which may be different than the speed set forth in this section, and that it is a zone of maximum speed limit. The speed so designated by the commissioner within any such zone shall be a maximum speed limit, and speed in excess of such limit shall be unlawful. The commissioner may in the same manner from time to time alter the boundary of such a zone and the speed limit therein or eliminate such zone.\n[Repealed, 1997 c 143 s 20]\nWhen local authorities believe that the existing speed limit upon any street or highway, or part thereof, within their respective jurisdictions and not a part of the trunk highway system is greater or less than is reasonable or safe under existing conditions, they may request the commissioner to authorize, upon the basis of an engineering and traffic investigation, the erection of appropriate signs designating what speed is reasonable and safe, and the commissioner may authorize the erection of appropriate signs designating a reasonable and safe speed limit thereat, which speed limit shall be effective when such signs are erected. Any speeds in excess of these speed limits shall be prima facie evidence that the speed is not reasonable or prudent and that it is unlawful; except that any speed limit within any municipality shall be a maximum limit and any speed in excess thereof shall be unlawful. Alteration of speed limits on streets and highways shall be made only upon authority of the commissioner except as provided by law.\n(a) Local authorities may establish a school speed limit within a school zone of a public or nonpublic school upon the basis of an engineering and traffic investigation as prescribed by the commissioner of transportation. The establishment of a school speed limit on any trunk highway shall be with the consent of the commissioner of transportation. Such school speed limits shall be in effect when children are present, going to or leaving school during opening or closing hours or during school recess periods. The school speed limit shall not be lower than 15 miles per hour and shall not be more than 30 miles per hour below the established speed limit on an affected street or highway.\n(b) The school speed limit shall be effective upon the erection of appropriate signs designating the speed and indicating the beginning and end of the reduced speed zone. Any speed in excess of such posted school speed limit is unlawful. All such signs shall be erected by the local authorities on those streets and highways under their respective jurisdictions and by the commissioner of transportation on trunk highways.\n(c) For the purpose of this subdivision, \"school zone\" means that section of a street or highway which abuts the grounds of a school where children have access to the street or highway from the school property or where an established school crossing is located provided the school advance sign prescribed by the Manual on Uniform Traffic Control Devices adopted by the commissioner of transportation pursuant to section 169.06 is in place. All signs erected by local authorities to designate speed limits in school zones shall conform to the Manual on Uniform Traffic Control Devices.\n(d) Notwithstanding section 609.0331 or 609.101 or other law to the contrary, a person who violates a speed limit established under this subdivision is assessed an additional surcharge equal to the amount of the fine imposed for the violation, but not less than $25.\nWhen any segment of at least a quarter-mile in distance of any city street, municipal state-aid street, or town road on which a speed limit in excess of 30 miles per hour has been established pursuant to an engineering and traffic investigation by the commissioner meets the definition of \"urban district\" as defined in section 169.011, subdivision 90, the governing body of the city or town may by resolution declare the segment to be an urban district and may establish on the segment the speed limit for urban districts prescribed in subdivision 2. The speed limit so established shall be effective upon the erection of appropriate signs designating the speed and indicating the beginning and end of the segment on which the speed limit is established, and any speed in excess of such posted limits shall be unlawful. A copy of the resolution shall be transmitted to the commissioner at least ten days prior to the erection of the signs.\nLocal authorities may regulate speed limits for alleyways as defined in section 169.011 based on their own engineering and traffic investigations. Alleyway speed limits established at other than ten miles per hour shall be effective when proper signs are posted.\n(a) Notwithstanding subdivision 2 and subject to subdivision 3, the speed limit on a road having an established speed limit of 50 miles per hour or greater is adjusted to 45 miles per hour in a work zone when (1) at least one lane or portion of a lane of traffic is closed in either direction, and (2) workers are present. A speed in excess of the adjusted speed limit is unlawful.\n(b) Paragraph (a) does not apply to a segment of road in which:\n(1) positive barriers are placed between workers and the traveled portion of the highway;\n(2) the work zone is in place for less than 24 hours;\n(3) a different speed limit for the work zone is determined by the road authority following an engineering and traffic investigation and based on accepted engineering practice; or\n(4) a different speed limit for the work zone is established by the road authority under paragraph (c).\n(c) The commissioner, on trunk highways and temporary trunk highways, and local authorities, on streets and highways under their jurisdiction, may authorize the use of reduced maximum speed limits in work zones when workers are present, without an engineering and traffic investigation required. The work zone speed limit must not reduce the speed limit on the affected street or highway by more than:\n(1) 20 miles per hour on a street or highway having an established speed limit of 55 miles per hour or greater; and\n(2) 15 miles per hour on a street or highway having an established speed limit of 50 miles per hour or less.\n(d) A work zone speed limit under paragraph (c) is effective on erection of appropriate regulatory speed limit signs. The signs must be removed or covered when they are not required. A speed in excess of the posted work zone speed limit is unlawful.\n(e) For any speed limit under this subdivision, a road authority shall erect signs identifying the speed limit and indicating the beginning and end of the speed limit zone.\nThe political subdivision with authority over a park may establish a speed limit on a road located within the park. A speed limit established under this subdivision on a trunk highway is effective only with the commissioner's approval. A speed limit established under this subdivision must be based on an engineering and traffic investigation prescribed by the commissioner of transportation and must not be lower than 20 miles per hour, and no speed limit established under this subdivision may reduce existing speed limits by more than 15 miles per hour. A speed limit established under this subdivision is effective on the erection of appropriate signs designating the speed limit and indicating the beginning and end of the reduced speed zone. Any speed in excess of the posted speed is unlawful.\n(a) A rural residential district existing and lawfully signed before August 1, 2009, continues to qualify as a rural residential district.\n(b) A rural residential district existing and lawfully signed before August 1, 2009, is subject to the speed limit signed before August 1, 2009.\n[See Note.]\nNotwithstanding any provision to the contrary in this section, the speed limit on St. Louis County Road 128 in Eagles Nest Township between marked Trunk Highway 169 and County Road 989 is 40 miles per hour. The county engineer must erect appropriate signs displaying the 40 miles per hour speed limit.\nA city may establish speed limits for city streets under the city's jurisdiction other than the limits provided in subdivision 2 without conducting an engineering and traffic investigation. This subdivision does not apply to town roads, county highways, or trunk highways in the city. A city that establishes speed limits pursuant to this section must implement speed limit changes in a consistent and understandable manner. The city must erect appropriate signs to display the speed limit. A city that uses the authority under this subdivision must develop procedures to set speed limits based on the city's safety, engineering, and traffic analysis. At a minimum, the safety, engineering, and traffic analysis must consider national urban speed limit guidance and studies, local traffic crashes, and methods to effectively communicate the change to the public.\n(a) Upon request by the local authority, the commissioner may establish a temporary or permanent speed limit in a safe road zone designated under section 169.065, other than the limits provided in subdivision 2, based on an engineering and traffic investigation.\n(b) The speed limit under this subdivision is effective upon the erection of appropriate signs designating the speed and indicating the beginning and end of the segment on which the speed limit is established. Any speed in excess of the posted limit is unlawful.\nNotwithstanding any provision to the contrary in this section, the speed limit on Trunk Highway 19 in the city of Lonsdale between 5th Avenue Northwest and the northern city limits is 45 miles per hour. The commissioner must erect appropriate signs displaying the speed limit.\n[Repealed, Ex1971 c 27 s 49]\nA person convicted of operating a motor vehicle in violation of a speed limit in a work zone, or any other provision of this section while in a work zone, shall be required to pay a fine of $300. This fine is in addition to the surcharge under section 357.021, subdivision 6.\nThe provisions of this chapter declaring speed limitation shall not be construed to relieve the plaintiff in any civil action from the burden of proving negligence on the part of the defendant as the proximate cause of an accident.\nOn determining upon the basis of an engineering and traffic investigation that a speed at least as great as, or in excess of, a specified and determined minimum is necessary to the reasonable and safe use of any trunk highway or portion thereof, the commissioner may erect appropriate signs specifying the minimum speed on such highway or portion thereof. The minimum speed shall be effective when such signs are erected. Any speeds less than the posted minimum speeds shall be prima facie evidence that the speed is not reasonable or prudent and that it is unlawful.\nIn any prosecution in which the rate of speed of a motor vehicle is relevant, evidence of the speed of a motor vehicle as indicated on the speedometer thereof shall be admissible on a showing that a vehicle is regularly used in traffic law enforcement and that the speedometer thereon is regularly and routinely tested for accuracy and a record of the results of said tests kept on file by the agency having control of said vehicle. Evidence as to the speed indicated on said speedometer shall be prima facie evidence that the said vehicle was, at the time said reading was observed, traveling at the rate of speed so indicated; subject to correction by the amount of error, if any, shown to exist by the test made closest in time to the time of said reading.\nRecords of speedometer tests kept in the regular course of operations of any law enforcement agency shall be admissible without further foundation, as to the results of said tests. Such records shall be available to the defendant upon demand. Nothing herein shall be construed to preclude or interfere with the cross examination or impeachment of evidence of rate of speed as indicated by speedometer readings, pursuant to the Rules of Evidence.\n(a) In any prosecution in which the rate of speed of a motor vehicle is relevant, evidence of the speed as indicated on radar or other speed-measuring device, including but not limited to a speed safety camera system, is admissible in evidence, subject to the following conditions:\n(1) the officer or traffic enforcement agent under section 169.147 operating the device has sufficient training to properly operate the equipment;\n(2) the officer or traffic enforcement agent testifies as to the manner in which the device was set up and operated;\n(3) the device was operated with minimal distortion or interference from outside sources; and\n(4) the device was tested by an accurate and reliable external mechanism, method, or system at the time it was set up.\n(b) Records of tests made of such devices and kept in the regular course of operations of any law enforcement agency are admissible in evidence without further foundation as to the results of the tests. The records shall be available to a defendant upon demand. Nothing in this subdivision shall be construed to preclude or interfere with cross examination or impeachment of evidence of the rate of speed as indicated on the radar or speed-measuring device.\n(c) Evidence from a speed safety camera system may be used solely for a citation or prosecution for a violation under subdivision 13.\n(a) Law enforcement agencies that use handheld radar units shall establish operating procedures to reduce the operator's exposure to microwave radiation.\n(b) The procedures, at a minimum, must require:\n(1) that the operator turn the unit off when it is not in use;\n(2) if the unit has a standby mode, that the operator use this mode except when measuring a vehicle's speed;\n(3) that the operator not allow the antenna to rest against the operator's body while it is in operation; and\n(4) that the operator always point the antenna unit away from the operator and any other person in very close proximity to the unit.\nFor purposes of this section, \"radar jammer\" means any instrument, device, or equipment designed or intended for use with a vehicle or otherwise to jam or interfere in any manner with a speed-measuring device operated by a peace officer.\nNo person shall sell, offer for sale, use, or possess any radar jammer in this state.\n(a) Subject to subdivision 14, if a motor vehicle is operated in violation of a speed limit and the violation is identified through the use of a speed safety camera system implemented under section 169.147, the owner of the vehicle or the lessee of the vehicle is guilty of a petty misdemeanor and must pay a fine of:\n(1) $40; or\n(2) $80, if the violation is for a speed at least 20 miles per hour in excess of the speed limit.\n(b) A person who commits a first offense under paragraph (a) must be given a warning and is not subject to a fine or conviction under paragraph (a). A person who commits a second offense under paragraph (a) is eligible for diversion, which must include a traffic safety course established under section 169.147, subdivision 11. A person who enters diversion and completes the traffic safety course is not subject to a fine or conviction under paragraph (a).\n(c) Paragraph (b) does not apply to:\n(1) a violation that occurs in a commercial motor vehicle; or\n(2) a violation committed by a holder of a class A, B, or C commercial driver's license or commercial driver learner's permit, without regard to whether the violation was committed in a commercial motor vehicle or another vehicle.\n(d) This subdivision applies to violations committed on or after August 1, 2025, and before August 1, 2029.\n(a) An owner or lessee of a motor vehicle is not subject to a fine or conviction under subdivision 13 if:\n(1) the vehicle was stolen at the time of the violation;\n(2) a transfer of interest in the vehicle in compliance with section 168A.10 was made before the time of the violation;\n(3) the vehicle owner is a lessor of the motor vehicle, and the lessor identifies the name and address of the lessee;\n(4) the vehicle is an authorized emergency vehicle operated in the performance of official duties at the time of the violation;\n(5) another person is convicted, within the meaning under section 171.01, subdivision 29, for the same violation;\n(6) the vehicle owner provides a sworn statement to the court or prosecuting authority that the owner was not operating the vehicle at the time of the violation; or\n(7) the vehicle owner provides a sworn statement to the court or prosecuting authority that the owner was operating the vehicle at the time of the violation under the circumstances of a medical emergency for either the driver or a passenger in the vehicle.\n(b) The owner or lessee of a motor vehicle may not be issued a citation under subdivision 13 and under another subdivision in this section for the same conduct.\n(c) Except as provided in subdivision 13, paragraph (c), a fine or conviction under subdivision 13 does not constitute grounds for revocation or suspension of a person's driver's license.\n(d) A vehicle owner asserting a defense under paragraph (a), clause (7), must provide an accompanying sworn statement from the physician responsible for treatment of the underlying condition or emergency that necessitated medical attention.\n(e) This subdivision applies to violations committed on or after August 1, 2025, and before August 1, 2029.",
	"repealed": false
}