{
	"id": "103F.325",
	"url": "https://www.revisor.mn.gov/statutes/cite/103F.325",
	"title": "103F.325 DESIGNATION PROCEDURE.",
	"text": "(a) For each river proposed to be included in the wild and scenic rivers system, the commissioner shall prepare a management plan, without unreasonable restrictions upon compatible, preexisting, economic uses of particular tracts of land, to preserve and enhance the values that cause the river to be proposed for inclusion in the system.\n(b) The plan shall:\n(1) give primary emphasis to the area's scenic, recreational, natural, historical, scientific and similar values;\n(2) state the proposed classification of the river and segments of the river;\n(3) designate the boundaries of the area along the river to be included within the system, which may not include more than 320 acres per mile on both sides of the river; and\n(4) include proposed rules governing the use of public lands and waters within the area, which may differ from statewide rules to the extent necessary to take account of the particular attributes of the area.\n(c) The plan may include proposed standards and criteria adopted under section 103F.321 for local land use controls that differ from statewide standards and criteria to the extent necessary to take account of the particular attributes of the area.\n(a) The commissioner shall make the proposed management plan available to affected local governmental bodies, shoreland owners, conservation and outdoor recreation groups, the commissioner of employment and economic development, the commissioner of commerce, the governor, and the general public. The commissioners of employment and economic development, the State Energy Office in the Department of Commerce, and the governor shall review the proposed management plan in accordance with the criteria in section 86A.09, subdivision 3, and submit any written comments to the commissioner within 60 days after receipt of the proposed management plan.\n(b) By 60 days after making the information available, the commissioner shall conduct a public hearing on the proposed management plan in the county seat of each county that contains a portion of the designated system area, in the manner provided in chapter 14.\nUpon receipt of the administrative law judge's report, the commissioner shall immediately forward the proposed management plan and the administrative law judge's report to the commissioners of employment and economic development and of commerce for review under section 86A.09, subdivision 3, except that the review by the commissioners must be completed or be deemed completed within 30 days after receiving the administrative law judge's report, and the review by the governor must be completed or be deemed completed within 15 days after receipt.\nWithin 60 days after receipt of the administrative law judge's report, the commissioner shall decide whether to designate by order the river or a segment of the river as a wild, scenic, or recreational river and, if so designated, shall adopt a management plan to govern the area. The commissioner shall notify and inform public agencies and private landowners of the plan and its purposes to encourage their cooperation in the management and use of their land in a manner consistent with the plan and its purposes.\nThe legislature may at any time designate additional rivers to be included within the system, exclude rivers previously included in the system, or change the classification of rivers classified by the commissioner.",
	"repealed": false
}