{
	"id": "214.09",
	"url": "https://www.revisor.mn.gov/statutes/cite/214.09",
	"title": "214.09 MEMBERSHIP; COMPENSATION; REMOVAL; VACANCIES.",
	"text": "The following standard provisions shall apply to the health-related and non-health-related licensing boards and to agencies created after July 1, 1975 in the executive branch, other than departments, whose primary functions include licensing, registration or certification of persons in specified professions or occupations.\nAn appointment to a board must be made in the manner provided in section 15.0597. The terms of the members shall be four years with the terms ending on the first Monday in January. The appointing authority shall appoint as nearly as possible one-fourth of the members to terms expiring each year. If the number of members is not evenly divisible by four, the greater number of members, as necessary, shall be appointed to terms expiring in the year of commencement of the governor's term and the year or years immediately thereafter. If the number of terms which can be served by a member of a board is limited by law, a partial term must be counted for this purpose if the time served by a member is greater than one-half of the duration of the regular term. If the membership is composed of categories of members from occupations, industries, political subdivisions, the public or other groupings of persons, and if the categories have two or more members each, the appointing authority shall appoint as nearly as possible one-fourth of the members in each category at each appointment date. Members may serve until their successors are appointed and qualify. If the appointing authority fails to appoint a successor by July 1 of the year in which the term expires, the term of the member for whom a successor has not been appointed shall extend until the first Monday in January four years after the scheduled end of the original term.\n(a) Members of health-related licensing boards may be compensated at the rate of $75 a day spent on board activities and members of non-health-related licensing boards may be compensated at the rate of $55 a day spent on board activities when authorized by the board, plus expenses in the same manner and amount as authorized by the commissioner's plan adopted under section 43A.18, subdivision 2. Members who, as a result of time spent attending board meetings, incur child care expenses that would not otherwise have been incurred, may be reimbursed for those expenses upon board authorization.\n(b) Members who are state employees or employees of the political subdivisions of the state must not receive the daily payment for activities that occur during working hours for which they are also compensated by the state or political subdivision. However, a state or political subdivision employee may receive the daily payment if the employee uses vacation time or compensatory time accumulated in accordance with a collective bargaining agreement or compensation plan for board activity. Members who are state employees or employees of the political subdivisions of the state may receive the expenses provided for in this subdivision unless the expenses are reimbursed by another source. Members who are state employees or employees of political subdivisions of the state may be reimbursed for child care expenses only for time spent on board activities that are outside their working hours.\n(c) Each board must adopt internal standards prescribing what constitutes a day spent on board activities for purposes of making daily payments under this subdivision.\nA member may be removed by the appointing authority at any time (1) for cause after notice and hearing, (2) if the board fails to prepare and submit the report required by section 214.07, or (3) after missing three consecutive meetings. The chair of the board shall inform the appointing authority of a member missing the three consecutive meetings. After the second consecutive missed meeting and before the next meeting, the secretary of the board shall notify the member in writing that the member may be removed for missing the next meeting. In the case of a vacancy on the board, the appointing authority shall appoint a person to fill the vacancy for the remainder of the unexpired term.\nNo current member of a health-related licensing board may seek a paid employment position with that board.",
	"repealed": false
}