{
	"id": "152.11",
	"url": "https://www.revisor.mn.gov/statutes/cite/152.11",
	"title": "152.11 PRESCRIPTIONS.",
	"text": "(a) A written prescription or an oral prescription reduced to writing, when issued for a controlled substance in Schedule II, III, IV, or V, is void unless (1) it is written in ink and contains the name and address of the person for whose use it is intended; (2) it states the amount of the controlled substance to be compounded or dispensed, with directions for its use; (3) if a written prescription, it contains the handwritten signature, address, and federal registry number of the prescriber and a designation of the branch of the healing art pursued by the prescriber; and if an oral prescription, the name and address of the prescriber and a designation of the prescriber's branch of the healing art; and (4) it shows the date when signed by the prescriber, or the date of acceptance in the pharmacy if an oral prescription.\n(b) An electronic prescription for a controlled substance in Schedule II, III, IV, or V is void unless it complies with the standards established pursuant to section 62J.497 and with those portions of Code of Federal Regulations, title 21, parts 1300, 1304, 1306, and 1311, that pertain to electronic prescriptions.\n(c) A prescription for a controlled substance in Schedule II, III, IV, or V that is transmitted by facsimile, either computer to facsimile machine or facsimile machine to facsimile machine, is void unless it complies with the applicable requirements of Code of Federal Regulations, title 21, part 1306.\n(d) Every licensed pharmacy that dispenses a controlled substance prescription shall retain the original prescription in a file for a period of not less than two years, open to inspection by any officer of the state, county, or municipal government whose duty it is to aid and assist with the enforcement of this chapter. An original electronic or facsimile prescription may be stored in an electronic database, provided that the database provides a means by which original prescriptions can be retrieved, as transmitted to the pharmacy, for a period of not less than two years.\n(e) Every licensed pharmacy shall distinctly label the container in which a controlled substance is dispensed with the directions contained in the prescription for the use of that controlled substance.\nNo person may dispense a controlled substance included in Schedule II of section 152.02 without a prescription issued by a doctor of medicine, a doctor of osteopathic medicine licensed to practice medicine, a doctor of dental surgery, a doctor of dental medicine, a doctor of podiatry, or a doctor of veterinary medicine, lawfully licensed to prescribe in this state or by a practitioner licensed to prescribe controlled substances by the state in which the prescription is issued, and having a current federal Drug Enforcement Administration registration number. The prescription must either be printed or written in ink and contain the handwritten signature of the prescriber or be transmitted electronically or by facsimile as permitted under subdivision 1. Provided that in emergency situations, as authorized by federal law, such drug may be dispensed upon oral prescription reduced promptly to writing and filed by the pharmacist. Such prescriptions shall be retained in conformity with section 152.101. No prescription for a Schedule II substance may be refilled.\n(a) Except as provided in paragraph (b), no person may dispense a controlled substance included in Schedule III or IV of section 152.02 without a prescription issued, as permitted under subdivision 1, by a doctor of medicine, a doctor of osteopathic medicine licensed to practice medicine, a doctor of dental surgery, a doctor of dental medicine, a doctor of podiatry, a doctor of optometry limited to Schedule IV, or a doctor of veterinary medicine, lawfully licensed to prescribe in this state or from a practitioner licensed to prescribe controlled substances by the state in which the prescription is issued, and having a current federal drug enforcement administration registration number. Such prescription may not be dispensed or refilled except with the documented consent of the prescriber, and in no event more than six months after the date on which such prescription was issued and no such prescription may be refilled more than five times.\n(b) This subdivision does not apply to cannabis plants, cannabis flower, cannabis products, or hemp-derived consumer products sold or transferred in compliance with chapter 342.\nA prescription need not bear a federal drug enforcement administration registration number that authorizes the prescriber to prescribe controlled substances if the drug prescribed is not a controlled substance in Schedule II, III, IV, or V. No person shall impose a requirement inconsistent with this subdivision.\nNo person or entity may offer for sale, sell, lease, or otherwise release a federal drug enforcement administration registration number for any reason, except for drug enforcement purposes authorized by this chapter and the federal controlled substances registration system. For purposes of this section, an entity includes a state governmental agency or regulatory board, a health plan company as defined under section 62Q.01, subdivision 4, a managed care organization as defined under section 62Q.01, subdivision 5, or any other entity that maintains prescription data.\nNo entity may use a federal drug enforcement administration registration number to identify or monitor the prescribing practices of a prescriber to whom that number has been assigned, except for drug enforcement purposes authorized by this chapter and the federal controlled substances registration system. For purposes of this section, an entity includes a health plan company as defined under section 62Q.01, subdivision 4, a managed care organization as defined under section 62Q.01, subdivision 5, or any other entity that maintains prescription data.\nNo person may dispense a controlled substance included in Schedules II through V without requiring the person purchasing the controlled substance, who need not be the patient for whom the controlled substance prescription is written, to present valid photographic identification, unless the person purchasing the controlled substance is known to the dispenser. A doctor of veterinary medicine who dispenses a controlled substance must comply with this subdivision.\nFor the purpose of this section, nothing shall prohibit the dispensing of orphan drugs prescribed by a person practicing in and licensed by another state as a physician, dentist, veterinarian, or podiatrist; who has a current federal drug enforcement administration registration number; and who may legally prescribe Schedule II, III, IV, or V controlled substances in that state.\n(a) When used for the treatment of acute pain, prescriptions for opiates or narcotic pain relievers listed in Schedules II through IV in section 152.02 shall not exceed a seven-day supply for an adult and shall not exceed a five-day supply for a minor under 18 years of age.\n(b) Notwithstanding paragraph (a), when used for the treatment of acute dental pain, including acute pain associated with wisdom teeth extraction surgery or acute pain associated with refractive surgery, prescriptions for opiate or narcotic pain relievers listed in Schedules II through IV of section 152.02 shall not exceed a four-day supply.\n(c) For the purposes of this subdivision, \"acute pain\" means pain resulting from disease, accidental or intentional trauma, surgery, or another cause, that the practitioner reasonably expects to last only a short period of time. Acute pain does not include chronic pain or pain being treated as part of cancer care, palliative care, or hospice or other end-of-life care.\n(d) Notwithstanding paragraph (a) or (b), if, in the professional clinical judgment of a practitioner, more than the limit specified in paragraph (a) or (b) is required to treat a patient's acute pain, the practitioner may issue a prescription for the quantity needed to treat the patient's acute pain.",
	"repealed": false
}