{
	"id": "354.094",
	"url": "https://www.revisor.mn.gov/statutes/cite/354.094",
	"title": "354.094 EXTENDED LEAVES OF ABSENCE.",
	"text": "(a) Upon granting any extended leave of absence under section 122A.46 or 136F.43, the employing unit granting the leave must certify the leave to the association on a form specified by the executive director. A member granted an extended leave of absence under section 122A.46 or 136F.43 shall receive allowable and formula service credit toward annuities and other benefits under this chapter, for each year of the leave, provided that payment is made as specified in paragraph (b). The employer may enter into an agreement with the exclusive bargaining representative of the teachers in the district under which, for an individual teacher, all or a portion of the employee's contribution is paid by the employer. Any such agreement must include a sunset of eligibility to qualify for the payment and must not be a part of the collective bargaining agreement. The leave period must not exceed five years. A member may not receive more than five years of allowable or formula service credit under this section.\n(b) Employee contribution payments without interest for the years for which a member is receiving service credit while on extended leave must be made on or before June 30 of each fiscal year for which service credit is to be received, or in instances of late reporting by the employer, within 30 days after the association gives notification to the member of the amount due. Payment is authorized after June 30 as specified in section 354.72.\n(c) Notwithstanding the provisions of any agreements to the contrary, payments may not be made to receive allowable and formula service credit if the member does not have full reinstatement rights as provided in section 122A.46 or 136F.43, both during and at the end of the extended leave.\n(d) Any school district paying the employee's retirement contributions or payments under this section shall forward to the Teachers Retirement Association a copy of the agreement executed by the school district and the employee.\n[Repealed, 1991 c 130 s 38; 1991 c 340 s 34]\n[Repealed, 1991 c 130 s 38; 1991 c 340 s 34]\nNotwithstanding section 354.49, subdivision 4, clause (3), a member on extended leave under subdivision 1 shall retain membership in the association if payment under subdivision 1, paragraph (b), or section 354.72, is made, under the same terms and conditions as if the member had continued to teach in the district or the Minnesota State Colleges and Universities system.\nA member on extended leave of absence under section 122A.46 or 136F.43 who fails to make payments under subdivision 1, paragraph (b), or section 354.72, for any given year of the leave shall be deemed to cease to render teaching services beginning in that year for purposes of this chapter and may not make payment to the fund for any subsequent year of the leave until full payment is made for all prior years of the leave. Failure to make payment does not affect the rights or obligations of the member or the member's employer under section 122A.46 or 136F.43.\nA member who makes the payments specified in subdivision 1, paragraph (b), or section 354.72, to the fund for the agreed maximum duration of an extended leave and who does not resume teaching in the first school year after that maximum duration has elapsed is deemed to cease to render teaching services beginning in that year for purposes of this chapter.\nThe provisions of this section do not apply to a member who is discharged or placed on unrequested leave of absence or retrenchment or layoff or whose contract is terminated while the member is on an extended leave of absence under section 122A.46 or 136F.43.\nA member who makes the payments required under subdivision 1, paragraph (b), or section 354.72, and receives allowable and formula service credit in the association under this section may not pay employee contributions or receive allowable or formula service credit for the same fiscal year in any other Minnesota public employee pension plan, except a firefighters relief association governed by sections 424A.091 to 424A.096. This subdivision must not be construed to prohibit a member who receives allowable and formula service credit in the association under this section for a given year from being employed as a substitute teacher by any school district during that year. Notwithstanding the provisions of sections 354.091 and 354.42, a teacher may not pay retirement contributions or receive allowable or formula service credit in the association for teaching service rendered for any part of any year for which the teacher pays retirement contributions or receives allowable or formula service credit under this section or section 354A.091 while on an extended leave of absence under section 122A.46.",
	"repealed": false
}