{
	"id": "84A.40",
	"url": "https://www.revisor.mn.gov/statutes/cite/84A.40",
	"title": "84A.40 COUNTY MAY ASSUME BONDS.",
	"text": "(a) Any county where a project or portion of it is located may voluntarily assume, in the manner specified in this section, the obligation to pay a portion of the principal and interest of the bonds issued before the approval and acceptance of the project and remaining unpaid at maturity, of any school district or town in the county and wholly or partly within the project. The portion must bear the same proportion to the whole of the unpaid principal and interest as the last net tax capacity, before the acceptance of the project, of lands then acquired by the state under sections 84A.31 to 84A.42 in the school districts or towns bears to the total net tax capacity for the same year of the school district or town. This assumption must be evidenced by a resolution of the county board of the county. A copy of the resolution must be certified to the commissioner of management and budget within one year after the acceptance of the project.\n(b) Later, if any of the bonds remains unpaid at maturity, the county board shall, upon demand of the governing body of the school district or town or of a bondholder, provide for the payment of the portion assumed. The county shall levy general taxes on all the taxable property of the county for that purpose, or issue its bonds to raise the sum needed, conforming to law respecting the issuance of county refunding bonds. The proceeds of taxes or bonds must be paid by the county treasurer to the treasurer of the school district or town. No payments shall be made by the county to the school district or town until the money in the treasury of the school district or town, together with the money to be paid by the county, is sufficient to pay in full each of the bonds as it becomes due.\n(c) If a county fails to adopt and certify the resolution, the commissioner of management and budget shall withhold from the payments to be made to the county under section 84A.32 a sum equal to that portion of the principal and interest of the outstanding bonds that bears the same proportion to the whole of the bonds as the above determined net tax capacity of lands acquired by the state within the project bears to the total net tax capacity for the same year of the school district or town. Money withheld from the county must be set aside in the state treasury and not paid to the county until the full principal and interest of the school district and town bonds have been paid.\n(d) If any bonds remain unpaid at maturity, upon the demand of the governing body of the school district or town, or a bondholder, the commissioner of management and budget shall issue to the treasurer of the school district or town a payment for that portion of the past due principal and interest computed as in the case of the county's liability authorized in this section to be voluntarily assumed. Money received by a school district or town under this section must be applied to the payment of past-due bonds and interest.",
	"repealed": false
}