{
	"id": "256.9631",
	"url": "https://www.revisor.mn.gov/statutes/cite/256.9631",
	"title": "256.9631 ALTERNATIVE CARE DELIVERY MODELS FOR MEDICAL ASSISTANCE AND MINNESOTACARE.",
	"text": "(a) The commissioner, in order to deliver services to eligible individuals, achieve better health outcomes, and reduce the cost of health care for the state, shall develop implementation plans for at least three care delivery models that:\n(1) are alternatives to the use of commercial managed care plans to deliver health care to Minnesota health care program enrollees; and\n(2) do not shift financial risk to nongovernmental entities.\n(b) One of the alternative models must be a direct payment system under which eligible individuals receive services through the fee-for-service system, county-based purchasing plans, and county-owned health maintenance organizations. At least one additional model must include county-based purchasing plans and county-owned health maintenance organizations in their design, and must allow these entities to deliver care in geographic areas on a single plan basis, if:\n(1) these entities contract with all providers that agree to contract terms for network participation; and\n(2) the commissioner of human services determines that an entity's provider network is adequate to ensure enrollee access and choice.\n(c) Before determining the alternative models for which implementation plans will be developed, the commissioner shall consult with the chairs and ranking minority members of the legislative committees with jurisdiction over health care finance and policy.\n(d) The commissioner shall present implementation plans for the selected models to the chairs and ranking minority members of the legislative committees with jurisdiction over health care finance and policy by January 15, 2026. The commissioner may contract for technical assistance in developing the implementation plans and conducting related studies and analyses.\n(a) For purposes of this section, the following terms have the meanings given.\n(b) \"Eligible individuals\" means all medical assistance and MinnesotaCare enrollees.\n(c) \"Minnesota health care programs\" means the medical assistance and MinnesotaCare programs.\n(d) \"Qualified hospital provider\" means a nonstate government teaching hospital with high medical assistance utilization and a level 1 trauma center, and all of the hospital's owned or affiliated health care professionals, ambulance services, sites, and clinics.\n(a) Each implementation plan must include:\n(1) a timeline for the development and recommended implementation date of the alternative model. In recommending a timeline, the commissioner must consider:\n(i) timelines required by the existing contracts with managed care plans and county-based purchasing plans to sunset existing delivery models;\n(ii) in counties that choose to operate a county-based purchasing plan under section 256B.692, timelines for any new procurements required for those counties to establish a new county-based purchasing plan or participate in an existing county-based purchasing plan;\n(iii) in counties that choose to operate a county-owned health maintenance organization under section 256B.69, timelines for any new procurements required for those counties to establish a new county-owned health maintenance organization or to continue serving enrollees through an existing county-owned health maintenance organization; and\n(iv) a recommendation on whether the commissioner should contract with a third-party administrator to administer the alternative model, and the timeline needed for procuring an administrator;\n(2) the procedures to be used to ensure continuity of care for enrollees who transition from managed care to fee-for-service and any administrative resources needed to carry out these procedures;\n(3) recommended quality measures for health care service delivery;\n(4) any changes to fee-for-service payment rates that the commissioner determines are necessary to ensure provider access and high-quality care and to reduce health disparities;\n(5) recommendations on ensuring effective care coordination under the alternative model, especially for enrollees who:\n(i) are age 65 or older, blind, or have disabilities;\n(ii) have complex medical conditions;\n(iii) face socioeconomic barriers to receiving care; or\n(iv) are from underserved populations that experience health disparities;\n(6) recommendations on payment arrangements for care coordination, including:\n(i) the provider types eligible for care coordination payments;\n(ii) procedures to coordinate care coordination payments with existing supplemental or cost-based payment methods or to replace these existing methods; and\n(iii) procedures to align care coordination initiatives funded under the alternative model with existing care coordination initiatives;\n(7) recommendations on whether the alternative model should include funding to providers for outreach initiatives to patients who, because of mental illness, homelessness, or other circumstances, are unlikely to obtain needed care and treatment;\n(8) recommendations for a supplemental payment to qualified hospital providers to offset any potential revenue losses resulting from the shift from managed care payments; and\n(9) recommendations for statutory changes necessary to implement the alternative model.\n(b) In developing each implementation plan, the commissioner shall:\n(1) calculate the projected cost of the alternative model relative to the cost of the current system;\n(2) assess gaps in care coordination under the current medical assistance and MinnesotaCare programs;\n(3) evaluate the effectiveness of approaches other states have taken to coordinate care under a fee-for-service system, including the coordination of care provided to persons who are age 65 or older, are blind, or have disabilities;\n(4) estimate the loss of revenue and cost savings from other payment enhancements based on managed care plan directed payments and pass-throughs;\n(5) estimate cost trends under the alternative model for managed care payments to county-based purchasing plans and county-owned health maintenance organizations;\n(6) estimate the impact of the alternative model on other revenue, including taxes, surcharges, or other federally approved in lieu of services and on other arrangements allowed under managed care;\n(7) consider allowing eligible individuals to opt out of managed care as an alternative approach;\n(8) consult with the commissioners of health and commerce and the contractor or contractors analyzing the Minnesota Health Plan and other health reform models on plan design and assumptions; and\n(9) conduct other analyses necessary to develop the implementation plan.",
	"repealed": false
}