{
	"id": "582.043",
	"url": "https://www.revisor.mn.gov/statutes/cite/582.043",
	"title": "582.043 LOSS MITIGATION; MORTGAGE FORECLOSURE DUAL TRACKING.",
	"text": "(a) For purposes of this section, the terms defined in this subdivision have the meanings given them.\n(b) \"Foreclosure sale date\" means either:\n(1) the date of the foreclosure sale contained in the notice that has been either served or published as required under section 580.03, or 550.18 and 550.19; or\n(2) the date to which the foreclosure sale is postponed by the borrower under section 580.07, subdivision 2,\nwhichever is later.\n(c) \"Loss mitigation option\" means a temporary or permanent loan modification, a forbearance agreement, a repayment agreement, a principal reduction, capitalizing arrears, or any other relief intended to allow a mortgagor to retain ownership of the property.\n(d) \"Mortgagor\" means a person who is liable on the promissory note secured by the mortgage, except that the mortgagor does not include a person who has surrendered the mortgaged property, as evidenced by either a letter or other written notice confirming the surrender or by delivery of the keys to the property to the servicer or authorized agent.\n(e) \"Servicer\" means a residential mortgage servicer as defined in section 58.02, subdivision 20.\n(f) \"Small servicer\" means a servicer that is either:\n(1) a small servicer, as defined in Code of Federal Regulations, title 12, section 1026.41, paragraph (e), clause (4);\n(2) a Housing Finance Agency, as defined in Code of Federal Regulations, title 24, section 266.5; or\n(3) a servicer that has conducted 125 or fewer foreclosure sales during the preceding 12 months.\nThis section applies only to first lien mortgages subject to foreclosure under chapter 580 or 581 that are secured by owner-occupied residential real property containing no more than four dwelling units and where the subject mortgage does not secure a loan for business, commercial, or agricultural purposes. For purposes of this subdivision, \"owner-occupied\" means that the property is the principal residence of the owner.\nNothing in this section imposes a duty on a servicer to provide any mortgagor with any specific loan modification option.\nA servicer shall not conduct a foreclosure sale unless the servicer has complied with subdivisions 5, 6, and 7, if applicable.\nA small servicer is not subject to this section, except that a small servicer shall not refer a mortgage loan to an attorney for foreclosure, record the notice of pendency or lis pendens, or conduct a foreclosure sale if a mortgagor is performing pursuant to the terms of a loan modification or other loss mitigation agreement.\nA servicer must:\n(1) notify a mortgagor in writing of available loss mitigation options offered by the servicer that are applicable to the mortgagor's loan before referring the mortgage loan to an attorney for foreclosure;\n(2) after receiving a request for a loan modification or other loss mitigation option, exercise reasonable diligence in obtaining documents and information from the mortgagor to complete a loss mitigation application, facilitate the submission and review of loss mitigation applications, and give the mortgagor a reasonable amount of time to provide the required documents;\n(3) upon the timely receipt of a loss mitigation application, evaluate the mortgagor for all available loss mitigation options prior to referring a mortgage loan to an attorney for foreclosure;\n(4) after review of the loss mitigation application, timely offer the mortgagor a loan modification if the mortgagor is eligible or, if not, timely offer the mortgagor any other loss mitigation option for which the mortgagor is eligible; and\n(5) comply with any applicable appeal period and procedures applicable to the specific loss mitigation option.\n(a) If the servicer has received a loss mitigation application and the subject mortgage loan has not already been referred to an attorney for foreclosure, a servicer shall not refer the subject mortgage loan to an attorney for foreclosure while the mortgagor's application is pending, unless:\n(1) the servicer determines that the mortgagor is not eligible for any loss mitigation option, the servicer informs the mortgagor of the determination in writing, and the applicable appeal period has expired without an appeal or the appeal has been properly denied;\n(2) where a written offer is made and a written acceptance is required, the mortgagor fails to accept the loss mitigation offer within the time frame specified in the offer or within 14 days after the date of the offer, whichever is longer; or\n(3) the mortgagor declines the loss mitigation offer in writing.\n(b) If the servicer receives a loss mitigation application after the subject mortgage loan has been referred to an attorney for foreclosure, but before a foreclosure sale has been scheduled, a servicer shall not move for an order of foreclosure, seek a foreclosure judgment, or conduct a foreclosure sale unless:\n(1) the servicer determines that the mortgagor is not eligible for a loss mitigation option, the servicer informs the mortgagor of this determination in writing, and the applicable appeal period has expired without an appeal or the appeal has been properly denied;\n(2) where a written offer is made and a written acceptance is required, the mortgagor fails to accept the loss mitigation offer within the time frame specified in the offer or within 14 days after the date of the offer, whichever is longer; or\n(3) the mortgagor declines a loss mitigation offer in writing.\n(c) If the servicer receives a loss mitigation application after the foreclosure sale has been scheduled, but before midnight of the seventh business day prior to the foreclosure sale date, the servicer must halt the foreclosure sale and evaluate the application. If required to halt the foreclosure sale and evaluate the application, the servicer must not move for an order of foreclosure, seek a foreclosure judgment, or conduct a foreclosure sale unless:\n(1) the servicer determines that the mortgagor is not eligible for a loss mitigation option, the servicer informs the mortgagor of this determination in writing, and the applicable appeal period has expired without an appeal or the appeal has been properly denied;\n(2) where a written offer is made and a written acceptance is required, the mortgagor fails to accept the loss mitigation offer within the time frame specified in the offer or within 14 days after the date of the offer, whichever is longer; or\n(3) the mortgagor declines a loss mitigation offer in writing.\n(d) A servicer shall not move for an order of foreclosure or conduct a foreclosure sale under any of the following circumstances:\n(1) the mortgagor is in compliance with the terms of a trial or permanent loan modification, or other loss mitigation option; or\n(2) a short sale has been approved by all necessary parties and proof of funds or financing has been provided to the servicer.\n(a) A mortgagor has a cause of action, based on a violation of this section, to enjoin or set aside a sale. A mortgagor who prevails in an action to set aside or enjoin a sale, or who successfully defends a foreclosure by action based on a violation of this section, is entitled to reasonable attorney fees and costs.\n(b) A lis pendens must be recorded prior to the expiration of the mortgagor's applicable redemption period under section 580.23 or 582.032 for an action taken under paragraph (a). The failure to record the lis pendens creates a conclusive presumption that the servicer has complied with this section.",
	"repealed": false
}