{
	"id": "325F.071",
	"url": "https://www.revisor.mn.gov/statutes/cite/325F.071",
	"title": "325F.071 FLAME-RETARDANT CHEMICALS; PROHIBITION.",
	"text": "(a) For the purposes of this section, the following terms have the meanings given.\n(b) \"Child\" means a person under 12 years of age.\n(c) \"Children's product\" means a product primarily designed or intended by a manufacturer to be used by or for a child, including any article used as a component of such a product, but excluding a food, beverage, dietary supplement, pharmaceutical product or biologic, children's toys that are subject to the most recent version of the American Society for Testing and Materials F963, Standard Consumer Safety Specification for Toy Safety, a medical device as defined in the Federal Food, Drug, and Cosmetic Act, United States Code, title 21, section 321(h), products listed under section 116.9405, clauses (10) and (11), and products listed under sections 325F.03 and 325F.04.\n(d) \"Upholstered residential furniture\" means furniture with padding, coverings, and cushions intended and sold for use in the home.\n(e) \"Mattress\" means a mattress as defined in Code of Federal Regulations, title 16, section 1632.1.\n(f) \"Organohalogenated chemical\" means any chemical that contains one or more carbon elements and one or more halogen elements, including fluorine, chlorine, bromine, or iodine.\n(g) \"Residential textile\" means a textile designed for use in the home as a covering on windows or walls.\n(a) No manufacturer or wholesaler may manufacture, sell, offer for sale, distribute for sale, or distribute for use in this state a children's product, upholstered residential furniture, residential textile, or mattress containing, in amounts greater than 1,000 parts per million in any product component, any organohalogenated flame retardant chemical.\n(b) No retailer may sell or offer for sale or use in this state a children's product, upholstered residential furniture, residential textile, or mattress containing in amounts greater than 1,000 parts per million in any product component the flame retardant chemicals listed in paragraph (a).\n(c) The sale or offer for sale of any previously owned product containing a chemical restricted under this section is exempt from the provisions of this section.\nThe following are exempt from the provisions of this section:\n(1) the sale or offer for sale of any previously owned product containing a chemical restricted under this section;\n(2) an electronic component of a children's product, mattress, upholstered residential furniture, or residential textile or any associated casing;\n(3) a children's product, mattress, upholstered residential furniture, or residential textile for which there is a federal or national flammability standard;\n(4) thread or fiber when used for stitching mattress components together; or\n(5) components of an adult mattress other than foam. As used in this clause, \"adult mattress\" means a mattress other than toddler mattress, crib mattress, or other infant sleep product.\nThe prohibitions in subdivision 2 do not apply to a flame retardant that:\n(1) is a polymeric material in accordance with the criteria in Code of Federal Regulations, title 40, section 723.250, or is chemically reacted to form a polymeric material with the materials it is intended to protect; or\n(2) has a determination of safety under United States Code, title 15, section 2604, subsection (a), paragraph (3), subparagraph (C), or under United States Code, title 15, section 2605, subsection (b), paragraph (4).\nA manufacturer shall not replace a chemical whose use is prohibited under this section with a chemical identified on the basis of credible scientific evidence by a state, federal, or international agency as being known or suspected with a high degree of probability to:\n(1) harm the normal development of a fetus or child or cause other developmental toxicity;\n(2) cause cancer, genetic damage, or reproductive harm;\n(3) disrupt the endocrine or hormone system; or\n(4) damage the nervous system, immune system, or organs, or cause other systemic toxicity.\nThe commissioner of the Pollution Control Agency may enforce compliance with this section under sections 115.071 and 116.072. The commissioner must coordinate with the commissioners of commerce and health in enforcing this section.",
	"repealed": false
}