{
	"id": "103B.515",
	"url": "https://www.revisor.mn.gov/statutes/cite/103B.515",
	"title": "103B.515 INITIATION AND ESTABLISHMENT BY COUNTY BOARD.",
	"text": "The county board may initiate the establishment of a lake improvement district in a portion of the county under this section. The board must adopt a resolution declaring the intent of the board to establish a lake improvement district. The resolution must:\n(1) specify the boundaries of the district, which shall be encouraged to be as consistent as practical with natural hydrologic boundaries;\n(2) prescribe the water and related land resource management programs to be undertaken in the district;\n(3) state how the programs will be financed;\n(4) designate the county officer or agency that will be responsible for supervising the programs; and\n(5) set a date for a hearing on the resolution.\nThe county board shall, at least 30 days before making an order establishing a lake improvement district, send the town board of a town wholly or partially within the boundaries of the proposed district a copy of the resolution and encourage the town board to respond to the proposed creation of the district.\nThe county board must hold a public hearing on whether a lake improvement district should be established. Before the date set for the hearing, any interested person may file objections to the formation of the district with the county auditor. At the hearing, any interested person may offer objections, criticisms, or suggestions about the necessity of the proposed district and how the person's property will be benefited or affected by the establishment of the district.\n(a) The county board may establish a lake improvement district, by order, after making findings, if the board determines that the:\n(1) proposed district is necessary or that the public welfare will be promoted by the establishment of the district;\n(2) property to be included in the district will be benefited by establishing the district; and\n(3) formation of the district will not cause or contribute to long-range environmental pollution.\n(b) The order establishing the district must state the board's findings and specify or prescribe the items contained in subdivision 1, clauses (1) to (4).",
	"repealed": false
}