{
	"id": "84.925",
	"url": "https://www.revisor.mn.gov/statutes/cite/84.925",
	"title": "84.925 EDUCATION AND TRAINING PROGRAM.",
	"text": "(a) The commissioner shall establish:\n(1) a comprehensive all-terrain vehicle environmental and safety education and training certification program, including the preparation and dissemination of vehicle information and safety advice to the public, the training of all-terrain vehicle operators, and the issuance of all-terrain vehicle safety certificates to vehicle operators over the age of 12 years who successfully complete the all-terrain vehicle environmental and safety education and training course; and\n(2) a voluntary all-terrain vehicle online training program for youth and a parent or guardian, offered at no charge for operators at least six years of age but younger than ten years of age.\n(b) A parent or guardian must be present at a training program when the youth is under ten years of age.\n(c) For the purpose of administering the program and to defray the expenses of training and certifying vehicle operators, the commissioner shall collect a fee from each person who receives the training for certification under paragraph (a), clause (1). The commissioner shall collect a fee, to include a $1 issuing fee for licensing agents, for issuing a duplicate all-terrain vehicle safety certificate. The commissioner shall establish both fees in a manner that neither significantly overrecovers nor underrecovers costs, including overhead costs, involved in providing the services. The fees are not subject to the rulemaking provisions of chapter 14 and section 14.386 does not apply. The fees may be established by the commissioner notwithstanding section 16A.1283. Fee proceeds, except for the issuing fee for licensing agents under this subdivision, shall be deposited in the all-terrain vehicle account in the natural resources fund and the amount thereof, except for the electronic licensing system commission established by the commissioner under section 84.027, subdivision 15, and issuing fees collected by the commissioner, is appropriated annually to the Enforcement Division of the Department of Natural Resources for the administration of the programs. In addition to the fee established by the commissioner, instructors may charge each person up to the established fee amount for class materials and expenses.\n(d) The commissioner shall cooperate with private organizations and associations, private and public corporations, and local governmental units in furtherance of the programs established under this section. School districts may cooperate with the commissioner and volunteer instructors to provide space for the classroom portion of the training. The commissioner shall consult with the commissioner of public safety in regard to the subject matter of the training programs and performance testing that leads to the certification of vehicle operators. The commissioner shall incorporate a riding component in the training certification programs established under this section and may incorporate a riding component in the training program established in paragraph (a), clause (2).\n[Repealed, 1989 c 331 s 26]\n(a) The commissioner may enter into reciprocity agreements or otherwise certify all-terrain vehicle environmental and safety education and training courses from other states that are substantially similar to in-state courses. Proof of completion of a course subject to a reciprocity agreement or certified as substantially similar is adequate to meet the safety certificate requirements of sections 84.92 to 84.928.\n(b) Proof of completion of the ATV RiderCourse offered by the All-Terrain Vehicle Safety Institute is adequate to meet the safety certificate requirements of sections 84.92 to 84.928.\nThe fee to issue a duplicate all-terrain vehicle safety certificate under subdivision 1 is not subject to the rulemaking provisions of chapter 14 and section 14.386 does not apply. The commissioner may establish the duplicate all-terrain safety certificate fee notwithstanding section 16A.1283.\n(a) An individual who was born after July 1, 1987, and who is 16 years of age or older, must successfully complete the independent study course component of all-terrain vehicle safety training before operating an all-terrain vehicle on public lands or waters, public road rights-of-way, or state or grant-in-aid trails.\n(b) An individual who is convicted of violating a law related to the operation of an all-terrain vehicle must successfully complete the independent study course component of all-terrain vehicle safety training before continuing operation of an all-terrain vehicle.\n(c) An individual who is convicted for a second or subsequent excess speed, trespass, or wetland violation in an all-terrain vehicle season, or any conviction for careless or reckless operation of an all-terrain vehicle, must successfully complete the independent study and the testing and operating course components of all-terrain vehicle safety training before continuing operation of an all-terrain vehicle.\n(d) An individual who receives three or more citations and convictions for violating a law related to the operation of an all-terrain vehicle in a two-year period must successfully complete the independent study and the testing and operating course components of all-terrain vehicle safety training before continuing operation of an all-terrain vehicle.\n(e) An individual must present evidence of compliance with this subdivision before an all-terrain vehicle registration is issued or renewed. A person may use the following as evidence of meeting all-terrain vehicle safety certificate requirements:\n(1) a valid all-terrain vehicle safety certificate issued by the commissioner;\n(2) a driver's license that has a valid all-terrain vehicle safety certificate indicator issued under section 171.07, subdivision 18; or\n(3) an identification card that has a valid all-terrain vehicle safety certificate indicator issued under section 171.07, subdivision 18.",
	"repealed": false
}