{
	"id": "204D.27",
	"url": "https://www.revisor.mn.gov/statutes/cite/204D.27",
	"title": "204D.27 SPECIAL ELECTION RETURNS.",
	"text": "The returns of a special primary or special election held pursuant to sections 204D.17 to 204D.27 shall be delivered promptly upon completion to the county auditor of the county in which the special primary or special election is held. Except as provided in subdivisions 2 to 4, the county canvassing board shall canvass and certify the returns to the secretary of state on the next day, excluding Sundays and legal holidays, following the special primary or special election.\nWhen a special primary is held on the day of the state primary and the special election will be held on the day of the next state general election, the returns of the special primary shall be canvassed and certified by the county canvassing board at their regular meeting.\nWhen the special primary is held on the day of the state primary and the special election will be held more than 20 days after that day, the returns of the special primary shall be canvassed by the county canvassing board at its regular meeting.\nWhen the special election is held on the day of the state general election and separate special election ballots were not required, the returns of the special election shall be canvassed and certified by the county and state canvassing boards at their regular meetings.\nNot later than four days after the returns of the county canvassing boards are certified to the secretary of state, the State Canvassing Board shall complete its canvass of the special primary. The secretary of state shall then promptly certify to the county auditors the names of the nominated individuals, prepare notices of nomination, and notify each nominee of the nomination. In case of a contest of a special primary for state senator or state representative, the notice of contest must be filed within two days, excluding Sundays and legal holidays, after the canvass is completed, and the contest shall otherwise proceed in the manner provided by law for contesting elections.\nExcept as provided in subdivision 4, the State Canvassing Board shall complete its canvass of a special election for senator or representative in Congress and declare the results within seven days after the returns of the county canvassing boards are certified to the secretary of state.\nIn case of a contest of a special election for senator or representative in Congress the notice of contest shall be filed within five days after the canvass is completed, and the contest otherwise shall proceed in the manner provided by law for contesting elections.\nNo certificate of election in a special election for senator or representative in Congress may be issued by the secretary of state to any individual declared elected by the county or state canvassing board until seven days after the canvassing board has canvassed the returns and declared the results of the election. In case of a contest the certificate may not be issued until the district court determines the contest.\nExcept as provided in subdivision 4, the State Canvassing Board shall complete its canvass of a special election for state senator or state representative and declare the results within four days, excluding Sundays and legal holidays, after the returns of the county canvassing boards are certified to the secretary of state.\nIn case of a contest of a special election for state senator or state representative, the notice of contest shall be filed within two days, excluding Sundays and legal holidays, after the canvass is completed, and the contest otherwise shall proceed in the manner provided by law for contesting elections.\nA certificate of election in a special election for state senator or state representative shall be issued by the secretary of state to the chief clerk of the house or the secretary of the senate two days, excluding Sundays and legal holidays, after the appropriate canvassing board finishes canvassing the returns for the election.\nIn case of a contest the certificate shall not be issued until the district court determines the contest.\nIn a special primary or special election, the provisions of section 204C.35 apply, except that the secretary of state may immediately proceed to recount the votes upon review of the certified reports of the county canvassing boards if it is apparent from the review that a recount is required.",
	"repealed": false
}