{
	"id": "179A.10",
	"url": "https://www.revisor.mn.gov/statutes/cite/179A.10",
	"title": "179A.10 STATE UNITS.",
	"text": "(a) The commissioner of management and budget shall meet and negotiate with the exclusive representative of each of the units specified in this section, except as provided in section 43A.06, subdivision 1, paragraph (c). The units provided in this section are the only appropriate units for executive branch state employees. The following employees shall be excluded from any appropriate unit:\n(1) the positions and classes of positions in the classified and unclassified services defined as managerial by the commissioner of management and budget in accordance with section 43A.18, subdivision 3, and so designated in the official state compensation schedules;\n(2) unclassified positions in the Minnesota State Colleges and Universities defined as managerial by the Board of Trustees;\n(3) positions of all unclassified employees appointed by a constitutional officer;\n(4) positions in the Bureau of Mediation Services and the Public Employment Relations Board;\n(5) positions of employees whose classification is pilot or chief pilot;\n(6) administrative law judge and compensation judge positions in the Office of Administrative Hearings;\n(7) positions of all confidential employees; and\n(8) positions of employees of the State Board of Investment who are employed under the terms and conditions of the compensation plan approved under section 43A.18, subdivision 3b.\n(b) The governor may upon the unanimous written request of exclusive representatives of units and the commissioner direct that negotiations be conducted for one or more units in a common proceeding or that supplemental negotiations be conducted for portions of a unit or units defined on the basis of appointing authority or geography.\n(a) Unclassified employees, unless otherwise excluded, are included within the units that include the classifications to which they are assigned for purposes of compensation. Supervisory employees can be assigned only to unit 12 or 16. The following units are the appropriate units of executive branch state employees:\n(1) law enforcement unit;\n(2) craft, maintenance, and labor unit;\n(3) service unit;\n(4) health care nonprofessional unit;\n(5) health care professional unit;\n(6) clerical and office unit;\n(7) technical unit;\n(8) correctional guards unit;\n(9) state university instructional unit;\n(10) state college instructional unit;\n(11) state university administrative unit;\n(12) professional engineering unit;\n(13) health treatment unit;\n(14) general professional unit;\n(15) professional state residential instructional unit;\n(16) supervisory employees unit;\n(17) public safety radio communications operator unit;\n(18) licensed peace officer special unit; and\n(19) licensed peace officer leader unit.\n(b) The following positions are included in the licensed peace officer special unit:\n(1) State Patrol lieutenant;\n(2) NR district supervisor - enforcement;\n(3) assistant special agent in charge;\n(4) corrections investigation assistant director 2;\n(5) corrections investigation supervisor; and\n(6) commerce supervisor special agent.\n(c) The following positions are included in the licensed peace officer leader unit:\n(1) State Patrol captain;\n(2) NR program manager 2 enforcement; and\n(3) special agent in charge.\n(d) Each unit consists of the classifications or positions assigned to it in the schedule of state employee job classification and positions maintained by the commissioner. The commissioner may make changes in the schedule in existence on the day before August 1, 1984, only:\n(1) as required by law; or\n(2) as provided in subdivision 4.\nEach of the following groups of employees has the right, as specified in this subdivision, to separate from the general professional, health treatment, or general supervisory units provided for in subdivision 2: attorneys, physicians, and professional employees of the Minnesota Office of Higher Education who are compensated under section 43A.18, subdivision 4. This right must be exercised by petition during the 60-day period commencing 270 days prior to the termination of a contract covering the units. If one of these groups of employees exercises the right to separate from the units they have no right to meet and negotiate, but retain the right to meet and confer with the commissioner of management and budget and with the appropriate appointing authority on any matter of concern to them. The right to separate must be exercised as follows: An employee organization or group of employees claiming that a majority of any one of these groups of employees on a statewide basis wish to separate from their units may petition the commissioner for an election during the petitioning period. If the petition is supported by a showing of at least 30 percent support for the petitioner from the employees, the commissioner shall hold an election to ascertain the wishes of the majority with respect to the issue of remaining within or severing from the units provided in subdivision 2. This election must be conducted within 30 days of the close of the petition period. If a majority of votes cast endorse severance from the unit in favor of separate meet and confer status for any one of these groups of employees, the commissioner shall certify that result. This election, where not inconsistent with other provisions of this section, is governed by section 179A.12. If a group of employees elects to sever, the group may rejoin that unit by following the same procedures specified above for severance, but may only do so during the periods provided for severance.\nThe commissioner shall assign state employee classifications, court employee classifications, University of Minnesota employee classifications, and supervisory positions to the appropriate units when the classifications or positions have not been assigned under subdivision 2 or section 179A.101 or 179A.11 or have been significantly modified in occupational content subsequent to assignment under these sections. The assignment of the classes shall be made on the basis of the community of interest of the majority of employees in these classes with the employees within the statutory units. All the employees in a class, excluding supervisory and confidential employees, shall be assigned to a single appropriate unit.",
	"repealed": false
}