{
	"id": "446A.04",
	"url": "https://www.revisor.mn.gov/statutes/cite/446A.04",
	"title": "446A.04 POWERS; DUTIES; PROGRAM ADMINISTRATION.",
	"text": "MS 2006 [Repealed by amendment, 2007 c 96 art 1 s 3]\nThe authority may sue and be sued. The authority may make and enter into contracts, leases, and agreements necessary to perform its duties and exercise its powers.\nThe authority may apply for, accept, and disburse gifts, grants, loans, or other property from the United States, the state, private sources, or any other source for any of its purposes. Money received by the authority under this subdivision must be deposited in the state treasury and is appropriated to the authority to carry out its duties.\nThe authority may retain or contract for the services of accountants, financial advisors, and other consultants or agents needed to perform its duties and exercise its powers.\n(a) The authority may set and collect fees for costs incurred by the authority, the Department of Employment and Economic Development, the Department of Health, the Pollution Control Agency, and the Department of Transportation, including costs for personnel, professional, and administrative services, for debt issuance related costs and the establishment and maintenance of reserve funds. Fees charged directly to borrowers or grantees upon executing a loan or grant agreement must not exceed one-half of one percent of the loan or grant amount. Servicing fees assessed to loan repayments must not exceed two percent of the loan repayment. The disposition of fees collected for costs incurred by the authority is governed by subdivision 20. The authority shall enter into interagency agreements to transfer funds into appropriate administrative accounts established for fees collected under this subdivision for costs incurred by the Department of Employment and Economic Development, the Department of Health, or the Pollution Control Agency. Fees collected under this subdivision for costs incurred by the Department of Transportation must be credited to the fund or account which is the source of the loan to which the fees are related.\n(b) The authority shall annually report to the chairs of the finance and appropriations committees of the legislature on:\n(1) the amount of fees collected under this subdivision for costs incurred by the authority;\n(2) the purposes for which the fee proceeds have been spent; and\n(3) the amount of any remaining balance of fee proceeds.\nThe authority may acquire, encumber, hold, and convey through lease, purchase, gift, or otherwise, any real or personal property.\nThe authority may make and contract to make loans and grants to eligible recipients to finance projects that the eligible recipient may construct or acquire. The authority may acquire or contract to acquire notes and bonds issued by eligible recipients to finance those projects.\nThe authority may borrow money to administer its programs and may issue bonds or notes as evidence of the borrowing in accordance with sections 446A.12 to 446A.20.\nThe authority has all the powers necessary and convenient to carry out its duties under this chapter.\nIn implementing the purposes and the programs described in this chapter, the authority has the powers in subdivisions 9 to 21.\nIt may adopt, amend, and repeal rules necessary to effectuate its purposes.\nIt may acquire, hold, and dispose of personal property for its corporate purposes.\nIt may acquire real property, or an interest in real property, in its own name, by purchase or foreclosure, where the acquisition is necessary or appropriate to protect a loan in which the authority has an interest and may sell, transfer, and convey the property to a buyer and, in the event the sale, transfer, or conveyance cannot be effected with reasonable promptness or at a reasonable price, may lease the property to a tenant.\nIt may sell, at public or private sale, any note, mortgage or other instrument or obligation evidencing or securing a loan.\nIt may procure insurance against a loss in connection with its property in the amounts, and from the insurers, as may be necessary or desirable.\nIt may consent, whenever it considers it necessary or desirable in the fulfillment of its purpose, to the modification of the rate of interest, time of payment, installment of principal or interest, or other term, of a contract or agreement to which the authority is a party.\nIt may establish and collect reasonable interest and amortization payments on loans, and in connection with them may establish and collect or authorize the collection of reasonable fees and charges or require money to be placed in escrow, sufficient to provide for the payment and security of its bonds, notes, commitments and other obligations and for their servicing, to provide reasonable allowances for or insurance against losses which may be incurred and to cover the cost of issuance of obligations and technical, consultative, and project assistance services.\n(a) It may cause any money not required for immediate disbursement, including the general reserve account, to be invested in direct obligations of or obligations guaranteed as to principal and interest by the United States, or in insured savings accounts, up to the amount of the insurance, in any institution the accounts of which are insured by the Federal Savings and Loan Insurance Corporation or to be deposited in a savings or other account in a bank insured by the Federal Deposit Insurance Corporation or to be invested in time certificates of deposit issued by a bank insured by the Federal Deposit Insurance Corporation and maturing within one year or less and in the investments described in section 11A.24, subdivision 4, except clause (d). It may deposit money in excess of the amount insured with security as provided in chapter 118A.\n(b) Notwithstanding paragraph (a), it may invest and deposit money into accounts established pursuant to resolutions or indentures securing its bonds or notes in investments and deposit accounts or certificates, and with security, agreed upon with the holders or a trustee for the holders.\nIt may provide general consultative and technical services to assist in financing the entities to which loans may be made. It may enter into agreements or other transactions concerning the receipt or provision of those services.\nFinancial information, including credit reports, financial statements and net worth calculations, received or prepared by the authority regarding an authority loan, financial assistance, or insurance is private data with regard to data on individuals as defined in section 13.02, subdivision 12 and nonpublic data with regard to data not on individuals as defined in section 13.02, subdivision 9.\nThe authority may accept appropriations, gifts, grants, bequests, and devises and use or dispose of them for its purposes. All gifts, grants, bequests, and revenues from those sources are appropriated to the authority.\nProceeds of the authority's bonds, notes, and other obligations; amounts granted or appropriated to the authority for the making or purchase or the insurance or guaranty of loans or for bond reserves; income from investment; money in the funds; and all revenues from loans, fees, and charges of the authority including rentals, royalties, dividends, or other proceeds are annually appropriated to the authority for the accomplishment of its corporate purposes and must be spent, administered, and accounted for in accordance with the applicable provisions of all bond and note resolutions, indentures, and other instruments, contracts, and agreements of the authority. Notwithstanding section 16A.28, these appropriations are available until expended.\nThe authority may do all things necessary and proper to fulfill its purpose.",
	"repealed": false
}