{
	"id": "150A.10",
	"url": "https://www.revisor.mn.gov/statutes/cite/150A.10",
	"title": "150A.10 ALLIED DENTAL PERSONNEL.",
	"text": "Any licensed dentist, licensed dental therapist, public institution, or school authority may obtain services from a licensed dental hygienist. The licensed dental hygienist may provide those services defined in section 150A.05, subdivision 1a. The services provided shall not include the establishment of a final diagnosis or treatment plan for a dental patient. All services shall be provided under supervision of a licensed dentist. Any licensed dentist who shall permit any dental service by a dental hygienist other than those authorized by the Board of Dentistry, shall be deemed to be violating the provisions of sections 150A.01 to 150A.12, and any unauthorized dental service by a dental hygienist shall constitute a violation of sections 150A.01 to 150A.12.\n(a) Notwithstanding subdivision 1, a dental hygienist licensed under this chapter may be employed or retained by a health care facility, program, nonprofit organization, or licensed dentist to perform the dental hygiene services listed in Minnesota Rules, part 3100.8700, subpart 1, without the patient first being examined by a licensed dentist if the dental hygienist:\n(1) has entered into a collaborative agreement with a licensed dentist that designates authorization for the services provided by the dental hygienist; and\n(2) has documented completion of a course on medical emergencies within each continuing education cycle.\n(b) A collaborating dentist must be licensed under this chapter and may enter into a collaborative agreement with no more than four dental hygienists unless otherwise authorized by the board. The board shall develop parameters and a process for obtaining authorization to collaborate with more than four dental hygienists. The collaborative agreement must include:\n(1) consideration for medically compromised patients and medical conditions for which a dental evaluation and treatment plan must occur prior to the provision of dental hygiene services;\n(2) age- and procedure-specific standard collaborative practice protocols, including recommended intervals for the performance of dental hygiene services and a period of time in which an examination by a dentist should occur;\n(3) copies of consent to treatment form provided to the patient by the dental hygienist;\n(4) specific protocols for the placement of pit and fissure sealants and requirements for follow-up care to ensure efficacy; and\n(5) the procedure for creating and maintaining dental records for patients who are treated by the dental hygienist under Minnesota Rules, part 3100.9600, including specifying where records will be located.\n(c) The collaborative agreement must be:\n(1) signed and maintained by the dentist; the dental hygienist; and the facility, program, or organization;\n(2) reviewed annually by the collaborating dentist and the dental hygienist; and\n(3) made available to the board upon request.\n(d) Before performing any services authorized under this subdivision, a dental hygienist must provide the patient with a consent to treatment form which must include a statement advising the patient that the dental hygiene services provided are not a substitute for a dental examination by a licensed dentist. When the patient requires a referral for additional dental services, the dental hygienist shall complete a referral form and provide a copy to the patient, the facility, if applicable, the dentist to whom the patient is being referred, and the collaborating dentist, if specified in the collaborative agreement. A copy of the referral form shall be maintained in the patient's health care record. The patient does not become a new patient of record of the dentist to whom the patient was referred until the dentist accepts the patient for follow-up services after referral from the dental hygienist.\n(e) For the purposes of this subdivision, a \"health care facility, program, or nonprofit organization\" includes a hospital; nursing home; home health agency; group home serving the elderly, disabled, or juveniles; state-operated facility licensed by the commissioner of human services or the commissioner of corrections; a state-agency-administered public health program or event; and federal, state, or local public health facility, community clinic, tribal clinic, school authority, Head Start program, or nonprofit organization that serves individuals who are uninsured or who are Minnesota health care public program recipients.\n(f) For purposes of this subdivision, a \"collaborative agreement\" means a written agreement with a licensed dentist who authorizes and accepts responsibility for the services performed by the dental hygienist.\n(g) A collaborative practice dental hygienist must be reimbursed for all services performed through a health care facility, program, nonprofit organization, or licensed dentist.\nEvery licensed dentist and dental therapist who uses the services of any unlicensed person for the purpose of assistance in the practice of dentistry or dental therapy shall be responsible for the acts of such unlicensed person while engaged in such assistance. The dentist or dental therapist shall permit the unlicensed assistant to perform only those acts which are authorized to be delegated to unlicensed assistants by the Board of Dentistry. The acts shall be performed under supervision of a licensed dentist or dental therapist. A licensed dental therapist shall not supervise more than four licensed or unlicensed dental assistants at any one practice setting. The board may permit differing levels of dental assistance based upon recognized educational standards, approved by the board, for the training of dental assistants. The board may also define by rule the scope of practice of licensed and unlicensed dental assistants. The board by rule may require continuing education for differing levels of dental assistants, as a condition to their license or authority to perform their authorized duties. Any licensed dentist or dental therapist who permits an unlicensed assistant to perform any dental service other than that authorized by the board shall be deemed to be enabling an unlicensed person to practice dentistry, and commission of such an act by an unlicensed assistant shall constitute a violation of sections 150A.01 to 150A.12.\n(a) Notwithstanding subdivision 2, a dental assistant licensed under this chapter may be employed or retained by a health care facility, program, or nonprofit organization as defined in subdivision 1a to perform the dental assisting services described in paragraph (b) without the patient first being examined by a licensed dentist, without a dentist's diagnosis or treatment plan, and without the dentist being present at the location where services are being performed, if:\n(1) the dental assistant has entered into a collaborative agreement with a licensed dentist, which must be part of a collaborative agreement established between a licensed dentist and a dental hygienist under subdivision 1a, that designates authorization for the services provided by the dental assistant; and\n(2) the dental assistant has documented completion of a course on medical emergencies within each continuing education cycle.\n(b) A dental assistant operating under general supervision of a collaborating dentist under this subdivision is authorized to perform the following services:\n(1) provide oral health promotion and disease prevention education;\n(2) take vital signs such as pulse rate and blood pressure;\n(3) obtain informed consent, according to Minnesota Rules, part 3100.9600, subpart 9, for treatments authorized by the collaborating dentist within the licensed dental assistant's scope of practice;\n(4) apply topical preventative agents, including fluoride varnishes and pit and fissure sealants;\n(5) perform mechanical polishing to clinical crowns not including instrumentation;\n(6) complete preliminary charting of the oral cavity and surrounding structures, except periodontal probing and assessment of the periodontal structure;\n(7) take photographs extraorally or intraorally; and\n(8) take radiographs.\n(c) A collaborating dentist must be licensed under this chapter and may enter into a collaborative agreement with no more than two licensed dental assistants, unless otherwise authorized by the board. The board shall develop a process and parameters for obtaining authorization to collaborate with more than two licensed dental assistants. The collaborative agreement must include the elements listed in subdivision 1a, paragraph (b).\nEvery licensed dentist and dental therapist who uses the services of any unlicensed person, other than under the dentist's or dental therapist's supervision and within the same practice setting, for the purpose of constructing, altering, repairing or duplicating any denture, partial denture, crown, bridge, splint, orthodontic, prosthetic or other dental appliance, shall be required to furnish such unlicensed person with a written work order in such form as shall be prescribed by the rules of the board. The work order shall be made in duplicate form, a duplicate copy to be retained in a permanent file of the dentist or dental therapist at the practice setting for a period of two years, and the original to be retained in a permanent file for a period of two years by the unlicensed person in that person's place of business. The permanent file of work orders to be kept by the dentist, dental therapist, or unlicensed person shall be open to inspection at any reasonable time by the board or its duly constituted agent.\n(a) Notwithstanding subdivisions 1, 1a, and 2, a licensed dental hygienist or licensed dental assistant may perform the following restorative procedures:\n(1) place, contour, and adjust amalgam restorations;\n(2) place, contour, and adjust glass ionomer;\n(3) adapt and cement stainless steel crowns; and\n(4) place, contour, and adjust class I, II, and V supragingival composite restorations on primary and permanent dentition.\n(b) The restorative procedures described in paragraph (a) may be performed only if:\n(1) the licensed dental hygienist or licensed dental assistant has completed a board-approved course on the specific procedures;\n(2) the board-approved course includes a component that sufficiently prepares the licensed dental hygienist or licensed dental assistant to adjust the occlusion on the newly placed restoration;\n(3) a licensed dentist or licensed advanced dental therapist has authorized the procedure to be performed; and\n(4) a licensed dentist or licensed advanced dental therapist is available in the clinic while the procedure is being performed.\n(c) The dental faculty who teaches the educators of the board-approved courses specified in paragraph (b) must have prior experience teaching these procedures in an accredited dental education program.",
	"repealed": false
}