{
	"id": "609.3455",
	"url": "https://www.revisor.mn.gov/statutes/cite/609.3455",
	"title": "609.3455 DANGEROUS SEX OFFENDERS; LIFE SENTENCES; CONDITIONAL RELEASE.",
	"text": "(a) As used in this section, the following terms have the meanings given.\n(b) \"Conviction\" includes a conviction as an extended jurisdiction juvenile under section 260B.130 for a violation of, or an attempt to violate, section 609.342, 609.343, 609.344, 609.3453, or 609.3458, if the adult sentence has been executed.\n(c) \"Extreme inhumane conditions\" mean situations where, either before or after the sexual penetration or sexual contact, the offender knowingly causes or permits the complainant to be placed in a situation likely to cause the complainant severe ongoing mental, emotional, or psychological harm, or causes the complainant's death.\n(d) A \"heinous element\" includes:\n(1) the offender tortured the complainant;\n(2) the offender intentionally inflicted great bodily harm upon the complainant;\n(3) the offender intentionally mutilated the complainant;\n(4) the offender exposed the complainant to extreme inhumane conditions;\n(5) the offender was armed with a dangerous weapon or any article used or fashioned in a manner to lead the complainant to reasonably believe it to be a dangerous weapon and used or threatened to use the weapon or article to cause the complainant to submit;\n(6) the offense involved sexual penetration or sexual contact with more than one victim;\n(7) the offense involved more than one perpetrator engaging in sexual penetration or sexual contact with the complainant; or\n(8) the offender, without the complainant's consent, removed the complainant from one place to another and did not release the complainant in a safe place.\n(e) \"Mutilation\" means the intentional infliction of physical abuse designed to cause serious permanent disfigurement or permanent or protracted loss or impairment of the functions of any bodily member or organ, where the offender relishes the infliction of the abuse, evidencing debasement or perversion.\n(f) A conviction is considered a \"previous sex offense conviction\" if the offender was convicted and sentenced for a sex offense before the commission of the present offense.\n(g) A conviction is considered a \"prior sex offense conviction\" if the offender was convicted of committing a sex offense before the offender has been convicted of the present offense, regardless of whether the offender was convicted for the first offense before the commission of the present offense, and the convictions involved separate behavioral incidents.\n(h) \"Sex offense\" means any violation of, or attempt to violate, section 609.342, 609.343, 609.344, 609.345, 609.3451, 609.3453, 609.3458, or any similar statute of the United States, this state, or any other state.\n(i) \"Torture\" means the intentional infliction of extreme mental anguish, or extreme psychological or physical abuse, when committed in an especially depraved manner.\n(j) An offender has \"two previous sex offense convictions\" only if the offender was convicted and sentenced for a sex offense committed after the offender was earlier convicted and sentenced for a sex offense and both convictions preceded the commission of the present offense of conviction.\n(a) Except as provided in paragraph (c), notwithstanding the statutory maximum penalty otherwise applicable to the offense, the court shall sentence a person convicted under section 609.342, subdivision 1, paragraph (a), (b), (c), (d), or (e), or subdivision 1a, clause (a), (b), (c), (d), (h), or (i); or 609.343, subdivision 1, paragraph (a), (b), (c), (d), or (e), or subdivision 1a, clause (a), (b), (c), (d), (h), or (i), to life without the possibility of release if:\n(1) the fact finder determines that two or more heinous elements exist; or\n(2) the person has a previous sex offense conviction for a violation of section 609.342, 609.343, 609.344, or 609.3458, subdivision 1, paragraph (b), and the fact finder determines that a heinous element exists for the present offense.\n(b) A fact finder may not consider a heinous element if it is an element of the underlying specified violation of section 609.342 or 609.343. In addition, when determining whether two or more heinous elements exist, the fact finder may not use the same underlying facts to support a determination that more than one element exists.\n(c) The court shall sentence a person who was under 18 years of age at the time of the commission of an offense described in paragraph (a) to imprisonment for life.\n(a) Notwithstanding the statutory maximum penalty otherwise applicable to the offense, the court shall sentence a person to imprisonment for life if the person is convicted under section 609.342, subdivision 1, paragraph (a), (b), (c), (d), or (e), or subdivision 1a, clause (a), (b), (c), (d), (h), or (i); or 609.343, subdivision 1, paragraph (a), (b), (c), (d), or (e), or subdivision 1a, clause (a), (b), (c), (d), (h), or (i); and the fact finder determines that a heinous element exists.\n(b) The fact finder may not consider a heinous element if it is an element of the underlying specified violation of section 609.342 or 609.343.\n(a) A court shall commit a person to the commissioner of corrections for a period of time that is not less than double the presumptive sentence under the sentencing guidelines and not more than the statutory maximum, or if the statutory maximum is less than double the presumptive sentence, for a period of time that is equal to the statutory maximum, if:\n(1) the court is imposing an executed sentence on a person convicted of committing or attempting to commit a violation of section 609.342, 609.343, 609.344, 609.345, 609.3453, or 609.3458;\n(2) the fact finder determines that the offender is a danger to public safety; and\n(3) the fact finder determines that the offender's criminal sexual behavior is so engrained that the risk of reoffending is great without intensive psychotherapeutic intervention or other long-term treatment or supervision extending beyond the presumptive term of imprisonment and supervised release.\n(b) The fact finder shall base its determination that the offender is a danger to public safety on any of the following factors:\n(1) the crime involved an aggravating factor that would justify a durational departure from the presumptive sentence under the sentencing guidelines;\n(2) the offender previously committed or attempted to commit a predatory crime or a violation of section 609.224 or 609.2242, including:\n(i) an offense committed as a juvenile that would have been a predatory crime or a violation of section 609.224 or 609.2242 if committed by an adult; or\n(ii) a violation or attempted violation of a similar law of any other state or the United States; or\n(3) the offender planned or prepared for the crime prior to its commission.\n(c) As used in this section, \"predatory crime\" has the meaning given in section 609.341, subdivision 22.\n(a) Notwithstanding the statutory maximum penalty otherwise applicable to the offense, the court shall sentence a person to imprisonment for life if the person is convicted of violating section 609.342, 609.343, 609.344, 609.345, 609.3453, or 609.3458 and:\n(1) the person has two previous sex offense convictions;\n(2) the person has a previous sex offense conviction and:\n(i) the fact finder determines that the present offense involved an aggravating factor that would provide grounds for an upward durational departure under the sentencing guidelines other than the aggravating factor applicable to repeat criminal sexual conduct convictions;\n(ii) the person received an upward durational departure from the sentencing guidelines for the previous sex offense conviction; or\n(iii) the person was sentenced under this section or Minnesota Statutes 2004, section 609.108, for the previous sex offense conviction; or\n(3) the person has two prior sex offense convictions, and the fact finder determines that the prior convictions and present offense involved at least three separate victims, and:\n(i) the fact finder determines that the present offense involved an aggravating factor that would provide grounds for an upward durational departure under the sentencing guidelines other than the aggravating factor applicable to repeat criminal sexual conduct convictions;\n(ii) the person received an upward durational departure from the sentencing guidelines for one of the prior sex offense convictions; or\n(iii) the person was sentenced under this section or Minnesota Statutes 2004, section 609.108, for one of the prior sex offense convictions.\n(b) Notwithstanding paragraph (a), a court may not sentence a person to imprisonment for life for a violation of section 609.345, unless the person's previous or prior sex offense convictions that are being used as the basis for the sentence are for violations of section 609.342, 609.343, 609.344, 609.3453, or 609.3458, or any similar statute of the United States, this state, or any other state.\nAt the time of sentencing under subdivision 3 or 4, the court shall specify a minimum term of imprisonment, based on the sentencing guidelines or any applicable mandatory minimum sentence, that must be served before the offender may be considered for supervised release. If the offender was under 18 years of age at the time of the commission of the offense, the minimum term of imprisonment specified by the court shall not exceed the applicable minimum term of imprisonment described in section 244.05, subdivision 4b.\nNotwithstanding the statutory maximum sentence otherwise applicable to the offense and unless a longer conditional release term is required in subdivision 7, when a court commits an offender to the custody of the commissioner of corrections for a violation of section 609.342, 609.343, 609.344, 609.345, 609.3453, or 609.3458, the court shall provide that, after the offender has been released from prison, the commissioner shall place the offender on conditional release for ten years.\n(a) When a court sentences an offender under subdivision 3 or 4, the court shall provide that, if the offender is released from prison, the commissioner of corrections shall place the offender on conditional release for the remainder of the offender's life.\n(b) Notwithstanding the statutory maximum sentence otherwise applicable to the offense, when the court commits an offender to the custody of the commissioner of corrections for a violation of section 609.342, 609.343, 609.344, 609.345, 609.3453, or 609.3458, and the offender has a previous or prior sex offense conviction, the court shall provide that, after the offender has been released from prison, the commissioner shall place the offender on conditional release for the remainder of the offender's life.\n(c) Notwithstanding paragraph (b), an offender may not be placed on lifetime conditional release for a violation of section 609.345, unless the offender's previous or prior sex offense conviction is for a violation of section 609.342, 609.343, 609.344, 609.3453, or 609.3458, subdivision 1, paragraph (b), or any similar statute of the United States, this state, or any other state.\n(a) The provisions of this subdivision relating to conditional release apply to all sex offenders sentenced to prison for a violation of section 609.342, 609.343, 609.344, 609.345, 609.3453, or 609.3458. Except as provided in this subdivision, conditional release of sex offenders is governed by provisions relating to supervised release. The commissioner of corrections may not dismiss an offender on conditional release from supervision until the offender's conditional release term expires.\n(b) The conditions of release may include successful completion of treatment and aftercare in a program approved by the commissioner, satisfaction of the release conditions specified in section 244.05, subdivision 6, and any other conditions the commissioner considers appropriate. The commissioner shall develop a plan to pay the cost of treatment of a person released under this subdivision. The plan may include co-payments from offenders, third-party payers, local agencies, or other funding sources as they are identified. This section does not require the commissioner to accept or retain an offender in a treatment program. Before the offender is placed on conditional release, the commissioner shall notify the sentencing court and the prosecutor in the jurisdiction where the offender was sentenced of the terms of the offender's conditional release. The commissioner also shall make reasonable efforts to notify the victim of the offender's crime of the terms of the offender's conditional release.\n(c) If the offender fails to meet any condition of release, the commissioner may revoke the offender's conditional release and order that the offender serve all or a part of the remaining portion of the conditional release term in prison. An offender, while on supervised release, is not entitled to credit against the offender's conditional release term for time served in confinement for a violation of release.\nThe provisions of this section do not affect the applicability of Minnesota Statutes 2004, section 609.108, to crimes committed before August 1, 2005, or the validity of sentences imposed under Minnesota Statutes 2004, section 609.108.\nExcept as provided in subdivision 2, 3, 3a, or 4, if a person is convicted under sections 609.342 to 609.345 or 609.3453 within 15 years of a previous sex offense conviction, the court shall commit the defendant to the commissioner of corrections for not less than three years, nor more than the maximum sentence provided by law for the offense for which convicted, notwithstanding sections 242.19, 243.05, 609.11, 609.12, and 609.135. The court may stay the execution of the sentence imposed under this subdivision only if it finds that a professional assessment indicates the offender is accepted by and can respond to treatment at a long-term inpatient program exclusively treating sex offenders and approved by the commissioner of corrections. If the court stays the execution of a sentence, it shall include the following as conditions of probation:\n(1) incarceration in a local jail or workhouse; and\n(2) a requirement that the offender successfully complete the treatment program and aftercare as directed by the court.",
	"repealed": false
}