{
	"id": "571.925",
	"url": "https://www.revisor.mn.gov/statutes/cite/571.925",
	"title": "571.925 FORM OF NOTICE.",
	"text": "The ten-day notice informing a debtor that a garnishment summons may be used to garnish the earnings of an individual must be substantially in the following form:\nPLEASE TAKE NOTICE that a garnishment summons or levy may be served upon your employer or other third parties, without any further court proceedings or notice to you, ten days or more from the date hereof. Some or all of your earnings are exempt from garnishment. If your earnings are garnished, your employer must show you how the amount that is garnished from your earnings was calculated. You have the right to request a hearing if you claim the garnishment is incorrect.\nYour earnings are completely exempt from garnishment if you are now a recipient of assistance based on need, if you have been a recipient of assistance based on need within the last six months, or if you have been an inmate of a correctional institution in the last six months.\nAssistance based on need includes, but is not limited to:\nIf you wish to claim an exemption, you should fill out the appropriate form below, sign it, and send it to the creditor's attorney and the garnishee.\nYou may wish to contact the attorney for the creditor in order to arrange for a settlement of the debt or contact an attorney to advise you about exemptions or other rights.\nPENALTIES\n(1) Be advised that even if you claim an exemption, a garnishment summons may still be served on your employer. If your earnings are garnished after you claim an exemption, you may petition the court for a determination of your exemption. If the court finds that the creditor disregarded your claim of exemption in bad faith, you will be entitled to costs, reasonable attorney fees, actual damages, and an amount not to exceed $100.\n(2) HOWEVER, BE WARNED if you claim an exemption, the creditor can also petition the court for a determination of your exemption, and if the court finds that you claimed an exemption in bad faith, you will be assessed costs and reasonable attorney's fees plus an amount not to exceed $100.\n(3) If after receipt of this notice, you in bad faith take action to frustrate the garnishment, thus requiring the creditor to petition the court to resolve the problem, you will be liable to the creditor for costs and reasonable attorney's fees plus an amount not to exceed $100.\nDEBTOR'S EXEMPTION CLAIM NOTICE\nI hereby claim that my earnings are exempt from garnishment because:\n(1) I am presently a recipient of relief based on need. (Specify the program, case number, and the county from which relief is being received.)\n(2) I am not now receiving relief based on need, but I have received relief based on need within the last six months. (Specify the program, case number, and the county from which relief has been received.)\n(3) I have been an inmate of a correctional institution within the last six months. (Specify the correctional institution and location.)\nI hereby authorize any agency that has distributed relief to me or any correctional institution in which I was an inmate to disclose to the above-named creditor or the creditor's attorney only whether or not I am or have been a recipient of relief based on need or an inmate of a correctional institution within the last six months. I have mailed or delivered a copy of this form to the creditor or creditor's attorney.",
	"repealed": false
}