{
	"id": "473.223",
	"url": "https://www.revisor.mn.gov/statutes/cite/473.223",
	"title": "473.223 FEDERAL AID.",
	"text": "For the purposes of this section the term \"governmental subdivision\" includes municipalities, counties and other political subdivisions generally. If federal aid for transportation programs and projects is otherwise unavailable to an existing agency or governmental subdivision, the Metropolitan Council may cooperate with the government of the United States and any agency or department thereof and the affected agency or other governmental subdivision in establishing metropolitan area eligibility to receive federal aid, and may comply with the provisions of the laws of the United States and any rules and regulations made thereunder for the expenditure of federal moneys upon such projects as are proposed for federal assistance. The Metropolitan Council may accept federal aid and other aid, either public or private, for and in behalf of the metropolitan area or any governmental subdivision of the state, for transportation programs and projects within the metropolitan area upon such terms and conditions as are or may be prescribed by the laws of the United States and any rules or regulations made thereunder, and is authorized to act as agent of any governmental subdivision of the state with jurisdiction in the metropolitan area upon request of such subdivision in accepting the aid in its behalf for such programs or projects financed either in whole or in part by federal aid. The governing body of any such subdivision is authorized to designate the Metropolitan Council as its agent for such purposes and to enter into an agreement with the council prescribing the terms and conditions of the agency relationship in accordance with state and federal laws, rules and regulations. The Metropolitan Council is authorized to designate an appropriate state agency as its agent for such purposes and to enter into an agreement with such agency prescribing the terms and conditions of the agency relationship in accordance with state and federal laws, rules and regulations.\nNothing contained herein shall limit any separate authority of agencies or governmental subdivisions of the state to contract for and receive federal aid.",
	"repealed": false
}