{
	"id": "289A.20",
	"url": "https://www.revisor.mn.gov/statutes/cite/289A.20",
	"title": "289A.20 DUE DATES FOR MAKING PAYMENTS OF TAX.",
	"text": "(a) Individual income, fiduciary, mining company, and corporate franchise taxes must be paid to the commissioner on or before the date the return must be filed under section 289A.18, subdivision 1, or the extended due date as provided in section 289A.19, unless an earlier date for payment is provided.\nNotwithstanding any other law, a taxpayer whose unpaid liability for income or corporate franchise taxes, as reflected upon the return, is $1 or less need not pay the tax.\n(b) Entertainment taxes must be paid on or before the date the return must be filed under section 289A.18, subdivision 1.\n(c) If a fiduciary administers 100 or more trusts, fiduciary income taxes for all trusts administered by the fiduciary must be paid by electronic means.\n(a) Except as provided in section 289A.18, subdivision 2a, a tax required to be deducted and withheld during the quarterly period must be paid on or before the last day of the month following the close of the quarterly period, unless an earlier time for payment is provided. A tax required to be deducted and withheld from compensation of an entertainer and from a payment to an out-of-state contractor must be paid on or before the date the return for such tax must be filed under section 289A.18, subdivision 2. Taxes required to be deducted and withheld by partnerships, S corporations, and trusts must be paid on a quarterly basis as estimated taxes under section 289A.25 for partnerships and trusts and under section 289A.26 for S corporations.\n(b) An employer who, during the previous quarter, withheld more than $1,500 of tax under section 290.92, subdivision 2a or 3, or 290.923, subdivision 2, must deposit tax withheld under those sections with the commissioner within the time allowed to deposit the employer's federal withheld employment taxes under Code of Federal Regulations, title 26, section 31.6302-1, as amended through December 31, 2001, without regard to the safe harbor or de minimis rules in paragraph (f) or the one-day rule in paragraph (c)(3). Taxpayers must submit a copy of their federal notice of deposit status to the commissioner upon request by the commissioner.\n(c) The commissioner may prescribe by rule other return periods or deposit requirements. In prescribing the reporting period, the commissioner may classify payors according to the amount of their tax liability and may adopt an appropriate reporting period for the class that the commissioner judges to be consistent with efficient tax collection. In no event will the duration of the reporting period be more than one year.\n(d) If less than the correct amount of tax is paid to the commissioner, proper adjustments with respect to both the tax and the amount to be deducted must be made, without interest, in the manner and at the times the commissioner prescribes. If the underpayment cannot be adjusted, the amount of the underpayment will be assessed and collected in the manner and at the times the commissioner prescribes.\n(e) If the aggregate amount of the tax withheld is $10,000 or more in a fiscal year ending June 30, the employer must remit each required deposit for wages paid in all subsequent calendar years by electronic means.\n(f) A third-party bulk filer as defined in section 290.92, subdivision 30, paragraph (a), clause (2), who remits withholding deposits must remit all deposits by electronic means as provided in paragraph (e), regardless of the aggregate amount of tax withheld during a fiscal year for all of the employers.\nTaxes imposed by section 291.03, subdivision 1, take effect at and upon the death of the person whose estate is subject to taxation and are due and payable on or before the expiration of nine months from that death.\nThe additional estate tax imposed by section 291.03, subdivision 11, paragraph (b), is due and payable on or before the expiration of the date provided by section 291.03, subdivision 11, paragraph (c).\n(a) The taxes imposed by chapter 297A are due and payable to the commissioner monthly on or before the 20th day of the month following the month in which the taxable event occurred, or following another reporting period as the commissioner prescribes or as allowed under section 289A.18, subdivision 4, paragraph (f) or (g), except that use taxes due on an annual use tax return as provided under section 289A.11, subdivision 1, are payable by April 15 following the close of the calendar year.\n(b) A vendor having a liability of $250,000 or more during a fiscal year ending June 30, except a vendor of construction materials as defined in paragraph (e), must remit the June liability for the next year in the following manner:\n(1) Two business days before June 30 of calendar year 2020 and 2021, the vendor must remit 87.5 percent of the estimated June liability to the commissioner. Two business days before June 30 of calendar year 2022 and thereafter, the vendor must remit 84.5 percent, or a reduced percentage as certified by the commissioner under section 16A.152, subdivision 2, paragraph (a), clause (6), of the estimated June liability to the commissioner.\n(2) On or before August 20 of the year, the vendor must pay any additional amount of tax not remitted in June.\n(c) A vendor having a liability of:\n(1) $10,000 or more, but less than $250,000, during a fiscal year must remit by electronic means all liabilities on returns due for periods beginning in all subsequent calendar years on or before the 20th day of the month following the month in which the taxable event occurred, or on or before the 20th day of the month following the month in which the sale is reported under section 289A.18, subdivision 4; or\n(2) $250,000 or more during a fiscal year must remit by electronic means all liabilities in the manner provided in paragraph (a) on returns due for periods beginning in the subsequent calendar year, except that a vendor subject to the remittance requirements of paragraph (b) must remit the percentage of the estimated June liability, as provided in paragraph (b), clause (1), which is due two business days before June 30. The remaining amount of the June liability is due on August 20.\n(d) Notwithstanding paragraph (b) or (c), a person prohibited by the person's religious beliefs from paying electronically shall be allowed to remit the payment by mail. The filer must notify the commissioner of revenue of the intent to pay by mail before doing so on a form prescribed by the commissioner. No extra fee may be charged to a person making payment by mail under this paragraph. The payment must be postmarked at least two business days before the due date for making the payment in order to be considered paid on a timely basis.\n(e) For the purposes of paragraph (b), \"vendor of construction materials\" means a retailer that sells any of the following construction materials, if 50 percent or more of the retailer's sales revenue for the fiscal year ending June 30 is from the sale of those materials:\n(1) lumber, veneer, plywood, wood siding, wood roofing;\n(2) millwork, including wood trim, wood doors, wood windows, wood flooring; or\n(3) concrete, cement, and masonry.\n(f) Paragraph (b) expires after the percentage of estimated payment is reduced to zero in accordance with section 16A.152, subdivision 2, paragraph (a), clause (6).\nIf a corporation is subject to LIFO recapture under section 1363(d) of the Internal Revenue Code, any increase in the tax imposed by section 290.06, subdivision 1, by reason of the inclusion of the LIFO recapture amount in its income is payable in four equal installments.\nThe first installment must be paid on or before the due date, determined without regard to extensions, for filing the return for the first taxable year for which the corporation was subject to the LIFO recapture. The three succeeding installments must be paid on or before the due date, determined without regard to extensions, for filing the corporation's return for the three succeeding taxable years.\nFor purposes of computing interest on underpayments, the last three installments must not be considered underpayments until after the payment due date specified in this subdivision.",
	"repealed": false
}