{
	"id": "151.066",
	"url": "https://www.revisor.mn.gov/statutes/cite/151.066",
	"title": "151.066 OPIATE PRODUCT REGISTRATION FEE.",
	"text": "(a) For purposes of this section, the following terms have the meanings given to them in this subdivision.\n(b) \"Manufacturer\" means a manufacturer licensed under section 151.252, excluding those exclusively licensed to manufacture medical gas.\n(c) \"Opiate\" means any opiate-containing controlled substance listed in section 152.02, subdivisions 3 to 5, that is distributed, delivered, sold, or dispensed into or within this state.\n(d) \"Third-party logistics provider\" means a third-party logistics provider licensed under section 151.471.\n(e) \"Wholesaler\" means a wholesale drug distributor licensed under section 151.47, excluding those exclusively licensed to distribute medical gas.\n(a) By March 1 of each year, beginning March 1, 2020, each manufacturer and each wholesaler must report to the board every sale, delivery, or other distribution within or into this state of any opiate that is made to any practitioner, pharmacy, hospital, veterinary hospital, or other person who is permitted by section 151.37 to possess controlled substances for administration or dispensing to patients that occurred during the previous calendar year. Reporting must be in the automation of reports and consolidated orders system format unless otherwise specified by the board. If no reportable distributions occurred for a given year, notification must be provided to the board in a manner specified by the board. If a manufacturer or wholesaler fails to provide information required under this paragraph on a timely basis, the board may assess an administrative penalty of $500 per day. This penalty shall not be considered a form of disciplinary action.\n(b) By March 1 of each year, beginning March 1, 2020, each owner of a pharmacy with at least one location within this state must report to the board any intracompany delivery or distribution into this state, of any opiate, to the extent that those deliveries and distributions are not reported to the board by a licensed wholesaler owned by, under contract to, or otherwise operating on behalf of the owner of the pharmacy. Reporting must be in the manner and format specified by the board for deliveries and distributions that occurred during the previous calendar year. The report must include the name of the manufacturer or wholesaler from which the owner of the pharmacy ultimately purchased the opiate, and the amount and date that the purchase occurred.\n(c) By March 1 of each year, beginning March 1, 2025, each third-party logistics provider must report to the board any delivery or distribution into this state of any opiate, to the extent that those deliveries and distributions are not reported to the board by a licensed wholesaler or manufacturer. Reporting must be in the manner and format specified by the board for deliveries and distributions that occurred during the previous calendar year.\n(a) The board shall annually assess an opiate product registration fee on any manufacturer of an opiate that annually sells, delivers, or distributes an opiate within or into the state in a quantity of 2,000,000 or more units as reported to the board under subdivision 2.\n(b) For purposes of assessing the annual registration fee under this section and determining the number of opiate units a manufacturer sold, delivered, or distributed within or into the state, the board shall not consider any opiate that is used for substance use disorder treatment with medications for opioid use disorder.\n(c) The annual registration fee for each manufacturer meeting the requirement under paragraph (a) is $250,000.\n(d) In conjunction with the data reported under this section, and notwithstanding section 152.126, subdivision 6, the board may use the data reported under section 152.126, subdivision 4, to determine which manufacturers meet the requirement under paragraph (a) and are required to pay the registration fees under this subdivision.\n(e) By April 1 of each year, beginning April 1, 2020, the board shall notify a manufacturer that the manufacturer meets the requirement in paragraph (a) and is required to pay the annual registration fee in accordance with section 151.252, subdivision 1, paragraph (b).\n(f) A manufacturer may dispute the board's determination that the manufacturer must pay the registration fee no later than 30 days after the date of notification. However, the manufacturer must still remit the fee as required by section 151.252, subdivision 1, paragraph (b). The dispute must be filed with the board in the manner and using the forms specified by the board. A manufacturer must submit, with the required forms, data satisfactory to the board that demonstrates that the assessment of the registration fee was incorrect. The board must make a decision concerning a dispute no later than 60 days after receiving the required dispute forms. If the board determines that the manufacturer has satisfactorily demonstrated that the fee was incorrectly assessed, the board must refund the amount paid in error.\n(g) For purposes of this subdivision, a unit means the individual dosage form of the particular drug product that is prescribed to the patient. One unit equals one tablet, capsule, patch, syringe, milliliter, or gram.\n(h) For the purposes of this subdivision, an opiate's units will be assigned to the manufacturer holding the New Drug Application (NDA) or Abbreviated New Drug Application (ANDA), as listed by the United States Food and Drug Administration.\n(a) The Board of Pharmacy shall evaluate the registration fee on drug manufacturers established under this section, and whether the registration fee and the increased licensure fees have impacted the prescribing practices of opiates by reducing the number of opiate prescriptions issued during calendar years 2021, 2022, and 2023, or creating any unintended consequences in the availability of opiates for the treatment of chronic or intractable pain to the extent the board has the ability to effectively identify a correlation. Notwithstanding section 152.126, subdivision 6, the board may access the data reported under section 152.126, subdivision 4, to conduct this evaluation.\n(b) The board shall submit the results of its evaluation to the chairs and ranking minority members of the legislative committees with jurisdiction over health and human services policy and finance by March 1, 2024.\nThe legislature shall review the reports from the Opiate Epidemic Response Advisory Council under section 256.042, subdivision 5, paragraph (a), the reports from the commissioner of management and budget on the Results First evaluation activities under section 256.042, subdivision 5, paragraph (b), the report from the Board of Pharmacy under subdivision 4, and any other relevant report or information related to the opioid crisis in Minnesota, to make a determination about whether the opiate product registration fee assessed under this section should continue beyond July 1, 2024.",
	"repealed": false
}