{
	"id": "60A.2085",
	"url": "https://www.revisor.mn.gov/statutes/cite/60A.2085",
	"title": "60A.2085 SURPLUS LINES ASSOCIATION OF MINNESOTA.",
	"text": "There is hereby created a nonprofit association to be known as the Surplus Lines Association of Minnesota. The association is not a state agency for purposes of chapter 16A, 16B, 16C, or 43A. All surplus lines brokers are members of this association. Section 60A.208 does not apply to the association created pursuant to the provisions of this section. The association shall perform its functions under the plan of operation established under subdivision 3 and must exercise its powers through a board of directors established under subdivision 2 as set forth in the plan of operation. The association shall be authorized and have the duty to:\n(1) receive, record, and stamp all nonadmitted insurance documents that surplus lines brokers are required to file with the association;\n(2) prepare and deliver monthly to the commissioners of revenue and commerce a report regarding surplus lines business. The report must include a list of all the business procured during the preceding month, in the form the commissioners prescribe;\n(3) educate its members regarding the surplus lines law of this state including insurance tax responsibilities and the rules and regulations of the commissioners of revenue and commerce relative to nonadmitted insurance;\n(4) communicate with organizations of agents, brokers, and admitted insurers with respect to the proper use of the surplus lines market;\n(5) employ and retain persons necessary to carry out the duties of the association;\n(6) borrow money necessary to effect the purposes of the association and grant a security interest or mortgage in its assets, including the stamping fees charged pursuant to subdivision 7 in order to secure the repayment of any such borrowed money;\n(7) enter contracts necessary to effect the purposes of the association;\n(8) provide other services to its members that are incidental or related to the purposes of the association;\n(9) form and organize itself as a nonprofit corporation under chapter 317A, with the powers set forth in section 317A.161 that are not otherwise limited by this section or in its articles, bylaws, or plan of operation;\n(10) file such applications and take such other action as necessary to establish and maintain the association as tax exempt pursuant to the federal income tax code;\n(11) recommend to the commissioner of commerce revisions to Minnesota law relating to the regulation of nonadmitted insurance in order to improve the efficiency and effectiveness of that regulation; and\n(12) take other actions reasonably required to implement the provisions of this section.\n(a) The commissioner shall appoint an interim board of five directors within 30 days of May 30, 2008. The interim board must:\n(1) establish a plan of operation within 60 days after the appointment of the interim board;\n(2) create a stamping office that is operational no later than December 31, 2008; and\n(3) conduct an election for a board of directors by the membership after December 31, 2008, and no later than one year after the appointment of the interim board.\n(b) Once the responsibilities of the interim board in paragraph (a) are fulfilled, the association shall function through a board of directors composed of the following:\n(1) one director appointed by the commissioner of revenue;\n(2) one director appointed by the commissioner of commerce; and\n(3) at least five but no more than seven directors elected by the members. The elected directors must be members of the association.\nDirectors may serve until their successors are appointed or elected and their terms are completed as outlined in the plan of operation.\n(a) The plan of operation shall provide for the formation, operation, and governance of the association as a nonprofit corporation under chapter 317A. The plan of operation must provide for the election of a board of directors by the members of the association. The board of directors shall elect officers as provided for in the plan of operation. The plan of operation shall establish the manner of voting and may weigh each member's vote to reflect the annual nonadmitted insurance premium written by the member. Members employed by the same or affiliated employers may consolidate their premiums written and delegate an individual officer or partner to represent the member in the exercise of association affairs, including service on the board of directors.\n(b) The plan of operation shall provide for an independent audit once each year of all the books and records of the association and a report of such independent audit shall be made to the board of directors, the commissioner of revenue, and the commissioner of commerce, with a copy made available to each member to review at the association office.\n(c) The plan of operation and any amendments to the plan of operation shall be submitted to the commissioner and shall be effective upon approval in writing by the commissioner. The association and all members shall comply with the plan of operation or any amendments to it. Failure to comply with the plan of operation or any amendments shall constitute a violation for which the commissioner may issue an order requiring discontinuance of the violation.\n(d) If the interim board of directors fails to submit a suitable plan of operation within 60 days following the creation of the interim board, or if at any time thereafter the association fails to submit required amendments to the plan, the commissioner may submit to the association a plan of operation or amendments to the plan, which the association must follow. The plan of operation or amendments submitted by the commissioner shall continue in force until amended by the commissioner or superseded by a plan of operation or amendment submitted by the association and approved by the commissioner. A plan of operation or an amendment submitted by the commissioner constitutes an order of the commissioner.\nThe association shall file with the commissioner:\n(1) a copy of its plan of operation and any amendments to it;\n(2) a current list of its members revised at least annually; and\n(3) the name and address of a member of the board residing in this state upon whom notices or orders of the commissioner or processes issued at the direction of the commissioner may be served.\nThe commissioner shall, at such times as deemed necessary, make or cause to be made an examination of the association. The officers, managers, agents, and employees of the association may be examined at any time, under oath, and shall exhibit all books, records, accounts, documents, or agreements governing its method of operation. The commissioner shall furnish a copy of the examination report to the association. If the commissioner finds the association to be in violation of this section, the commissioner may issue an order requiring the discontinuance of the violation.\nThere shall be no liability on the part of and no causes of action of any nature shall arise against the association, its directors, officers, agents, or employees for any action taken or omitted by them in the performance of their powers and duties under this section, absent gross negligence or willful misconduct.\nThe services performed by the association shall be funded by a stamping fee assessed for each premium-bearing document submitted to the association. The stamping fee shall be established by the board of directors of the association from time to time. The stamping fee shall be paid by the insured to the surplus lines broker and remitted to the association by the surplus lines broker in the manner established by the association.\nUnless otherwise classified by statute, a temporary classification under section 13.06, or federal law, information obtained by the commissioner from the association is public, except that any data identifying insureds or the Social Security number of a broker or any information derived therefrom is private data on individuals or nonpublic data as defined in section 13.02, subdivisions 9 and 12.",
	"repealed": false
}