{
	"id": "270C.72",
	"url": "https://www.revisor.mn.gov/statutes/cite/270C.72",
	"title": "270C.72 TAX CLEARANCE; ISSUANCE OF LICENSES.",
	"text": "(a) The state or a political subdivision of the state may not issue, transfer, or renew, and must revoke, a license for the conduct of a profession, occupation, trade, or business, if the commissioner notifies the licensing authority that the applicant owes the state delinquent taxes payable to the commissioner, penalties, or interest. The commissioner may not notify the licensing authority unless the applicant taxpayer owes $500 or more in delinquent taxes, penalties, or interest, or has not filed returns. If the applicant taxpayer does not owe delinquent taxes, penalties, or interest, but has not filed returns, the commissioner may not notify the licensing authority unless the taxpayer has been given 90 days' written notice to file the returns or show that the returns are not required to be filed.\n(b) Within ten days after receipt of the notification from the commissioner under paragraph (a), the licensing authority must notify the license holder by certified mail of the potential revocation of the license for the applicable reason under paragraph (a). The notice must include a copy of the commissioner's notice to the licensing agency and information, in the form specified by the commissioner, on the licensee's option for receiving a tax clearance from the commissioner. The licensing authority must revoke the license 30 days after receiving the notice from the commissioner, unless it receives a tax clearance from the commissioner as provided in paragraph (c).\n(c) A licensing authority that has received a notice from the commissioner may issue, transfer, renew, or not revoke the applicant's license only if (1) the commissioner issues a tax clearance certificate and (2) the commissioner or the applicant forwards a copy of the clearance to the authority. The commissioner may issue a clearance certificate only if the applicant does not owe the state any uncontested delinquent taxes, penalties, or interest and has filed all required returns.\nFor purposes of this section, the following terms have the meanings given.\n(a) \"Delinquent taxes\" do not include a tax liability if (i) an administrative or court action which contests the amount or validity of the liability has been filed or served, (ii) the appeal period to contest the tax liability has not expired, or (iii) the applicant has entered into a payment agreement and is current with the payments.\n(b) \"Applicant\" means an individual, if the license is issued to or in the name of an individual, or the corporation or partnership, if the license is issued to or in the name of a corporation or partnership. \"Applicant\" also means an officer of a corporation, a member of a partnership, or an individual who is liable for delinquent taxes, either for the entity for which the license is at issue or for another entity for which the liability was incurred, or personally as a licensee. In the case of a license transfer, \"applicant\" also means both the transferor and the transferee of the license. \"Applicant\" also means any holder of a license.\n(c) \"License\" means any permit, registration, certification, or other form of approval authorized by statute or rule to be issued by the state or a political subdivision of the state as a condition of doing business or conducting a trade, profession, or occupation in Minnesota, specifically including, but not limited to, a contract for space rental at the Minnesota State Fair and authorization to operate concessions or rides at county and local fairs, festivals, or events.\n(d) \"Licensing authority\" includes the Minnesota State Fair Board and county and local boards or governing bodies.\n(a) Prior to notifying a licensing authority pursuant to subdivision 1 to revoke a license, the commissioner must send a notice to the applicant of the commissioner's intent to require revocation of the license and of the applicant's right to a hearing. If the applicant requests a hearing in writing within 30 days of the date of the notice, a contested case hearing must be held. The hearing must be held within 45 days of the date the commissioner refers the case to the Office of Administrative Hearings. Notwithstanding any law to the contrary, the applicant must be served with 20 days' notice in writing specifying the time and place of the hearing and the allegations against the applicant. The notice may be served personally or by mail. A license is subject to revocation when 30 days have passed following the date of the notice in this paragraph without the applicant requesting a hearing, or, if a hearing is timely requested, upon final determination of the hearing under section 14.62, subdivision 1.\n(b) The commissioner may notify a licensing authority under subdivision 1 only after the requirements of paragraph (a) have been satisfied.\n(c) A hearing under this subdivision is in lieu of any other hearing or proceeding provided by law arising from any action taken under subdivision 1.\nAll licensing authorities must require the applicant to provide the applicant's Social Security number or individual taxpayer identification number and Minnesota business identification number, as applicable, on all license applications. Upon request of the commissioner, the licensing authority must provide the commissioner with a list of all applicants, including the name, address, business name and address, and Social Security number or individual taxpayer identification number and business identification number, as applicable, of each applicant. The commissioner may request from a licensing authority a list of the applicants no more than once each calendar year.",
	"repealed": false
}