{
	"id": "62J.56",
	"url": "https://www.revisor.mn.gov/statutes/cite/62J.56",
	"title": "62J.56 IMPLEMENTATION OF ELECTRONIC DATA INTERCHANGE STANDARDS.",
	"text": "(a) The legislature finds that there is a need to advance the use of electronic methods of data interchange among all health care participants in the state in order to achieve significant administrative cost savings. The legislature also finds that in order to advance the use of health care electronic data interchange in a cost-effective manner, the state needs to implement electronic data interchange standards that are nationally accepted, widely recognized, and available for immediate use. The legislature intends to set forth a plan for a systematic phase in of uniform health care electronic data interchange standards in all segments of the health care industry.\n(b) The commissioner of health, with the advice of the Minnesota Administrative Uniformity Committee, shall administer the implementation of and monitor compliance with, electronic data interchange standards of health care participants, according to the plan provided in this section.\nThe commissioner, with the advice of the Minnesota Administrative Uniformity Committee, and in coordination with federal efforts, may approve the use of new ASC X12 standards, or new versions of existing standards, as they become available, or other nationally recognized standards, where appropriate ASC X12 standards are not available for use. These alternative standards may be used during a transition period while ASC X12 standards are developed.\n(a) The commissioner, with the advice of the Minnesota Administrative Uniformity Committee, and the Minnesota Center for Health Care Electronic Data Interchange shall review and recommend the use of guides to implement the core transaction sets. Implementation guides must contain the background and technical information required to allow health care participants to implement the transaction set in the most cost-effective way.\n(b) The commissioner shall promote the development of implementation guides among health care participants for those business transaction types for which implementation guides are not available, to allow providers and group purchasers to implement electronic data interchange. In promoting the development of these implementation guides, the commissioner shall review the work done by the American Hospital Association through the national Uniform Billing Committee and its state representative organization; the American Medical Association through the National Uniform Claim Committee; the American Dental Association; the National Council of Prescription Drug Programs; and the Workgroup for Electronic Data Interchange.",
	"repealed": false
}