{
	"id": "469.009",
	"url": "https://www.revisor.mn.gov/statutes/cite/469.009",
	"title": "469.009 CONFLICT OF INTEREST; PENALTIES FOR FAILURE TO DISCLOSE.",
	"text": "Before taking an action or making a decision which could substantially affect the commissioner's or an employee's financial interests or those of an organization with which the commissioner or an employee is associated, a commissioner or employee of an authority shall (1) prepare a written statement describing the matter requiring action or decision and the nature of the potential conflict of interest and (2) submit the statement to the commissioners of the authority. The disclosure shall be entered upon the minutes of the authority at its next meeting. The disclosure statement must be submitted no later than one week after the employee or commissioner becomes aware of the potential conflict of interest. However, no disclosure statement is required if the effect on the commissioner or employee of the decision or act will be no greater than on other members of the business, profession or occupation or if the effect on the organization with which the commissioner or employee is affiliated is indirect, remote, and insubstantial. A potential conflict of interest is present if the commissioner or employee knows or has reason to know that the organization with which the commissioner or employee is affiliated is or is reasonably likely to become a participant in a project or development which will be affected by the action or decision. Any individual who knowingly fails to submit a statement required by this subdivision or submits a statement which the individual knows contains false information or omits required information is guilty of a gross misdemeanor.\nIf an employee has a potential conflict of interest, the employee's superior shall immediately assign the matter to another employee who does not have a potential conflict of interest. A commissioner who has a potential conflict of interest shall not attempt to influence an employee in any matter related to the action or decision in question, shall not take part in the action or decision, and shall not be counted toward a quorum during the portion of any meeting of the authority in which the action or decision is to be considered. Any individual who knowingly violates this subdivision is guilty of a gross misdemeanor.\nA commissioner or employee of an authority who knowingly takes part in any manner in making any sale, lease, or contract in the commissioner's or employee's official capacity in which the commissioner or employee has a personal financial interest is guilty of a gross misdemeanor.\nFor one year after termination of a position as a commissioner or employee of an authority, no former commissioner or former employee of an authority shall appear personally before any court or governmental department or agency as agent or attorney for anyone other than the authority in connection with any proceeding, application, request for ruling or other determination, contract, claim, controversy, charge, accusation, arrest, or other particular matter in which the authority is substantially interested, and with respect to which the commissioner or employee took any action or made any decision as a commissioner or employee of the authority at any time within a period of one year prior to the termination of that position.\nWith respect to each program established by the authority to provide financial assistance or financing for real property other than rental assistance programs, an employee or commissioner may receive such financial assistance or financing not more than once.\nThe county attorney may seek an injunction in the district court to enforce the provisions of this section.",
	"repealed": false
}