{
	"id": "47.61",
	"url": "https://www.revisor.mn.gov/statutes/cite/47.61",
	"title": "47.61 ELECTRONIC FUNDS TRANSFER FACILITIES; DEFINITIONS.",
	"text": "For the purposes of sections 47.61 to 47.74, unless the context requires otherwise, the following terms shall have the meanings given them.\n\"Commissioner\" means the commissioner of commerce.\n(a) \"Electronic financial terminal\" means an electronic information processing device that is established to do either or both of the following:\n(1) capture the data necessary to initiate financial transactions; or\n(2) through its attendant support system, store or initiate the transmission of the information necessary to consummate a financial transaction.\n(b) \"Electronic financial terminal\" does not include:\n(1) a telephone;\n(2) an electronic information processing device that is used internally by a financial institution to conduct the business activities of the institution;\n(3) an electronic point-of-sale terminal operated by a retailer that is used to process payments for the purchase of goods and services by consumers, and which also may be used to obtain cash advances or cash back not to exceed $25 and only if incidental to the retail sale transactions, through the use of credit cards or debit cards, provided that the payment transactions using debit cards are subject to the federal Electronic Funds Transfer Act, United States Code, title 15, sections 1693 et seq., and Regulation E of the Federal Reserve Board, Code of Federal Regulations, title 12, subpart 205.2; this clause does not exempt the retailer from liability for negligent conduct or intentional misconduct of the operator under section 47.69, subdivision 5;\n(4) stored-value cards to only process transactions other than those authorized by this section. Stored-value cards are transaction cards having magnetic stripes or computer chips that enable electronic value to be added or deducted as needed; or\n(5) a personal computer possessed by and operated exclusively by the account holder.\n\"Financial institution\" means a national banking association, federal savings association, or federal credit union having its main office in this state, or a bank, savings bank, savings association, credit union, industrial loan and thrift company, or regulated lender under chapter 56 established and operating under the laws of this state.\n\"Minnesota transmission facility\" means: (1) a transmission facility which is owned or controlled by financial institutions located in Minnesota; (2) a transmission facility owned or controlled by a bank holding company or savings and loan holding company if domiciled or headquartered in Minnesota; or (3) a transmission facility established in Minnesota and approved by the commissioner under section 47.65, subdivision 1, as of August 1, 1990.\n[Repealed, 1983 c 102 s 3]\n\"Retailer\" means a person primarily engaged in the business of selling goods or services to consumers or a person who owns or operates a mall area.\n\"Transmission facility\" means the electronic system which is used to forward from one financial institution, its affiliate, or agent, to one or more financial institutions, their affiliates, or agents, financial transaction data originating from an electronic financial terminal and its attendant support system.",
	"repealed": false
}