{
	"id": "142B.40",
	"url": "https://www.revisor.mn.gov/statutes/cite/142B.40",
	"title": "142B.40 SPECIAL CONDITIONS FOR RESIDENTIAL PROGRAMS.",
	"text": "It is the policy of the state that persons shall not be excluded by municipal zoning ordinances or other land use regulations from the benefits of normal residential surroundings.\nResidential programs with a licensed capacity of six or fewer persons shall be considered a permitted single-family residential use of property for the purposes of zoning and other land use regulations, except that a residential program whose primary purpose is to treat juveniles who have violated criminal statutes relating to sex offenses or have been adjudicated delinquent on the basis of conduct in violation of criminal statutes relating to sex offenses shall not be considered a permitted use. This exception shall not apply to residential programs licensed before July 1, 1995. Programs otherwise allowed under this subdivision shall not be prohibited by operation of restrictive covenants or similar restrictions, regardless of when entered into, that cannot be met because of the nature of the licensed program, including provisions that require the home's occupants be related, and that the home must be occupied by the owner, or similar provisions.\n(a) Child foster care license holders must maintain the ability to care for a foster child and ensure a safe home environment for children placed in their care. License holders must immediately notify the licensing agency of:\n(1) any changes to the license holder or household member's physical or behavioral health that may affect the license holder's ability to care for a foster child or pose a risk to a foster child's health; or\n(2) changes related to the care of a child or vulnerable adult for whom the license holder is a parent or legally responsible, including living out of the home for treatment for physical or behavioral health, modified parenting time arrangements, legal custody, or placement in foster care.\n(b) The licensing agency may request a license holder or household member to undergo an evaluation by a specialist in areas such as physical or behavioral health to evaluate the license holder's ability to provide a safe environment for a foster child. Prior to assigning a specialist to evaluate, the licensing agency must tell the license holder or household member why the licensing agency has requested a specialist evaluation and request a release of information from the license holder or household member.",
	"repealed": false
}