{
	"id": "325G.24",
	"url": "https://www.revisor.mn.gov/statutes/cite/325G.24",
	"title": "325G.24 RIGHT OF CANCELLATION.",
	"text": "(a) Any person who has elected to become a member of a club may unilaterally cancel such membership, in the person's exclusive discretion, by giving notice of cancellation at any time before midnight of the third business day following the date on which membership was attained.\n(b) If given by mail, the notice is effective upon deposit in a mailbox, properly addressed and postage prepaid.\n(c) Cancellation under this subdivision shall be without liability on the part of the member and the member shall be entitled to a refund, within ten days after notice of cancellation is given, of the entire consideration paid for the contract.\n(a) Any person who has elected to become a member of a club may unilaterally terminate such membership, in the person's exclusive discretion, by giving notice of termination at any time.\n(b) If given by mail, the notice is effective upon deposit in a mailbox, properly addressed, and postage prepaid.\n(c) A club must not impose a termination fee or any other liability on the member for termination under this subdivision.\n(d) Termination under this subdivision is effective at the end of the membership term in which the member provides the notice of termination. If membership is at-will without a defined membership term, then termination under this subdivision is effective immediately, unless the member indicates a future effective date of termination, in which event the date indicated by the member is the effective date of termination.\n(e) If a member provides notice of termination at any time before midnight of the third business day following the date on which membership was attained, the club must treat the notice as a notice of cancellation under subdivision 1, unless the member specifically provides for a future termination effective date.\n(a) A club must accept a notice of cancellation or notice of termination that has been given:\n(1) verbally, including but not limited to personally or over the telephone to customer or account service members;\n(2) in writing, including but not limited to via mail, email, or an online message through the club's website directed to customer or account service members;\n(3) through a termination election as described in section 325G.60; or\n(4) in any other manner or medium by which the member initially accepted membership to the club and that is no more burdensome to the member than was the initial acceptance.\n(b) The process to cancel must be stated clearly and be easily accessible and completed with ease.\nA right of cancellation or right of termination under this section may not be waived or otherwise surrendered.",
	"repealed": false
}