{
	"id": "279.16",
	"url": "https://www.revisor.mn.gov/statutes/cite/279.16",
	"title": "279.16 JUDGMENT WHEN NO ANSWER; FORM; ENTRY.",
	"text": "Upon the expiration of 20 days from the later of the filing of the affidavit of publication or the filing of the affidavit of mailing pursuant to section 279.131, the court administrator shall enter judgment against each and every such parcel as to which no answer has been filed, which judgment shall include all such parcels, and shall be substantially in the following form:\nIn the matter of the proceedings to enforce payment of the taxes on real estate remaining delinquent on the first Monday in January, ......., for the county of ...................., state of Minnesota.\nA list of taxes on real property, delinquent on the first Monday in January, ......., for said county of ................., having been duly filed in the office of the court administrator of this court, and the notice and list required by law having been duly published and mailed as required by law, and more than 20 days having elapsed since the last publication of the notice and list, and no answer having been filed by any person, company, or corporation to the taxes upon any of the parcels of land hereinafter described, it is hereby adjudged that each parcel of land hereinafter described is liable for taxes, penalties, and costs to the amount set opposite the same, as follows:\nThe amount of taxes, penalties, and cost to which, as hereinbefore stated, each of such parcels of land is liable, is hereby declared a lien upon such parcel of land as against the estate, right, title, interest, claim, or lien, of whatever nature, in law or equity, of every person, company, or corporation; and it is adjudged that, unless the amount to which each of such parcels is liable be paid, each of such parcels be sold, as provided by law, to satisfy the amount to which it is liable.\nThe judgment shall be entered by the court administrator in a book to be kept by the court administrator, to be called the real estate tax judgment book, and signed by the court administrator. The same presumption in favor of the regularity and validity of the judgment shall be deemed to exist as in respect to judgments in civil actions in such court, except where taxes have been paid before the entry of judgment, or where the land is exempt from taxation, in which cases the judgment shall be prima facie evidence only of its regularity and validity.",
	"repealed": false
}