{
	"id": "256B.059",
	"url": "https://www.revisor.mn.gov/statutes/cite/256B.059",
	"title": "256B.059 TREATMENT OF ASSETS WHEN A SPOUSE IS INSTITUTIONALIZED.",
	"text": "(a) For purposes of this section and sections 256B.058 and 256B.0595, the terms defined in this subdivision have the meanings given them.\n(b) \"Community spouse\" means the spouse of an institutionalized spouse.\n(c) \"Assets otherwise available to the community spouse\" means assets individually or jointly owned by the community spouse, other than assets excluded by subdivision 5, paragraph (c).\n(d) \"Community spouse asset allowance\" is the value of assets that can be transferred under subdivision 3.\n(e) \"Institutionalized spouse\" means a person who is:\n(1) in a hospital, nursing facility, or intermediate care facility for persons with developmental disabilities, or receiving home and community-based services under chapter 256S, and is expected to remain in the facility or institution or receive the home and community-based services for at least 30 consecutive days; and\n(2) married to a person who is not in a hospital, nursing facility, or intermediate care facility for persons with developmental disabilities, and is not receiving home and community-based services under chapter 256S or section 256B.092 or 256B.49.\n(f) \"For the sole benefit of\" means no other individual or entity can benefit in any way from the assets or income at the time of a transfer or at any time in the future.\n(g) \"Continuous period of institutionalization\" means a 30-consecutive-day period of time in which a person is expected to stay in a medical or long-term care facility, or receive home and community-based services that would qualify for coverage under the elderly waiver (EW) or alternative care (AC) programs. For a stay in a facility, the 30-consecutive-day period begins on the date of entry into a medical or long-term care facility. For receipt of home and community-based services, the 30-consecutive-day period begins on the date that the following conditions are met:\n(1) the person is receiving services that meet the nursing facility level of care determined by a long-term care consultation;\n(2) the person has received the long-term care consultation within the past 60 days;\n(3) the services are paid by the EW program under chapter 256S or the AC program under section 256B.0913 or would qualify for payment under the EW or AC programs if the person were otherwise eligible for either program, and but for the receipt of such services the person would have resided in a nursing facility; and\n(4) the services are provided by a licensed provider qualified to provide home and community-based services.\n[Repealed, 2016 c 189 art 19 s 31]\nUpon application for medical assistance benefits for an institutionalized spouse, the total value of assets in which either the institutionalized spouse or the community spouse has an interest shall be assessed and the community spouse asset allowance shall be calculated as required in subdivision 3.\nAn institutionalized spouse may transfer assets to the community spouse for the sole benefit of the community spouse. Except for increased amounts allowable under subdivision 4, the maximum amount of assets allowed to be transferred is the amount which, when added to the assets otherwise available to the community spouse, is the greater of:\n(1) $119,220 subject to an annual adjustment on January 1, 2017, and every January 1 thereafter, equal to the percentage increase in the Consumer Price Index for All Urban Consumers (all items; United States city average) between the two previous Septembers; or\n(2) the amount required by court order to be paid to the community spouse.\nIf the assets available to the community spouse are already at the limit permissible under this section, or the higher limit attributable to increases under subdivision 4, no assets may be transferred from the institutionalized spouse to the community spouse. The transfer must be made as soon as practicable after the date the institutionalized spouse is determined eligible for medical assistance, or within the amount of time needed for any court order required for the transfer.\n(a) If either the institutionalized spouse or community spouse establishes that the community spouse asset allowance under subdivision 3 (in relation to the amount of income generated by such an allowance) is not sufficient to raise the community spouse's income to the minimum monthly maintenance needs allowance in section 256B.058, subdivision 2, paragraph (c), there shall be substituted for the amount allowed to be transferred an amount sufficient, when combined with the monthly income otherwise available to the spouse, to provide the minimum monthly maintenance needs allowance. A substitution under this paragraph may be made only if the assets of the couple have been arranged so that the maximum amount of income-producing assets, at the maximum rate of return, are available to the community spouse under the community spouse asset allowance. The maximum rate of return is the average rate of return available from the financial institution holding the asset, or a rate determined by the commissioner to be reasonable according to community standards, if the asset is not held by a financial institution.\n(b) The community spouse asset allowance under subdivision 3 can be increased by court order or hearing that complies with the requirements of United States Code, title 42, section 1396r-5.\n(a) At the time of initial determination of eligibility for medical assistance benefits for an institutionalized spouse, assets considered available to the institutionalized spouse shall be the total value of all assets in which either spouse has an ownership interest, reduced by the amount available to the community spouse under subdivision 3.\nThe value of assets transferred for the sole benefit of the community spouse under section 256B.0595, subdivision 4, in combination with other assets available to the community spouse under this section, cannot exceed the limit for the community spouse asset allowance determined under subdivision 3 or 4. Assets that exceed this allowance shall be considered available to the institutionalized spouse. If the community spouse asset allowance has been increased under subdivision 4, then the assets considered available to the institutionalized spouse under this subdivision shall be further reduced by the value of additional amounts allowed under subdivision 4.\n(b) An institutionalized spouse may be found eligible for medical assistance even though assets in excess of the allowable amount are found to be available under paragraph (a) if the assets are owned jointly or individually by the community spouse, and the institutionalized spouse cannot use those assets to pay for the cost of care without the consent of the community spouse, and if:\n(i) the institutionalized spouse assigns to the commissioner the right to support from the community spouse under section 256B.14, subdivision 3;\n(ii) the institutionalized spouse lacks the ability to execute an assignment due to a physical or mental impairment; or\n(iii) the denial of eligibility would cause an imminent threat to the institutionalized spouse's health and well-being.\n(c) After the month in which the institutionalized spouse is determined eligible for medical assistance, and during the continuous period of enrollment, no assets of the community spouse are considered available to the institutionalized spouse, unless the institutionalized spouse has been found eligible under paragraph (b).\n(d) Assets determined to be available to the institutionalized spouse under this section must be used for the health care or personal needs of the institutionalized spouse.\n(e) For purposes of this section, assets do not include assets excluded under the Supplemental Security Income program.\n(a) During the period in which rules against spousal impoverishment are temporarily applied according to section 2404 of the Patient Protection Affordable Care Act, Public Law 111-148, as amended by the Health Care and Education Reconciliation Act of 2010, Public Law 111-152, this section applies to an institutionalized spouse:\n(1) applying for home and community-based waivers under sections 256B.092, 256B.093, and 256B.49 on or after June 1, 2016;\n(2) enrolled in home and community-based waivers under sections 256B.092, 256B.093, and 256B.49 before June 1, 2016, based on an application submitted on or after January 1, 2014; or\n(3) applying for services under section 256B.85 upon the effective date of that section.\n(b) During the applicable period of paragraph (a), the definition of \"institutionalized spouse\" in subdivision 1, paragraph (e), also includes an institutionalized spouse referenced in paragraph (a).",
	"repealed": false
}