{
	"id": "126C.41",
	"url": "https://www.revisor.mn.gov/statutes/cite/126C.41",
	"title": "126C.41 BENEFITS LEVIES.",
	"text": "[Repealed, 1Sp2015 c 3 art 1 s 28]\n(a) A district may levy an amount up to the amount the district is required by the collective bargaining agreement in effect on March 30, 1992, to pay for health insurance or unreimbursed medical expenses for licensed and nonlicensed employees who have terminated services in the employing district and withdrawn from active teaching service or other active service, as applicable, before July 1, 1992, and to pay for health insurance or unreimbursed medical expenses for licensed and nonlicensed employees who have terminated services in the employing district and withdrawn from active teaching service or other active service, as applicable before July 1, 1998, only if a sunset clause is in effect for the current collective bargaining agreement. The total amount of the levy each year may not exceed $600,000.\n(b) In addition to the levy authority granted under paragraph (a), a school district may levy for other postemployment benefits expenses actually paid during the previous fiscal year. For purposes of this subdivision, \"postemployment benefits\" means benefits giving rise to a liability under Statement No. 45 of the Government Accounting Standards Board. A district seeking levy authority under this subdivision must:\n(1) create or have created an actuarial liability to pay postemployment benefits to employees or officers after their termination of service;\n(2) have a sunset clause in effect for the current collective bargaining agreement as required by paragraph (a); and\n(3) apply for the authority in the form and manner required by the commissioner of education.\nIf the total levy authority requested under this paragraph exceeds the amount established in paragraph (c), the commissioner must proportionately reduce each district's maximum levy authority under this subdivision. The commissioner may subsequently adjust each district's levy authority under this subdivision so long as the total levy authority does not exceed the maximum levy authority for that year.\n(c) The maximum levy authority under paragraph (b) must not exceed the following amounts:\n(1) $9,242,000 for taxes payable in 2010;\n(2) $29,863,000 for taxes payable in 2011; and\n(3) for taxes payable in 2012 and later, the maximum levy authority must not exceed the sum of the previous year's authority and $14,000,000.\n(a) In 1991 and each year thereafter, a district to which this subdivision applies may levy an additional amount required for contributions to the general employees retirement plan of the Public Employees Retirement Association as the successor of the Minneapolis Employees Retirement Fund as a result of the maximum dollar amount limitation on state contributions to that plan imposed under section 353.505. The additional levy must not exceed the most recent amount certified by the executive director of the Public Employees Retirement Association as the district's share of the contribution requirement in excess of the maximum state contribution under section 353.505.\n(b) For taxes payable in 1994 and thereafter, Special School District No. 1, Minneapolis, and Independent School District No. 625, St. Paul, may levy for the increase in the employer retirement fund contributions, under Laws 1992, chapter 598, article 5, section 1.\n(c) If the employer retirement fund contributions under section 354A.12, subdivision 2a, are increased for fiscal year 1994 or later fiscal years, Special School District No. 1, Minneapolis, and Independent School District No. 625, St. Paul, may levy in payable 1994 or later an amount equal to the amount derived by applying the net increase in the employer retirement fund contribution rate of the respective teacher retirement fund association between fiscal year 1993 and the fiscal year beginning in the year after the levy is certified to the total covered payroll of the applicable teacher retirement fund association. If an applicable school district levies under this paragraph, they may not levy under paragraph (b).\n(d) In addition to the levy authorized under paragraph (c), Special School District No. 1, Minneapolis, may also levy payable in 1997 or later an amount equal to the contributions under section 354.435, subdivision 2, and may also levy in payable 1994 or later an amount equal to the state aid contribution under section 354.435, subdivision 1. Independent School District No. 625, St. Paul, may levy payable in 1997 or later an amount equal to the supplemental contributions under section 423A.02, subdivision 3.\nEach year Special School District No. 1, Minneapolis, may make an additional levy not to exceed the amount raised by a net tax rate of .10 percent times the adjusted net tax capacity for taxes payable in 1991 and thereafter of the property in the district for the preceding year. The proceeds may be used only to subsidize health insurance costs for eligible teachers as provided in this section.\n\"Eligible teacher\" means a retired teacher who is a retired member of the Teachers Retirement Association, who was a basic member of the former Minneapolis Teachers Retirement Fund Association, who retired before May 1, 1974, or who had 20 or more years of basic member service in the former Minneapolis Teachers Retirement Fund Association and retired before June 30, 1983, and who is not eligible to receive the hospital insurance benefits of the federal Medicare program of the Social Security Act without payment of a monthly premium. The district must notify eligible teachers that a subsidy is available. To obtain a subsidy, an eligible teacher must submit to the school district a copy of receipts for health insurance premiums paid. The district must disburse the health insurance premium subsidy to each eligible teacher according to a schedule determined by the district, but at least annually. An eligible teacher may receive a subsidy up to an amount equal to the lesser of 90 percent of the cost of the eligible teacher's health insurance or up to 90 percent of the cost of the number two qualified plan of health coverage for individual policies made available by the Minnesota comprehensive health association under chapter 62E.\nIf funds remaining from the previous year's health insurance subsidy levy, minus the previous year's required subsidy amount, are sufficient to pay the estimated current year subsidy, the levy must be discontinued until the remaining funds are estimated by the school board to be insufficient to pay the subsidy.\nThis subdivision does not extend benefits to teachers who retire after June 30, 1983, and does not create a contractual right or claim for altering the benefits in this subdivision. This subdivision does not restrict the district's right to modify or terminate coverage under this subdivision.\nThe school board of Independent School District No. 625, St. Paul, for the purpose of providing moneys for the payment of its severance pay obligations under a plan approved by resolution of the district, in addition to all other powers possessed by the school district and in addition to and in excess of any existing limitation upon the amount it is otherwise authorized by law to levy as taxes, is authorized to levy taxes annually not exceeding in any one year an amount equal to a net tax capacity rate of 0.36 percent for taxes payable in 2002 and thereafter upon all taxable property within the school district which taxes as levied shall be spread upon the tax rolls, and all corrections thereof shall be held by the school district, and allocated therefor to be disbursed and expended by the school district in payment of any public school severance pay obligations and for no other purpose. Disbursements and expenditures previously authorized on behalf of the school district for payment of severance pay obligations shall not be deemed to constitute any part of the cost of the operation and maintenance of the school district within the meaning of any statutory limitation of any school district expenditures.\nThe amount of such severance pay allowable or to become payable in respect of any such employment or to any such employee shall not exceed the amount permitted by section 465.72.\n(a) A school district qualifies for eligibility under this section if the district:\n(1) participated in the cooperative secondary facilities program;\n(2) consolidated with at least two other school districts; and\n(3) has unfunded severance or retirement costs.\n(b) An eligible school district may annually levy up to $150,000 for unfunded severance or retirement costs. This levy authority expires after taxes payable in 2017.\n(c) A school district that levies under this section must reserve the proceeds of the levy and spend those amounts only for unfunded severance or retirement costs.",
	"repealed": false
}