{
	"id": "62A.3164",
	"url": "https://www.revisor.mn.gov/statutes/cite/62A.3164",
	"title": "62A.3164 MEDICARE SUPPLEMENT PLAN WITH $20 AND $50 CO-PAYMENT MEDICARE PART B COVERAGE.",
	"text": "(a) The Medicare supplement plan with $20 and $50 co-payment Medicare Part B coverage must have a level of coverage that will provide:\n(1) 100 percent of Medicare Part A hospitalization coinsurance plus coverage for 365 days after Medicare benefits end;\n(2) coverage for the Medicare Part A inpatient hospital deductible amount per benefit period;\n(3) coverage for the coinsurance amount for each day used from the 21st through the 100th day in a Medicare benefit period for posthospital skilled nursing care eligible under Medicare Part A;\n(4) coverage for the cost sharing for all Medicare Part A eligible hospice and respite care expenses;\n(5) coverage for Medicare Part A or B of the reasonable cost of the first three pints of blood, or equivalent quantities of packed red blood cells, as defined under federal regulations, unless replaced according to federal regulations;\n(6) coverage for 100 percent of the cost sharing otherwise applicable under Medicare Part B except for the lesser of $20 or the Medicare Part B coinsurance or co-payment for each covered health care provider office visit and the lesser of $50 or the Medicare Part B coinsurance or co-payment for each covered emergency room visit; however, this co-payment shall be waived if the insured is admitted to any hospital and the emergency visit is subsequently covered as a Medicare Part A expense;\n(7) coverage of 100 percent of the cost sharing for Medicare Part B preventive services and diagnostic procedures for cancer screening described in section 62A.30 after the policyholder pays the Medicare Part B deductible;\n(8) coverage of 80 percent of the hospital and medical expenses and supplies incurred during travel outside of the United States as a result of a medical emergency; and\n(9) coverage for Medicare Part A or B home health care services and medical supplies after the policyholder pays the Medicare Part B deductible.\n(b) A Medicare supplement plan with $20 and $50 co-payment Medicare Part B coverage must provide the benefits contained in this section, but must not provide coverage for 100 percent or any portion of the Medicare Part B deductible to a newly eligible individual. No portion of the co-payment referenced in this paragraph may be applied to a Medicare Part B deductible.",
	"repealed": false
}