{
	"id": "53B.28",
	"url": "https://www.revisor.mn.gov/statutes/cite/53B.28",
	"title": "53B.28 DEFINITIONS.",
	"text": "For the purposes of this chapter, the terms defined in this section have the meanings given them.\n\"Acting in concert\" means persons knowingly acting together with a common goal of jointly acquiring control of a licensee, whether or not pursuant to an express agreement.\n\"Authorized delegate\" means a person a licensee designates to engage in money transmission on behalf of the licensee.\n\"Average daily money transmission liability\" means the amount of the licensee's outstanding money transmission obligations in Minnesota at the end of each day in a given period of time, added together, and divided by the total number of days in the given period of time. For purposes of calculating average daily money transmission liability under this chapter for any licensee required to do so, the given period of time shall be the quarters ending March 31, June 30, September 30, and December 31.\n\"Bank Secrecy Act\" means the Bank Secrecy Act under United States Code, title 31, section 5311, et seq., and the Bank Secrecy Act's implementing regulations, as amended and recodified from time to time.\n\"Closed loop stored value\" means stored value that is redeemable by the issuer only for a good or service provided by the issuer, the issuer's affiliate, the issuer's franchisees, or an affiliate of the issuer's franchisees, except to the extent required by applicable law to be redeemable in cash for the good or service's cash value.\n\"Control\" means:\n(1) the power to vote, directly or indirectly, at least 25 percent of the outstanding voting shares or voting interests of a licensee or person in control of a licensee;\n(2) the power to elect or appoint a majority of key individuals or executive officers, managers, directors, trustees, or other persons exercising managerial authority of a person in control of a licensee; or\n(3) the power to exercise, directly or indirectly, a controlling influence over the management or policies of a licensee or person in control of a licensee.\n\"Eligible rating\" means a credit rating of any of the three highest rating categories provided by an eligible rating service, whereby each category may include rating category modifiers such as \"plus\" or \"minus\" or the equivalent for any other eligible rating service. Long-term credit ratings are deemed eligible if the rating is equal to A- or higher or the equivalent from any other eligible rating service. Short-term credit ratings are deemed eligible if the rating is equal to or higher than A-2 or SP-2 by S&P, or the equivalent from any other eligible rating service. In the event that ratings differ among eligible rating services, the highest rating shall apply when determining whether a security bears an eligible rating.\n\"Eligible rating service\" means any Nationally Recognized Statistical Rating Organization (NRSRO), as defined by the United States Securities and Exchange Commission and any other organization designated by the commissioner by rule or order.\n\"Federally insured depository financial institution\" means a bank, credit union, savings and loan association, trust company, savings association, savings bank, industrial bank, or industrial loan company organized under the laws of the United States or any state of the United States, when the bank, credit union, savings and loan association, trust company, savings association, savings bank, industrial bank, or industrial loan company has federally insured deposits.\n\"In Minnesota\" means at a physical location within the state of Minnesota for a transaction requested in person. For a transaction requested electronically or by telephone, the provider of money transmission may determine if the person requesting the transaction is in Minnesota by relying on other information provided by the person regarding the location of the individual's residential address or a business entity's principal place of business or other physical address location, and any records associated with the person that the provider of money transmission may have that indicate the location, including but not limited to an address associated with an account.\n\"Individual\" means a natural person.\n\"Key individual\" means any individual ultimately responsible for establishing or directing policies and procedures of the licensee, including but not limited to as an executive officer, manager, director, or trustee.\n\"Licensee\" means a person licensed under this chapter.\n\"Material litigation\" means litigation that, according to United States generally accepted accounting principles, is significant to a person's financial health and would be required to be disclosed in the person's annual audited financial statements, report to shareholders, or similar records.\n\"Money\" means a medium of exchange that is authorized or adopted by the United States or a foreign government. Money includes a monetary unit of account established by an intergovernmental organization or by agreement between two or more governments.\n\"Monetary value\" means a medium of exchange, whether or not redeemable in money.\n(a) \"Money transmission\" means:\n(1) selling or issuing payment instruments to a person located in this state;\n(2) selling or issuing stored value to a person located in this state; or\n(3) receiving money for transmission from a person located in this state.\n(b) Money transmission does not include the provision solely of online or telecommunications services or network access.\n\"Money services businesses accredited state\" or \"MSB accredited state\" means a state agency that is accredited by the Conference of State Bank Supervisors and Money Transmitter Regulators Association for money transmission licensing and supervision.\n\"Multistate licensing process\" means any agreement entered into by and among state regulators relating to coordinated processing of applications for money transmission licenses, applications for the acquisition of control of a licensee, control determinations, or notice and information requirements for a change of key individuals.\n\"NMLS\" means the Nationwide Multistate Licensing System and Registry developed by the Conference of State Bank Supervisors and the American Association of Residential Mortgage Regulators and owned and operated by the State Regulatory Registry, LLC, or any successor or affiliated entity, for the licensing and registration of persons in financial services industries.\n(a) \"Outstanding money transmission obligations\" must be established and extinguished in accordance with applicable state law and means:\n(1) any payment instrument or stored value issued or sold by the licensee to a person located in the United States or reported as sold by an authorized delegate of the licensee to a person that is located in the United States that has not yet been paid or refunded by or for the licensee, or escheated in accordance with applicable abandoned property laws; or\n(2) any money received for transmission by the licensee or an authorized delegate in the United States from a person located in the United States that has not been received by the payee or refunded to the sender, or escheated in accordance with applicable abandoned property laws.\n(b) For purposes of this subdivision, \"in the United States\" includes, to the extent applicable, a person in any state, territory, or possession of the United States; the District of Columbia; the Commonwealth of Puerto Rico; or a U.S. military installation that is located in a foreign country.\n\"Passive investor\" means a person that:\n(1) does not have the power to elect a majority of key individuals or executive officers, managers, directors, trustees, or other persons exercising managerial authority of a person in control of a licensee;\n(2) is not employed by and does not have any managerial duties of the licensee or person in control of a licensee;\n(3) does not have the power to exercise, directly or indirectly, a controlling influence over the management or policies of a licensee or person in control of a licensee; and\n(4) attests to clauses (1), (2), and (3), in a form and in a medium prescribed by the commissioner, or commits to the passivity characteristics under clauses (1), (2), and (3) in a written document.\n(a) \"Payment instrument\" means a written or electronic check, draft, money order, traveler's check, or other written or electronic instrument for the transmission or payment of money or monetary value, whether or not negotiable.\n(b) Payment instrument does not include stored value or any instrument that is: (1) redeemable by the issuer only for goods or services provided by the issuer, the issuer's affiliate, the issuer's franchisees, or an affiliate of the issuer's franchisees, except to the extent required by applicable law to be redeemable in cash for its cash value; or (2) not sold to the public but issued and distributed as part of a loyalty, rewards, or promotional program.\n\"Payroll processing services\" means delivering wages or salaries, making payment of payroll taxes to state and federal agencies, making payments relating to employee benefit plans, making distributions of other authorized deductions from wages or salaries, or transmitting money on behalf of an employer in connection with transactions related to employees. The term payroll processing services includes an employer performing payroll processing services on the employer's own behalf or on behalf of the employer's affiliate and professional employment organizations.\n\"Person\" means any individual, general partnership, limited partnership, limited liability company, corporation, trust, association, joint stock corporation, or other corporate entity identified by the commissioner.\n\"Receiving money for transmission\" or \"money received for transmission\" means receiving money or monetary value in the United States for transmission within or outside the United States by electronic or other means.\n(a) \"Stored value\" means monetary value representing a claim against the issuer evidenced by an electronic or digital record, and that is intended and accepted for use as a means of redemption for money or monetary value, or payment for goods or services. Stored value includes but is not limited to prepaid access, as defined under Code of Federal Regulations, title 31, part 1010.100, as amended or recodified from time to time.\n(b) Notwithstanding this subdivision, stored value does not include: (1) a payment instrument or closed loop stored value; or (2) stored value not sold to the public but issued and distributed as part of a loyalty, rewards, or promotional program.\n\"Tangible net worth\" means the aggregate assets of a licensee excluding all intangible assets, less liabilities, as determined in accordance with United States generally accepted accounting principles.",
	"repealed": false
}