{
	"id": "144.4961",
	"url": "https://www.revisor.mn.gov/statutes/cite/144.4961",
	"title": "144.4961 MINNESOTA RADON LICENSING ACT.",
	"text": "This section may be cited as the \"Minnesota Radon Licensing Act.\"\n(a) As used in this section, the following terms have the meanings given them.\n(b) \"Mitigation\" means the act of repairing or altering a building or building design for the purpose in whole or in part of reducing the concentration of radon in the indoor atmosphere.\n(c) \"Radon\" means both the radioactive, gaseous element produced by the disintegration of radium, and the short-lived radionuclides that are decay products of radon.\nThe commissioner of health shall adopt rules establishing licensure requirements and work standards relating to indoor radon in dwellings and other buildings, with the exception of newly constructed Minnesota homes according to section 326B.106, subdivision 6. The commissioner shall coordinate, oversee, and implement all state functions in matters concerning the presence, effects, measurement, and mitigation of risks of radon in dwellings and other buildings. Rules adopted by the commissioner under this subdivision are effective beginning January 1, 2019.\nAll radon mitigation systems installed in Minnesota on or after January 1, 2019, must have a radon mitigation system tag provided by the commissioner. A radon mitigation professional must attach the tag to the radon mitigation system in a visible location.\nEffective January 1, 2019, a license is required annually for every person, firm, or corporation that performs a service for compensation to detect the presence of radon in the indoor atmosphere, performs laboratory analysis, or performs a service to mitigate radon in the indoor atmosphere.\nThis section does not apply to:\n(1) employees of a firm or corporation that installs radon control systems in newly constructed Minnesota homes as specified in subdivision 11;\n(2) a person authorized as a building official under Minnesota Rules, part 1300.0070, or that person's designee; or\n(3) any person, firm, corporation, or entity that distributes radon testing devices or information for general educational purposes.\nThe professionals, companies, and laboratories listed in subdivision 8 must submit applications for licenses, system tags, and any other reporting required under this section and Minnesota Rules on forms prescribed by the commissioner.\n(a) All radon license applications submitted to the commissioner of health must be accompanied by the required fees. If the commissioner determines that insufficient fees were paid, the necessary additional fees must be paid before the commissioner approves the application. The commissioner shall charge the following fees for each radon license:\n(1) Each measurement professional license, $150 per year. \"Measurement professional\" means any person who performs a test to determine the presence and concentration of radon in a building the person does not own or lease.\n(2) Each mitigation professional license, $250 per year. \"Mitigation professional\" means an individual who installs or designs a radon mitigation system in a building the individual does not own or lease, or provides on-site supervision of radon mitigation and mitigation technicians. \"On-site supervision\" means a review at the property of mitigation work upon completion of the work and attachment of a system tag. Employees or subcontractors who are supervised by a licensed mitigation professional are not required to be licensed under this clause. This license also permits the licensee to perform the activities of a measurement professional described in clause (1).\n(3) Each mitigation company license, $100 per year. \"Mitigation company\" means any business or government entity that performs or authorizes employees to perform radon mitigation. This fee is waived if the mitigation company employs only one licensed mitigation professional.\n(4) Each radon analysis laboratory license, $500 per year. \"Radon analysis laboratory\" means a business entity or government entity that analyzes passive radon detection devices to determine the presence and concentration of radon in the devices. This fee is waived if the laboratory is a government entity and is only distributing test kits for the general public to use in Minnesota.\n(5) Each Minnesota Department of Health radon mitigation system tag, $75 per tag. \"Minnesota Department of Health radon mitigation system tag\" or \"system tag\" means a unique identifiable radon system label provided by the commissioner of health.\n(b) Fees collected under this section shall be deposited in the state treasury and credited to the state government special revenue fund.\nThe commissioner shall enforce this section under the provisions of sections 144.989 to 144.993.\nThis section does not preclude local units of government from requiring additional permits or inspections for radon control systems, and does not supersede any local inspection or permit requirements.\nThis section does not apply to newly constructed Minnesota homes according to section 326B.106, subdivision 6, prior to the issuance of a certificate of occupancy.",
	"repealed": false
}