{
	"id": "322C.1004",
	"url": "https://www.revisor.mn.gov/statutes/cite/322C.1004",
	"title": "322C.1004 FILINGS REQUIRED FOR MERGER OR EXCHANGE; EFFECTIVE DATE AND TIME.",
	"text": "After each constituent organization has approved a merger or exchange, articles of merger or exchange must be signed on behalf of:\n(1) each constituent limited liability company, as provided in section 322C.0203, subdivision 1; and\n(2) each other constituent organization, as provided in its governing statute.\nArticles of merger under this section must include:\n(1) the name and form of each constituent organization and the jurisdiction of its governing statute;\n(2) the name and form of the surviving organization, the jurisdiction of its governing statute, and, if the surviving organization is created by the merger, a statement to that effect;\n(3) the date the merger is effective under the governing statute of the surviving organization;\n(4) if the surviving organization is to be created by the merger:\n(i) if it will be a limited liability company, the company's articles of organization; or\n(ii) if it will be an organization other than a limited liability company, the organizational document that creates the organization that is in a public record;\n(5) if the surviving organization preexists the merger, any amendments provided for in the plan of merger for the organizational document that created the organization that are in a public record;\n(6) a statement as to each constituent organization that the merger was approved as required by the organization's governing statute;\n(7) if the surviving organization is a foreign organization not authorized to transact business in this state, the street address of an office that the secretary of state may use for the purposes of section 322C.1005, subdivision 2; and\n(8) any additional information required by the governing statute of any constituent organization.\nArticles of exchange under this section must include:\n(1) the name and form of each constituent organization and the jurisdiction of its governing statute;\n(2) the manner and basis of exchanging the ownership interests to be acquired for securities of, or other ownership interests in, the acquiring organization or any other organization or, in whole or part, for money or other property;\n(3) the date the exchange is effective under the governing statute of the acquiring organization;\n(4) a statement as to each constituent organization that the exchange was approved as required by the organization's governing statute; and\n(5) any additional information required by the governing statute of any constituent organization.\nEach constituent limited liability company shall file the articles of merger, together with a total fee of $60, with the Office of the Secretary of State.\n(a) A merger becomes effective under sections 322C.1001 to 322C.1015:\n(1) if the surviving organization is a limited liability company, upon the later of:\n(i) compliance with subdivision 4; or\n(ii) subject to section 322C.0205, subdivision 3, such effective time as is specified in the articles of merger; or\n(2) if the surviving organization is not a limited liability company, as provided by the governing statute of the surviving organization.\n(b) An exchange becomes effective under sections 322C.1001 to 322C.1015 upon the later of:\n(1) compliance with subdivision 4; or\n(2) subject to section 322C.0205, subdivision 3, such effective time as is specified in the articles of exchange.",
	"repealed": false
}