{
	"id": "333.285",
	"url": "https://www.revisor.mn.gov/statutes/cite/333.285",
	"title": "333.285 DILUTION OF DISTINCTIVE FAMOUS MARK MAY BE ENJOINED.",
	"text": "(a) The owner of a mark that is famous in this state may, subject to the principles of equity and upon terms the court considers reasonable: seek an injunction against another person's commercial use of a mark or trade name, if the use begins after the mark has become famous and causes dilution of the distinctive quality of the mark; and obtain other relief as provided in this section.\nIn determining whether a mark is distinctive and famous, a court may consider factors such as, but not limited to:\n(1) the degree of inherent or acquired distinctiveness of the mark in this state;\n(2) the duration and extent of use of the mark in connection with the goods and services with which the mark is used;\n(3) the duration and extent of advertising and publicity of the mark in this state;\n(4) the geographical extent of the trading area in which the mark is used;\n(5) the channels of trade for the goods or services with which the mark is used;\n(6) the degree of recognition of the mark in the trading areas and channels of trade in this state used by the mark's owner and the person against whom the injunction is sought;\n(7) the nature and extent of use of the same or similar mark by third parties; and\n(8) whether the mark is the subject of a state registration in this state, or a federal registration under the Act of March 3, 1881, or under the Act of February 20, 1905, or on the principal register.\n(b) In an action brought under this section, the owner of a famous mark is entitled only to injunctive relief in this state, unless the person against whom the injunctive relief is sought willfully intended to trade on the owner's reputation or to cause dilution of the famous mark. If willful intent is proven, the owner is entitled to the remedies in this chapter, subject to the discretion of the court and the principles of equity.\n(c) The following are not actionable under this section:\n(1) fair use of a famous mark by another person in comparative commercial advertising or promotion to identify the competing goods or services of the owner of the famous mark;\n(2) noncommercial use of the mark; and\n(3) all forms of news reporting and news commentary.",
	"repealed": false
}