{
	"id": "168A.125",
	"url": "https://www.revisor.mn.gov/statutes/cite/168A.125",
	"title": "168A.125 TRANSFER-ON-DEATH TITLE TO MOTOR VEHICLE.",
	"text": "A natural person who is the owner of a motor vehicle may have the motor vehicle titled in transfer-on-death or TOD form by including in the application for the certificate of title a designation of a beneficiary or beneficiaries to whom the motor vehicle must be transferred on death of the owner or the last survivor of joint owners with rights of survivorship, subject to the rights of secured parties.\nA motor vehicle is registered in transfer-on-death form by designating on the certificate of title the name of the owner and the names of joint owners with identification of rights of survivorship, followed by the words \"transfer-on-death to (name of beneficiary or beneficiaries).\" The designation \"TOD\" may be used instead of \"transfer-on-death.\" A title in transfer-on-death form is not required to be supported by consideration, and the certificate of title in which the designation is made is not required to be delivered to the beneficiary or beneficiaries in order for the designation to be effective. If the owner of the motor vehicle is married at the time of the designation, the designation of a beneficiary other than the owner's spouse requires the spouse's written consent.\nThe transfer-on-death beneficiary or beneficiaries have no interest in the motor vehicle until the death of the owner or the last survivor of joint owners with rights of survivorship. A beneficiary designation may be changed at any time by the owner or by all joint owners with rights of survivorship, without the consent of the beneficiary or beneficiaries, by filing an application for a new certificate of title.\nOwnership of a motor vehicle titled in transfer-on-death form vests in the designated beneficiary or beneficiaries on the death of the owner or the last of the joint owners with rights of survivorship, subject to the rights of secured parties. The transfer-on-death beneficiary or beneficiaries who survive the owner may apply for a new certificate of title to the motor vehicle upon submitting a certified death record of the owner of the motor vehicle. If no transfer-on-death beneficiary or beneficiaries survive the owner of a motor vehicle, the motor vehicle must be included in the probate estate of the deceased owner. A transfer of a motor vehicle to a transfer-on-death beneficiary or beneficiaries is not a testamentary transfer.\n(a) This section does not limit the rights of any secured party or creditor of the owner of a motor vehicle against a transfer-on-death beneficiary or beneficiaries.\n(b) The state or a county agency with a claim or lien authorized by section 246.53, 256B.15, 261.04, or 270C.63 is a creditor for purposes of this subdivision. A claim authorized by section 256B.15 against the estate of an owner of a motor vehicle titled in transfer-on-death form voids any transfer-on-death conveyance of a motor vehicle as described in this section. A claim or lien under section 246.53, 261.04, or 270C.63 continues to apply against the designated beneficiary or beneficiaries after the transfer under this section if other assets of the deceased owner's estate are insufficient to pay the amount of the claim. The claim or lien continues to apply to the motor vehicle until the designated beneficiary sells or transfers it to a person against whom the claim or lien does not apply and who did not have actual notice or knowledge of the claim or lien.",
	"repealed": false
}