{
	"id": "462.36",
	"url": "https://www.revisor.mn.gov/statutes/cite/462.36",
	"title": "462.36 CERTIFIED COPIES FILED WITH COUNTY RECORDER.",
	"text": "A certified copy of every ordinance, resolution, map, or regulation adopted under the provisions of sections 462.358, 462.359, and 462.3595 shall be filed with the county recorder of the county or counties in which the municipality adopting it is located. A certified copy of every variance to abstract or registered property granted under section 462.358 shall be recorded with the county recorder or the registrar of titles of the county or counties in which the municipality granting it is located; except that the requirement to record a variance is satisfied if a certified copy of the resolution citing the existence of the variance is recorded identifying the location where the variance documents are available for inspection. Ordinances, resolutions, maps, regulations or variances recorded pursuant to this subdivision do not constitute encumbrances on real property. The order issued by the governing body or board of appeals and adjustments as the case may be, shall include the legal description of the property involved. Failure to record an ordinance, resolution, map, regulation, variance, or order shall not affect its validity or enforceability.\nA copy of a comprehensive plan adopted by a planning agency under the provisions of sections 462.351 to 462.364 shall be filed with the governing body of each contiguous municipality and with the regional planning agency, if any, established to serve the area in which the municipality is located.\nCopies of resolutions approving subdivision plats of land within a municipality, but contiguous to another municipality shall be filed with the governing body of the contiguous municipality. Copies of resolutions approving subdivision plats of land outside a municipality but subject to its subdivision regulations shall be filed with the clerk of the town in which the land is situated.",
	"repealed": false
}