{
	"id": "151.19",
	"url": "https://www.revisor.mn.gov/statutes/cite/151.19",
	"title": "151.19 REGISTRATION; FEES.",
	"text": "(a) No person shall operate a pharmacy without first obtaining a license from the board and paying any applicable fee specified in section 151.065. The license shall be displayed in a conspicuous place in the pharmacy for which it is issued and expires on June 30 following the date of issue. It is unlawful for any person to operate a pharmacy unless the license has been issued to the person by the board.\n(b) Application for a pharmacy license under this section shall be made in a manner specified by the board.\n(c) No license shall be issued or renewed for a pharmacy located within the state unless the applicant agrees to operate the pharmacy in a manner prescribed by federal and state law and according to rules adopted by the board. No license shall be issued for a pharmacy located outside of the state unless the applicant agrees to operate the pharmacy in a manner prescribed by federal law and, when dispensing medications for residents of this state, the laws of this state, and Minnesota Rules.\n(d) No license shall be issued or renewed for a pharmacy that is required to be licensed or registered by the state in which it is physically located unless the applicant supplies the board with proof of such licensure or registration.\n(e) The board shall require a separate license for each pharmacy located within the state and for each pharmacy located outside of the state at which any portion of the dispensing process occurs for drugs dispensed to residents of this state.\n(f) Prior to the issuance of an initial or renewed license for a pharmacy, the board may require the pharmacy to pass an inspection conducted by an authorized representative of the board. In the case of a pharmacy located outside of the state, the board may require the applicant to pay the cost of the inspection, in addition to the license fee in section 151.065, unless the applicant furnishes the board with a report, issued by the appropriate regulatory agency of the state in which the facility is located, of an inspection that has occurred within the 24 months immediately preceding receipt of the license application by the board. The board may deny licensure unless the applicant submits documentation satisfactory to the board that any deficiencies noted in an inspection report have been corrected.\n(g) The board shall not issue an initial or renewed license for a pharmacy located outside of the state unless the applicant discloses and certifies:\n(1) the location, names, and titles of all principal corporate officers and all pharmacists who are involved in dispensing drugs to residents of this state;\n(2) that it maintains its records of drugs dispensed to residents of this state so that the records are readily retrievable from the records of other drugs dispensed;\n(3) that it agrees to cooperate with, and provide information to, the board concerning matters related to dispensing drugs to residents of this state;\n(4) that, during its regular hours of operation, but no less than six days per week, for a minimum of 40 hours per week, a toll-free telephone service is provided to facilitate communication between patients in this state and a pharmacist at the pharmacy who has access to the patients' records; the toll-free number must be disclosed on the label affixed to each container of drugs dispensed to residents of this state; and\n(5) that, upon request of a resident of a long-term care facility located in this state, the resident's authorized representative, or a contract pharmacy or licensed health care facility acting on behalf of the resident, the pharmacy will dispense medications prescribed for the resident in unit-dose packaging or, alternatively, comply with section 151.415, subdivision 5.\n(h) This subdivision does not apply to a manufacturer licensed under section 151.252, subdivision 1, a wholesale drug distributor licensed under section 151.47, or a third-party logistics provider, to the extent the manufacturer, wholesale drug distributor, or third-party logistics provider is engaged in the distribution of dialysate or devices necessary to perform home peritoneal dialysis on patients with end-stage renal disease, if:\n(1) the manufacturer or its agent leases or owns the licensed manufacturing or wholesaling facility from which the dialysate or devices will be delivered;\n(2) the dialysate is comprised of dextrose or icodextrin and has been approved by the United States Food and Drug Administration;\n(3) the dialysate is stored and delivered in its original, sealed, and unopened manufacturer's packaging;\n(4) the dialysate or devices are delivered only upon:\n(i) receipt of a physician's order by a Minnesota licensed pharmacy; and\n(ii) the review and processing of the prescription by a pharmacist licensed by the state in which the pharmacy is located, who is employed by or under contract to the pharmacy;\n(5) prescriptions, policies, procedures, and records of delivery are maintained by the manufacturer for a minimum of three years and are made available to the board upon request; and\n(6) the manufacturer or the manufacturer's agent delivers the dialysate or devices directly to:\n(i) a patient with end-stage renal disease for whom the prescription was written or the patient's designee, for the patient's self-administration of the dialysis therapy; or\n(ii) a health care provider or institution, for administration or delivery of the dialysis therapy to a patient with end-stage renal disease for whom the prescription was written.\n[Repealed, 2013 c 108 art 10 s 13]\nMS 2020 [Repealed, 2021 c 30 art 4 s 6]\n(a) The board may grant a license to any physician licensed under chapter 147, advanced practice registered nurse licensed under chapter 148, or physician assistant licensed under chapter 147A who provides services in a health care facility located in a designated health professional shortage area authorizing the physician, advanced practice registered nurse, or physician assistant to dispense drugs to individuals for whom pharmaceutical care is not reasonably available. The license may be renewed annually. Any physician, advanced practice registered nurse, or physician assistant licensed under this subdivision shall be limited to dispensing drugs in a limited service pharmacy and shall be governed by the rules adopted by the board when dispensing drugs.\n(b) For the purposes of this subdivision, pharmaceutical care is not reasonably available if the limited service pharmacy in which the physician, advanced practice registered nurse, or physician assistant is dispensing drugs is located in a health professional shortage area, and no other licensed pharmacy is located within 15 miles of the limited service pharmacy.\n(c) For the purposes of this subdivision, section 151.15, subdivision 2, shall not apply, and section 151.215 shall not apply provided that a physician, advanced practice registered nurse, or physician assistant granted a license under this subdivision certifies each filled prescription in accordance with Minnesota Rules, part 6800.3100, subpart 3.\n(d) Notwithstanding section 151.102, a physician, advanced practice registered nurse, or physician assistant granted a license under this subdivision may be assisted by a pharmacy technician if the technician holds a valid certification from the Pharmacy Technician Certification Board or from another national certification body for pharmacy technicians that requires passage of a nationally recognized psychometrically valid certification examination for certification as determined by the board. The physician, advanced practice registered nurse, or physician assistant may supervise the pharmacy technician as long as the physician, advanced practice registered nurse, or physician assistant assumes responsibility for all functions performed by the technician. For purposes of this subdivision, supervision does not require the physician, advanced practice registered nurse, or physician assistant to be physically present if the physician, advanced practice registered nurse, physician assistant, or a licensed pharmacist is available, either electronically or by telephone.\n(e) Nothing in this subdivision shall be construed to prohibit a physician, advanced practice registered nurse, or physician assistant from dispensing drugs pursuant to section 151.37 and Minnesota Rules, parts 6800.9950 to 6800.9954.",
	"repealed": false
}