{
	"id": "62Q.556",
	"url": "https://www.revisor.mn.gov/statutes/cite/62Q.556",
	"title": "62Q.556 CONSUMER PROTECTIONS AGAINST BALANCE BILLING.",
	"text": "(a) Except as provided in paragraph (b), balance billing is prohibited when an enrollee receives services from:\n(1) a nonparticipating provider at a participating hospital or ambulatory surgical center, as described by the No Surprises Act, including any federal regulations adopted under that act;\n(2) a participating provider that sends a specimen taken from the enrollee in the participating provider's practice setting to a nonparticipating laboratory, pathologist, or other medical testing facility; or\n(3) a nonparticipating provider or facility providing emergency services as defined in section 62Q.55, subdivision 3, and other services as described in the requirements of the No Surprises Act.\n(b) The services described in paragraph (a), clauses (1), (2), and (3), as defined in the No Surprises Act, and any federal regulations adopted under that act, are subject to balance billing if the enrollee provides informed consent prior to receiving services from the nonparticipating provider acknowledging that the use of a provider, or the services to be rendered, may result in costs not covered by the health plan. The informed consent must comply with all requirements of the No Surprises Act, including any federal regulations adopted under that act.\n(a) An enrollee's financial responsibility for the nonparticipating provider services described in subdivision 1, paragraph (a), shall be the same cost-sharing requirements, including co-payments, deductibles, coinsurance, coverage restrictions, and coverage limitations, as those applicable to services received by the enrollee from a participating provider. A health plan company must apply any enrollee cost sharing requirements, including co-payments, deductibles, and coinsurance, for nonparticipating provider services to the enrollee's annual out-of-pocket limit to the same extent payments to a participating provider would be applied.\n(b) A health plan company must attempt to negotiate the reimbursement, less any applicable enrollee cost sharing under paragraph (a), for the nonparticipating provider services with the nonparticipating provider. If the attempt to negotiate reimbursement for the nonparticipating provider services does not result in a resolution, either party may initiate the federal independent dispute resolution process pursuant to the No Surprises Act, including any federal regulations adopted under that act.\n(a) Beginning April 1, 2024, a health plan company must report annually to the commissioner of health:\n(1) the total number of claims and total billed and paid amounts for nonparticipating provider services, by service and provider type, submitted to the health plan in the prior calendar year; and\n(2) the total number of enrollee complaints received regarding the rights and protections established by the No Surprises Act in the prior calendar year.\n(b) The commissioners of commerce and health shall develop the form and manner for health plan companies to comply with paragraph (a).\n(a) Any provider or facility, including a health care provider or facility pursuant to section 62A.63, subdivision 2, or 62J.03, subdivision 8, that is subject to the relevant provisions of the No Surprises Act is subject to the requirements of this section and section 62J.811.\n(b) The commissioner of commerce or health shall enforce this section.\n(c) If a health-related licensing board has cause to believe that a provider has violated this section, it may further investigate and enforce the provisions of this section pursuant to chapter 214.",
	"repealed": false
}