{
	"id": "28A.075",
	"url": "https://www.revisor.mn.gov/statutes/cite/28A.075",
	"title": "28A.075 DELEGATION TO LOCAL COMMUNITY HEALTH BOARD.",
	"text": "(a) At the request of a local community health board that licensed and inspected grocery and convenience stores on January 1, 1999, the commissioner must enter into agreements before January 1, 2001, with local community health boards to delegate to the appropriate local community health board the licensing and inspection duties of the commissioner pertaining to retail food handlers that are grocery or convenience stores. At the request of a local community health board that licensed and inspected part of any grocery or convenience store on January 1, 1999, the commissioner must enter into agreements before July 1, 2001, with local community health boards to delegate to the appropriate local community health board the licensing and inspection duties of the commissioner pertaining to retail food handlers that are grocery or convenience stores. At any time thereafter, the commissioner may enter into an agreement with a local community health board that licensed and inspected all or part of any grocery or convenience store on January 1, 1999, to delegate to the appropriate local community health board the licensing and inspection duties of the commissioner pertaining to retail food handlers such as grocery or convenience stores. Retail food handlers inspected under the state meat inspection program of chapter 31A are exempt from delegation.\n(b) A local community health board must adopt an ordinance consistent with the Minnesota Food Code, Minnesota Rules, chapter 4626, for all of its jurisdiction to regulate retail food handlers and the ordinance (Food Code) must not be in conflict with standards set in law or rule.\n(c) A fee to recover the estimated costs of enforcement of this chapter must be established by ordinance and must be fair, reasonable, and proportionate to the actual cost of the licensing and inspection services. The fee must only be maintained and used for the estimated costs of enforcing this chapter.",
	"repealed": false
}