{
	"id": "17.56",
	"url": "https://www.revisor.mn.gov/statutes/cite/17.56",
	"title": "17.56 COUNCIL TO FORMULATE AND SUBMIT PROMOTIONAL ORDER.",
	"text": "Within 15 days after certification by the commissioner of its election the first council for producers of a particular commodity shall meet and formulate a promotional order establishing a program for development, promotion, advertising, research, distribution and the expansion of the sale, use and consumption of the commodity it represents and establishing a checkoff fee to be paid by producers to finance the proposed activities.\nThe commissioner, after consultation with the council, shall hold public hearings on the proposed promotional order in areas and at times affording reasonable opportunities for producers to attend. After such hearings and after consultation with the council, the commissioner shall determine whether or not the promotional order shall be amended, modified or supplemented. If changes or additions of substance are made, commissioner shall hold public hearings on the amended or supplemented promotional order.\nFollowing the hearings, the commissioner shall conduct a referendum on the proposed final promotional order. At least ten days' notice of the time and places of such referendum shall be published in a legal newspaper of general circulation in each county affected. Notice shall also be given to other media in each county affected. A complete copy of the promotional order shall be given to each county extension office in any county involved in the referendum to afford all producers of the commodity access to complete information about the promotional order and the referendum.\nThe promotional order shall become effective if approved by a majority of those voting.\nIf a referendum is conducted and a proposed promotional order is not approved, the commissioner shall not conduct another referendum on any promotional order for the same commodity until one year has elapsed, except for the Minnesota Canola Council, for which six months must have elapsed.",
	"repealed": false
}