{
	"id": "174.38",
	"url": "https://www.revisor.mn.gov/statutes/cite/174.38",
	"title": "174.38 ACTIVE TRANSPORTATION PROGRAM.",
	"text": "(a) For purposes of this section, the following terms have the meanings given them.\n(b) \"Active transportation\" means bicycling, pedestrian activities, and other forms of nonmotorized transportation.\n(c) \"Bond-eligible costs\" means expenditures under subdivision 6, paragraph (a), clause (1), for publicly owned infrastructure in this state with a useful life of at least ten years.\n(d) \"Commissioner\" means the commissioner of transportation.\nSubject to available funds, the commissioner must establish a program to support active transportation.\n(a) An active transportation account is established in the special revenue fund. The account consists of funds provided by law and any other money donated, allotted, transferred, or otherwise provided to the account. Money in the account is annually appropriated to the commissioner and must be expended only on projects that receive financial assistance under this section.\n(b) An active transportation account is established in the bond proceeds fund. The account consists of state bond proceeds appropriated to the commissioner. Money in the account may only be expended on bond-eligible costs of a project receiving financial assistance as provided under this section. Money in the account may only be expended on a project that is publicly owned.\n(a) The commissioner must establish active transportation program requirements, including:\n(1) assistance eligibility, subject to the requirements under subdivision 5;\n(2) a solicitation and application process that minimizes the burden on applicants; and\n(3) procedures to award and pay financial assistance.\n(b) The commissioner must annually conduct a solicitation for active transportation projects under the program.\n(c) The commissioner must make reasonable efforts to publicize each application solicitation among all eligible recipients. The commissioner must assist applicants to create and submit applications, with an emphasis on providing assistance in communities that are historically and currently underrepresented in local or regional planning, including communities of color, low-income households, people with disabilities, and people with limited English proficiency.\n(d) The commissioner may provide grants or other financial assistance for a project.\n(e) The commissioner is prohibited from expending more than one percent of available funds in a fiscal year under this section on program administration.\nEligible recipients of financial assistance under this section are:\n(1) a political subdivision;\n(2) a tax-exempt organization under section 501(c)(3) of the Internal Revenue Code, as amended; and\n(3) a federally recognized Indian Tribe.\n(a) The commissioner must determine permissible uses of financial assistance under this section, which are limited to:\n(1) construction and maintenance of bicycle, trail, and pedestrian infrastructure, including but not limited to safe routes to school infrastructure and bicycle facilities and centers; and\n(2) noninfrastructure programming, including activities as specified in section 174.40, subdivision 7a, paragraph (b).\n(b) Of the amount made available in each fiscal year, the first $500,000 is for grants to develop, maintain, and implement active transportation safety curriculum for youth ages five to 14 years old, and if remaining funds are available, for (1) youth ages 15 to 17 years old, (2) adult active transportation safety programs, and (3) adult learn-to-ride programs. The curriculum must include resources for teachers and must meet the model training materials requirements under section 123B.935, subdivision 4.\n(a) The commissioner must establish a project evaluation and selection process that is competitive, criteria-based, and objective.\n(b) The process must include criteria and prioritization of projects based on:\n(1) the project's inclusion in a municipal or regional nonmotorized transportation system plan;\n(2) the extent to which policies or practices of the political subdivision encourage and promote complete streets planning, design, and construction;\n(3) the extent to which the project supports connections between communities and to key destinations within a community;\n(4) identified barriers or deficiencies in the nonmotorized transportation system;\n(5) identified safety or health benefits;\n(6) geographic equity in project benefits, with an emphasis on communities that are historically and currently underrepresented in local or regional planning; and\n(7) ability of a grantee to maintain the active transportation infrastructure following project completion.",
	"repealed": false
}