{
	"id": "12A.16",
	"url": "https://www.revisor.mn.gov/statutes/cite/12A.16",
	"title": "12A.16 TRANSPORTATION.",
	"text": "The commissioner may use appropriations from the trunk highway fund for transportation infrastructure operation and maintenance related to a disaster.\nThe commissioner may use appropriations from the emergency relief account in the trunk highway fund for infrastructure repair, maintenance, and operation related to a disaster.\nThe commissioner is responsible to reconstruct and repair trunk highways and trunk highway bridges located in the disaster area and damaged by the disaster.\nThe commissioner may make grants to local governments for the capital costs of repairing, reconstructing, or replacing local roads and bridges, including necessary demolition and design costs, damaged or destroyed by the disaster. Grants may also be used for reasonable costs to mitigate damage from future disasters when to do so is part of a project to repair, reconstruct, or replace infrastructure damaged in the disaster. Before the commissioner releases grant money, a grantee must submit final plans to the commissioner for each project under this subdivision. The commissioner must determine project priorities, review project plans in light of those priorities, and, if necessary, require changes to the project plans to ensure the most prudent use of limited state resources.\nThe commissioner, in consultation with the commissioner of public safety, must develop guidelines for local governments to use to respond to natural disasters in order to maximize the use of federal disaster assistance. The guidelines must address the use of local employees and equipment and contracted employees and equipment in the disaster response and the relative eligibility for federal reimbursement and clarify agency roles and responsibilities for damage estimates used for developing emergency state appropriations.\nThe requirements of section 174.50, subdivisions 5 to 7, are waived for grants under subdivision 3.",
	"repealed": false
}