{
	"id": "176.305",
	"url": "https://www.revisor.mn.gov/statutes/cite/176.305",
	"title": "176.305 PETITIONS FILED WITH WORKERS' COMPENSATION DIVISION.",
	"text": "The petitioner shall serve a copy of the petition on each adverse party and file a copy with the office, together with an appropriate affidavit of service. Service and filing must be made as provided under section 176.285, subdivisions 1 and 2.\nThe chief administrative law judge shall promptly assign the petition to a compensation judge under section 176.307, and shall schedule a settlement conference before a compensation judge, to be held no later than 180 days after a claim petition was filed, or 45 days after a petition to discontinue, objection to discontinuance, or request for formal hearing was filed.\nAll parties must appear at the settlement conference, either personally or by representative, must be prepared to discuss settlement of all issues, and must be prepared to discuss or present the information required by the joint rules of the division and the office. If a representative appears on behalf of a party, the representative must have authority to fully settle the matter. The parties shall serve and file a pretrial statement no fewer than five days before the settlement conference.\nIf settlement is not reached, the chief administrative law judge shall schedule a hearing to be held within 90 days from the scheduled settlement conference. However, the hearing must be held earlier than 90 days from the scheduled settlement conference if this chapter requires an expedited hearing to be held at an earlier date. The hearing must be held before a compensation judge other than the compensation judge who conducted the settlement conference. The compensation judge assigned to hold the hearing may choose to conduct a pretrial conference to clarify the issues and evidence that will be presented at the hearing.\nCancellations and continuations of proceedings are disfavored but may be granted upon the showing of good cause under section 176.341, subdivision 4.\nThe compensation judge conducting the settlement conference may require the parties to present copies of all documentary evidence not previously filed and a summary of the evidence they will present at a formal hearing. If appropriate, a written summary decision shall be issued within ten days after the conference stating the issues and a determination of each issue. If a party fails to appear at the conference, all issues may be determined contrary to the absent party's interest, provided the party in attendance presents a prima facie case.\nThe summary decision is final unless a written request for a formal hearing is served on all parties and filed with the commissioner within 30 days after the date of service and filing of the summary decision. Within ten days after receipt of the request, the commissioner shall certify the matter to the office for a de novo hearing.\nMS 2020 [Repealed, 2022 c 32 art 2 s 13]\nWhere the chief administrative law judge has substituted a compensation judge originally assigned to hear a matter, the testimony taken before the substitute compensation judge shall be considered as though taken before the judge before whom it was originally assigned.\nA compensation judge, after receiving a properly served motion, may strike a case from the active trial calendar after the employee has been given 30 days to correct a deficient petition if it is shown that the information on the petition or included with the petition is incomplete. Once a case is stricken, it may not be reinstated until the missing information is provided to the adverse parties and filed with the compensation judge. If a case has been stricken from the calendar for 180 days or more and no corrective action has been taken, the compensation judge may, upon the judge's own motion or a motion of a party which is properly served on all parties, dismiss the case. The petitioner must be given at least 30 days' advance notice of the proposed dismissal before the dismissal is effective.",
	"repealed": false
}