{
	"id": "375A.13",
	"url": "https://www.revisor.mn.gov/statutes/cite/375A.13",
	"title": "375A.13 COUNTY GOVERNMENT STUDY COMMISSION.",
	"text": "A county government study commission hereinafter called \"the commission\" may be established in any county as provided in this section to study the form and structure of county government in the county and other counties both within and outside this state and, if deemed advisable by the commission, recommend to the voters of the county the adoption of any of the optional forms of county government contained in sections 375A.01 to 375A.13. The commission shall be established upon presentation of a petition requesting such action signed by voters equal in number to five percent of the electors voting at the last previous election for the office of governor or a resolution of the board of county commissioners of the county requesting such action. Appointments to the commission shall be made by order filed with the court administrator of the district court of the county and shall be made by the senior judge having chambers in the county. If there be no judge having chambers in the county, appointments shall be made by the chief judge of the judicial district. The number on the study commission shall be set by the appointing judge but not to exceed 15. A noncommissioner from each commissioner district shall be appointed to a study commission. In addition three members shall be county commissioners and two shall be elected county officials. An appointee who neglects to file with the court administrator within 15 days a written acceptance shall be deemed to have declined the appointment and the place shall be filled as though the appointee had resigned. Vacancies in the commission shall be filled as in the case of original appointments. The county board, the commission, or the petitioners requesting the appointment of the commission may submit to the appointing judge the names of eligible nominees which the appointing judge may consider in making appointments to the commission.\nThe members of the commission shall serve without compensation but may be reimbursed their necessary expenses in carrying out the business of the commission. The commission may employ and determine the compensation of such staff as it deems necessary. The necessary expenses of the commission and the cost of printing the commission's report and recommendations shall be paid by the county if so ordered by the commission. The amount of reasonable and necessary commission expenses that shall be so paid by the county shall not exceed in any one year the sum of $5,000 but the county board may authorize additional commission expenses as it deems necessary. The county board may levy a tax annually on the taxable property in the county to pay such expenses.\nThe commission's activity shall be limited to one year from the date of the order of the appointing judge but the appointing judge may extend the duration of the committee's activities for such period as the judge shall determine but not to exceed one year.\nThe commission shall file its final report not later than one year after the commission is established unless its activity is extended by the appointing judge, in which case the final report shall be filed on or before the last day of the extension. The commission may file a partial report at any time. Commission reports shall be signed by not less than a majority of the members of the commission and shall state the scope of its study and its recommendations that a change is not necessary or desirable or that one or more of the options provided in sections 375A.01 to 375A.13 be implemented but may include such other conclusions or recommendations as the commission determines. If the report contains a recommendation that a referendum be held on an option, the referendum shall be held as provided in section 375A.12.\nAfter a study commission has filed its final report a new study commission may be established but not before three years shall have expired after the filing of the commission report unless the appointing judge concurs in the request for the appointment of a new study commission.",
	"repealed": false
}