{
	"id": "469.316",
	"url": "https://www.revisor.mn.gov/statutes/cite/469.316",
	"title": "469.316 INDIVIDUAL INCOME TAX EXEMPTION.",
	"text": "An individual, estate, or trust operating a trade or business in a job opportunity building zone, and an individual, estate, or trust making a qualifying investment in a qualified business operating in a job opportunity building zone qualifies for the exemptions from taxes imposed under chapter 290, as provided in this section. The exemptions provided under this section apply only to the extent that the income otherwise would be taxable under chapter 290. Subtractions under this section from federal adjusted gross income, federal taxable income, alternative minimum taxable income, or any other base subject to tax are limited to the amount that otherwise would be included in the tax base absent the exemption under this section. This section applies only to taxable years beginning during the duration of the job opportunity building zone.\nAn individual, estate, or trust is exempt from the taxes imposed under chapter 290 on net rents derived from real or tangible personal property used by a qualified business and located in a zone for a taxable year in which the zone was designated a job opportunity building zone. If tangible personal property was used both within and outside of the zone by the qualified business, the exemption amount for the net rental income must be multiplied by a fraction, the numerator of which is the number of days the property was used in the zone and the denominator of which is the total days the property is rented by the qualified business.\nAn individual, estate, or trust is exempt from the taxes imposed under chapter 290 on net income from the operation of a qualified business in a job opportunity building zone. If the trade or business is carried on within and without the zone and the individual is not a resident of Minnesota, or the taxpayer is an estate or trust, the exemption must be apportioned based on the zone percentage and the relocation payroll percentage for the taxable year. If the trade or business is carried on within and without the zone and the individual is a resident of Minnesota, the exemption must be apportioned based on the zone percentage and the relocation payroll percentage for the taxable year, except the ratios under section 469.310, subdivision 7, clause (1), items (i) and (ii), must use the denominators of the property and payroll factors determined under section 290.191. No subtraction is allowed under this section in excess of 20 percent of the sum of the job opportunity building zone payroll and the adjusted basis of the property at the time that the property is first used in the job opportunity building zone by the business.\n(a) An individual, estate, or trust is exempt from the taxes imposed under chapter 290 on:\n(1) net gain derived on a sale or exchange of real property located in the zone and used by a qualified business. If the property was held by the individual, estate, or trust during a period when the zone was not designated, the gain must be prorated based on the percentage of time, measured in calendar days, that the real property was held by the individual, estate, or trust during the period the zone designation was in effect to the total period of time the real property was held by the individual;\n(2) net gain derived on a sale or exchange of tangible personal property used by a qualified business in the zone. If the property was held by the individual, estate, or trust during a period when the zone was not designated, the gain must be prorated based on the percentage of time, measured in calendar days, that the property was held by the individual, estate, or trust during the period the zone designation was in effect to the total period of time the property was held by the individual. If the tangible personal property was used outside of the zone during the period of the zone's designation, the exemption must be multiplied by a fraction, the numerator of which is the number of days the property was used in the zone during the time of the designation and the denominator of which is the total days the property was held during the time of the designation; and\n(3) net gain derived on a sale of an ownership interest in a qualified business operating in the job opportunity building zone, meeting the requirements of paragraph (b). The exemption on the gain must be multiplied by the zone percentage of the business for the taxable year prior to the sale.\n(b) A qualified business meets the requirements of paragraph (a), clause (3), if it is a corporation, an S corporation, or a partnership, and for the taxable year its job opportunity building zone percentage exceeds 25 percent. For purposes of paragraph (a), clause (3), the zone percentage must be calculated by modifying the ratios under section 469.310, subdivision 7, clause (1), items (i) and (ii), to use the denominators of the property and payroll factors determined under section 290.191. Upon the request of an individual, estate, or trust holding an ownership interest in the entity, the entity must certify to the owner, in writing, the job opportunity building zone percentage needed to determine the exemption.",
	"repealed": false
}