{
	"id": "62S.021",
	"url": "https://www.revisor.mn.gov/statutes/cite/62S.021",
	"title": "62S.021 LONG-TERM CARE INSURANCE; INITIAL FILING.",
	"text": "This section applies to any long-term care policy issued in this state on or after January 1, 2002, under this chapter or sections 62A.46 to 62A.56.\nAn insurer shall provide the following information to the commissioner 30 days prior to making a long-term care insurance form available for sale:\n(1) a copy of the disclosure documents required in section 62S.081; and\n(2) an actuarial certification consisting of at least the following:\n(i) a statement that the initial premium rate schedule is sufficient to cover anticipated costs under moderately adverse experience and that the premium rate schedule is reasonably expected to be sustainable over the life of the form with no future premium increases anticipated;\n(ii) a statement that the policy design and coverage provided have been reviewed and taken into consideration;\n(iii) a statement that the underwriting and claims adjudication processes have been reviewed and taken into consideration; and\n(iv) a complete description of the basis for contract reserves that are anticipated to be held under the form, to include:\n(A) sufficient detail or sample calculations provided so as to have a complete depiction of the reserve amounts to be held;\n(B) a statement that the assumptions used for reserves contain reasonable margins for adverse experience;\n(C) a statement that the net valuation premium for renewal years does not increase, except for attained age rating where permitted;\n(D) a statement that the difference between the gross premium and the net valuation premium for renewal years is sufficient to cover expected renewal expenses, or if such a statement cannot be made, a complete description of the situations in which this does not occur. An aggregate distribution of anticipated issues may be used as long as the underlying gross premiums maintain a reasonably consistent relationship. If the gross premiums for certain age groups appear to be inconsistent with this requirement, the commissioner may request a demonstration under item (i) based on a standard age distribution; and\n(E) either a statement that the premium rate schedule is not less than the premium rate schedule for existing similar policy forms also available from the insurer except for reasonable differences attributable to benefits, or a comparison of the premium schedules for similar policy forms that are currently available from the insurer with an explanation of the differences.\nThe commissioner may request an actuarial demonstration that benefits are reasonable in relation to premiums. The actuarial demonstration must include either premium and claim experience on similar policy forms, adjusted for any premium or benefit differences, relevant and credible data from other studies, or both. If the commissioner asks for additional information under this subdivision, the 30-day time limit in subdivision 2 does not include the time during which the insurer is preparing the requested information.",
	"repealed": false
}