{
	"id": "469.146",
	"url": "https://www.revisor.mn.gov/statutes/cite/469.146",
	"title": "469.146 ISSUANCE OF BONDS AND NOTES.",
	"text": "For the purposes authorized in section 469.142, the authority may issue bonds and execute mortgages and contracts, pledge revenues, and enter into covenants and agreements for the security thereof in the same manner and subject to the same conditions as a municipality under the provisions of sections 469.152 to 469.165 except as otherwise and additionally provided in sections 469.142 to 469.151. Net rentals and other charges payable to the authority by the operator or lessee of any project and pledged by the authority for payment of its bonds and interest thereon, and for the creation and maintenance of reserves therefor, may be reduced by amounts not exceeding the payments actually received by the authority from the other sources described in sections 469.142 to 469.151.\nThe authority may issue notes, including renewal notes, for any purpose for which bonds may be issued, whenever the authority determines that payment thereof can be made in full from any revenues the authority expects to receive from any source. The notes may be issued to provide funds to pay preliminary costs of surveys, plans, development, or other matters relating to any proposed or existing project. The authority may pledge the revenues, subject to any other pledge thereof, for the payment of the notes, and may secure the notes in the same manner and with the same effect as herein provided for bonds and may also secure the notes by the personal guarantee of property owners within a benefited area. The authority may make contracts for the future sale of the notes, by which the purchaser shall be committed to purchase the notes on terms and conditions stated in such contracts. The authority may pay the consideration it deems proper for the commitments.\nAn authority may sell, at private or public sale, at the price or prices determined by the authority, any note, mortgage, lease, sublease, lease purchase, or other instrument or obligation evidencing or securing a loan made for the purpose of economic development, job creation, redevelopment, or community revitalization by a public agency to a business, for-profit or nonprofit organization, or an individual.",
	"repealed": false
}