{
	"id": "260C.605",
	"url": "https://www.revisor.mn.gov/statutes/cite/260C.605",
	"title": "260C.605 REASONABLE EFFORTS TO FINALIZE AN ADOPTION.",
	"text": "(a) Reasonable efforts to finalize the adoption of a child under the guardianship of the commissioner shall be made by the responsible social services agency responsible for permanency planning for the child.\n(b) Reasonable efforts to make a placement in a home according to the placement considerations under section 260C.212, subdivision 2, with a relative or foster parent who will commit to being the permanent resource for the child in the event the child cannot be reunified with a parent are required under section 260.012 and may be made concurrently with reasonable, or if the child is an Indian child, active efforts to reunify the child with the parent.\n(c) Reasonable efforts under paragraph (b) must begin as soon as possible when the child is in foster care under this chapter, but not later than the hearing required under section 260C.204.\n(d) Reasonable efforts to finalize the adoption of the child include:\n(1) considering the child's preference for an adoptive family;\n(2) using age-appropriate engagement strategies to plan for adoption with the child;\n(3) identifying an appropriate prospective adoptive parent for the child by updating the child's identified needs using the factors in section 260C.212, subdivision 2;\n(4) making an adoptive placement that meets the child's needs by:\n(i) completing or updating the relative search required under section 260C.221 and giving notice of the need for an adoptive home for the child to:\n(A) relatives who have kept the agency or the court apprised of their whereabouts; or\n(B) relatives of the child who are located in an updated search;\n(ii) an updated search is required whenever:\n(A) there is no identified prospective adoptive placement for the child notwithstanding a finding by the court that the agency made diligent efforts under section 260C.221, in a hearing required under section 260C.202;\n(B) the child is removed from the home of an adopting parent; or\n(C) the court determines that a relative search by the agency is in the best interests of the child;\n(iii) engaging the child's relatives or current or former foster parents to commit to being the prospective adoptive parent of the child, and considering the child's relatives for adoptive placement of the child in the order specified under section 260C.212, subdivision 2, paragraph (a); or\n(iv) when there is no identified prospective adoptive parent:\n(A) registering the child on the state adoption exchange as required in section 259.75 unless the agency documents to the court an exception to placing the child on the state adoption exchange reported to the commissioner;\n(B) reviewing all families with approved adoption home studies associated with the responsible social services agency;\n(C) presenting the child to adoption agencies and adoption personnel who may assist with finding an adoptive home for the child;\n(D) using newspapers and other media to promote the particular child;\n(E) using a private agency under grant contract with the commissioner to provide adoption services for intensive child-specific recruitment efforts; and\n(F) making any other efforts or using any other resources reasonably calculated to identify a prospective adoption parent for the child;\n(5) updating and completing the social and medical history required under sections 260C.212, subdivision 15, and 260C.609;\n(6) making, and keeping updated, appropriate referrals required by section 260.851, the Interstate Compact on the Placement of Children;\n(7) giving notice regarding the responsibilities of an adoptive parent to any prospective adoptive parent as required under section 259.35;\n(8) offering the adopting parent the opportunity to apply for or decline adoption assistance under sections 142A.60 to 142A.612;\n(9) certifying the child for adoption assistance, assessing the amount of adoption assistance, and ascertaining the status of the commissioner's decision on the level of payment if the adopting parent has applied for adoption assistance;\n(10) placing the child with siblings. If the child is not placed with siblings, the agency must document reasonable efforts to place the siblings together, as well as the reason for separation. The agency may not cease reasonable efforts to place siblings together for final adoption until the court finds further reasonable efforts would be futile or that placement together for purposes of adoption is not in the best interests of one of the siblings; and\n(11) working with the adopting parent to file a petition to adopt the child and with the court administrator to obtain a timely hearing to finalize the adoption.\n(a) The responsible social services agency shall make reasonable efforts to recruit, assess, and match an adoptive home for any child under the guardianship of the commissioner and reasonable efforts shall continue until an adoptive placement is made and adoption finalized or until the child is no longer under the guardianship of the commissioner.\n(b) A child of any age who is under the guardianship of the commissioner and is legally available for adoption may not refuse or waive the responsible social services agency's reasonable efforts to recruit, identify, and place the child in an adoptive home required under this section. The agency has an ongoing responsibility to work with the child to explore the child's opportunities for adoption, and what adoption means for the child, and may not accept a child's refusal to consider adoption as an option.\n(c) The court may not relieve or otherwise order the responsible social services agency to cease fulfilling the responsible social services agency's duty regarding reasonable efforts to recruit, identify, and place the child in an adoptive home.",
	"repealed": false
}