{
	"id": "349.181",
	"url": "https://www.revisor.mn.gov/statutes/cite/349.181",
	"title": "349.181 RESTRICTIONS ON WHO MAY PARTICIPATE IN LAWFUL GAMBLING.",
	"text": "(a) A person under age 18 may not participate:\n(1) as a player in games of pull-tabs, tipboards, paddlewheel, or raffles;\n(2) as a player in a bingo game other than:\n(i) a bingo game exempt or excluded from licensing; or\n(ii) a bingo game conducted by an organization as part of an annual community event if the person under age 18 is accompanied by a parent or guardian; and\n(3) in the conduct of pull-tabs, tipboards, paddlewheels, bingo, or raffles, except that a person under age 18 may sell raffle tickets.\nViolation of this paragraph is a misdemeanor.\n(b) A licensed organization or employee may not allow a person under age 18 to participate in lawful gambling in violation of paragraph (a). Violation of this paragraph is a misdemeanor.\n(c) In a prosecution under paragraph (b), it is a defense for the defendant to prove by a preponderance of the evidence that the defendant reasonably and in good faith relied upon representations of proof of age authorized in section 340A.503, subdivision 6, paragraph (a).\nA gambling manager may not participate directly or indirectly as a player in any lawful gambling conducted by the organization for which the gambling manager is licensed.\n(a) For purposes of this section, \"volunteer\" means a person who is not compensated by an organization but who performs activities in the conduct of lawful gambling for that organization.\n(b) For purposes of this section, \"conduct of pull-tabs, tipboards, and paddlewheels\" includes selling tickets, redeeming tickets, auditing games, making deposits, spinning the paddlewheel, and conducting inventory.\n(c) For purposes of this section, \"conduct of bingo\" includes selling bingo hard cards, bingo paper sheets, or facsimiles of bingo paper sheets; completing bingo occasion records; selecting or announcing bingo numbers; making deposits; and conducting inventory.\n(d) A volunteer involved in the conduct of tipboards that have no more than 32 chances per game or paddlewheel games conducted without a paddlewheel table may not participate as a player in electronic linked bingo, pull-tab, tipboard, or paddlewheel games at the same premises on the same business day that the volunteer was involved in the conduct of the games.\n(e) An employee or a volunteer who is involved in the conduct of any lawful gambling during a bingo occasion may not participate directly or indirectly as a player in any lawful gambling during that bingo occasion.\n(f) An organization or a lessor employee or volunteer who is involved in the conduct of electronic linked bingo, pull-tab games, tipboard games with more than 32 chances per game, or paddlewheel games conducted with a paddlewheel table at a permitted premises may not participate directly or indirectly as a player in electronic linked bingo, pull-tab, tipboard, or paddlewheel games at that premises. This restriction is in effect until two weeks after the employee or volunteer is no longer involved in the conduct of electronic linked bingo, pull-tab games, tipboard games with more than 32 chances per game, or paddlewheel games conducted with a paddlewheel table at that premises.\nThe lessor of a permitted premises may not participate directly or indirectly as a player in any lawful gambling conducted at that premises.\nThe lessor's immediate family may not participate directly or indirectly as a player in a pull-tab, a tipboard, a paddlewheel, or an electronic linked bingo game conducted at that premises.",
	"repealed": false
}