{
	"id": "403.27",
	"url": "https://www.revisor.mn.gov/statutes/cite/403.27",
	"title": "403.27 REVENUE BONDS; OBLIGATIONS.",
	"text": "After consulting with the commissioner of management and budget, the council, if requested by a vote of at least two-thirds of all of the members of the Metropolitan Radio Board, may, by resolution, authorize the issuance of its revenue bonds for any of the following purposes to:\n(1) provide funds for regionwide mutual aid and emergency medical services communications;\n(2) provide funds for the elements of the first phase of the regionwide public safety radio communication system that the board determines are of regionwide benefit and support mutual aid and emergency medical services communication including, but not limited to, costs of master controllers of the backbone;\n(3) provide money for the second phase of the public safety radio communication system;\n(4) to the extent money is available after meeting the needs described in clauses (1) to (3), provide money to reimburse local units of government for amounts expended for capital improvements to the first phase system previously paid for by the local government units; or\n(5) refund bonds issued under this section.\nThe bonds shall be sold, issued, and secured in the manner provided in chapter 475 for bonds payable solely from revenues, except as otherwise provided in sections 403.21 to 403.34 and the council shall have the same powers and duties as a municipality and its governing body in issuing bonds under chapter 475. The bonds may be sold at any price and at public or private sale as determined by the council.\nThe bonds shall be payable from and secured by a pledge of the emergency telephone service fee provided in chapter 403 and shall not represent or constitute a general obligation or debt of the council and shall not be included in the net debt of any city, county, or other subdivision of the state for the purpose of any debt limitation.\n(a) The principal amount of the bonds issued pursuant to subdivision 1, exclusive of any original issue discount, shall not exceed the amount of $10,000,000 plus the amount the council determines necessary to pay the costs of issuance, fund reserves, debt service, and pay for any bond insurance or other credit enhancement.\n(b) In addition to the amount authorized under paragraph (a), the council may issue bonds under subdivision 1 in a principal amount of $3,306,300, plus the amount the council determines necessary to pay the cost of issuance, fund reserves, debt service, and any bond insurance or other credit enhancement. The proceeds of bonds issued under this paragraph may not be used to finance portable or subscriber radio sets.\nThe bonds may be secured by a bond resolution or a trust indenture entered into by the council with a corporate trustee within or outside the state which shall define the fee pledged for the payment and security of the bonds and for payment of all necessary and reasonable debt service expenses until all the bonds referred to in subdivision 1 are fully paid or discharged in accordance with law. The pledge shall be a valid charge on the emergency telephone service fee provided in chapter 403. No mortgage of or security interest in any tangible real or personal property shall be granted to the bondholders or the trustee, but they shall have a valid security interest in the revenues and bond proceeds received by the council and pledged to the payment of the bonds as against the claims of all persons in tort, contract, or otherwise, irrespective of whether the parties have notice and without possession or filing as provided in the Uniform Commercial Code, or any other law, subject however to the rights of the holders of any general obligation bonds issued under section 403.32. In the bond resolution or trust indenture, the council may make covenants as it determines to be reasonable for the protection of the bondholders.\nNeither the council, nor any council member, officer, employee, or agent of the council, nor any person executing the bonds shall be liable personally on the bonds by reason of their issuance. The bonds are not payable from, and are not a charge upon, any funds other than the revenues and bond proceeds pledged to their payment. The council is not subject to any liability on the bonds and has no power to obligate itself to pay or to pay the bonds from funds other than the revenues and bond proceeds pledged. No holder of bonds has the right to compel any exercise of the taxing power of the council, except any deficiency tax levy the council covenants to certify under section 403.31, or any other public body, to the payment of principal of or interest on the bonds. No holder of bonds has the right to enforce payment of principal or interest against any property of the council or other public body other than that expressly pledged for the payment of the bonds.",
	"repealed": false
}