{
	"id": "604.01",
	"url": "https://www.revisor.mn.gov/statutes/cite/604.01",
	"title": "604.01 COMPARATIVE FAULT; EFFECT.",
	"text": "Contributory fault does not bar recovery in an action by any person or the person's legal representative to recover damages for fault resulting in death, in injury to person or property, or in economic loss, if the contributory fault was not greater than the fault of the person against whom recovery is sought, but any damages allowed must be diminished in proportion to the amount of fault attributable to the person recovering. The court may, and when requested by any party shall, direct the jury to find separate special verdicts determining the amount of damages and the percentage of fault attributable to each party and the court shall then reduce the amount of damages in proportion to the amount of fault attributable to the person recovering.\n\"Fault\" includes acts or omissions that are in any measure negligent or reckless toward the person or property of the actor or others, or that subject a person to strict tort liability. The term also includes breach of warranty, unreasonable assumption of risk not constituting an express consent or primary assumption of risk, misuse of a product and unreasonable failure to avoid an injury or to mitigate damages, and the defense of complicity under section 340A.801. Legal requirements of causal relation apply both to fault as the basis for liability and to contributory fault. The doctrine of last clear chance is abolished.\nEvidence of unreasonable failure to avoid aggravating an injury or to mitigate damages may be considered only in determining the damages to which the claimant is entitled. It may not be considered in determining the cause of an accident.\nSettlement with or any payment made to an injured person or to others on behalf of such injured person with the permission of such injured person or to anyone entitled to recover damages on account of injury or death of such person shall not constitute an admission of liability by the person making the payment or on whose behalf payment was made.\nSettlement with or any payment made to a person or on the person's behalf to others for damage to or destruction of property or for economic loss does not constitute an admission of liability by the person making the payment or on whose behalf the payment was made.\nExcept in an action in which settlement and release has been pleaded as a defense, any settlement or payment referred to in subdivisions 2 and 3 shall be inadmissible in evidence on the trial of any legal action.\nAll settlements and payments made under subdivisions 2 and 3 shall be credited against any final settlement or judgment; provided however that in the event that judgment is entered against the person seeking recovery or if a verdict is rendered for an amount less than the total of any such advance payments in favor of the recipient thereof, such person shall not be required to refund any portion of such advance payments voluntarily made. Upon motion to the court in the absence of a jury and upon proper proof thereof, prior to entry of judgment on a verdict, the court shall first apply the provisions of subdivision 1 and then shall reduce the amount of the damages so determined by the amount of the payments previously made to or on behalf of the person entitled to such damages.",
	"repealed": false
}