{
	"id": "18H.12",
	"url": "https://www.revisor.mn.gov/statutes/cite/18H.12",
	"title": "18H.12 DAMAGED, DISEASED, INFESTED, OR MISREPRESENTED STOCK.",
	"text": "(a) No entity may knowingly offer to distribute, advertise, or display nursery stock that is infested or infected with plant pests or nursery stock that is in a dying condition, desiccated, frozen or damaged by freezing, or materially damaged in any way.\n(b) No entity may knowingly offer to distribute, advertise, or display nursery stock that may result in the capacity and tendency or effect of deceiving any purchaser or prospective purchaser as to the quantity, size, grade, kind, species name, age, variety, maturity, condition, vigor, hardiness, number of times transplanted, growth ability, growth characteristics, rate of growth, time required before flowering or fruiting, price, origin, place where grown, or any other material respect.\n(c) Upon discovery or notification of damaged, diseased, infested, or misrepresented stock, the commissioner may place a stop sale and a withdrawal from distribution order on the material. The order makes it an illegal action to distribute, give away, destroy, alter, or tamper with the plants.\n(d) The commissioner may conspicuously mark all plants, materials, and articles known or suspected to be infected or infested with plant pests. The commissioner shall notify the persons, owners, or the tenants in possession of the premises or area in question of the existence of the plant pests.\n(e) If the commissioner determines that this chapter has been violated, the commissioner may order that the nuisance, infestation, infection, or plant pest be abated by whatever means necessary, including, but not limited to, destruction, confiscation, treatment, return shipment, or quarantine.\n(f) The plant owner is liable for all costs associated with a stop order or a quarantine, treatment, or destruction of plants. The commissioner is not liable for any actual or incidental costs incurred by an entity due to authorized actions of the commissioner. The commissioner must be reimbursed by the owner of plants for actual expenses incurred by the commissioner in carrying out a stop order.",
	"repealed": false
}