{
	"id": "97A.445",
	"url": "https://www.revisor.mn.gov/statutes/cite/97A.445",
	"title": "97A.445 EXEMPTIONS FROM LICENSE REQUIREMENT.",
	"text": "(a) A resident age 16 years or older may take fish by angling without an angling license and may take fish by spearing from a dark house without a spearing license and without a fish house or dark house license during one three-day consecutive period of the open-water angling season and one three-day consecutive period of the ice angling season designated by the commissioner if the resident is accompanied by a child who is under age 16. The commissioner may, by written order published in the State Register, establish the three-day consecutive periods. The written order is not subject to the rulemaking provisions of chapter 14 and section 14.386 does not apply.\n(b) The commissioner may designate and publicize the three-day periods as \"Take a Kid Fishing Weekend\" for the open-water angling season and \"Take a Kid Ice Fishing Weekend\" for the ice angling season. The commissioner shall announce the date of each three-day weekend at least 30 days in advance of the date it occurs.\n(a) A resident may take fish by angling without an angling license:\n(1) when shore fishing or wading on state-owned land within a state park; or\n(2) when angling from a boat or float or through the ice on water bodies completely encompassed within the statutory boundary of the state park.\n(b) The exemption from an angling license does not apply to waters where a trout stamp is required.\nA license is not required to take fish by angling with the written consent of the superintendent or chief executive of the institution for the following persons:\n(1) a resident of a state hospital;\n(2) a patient of a United States Veterans Administration hospital;\n(3) an inmate of a state correctional facility;\n(4) a resident of a licensed nursing or boarding care home, a person who is enrolled in and regularly participates in an adult day care program or other similar organized activity sponsored by a licensed nursing or boarding care home, or a resident of a licensed board and lodging facility; and\n(5) a resident of a drug or alcohol residential treatment program under the age of 20.\n[Repealed, 2014 c 290 s 70]\nAny mother who is a resident of Minnesota may take fish by angling without a license during the Saturday and Sunday of the angling season that coincides with Mother's Day. The commissioner shall publicize the Saturday and Sunday as \"Take a Mom Fishing Weekend.\"\nA resident over age 18 may take small game by hunting without a license during one Saturday and Sunday of the small-game-hunting season designated by rule of the commissioner if accompanied by a child who is under age 16. The commissioner shall publicize the Saturday and Sunday as \"Take a Kid Hunting Weekend.\"\nIn the event of a disruption in the availability of hunting and angling licenses, the commissioner may publish in the State Register a notice that exempts residents and nonresidents from requirements to possess a license to take game or fish.\n[See Note.]",
	"repealed": false
}