{
	"id": "182.6553",
	"url": "https://www.revisor.mn.gov/statutes/cite/182.6553",
	"title": "182.6553 SAFE PATIENT HANDLING PROGRAM.",
	"text": "(a) Every licensed health care facility in the state shall adopt a written safe patient handling policy establishing the facility's plan to achieve the goal of minimizing manual lifting of patients by nurses and other direct patient care workers by utilizing safe patient handling equipment.\n(b) The program shall address:\n(1) assessment of hazards with regard to patient handling;\n(2) the acquisition of an adequate supply of appropriate safe patient handling equipment;\n(3) initial and ongoing training of nurses and other direct patient care workers on the use of this equipment;\n(4) procedures to ensure that physical plant modifications and major construction projects are consistent with program goals; and\n(5) periodic evaluations of the safe patient handling program.\n(a) Every licensed health care facility in the state shall establish a safe patient handling committee either by creating a new committee or assigning the functions of a safe patient handling committee to an existing committee.\n(b) Membership of a safe patient handling committee or an existing committee must meet the following requirements:\n(1) at least half the members shall be nonmanagerial nurses and other direct patient care workers; and\n(2) in a health care facility where nurses and other direct patient care workers are covered by a collective bargaining agreement, the union shall select the committee members proportionate to its representation of nonmanagerial workers, nurses, and other direct patient care workers.\n(c) A health care organization with more than one covered health care facility may establish a committee at each facility or one committee to serve this function for all the facilities. If the organization chooses to have one overall committee for multiple facilities, at least half of the members of the overall committee must be nonmanagerial nurses and other direct patient care workers and each facility must be represented on the committee.\n(d) Employees who serve on a safe patient handling committee must be compensated by their employer for all hours spent on committee business.\nA facility that has already adopted a safe patient handling policy that satisfies the requirements of subdivision 1, and established a safe patient handling committee by July 1, 2008, is considered to be in compliance with those requirements. The committee must continue to satisfy the requirements of subdivision 2, paragraph (b), on an ongoing basis.\nA safe patient handling committee shall:\n(1) complete a patient handling hazard assessment that:\n(i) considers patient handling tasks, types of nursing units, patient populations, and the physical environment of patient care areas;\n(ii) identifies problems and solutions;\n(iii) identifies areas of highest risk for lifting injuries; and\n(iv) recommends a mechanism to report, track, and analyze injury trends;\n(2) make recommendations on the purchase, use, and maintenance of an adequate supply of appropriate safe patient handling equipment;\n(3) make recommendations on training of nurses and other direct patient care workers on use of safe patient handling equipment, initially when the equipment arrives at the facility and periodically afterwards;\n(4) conduct annual evaluations of the safe patient handling implementation plan and progress toward goals established in the safe patient handling policy; and\n(5) recommend procedures to ensure that, when remodeling of patient care areas occurs, the plans incorporate safe patient handling equipment or the physical space and construction design needed to accommodate safe patient handling equipment at a later date.\nThe commissioner shall make training materials on implementation of this section available to all health care facilities at no cost as part of the training and education duties of the commissioner under section 182.673.\nThis section shall be enforced by the commissioner under sections 182.66 and 182.661. A violation of this section is subject to the penalties provided under section 182.666.\nThe commissioner may make grants to health care facilities to acquire safe patient handling equipment and for training on safe patient handling and safe patient handling equipment. Grants to any one facility may not exceed $40,000. A grant must be matched on a dollar-for-dollar basis by the grantee. The commissioner shall establish a grant application process. The commissioner may give priority for grants to facilities that demonstrate that acquiring safe patient handling equipment will impose a financial hardship on the facility. For health care facilities that provide evidence of hardship, the commissioner may waive the 50 percent match requirement and may grant such a facility more than $40,000. Health care facilities that the commissioner determines are experiencing hardship shall not be required to meet the safe patient handling requirements until July 1, 2012.",
	"repealed": false
}