{
	"id": "245.466",
	"url": "https://www.revisor.mn.gov/statutes/cite/245.466",
	"title": "245.466 LOCAL SERVICE DELIVERY SYSTEM.",
	"text": "The county board in each county is responsible for using all available resources to develop and coordinate a system of locally available and affordable adult mental health services. The county board may provide some or all of the mental health services and activities specified in subdivision 2 directly through a county agency or under contracts with other individuals or agencies. A county or counties may enter into an agreement with a regional treatment center under section 246.57 or with any state facility or program as defined in section 246.50, subdivision 3, under the control of the Direct Care and Treatment executive board to enable the county or counties to provide the treatment services in subdivision 2. Services provided through an agreement between a county and a regional treatment center must meet the same requirements as services from other service providers.\nThe adult mental health service system developed by each county board must include the following services:\n(1) education and prevention services in accordance with section 245.468;\n(2) emergency services in accordance with section 245.469;\n(3) outpatient services in accordance with section 245.470;\n(4) community support program services in accordance with section 245.4711;\n(5) residential treatment services in accordance with section 245.472;\n(6) acute care hospital inpatient treatment services in accordance with section 245.473;\n(7) regional treatment center inpatient services in accordance with section 246C.12;\n(8) screening in accordance with section 245.476; and\n(9) case management in accordance with sections 245.462, subdivision 3; and 245.4711.\nEffective January 1, 1988, the county board shall review all proposed county agreements, grants, or other contracts related to mental health services for funding from any local, state, or federal governmental sources. Contracts with service providers must:\n(1) name the commissioner as a third-party beneficiary;\n(2) identify monitoring and evaluation procedures not in violation of the Minnesota Government Data Practices Act, chapter 13, which are necessary to ensure effective delivery of quality services;\n(3) include a provision that makes payments conditional on compliance by the contractor and all subcontractors with sections 245.461 to 245.486 and all other applicable laws, rules, and standards; and\n(4) require financial controls and auditing procedures.\nCounties must prepare a transition plan that provides for continuity of care in the event of contract termination with a community mental health center under section 245.62, or a community support services program under section 245.462, subdivision 6. The county shall provide at least 90 days' notice of the termination to the contracted agency and the commissioner of human services. The transition plan must provide information to clients on how to access medical records and how to transfer to other providers.\nIn order to provide efficiently the services required by sections 245.461 to 245.486, counties are encouraged to join with one or more county boards to establish a multicounty local mental health authority pursuant to the Joint Powers Act, section 471.59, the Human Services Act, sections 402.01 to 402.10, community mental health center provisions, section 245.62, or enter into multicounty mental health agreements. Participating county boards shall establish acceptable ways of apportioning the cost of the services.\nThe county board, individually or in conjunction with other county boards, shall establish a local adult mental health advisory council or mental health subcommittee of an existing advisory council. The council's members must reflect a broad range of community interests. They must include at least one consumer, one family member of an adult with mental illness, one mental health professional, and one community support services program representative. The local adult mental health advisory council or mental health subcommittee of an existing advisory council shall meet at least quarterly to review, evaluate, and make recommendations regarding the local mental health system. Annually, the local adult mental health advisory council or mental health subcommittee of an existing advisory council shall:\n(1) arrange for input from the regional treatment center's mental illness program unit regarding coordination of care between the regional treatment center and community-based services;\n(2) identify for the county board the individuals, providers, agencies, and associations as specified in section 245.462, subdivision 10;\n(3) provide to the county board a report of unmet mental health needs of adults residing in the county to be included in the county's mental health plan, and participate in developing the mental health plan; and\n(4) coordinate its review, evaluation, and recommendations regarding the local mental health system with the state advisory council on mental health.\nThe county board shall consider the advice of its local mental health advisory council or mental health subcommittee of an existing advisory council in carrying out its authorities and responsibilities.\nThe county board may establish procedures and policies that are not contrary to those of the commissioner or sections 245.461 to 245.486 regarding local adult mental health services and facilities. The county board shall perform other acts necessary to carry out sections 245.461 to 245.486.\nIf a county presents a budget-neutral plan for a net reduction in the number of institution for mental disease (IMD) beds funded by housing support under chapter 256I, the commissioner may transfer the net savings from housing support to medical assistance and mental health grants to provide appropriate services in non-IMD settings. For the purposes of this subdivision, \"a budget neutral plan\" means a plan that does not increase the state share of costs.",
	"repealed": false
}