{
	"id": "298.292",
	"url": "https://www.revisor.mn.gov/statutes/cite/298.292",
	"title": "298.292 POLICY.",
	"text": "The legislature is cognizant of the severe economic dislocations and widespread unemployment that result when a single industry on which an area is largely dependent, experiences a drastic reduction in activity. The Douglas J. Johnson economic protection trust fund is hereby created to be devoted to economic rehabilitation and diversification of industrial enterprises where these conditions ensue as the result of the decline of such a single industry. Priority shall be given to using the Douglas J. Johnson economic protection trust fund for the following purposes:\n(1) projects and programs that are designed to create and maintain productive, permanent, skilled employment, including employment in technologically innovative businesses;\n(2) projects and programs to encourage diversification of the economy and to promote the development of minerals, alternative energy sources utilizing indigenous fuels, forestry, small business, and tourism; and\n(3) projects and programs for which technological and economic feasibility have been demonstrated.\n(a) Money in the Douglas J. Johnson economic protection trust fund may be used for the following purposes:\n(1) to provide loans, loan guarantees, interest buy-downs and other forms of participation with private sources of financing, but a loan to a private enterprise shall be for a principal amount not to exceed one-half of the cost of the project for which financing is sought, and the rate of interest on a loan to a private enterprise shall be no less than the lesser of eight percent or an interest rate three percentage points less than a full faith and credit obligation of the United States government of comparable maturity, at the time that the loan is approved;\n(2) to fund reserve accounts established to secure the payment when due of the principal of and interest on bonds issued pursuant to section 298.2211, including bonds authorized by the legislature to be repaid from the distributions under section 298.28, subdivision 7a;\n(3) to pay in periodic payments or in a lump-sum payment any or all of the interest on bonds issued pursuant to chapter 474 for the purpose of constructing, converting, or retrofitting heating facilities in connection with district heating systems or systems utilizing alternative energy sources;\n(4) to invest in a venture capital fund or enterprise that will provide capital to other entities that are engaging in, or that will engage in, projects or programs that have the purposes set forth in subdivision 1. No investments may be made in a venture capital fund or enterprise unless at least two other unrelated investors make investments of at least $500,000 in the venture capital fund or enterprise, and the investment by the Douglas J. Johnson economic protection trust fund may not exceed the amount of the largest investment by an unrelated investor in the venture capital fund or enterprise. For purposes of this subdivision, an \"unrelated investor\" is a person or entity that is not related to the entity in which the investment is made or to any individual who owns more than 40 percent of the value of the entity, in any of the following relationships: spouse, parent, child, sibling, employee, or owner of an interest in the entity that exceeds ten percent of the value of all interests in it. For purposes of determining the limitations under this clause, the amount of investments made by an investor other than the Douglas J. Johnson economic protection trust fund is the sum of all investments made in the venture capital fund or enterprise during the period beginning one year before the date of the investment by the Douglas J. Johnson economic protection trust fund; and\n(5) to purchase forest land in the taconite assistance area defined in section 273.1341 to be held and managed as a public trust for the benefit of the area for the purposes authorized in section 298.22, subdivision 5a. Property purchased under this section may be sold by the commissioner, after consultation with the advisory board. The net proceeds must be deposited in the trust fund for the purposes and uses of this section.\n(b) Money from the trust fund shall be expended only in the taconite assistance area defined in section 273.1341.\n(c) Money devoted to the trust fund under this section shall not be expended, appropriated, or transferred from the trust fund for any purpose except as provided in this section.",
	"repealed": false
}