{
	"id": "515B.2-101",
	"url": "https://www.revisor.mn.gov/statutes/cite/515B.2-101",
	"title": "515B.2-101 CREATION OF COMMON INTEREST COMMUNITIES.",
	"text": "(a) On and after June 1, 1994, a common interest community subject to this chapter may be created only as follows:\n(1) A condominium may be created only by recording a declaration.\n(2) A cooperative may be created only by recording a declaration and by immediately thereafter recording a conveyance of the real estate subject to that declaration to the association.\n(3) A planned community which includes common elements may be created only by recording a declaration. The declarant shall, immediately thereafter, record a conveyance of the common elements subject to that declaration, other than common elements described in section 515B.2-109(c) and (d), to the association; provided, that a delay in or failure to record the conveyance shall have no effect on the validity of the common interest community.\n(4) A planned community without common elements may be created only by recording a declaration.\n(b) Except as otherwise provided in this chapter, the declaration shall be executed by the owner of the real estate subject to the declaration at the time the declaration is recorded, except vendors under contracts for deed, and by every lessor of a lease the expiration or termination of which will terminate the common interest community. The declaration shall be recorded in every county in which any portion of the common interest community is located. Failure of any party not required to execute a declaration, but having a recorded interest in the real estate subject to the declaration at the time the declaration is recorded, to join in the declaration shall have no effect on the validity of the common interest community; provided that the party is not bound by the declaration unless the party (i) executes a recorded instrument that utilizes a legal description of part or all of the common interest community complying with section 515B.2-104, or (ii) otherwise acknowledges the existence of the common interest community in a recorded instrument.\n(c) In a condominium, a planned community utilizing a CIC plat complying with section 515B.2-110(c), or a cooperative, where the unit boundaries are delineated by a structure, a declaration, or an amendment to a declaration adding units, shall not be recorded unless the structural components of the structures containing the units and the mechanical systems serving more than one unit, but not the units, are substantially completed, as evidenced by a recorded certificate executed by a registered engineer or architect.\n(d) A project which (i) meets the definition of a \"common interest community\" in section 515B.1-103(10), (ii) is created after May 31, 1994, and (iii) is not exempt under section 515B.1-102(e), is subject to this chapter even if this or other sections of the chapter have not been complied with, and the declarant and all unit owners are bound by all requirements and obligations of this chapter.\n(e) The association shall be incorporated pursuant to section 515B.3-101 and the CIC plat shall be recorded as and if required by section 515B.2-110.",
	"repealed": false
}