{
	"id": "50.14",
	"url": "https://www.revisor.mn.gov/statutes/cite/50.14",
	"title": "50.14 AUTHORIZED SECURITIES.",
	"text": "Except as it relates to the investment of trust funds by corporate trustees or by individual trustees, the term \"authorized securities\" whenever used in the statutes and laws of this state shall be understood as referring to the following described securities in which the directors of any savings bank shall invest the money deposited therein and which at the time of the purchase thereof are included in one or more of the following classes.\nClass one shall be:\n(a) the bonds or other interest bearing obligations of the United States, or in securities for the payment of which and interest thereon the faith of the government is pledged;\n(b) shares of an investment company registered under the Investment Company Act of 1940, whose shares are registered under the Securities Act of 1933, provided that the only investments of that company are in obligations of the United States government, in obligations fully guaranteed by the United States government, or in obligations of instrumentalities of the United States government such as the Federal National Mortgage Association, the Federal Home Loan Banks, the Federal Land Banks, the Federal Intermediate Credit Banks, or the Banks for Cooperatives;\n(c) the bonds or other interest bearing securities of the Dominion of Canada, provided that the full faith and credit of the Dominion of Canada is pledged for the payment thereof and provided further that they are payable in United States dollars within the United States.\nClass two shall be the bonds or notes of any state which has not defaulted in the payment of any bonded debt within ten years prior to the making of such investment; and in the highway revenue bonds or certificates of such states payable out of irrevocably pledged special revenues to be derived from gasoline or other motor fuel taxes or motor vehicle license fees, provided that such revenues during the most recent fiscal year of such state (next preceding the date of such investment) were equal to at least 1-1/4 times the interest, principal, and sinking fund requirements of such revenue bonds or certificates during such fiscal year.\nClass three shall be:\n(a) the bonds, certificates of indebtedness, or other interest bearing obligations, payable out of a levy of ad valorem taxes, of any county, city, town, or any school district, drainage district, or other district, or of any board of any municipality, or of any public authority, created pursuant to law for public purposes in Minnesota, without regard to any debt limits other than those in section 475.53;\n(b) the bonds, certificates of indebtedness or other interest-bearing obligations, payable out of a levy of ad valorem taxes, of any county, city, town, or school, drainage or other district, or public authority, created pursuant to law for public purposes in any state of the United States other than Minnesota, provided that the total bonded indebtedness of the county, municipality, district or authority, after deducting the amount of all sinking funds and of all revenue bonds or certificates (including among revenue bonds and certificates those which pledge the full faith and credit of the issuer, if the net revenues applicable to the payment of the bonds or certificates during the three fiscal years immediately preceding the date of purchase exceeded by at least five percent the amount required to pay principal and interest on those bonds or certificates during that period), shall not exceed ten percent of its assessed value; and provided further that if the county, municipality, district or authority is of any state other than Iowa, Wisconsin, North Dakota, or South Dakota, it contains at least 3,500 inhabitants;\n(c) the bonds, certificates or other interest-bearing obligations, payable out of special revenues, of any county, city, town, or school, drainage, or other district, or public authority, created pursuant to law for public purposes in any state of the United States, provided that:\n(1) if the county, municipality, district or authority is of any state other than Minnesota, it contains at least 3,500 inhabitants;\n(2) the obligations were issued to finance the purpose of construction of or addition to a public enterprise furnishing water, sewer, lighting, power, gas, or road facilities, from which revenue is to be derived;\n(3) the governing body or other legally constituted authority has covenanted or is required by law to establish and maintain rates to yield sufficient revenue for the payment of operating expenses, maintenance expenses, and principal and interest on the revenue obligations and to pledge that revenue irrevocably for those purposes;\n(4) at the date of investment the public enterprise has been in operation for at least three years; and\n(5) during the preceding three fiscal years its annual net earnings, after payment of operating expenses and maintenance expenses, have been on the average at least 1-1/4 times the average annual interest, principal, and sinking fund requirements on the revenue obligations during the period from the end of its most recent fiscal year to the final maturity of the obligations; and\n(d) the bonds or other interest-bearing obligations, payable from revenues other than ad valorem taxes as contemplated in clause (a), validly issued by any state or insular possession of the United States, or by any agency, instrumentality, municipality, or governmental or public subdivision, district, corporation, commission, board, council, or authority of whatsoever kind, created for public purposes by or pursuant to the laws of any state, provided that the bonds or other interest-bearing obligations are at the time of purchase rated among the highest three quality categories, not applicable to bonds or other interest-bearing obligations in default as to principal, used by a nationally recognized rating agency for rating the quality of similar bonds or other interest-bearing obligations, and are not rated lower by any other such agency.\n(1) Class four shall be:\n(a) notes or bonds secured by mortgages or trust deeds on unencumbered real estate, whether in fee or in a leasehold of a duration not less than ten years beyond the maturity of the loan, in any state of the United States, worth at least the amount loaned thereon;\n(b) notes or bonds secured by mortgages or trust deeds on unencumbered real estate in clause (1)(a) where the notes or bonds do not exceed 80 percent of the appraised value of the security for the same, provided that the notes or bonds are payable in installments aggregating not less than five percent of the original principal a year in addition to the interest; or, are payable on a regular amortization basis in equal installments, including principal and interest, these installments to be payable monthly in amounts that the debt will be fully paid in not to exceed 30 years if the security is nonagricultural real estate, and these installments to be payable annually or semiannually in amounts that the debt will be fully paid in not to exceed 25 years if the security is agricultural real estate. A construction loan is deemed amortized as required by this clause if the first installment thereon is payable not later than 18 months after the date of the first advance in the case of residential construction or not later than 36 months after the date of the first advance in the case of nonresidential construction; and\n(c) notes or bonds secured by mortgages or trust deeds on unencumbered real estate in clause (1)(a) which are in an original principal amount of $100,000 or more and which do not exceed 95 percent of the appraised value of the security for the same which may be payable in the manner as the directors of the savings bank prescribe, provided that construction loans made by a savings bank pursuant to this clause (1)(c) do not exceed in the aggregate five percent of the assets of the savings bank.\n(2) Class four investments shall be made only on report of a committee directed to investigate the same and report its value, according to the judgment of its members, and its report shall be preserved among the bank's records.\n(3) Notwithstanding anything to the contrary in clause (1)(b), a savings bank organized under the laws of this state may invest in notes or bonds secured by mortgages or trust deed where the notes or bonds do not exceed 95 percent of the appraised value of the security for the same. Except as modified herein, the other provisions of clause (1)(b) apply.\n(4) For purposes of this subdivision, real estate is deemed unencumbered if the only existing mortgage or lien against the real estate is a first mortgage lien in favor of the savings bank making a second mortgage loan or if the total unpaid aggregate of all outstanding liens against the same real estate does not exceed 80 percent of its appraised value.\n(5) Renegotiable rate notes or bonds secured by mortgages or trust deeds where the notes or bonds do not exceed 95 percent of the appraised value of the security for the same.\nFor the purposes of this clause, a renegotiable rate mortgage loan is a loan issued for a term of three years to five years, secured by a mortgage maturing in not to exceed 30 years, and automatically renewable at equal intervals after the original loan term which may be up to six months shorter or longer than subsequent terms. The loan must be repayable in equal monthly installments of principal and interest during the loan term, in an amount at least sufficient to amortize a loan with the same principal and at the same interest rate over the remaining life of the mortgage.\nIn the mortgage documents, the savings bank must grant to the borrower an option to renew the loan for a new term, but not beyond the maturity date of the mortgage, at a new interest rate which shall be the savings bank's current market rate of interest on similar loans determined 60 days before the due date of the loan: provided, that the maximum interest rate increase shall be equal to one-half of one percent per year multiplied by the number of years in the loan term with a maximum net increase of five percent over the life of the mortgage. Interest rate increases are optional with the savings bank; net decreases from the previous loan term are mandatory.\nThe borrower may not be charged costs connected with the renewal of the loan.\nSixty days before the due date of the loan, the savings bank shall send a written notification to the borrower containing the following information: (i) the date on which the entire balance of borrower's loan is due and payable; (ii) a statement that the loan will be renewed automatically by the savings bank at the rate specified in the notice unless the borrower pays the loan by the due date; (iii) the amount of the monthly payment, calculated according to the new rate determined at the time of notice; (iv) a statement that the borrower may prepay the loan without penalty at any time after the original loan becomes due and payable; and (v) the name and phone number of a savings bank employee who will answer the borrowers' questions concerning the information in the notice.\nAn applicant for a renegotiable rate mortgage loan must be given, at the time an application is requested, written disclosure materials prepared in reasonably simple terms that contain at least the following information: (i) an explanation of how a renegotiable rate mortgage differs from a standard fixed rate mortgage; (ii) an example of a renegotiable rate mortgage indicating the maximum possible interest rate increase and monthly payment calculated on that rate at the time of the first renewal; and (iii) an explanation of how the savings bank determines what the rate will be at the end of each loan term.\n(6) An investment in notes or bonds secured by mortgages or trust deeds on real estate in fee or in a leasehold may exceed the 80 percent requirement in paragraph (1), clause (b), and the 95 percent requirement in paragraph (2), if the amount of the loan in excess of those limits is insured or guaranteed by a private mortgage insurer that the Federal Home Loan Mortgage Corporation or the Federal National Mortgage Association has determined to be a qualified private insurer.\nClass five shall be notes secured by such bonds or mortgages, as the bank under this section is authorized to invest in, but no such bond or mortgage shall be taken as collateral security for more than its par value, nor shall the aggregate amount of securities taken be less than the full amount loaned thereon, and no such loan shall be made for a longer time than one year, nor to a greater amount to any one person than three percent of the total deposits of the bank. No such bank shall loan in the aggregate, on the security specified in this paragraph, more than one-fourth of its deposits.\nClass six shall be the \"eligible obligations\" of \"qualifying railroad corporations,\" both as hereinafter defined.\n(a) A \"qualifying railroad corporation\" shall be one which at the time of investment\n(1) Shall have been incorporated under the laws of the United States or of any state thereof or of the District of Columbia, and\n(2) Shall own or operate within the United States not less than 500 miles of standard gauge railroad lines exclusive of sidings, or shall have had, for its five preceding fiscal years, average gross railway operating revenues of at least $10,000,000 annually, or shall own or operate railroad terminal property located in a city within the United States having at least 200,000 population, and\n(3) Shall not have been in default in the payment of any part of the principal or interest owing by it upon any part of its funded indebtedness, at any times during its current fiscal year and its five consecutive fiscal years immediately prior thereto, except that if the corporation shall have been reorganized in receivership or bankruptcy within such period such corporation shall not have been in such default since the effective date of reorganization, and\n(4) Shall not have fixed interest obligations in excess of 60 percent of the total sum of (a) its fixed interest obligations, (b) obligations, if any, bearing interest on a contingent basis, (c) preferred stock, if any, at par or stated value, (d) common stock at par or stated value and (e) earned surplus, and\n(5) Shall have had net earnings (a) in its five fiscal years immediately preceding time of purchase, of an average annual amount not less than 1-1/2 times the fixed charges of the year immediately preceding time of purchase, and (b) in four of its five fiscal years immediately preceding time of purchase and in its fiscal year immediately preceding time of purchase, not less than the fixed charges of those respective years, except that if the corporation shall have been reorganized in receivership or bankruptcy within such period, its net earnings for each year shall have been not less than the fixed charges of the reorganized company. As used herein \"net earnings\" shall be defined as gross operating and nonoperating income of a railroad corporation or its predecessor corporation, minus traffic and transportation expenses, maintenance, depreciation, rent of equipment and joint facilities, and other operating expenses, and taxes excluding income and profits taxes. As used herein \"fixed charges\" shall be defined as interest on debt on which there is an unqualified obligation to pay interests, leased line rentals and amortization of debt discount and expense, except that if a corporation has been reorganized in receivership or bankruptcy within five years prior to time of purchase \"fixed charges\" shall be the fixed charges of the reorganized company.\n(b) \"Eligible obligations\" shall be bonds, notes or other obligations which\n(1) Shall have been issued by a qualifying railroad corporation, or shall have been assumed or guaranteed as to principal and interest by a qualifying railroad corporation, and\n(2) Shall bear interest at a fixed rate, and\n(3) Shall have a definite maturity date, and\n(4) Shall be secured by either (a) a lien upon railroad lines which shall be a first lien upon at least two-thirds of the total mileage covered by such lien and upon at least 100 miles of main lines or (b) a first mortgage or lien on railroad terminal property and assumed or guaranteed as to principal and interest by two or more qualifying railroad corporations.\n(c) No savings bank shall invest in securities of class six to an amount exceeding in the aggregate 15 percent of its deposits; nor in securities of class six secured by lien upon railroad lines, issued, guaranteed, or assumed by any one railroad corporation to an amount exceeding two percent of its deposits; nor in securities of class six secured by lien upon any one railroad terminal property to an amount exceeding one percent of its deposits.\nThe requirements set forth herein governing investments in securities under this subdivision shall affect only those securities acquired after the effective date of Laws 1945, chapter 140.\nClass seven shall be farm loan bonds issued by any federal land bank, or by a joint stock land bank in the Federal Reserve district in which Minnesota is situated, in accordance with the provisions of an Act of Congress of the United States of July 17, 1916, known and designated as \"The Federal Farm Loan Act,\" and acts amendatory thereto; stocks, bonds, and obligations of the Federal Home Loan Banks established by Act of Congress known as the Federal Home Loan Bank Act approved July 22, 1932, and acts amendatory thereto; and bonds issued by the federal land banks, federal intermediate credit banks, and the banks for cooperatives in accordance with the provisions of an Act of Congress of the United States known as the Farm Credit Act of 1971, and acts amendatory thereto.\nClass eight shall be bankers' acceptances of the kind and character following:\n(a) Bankers acceptances of the kind and maturities made eligible by law for rediscount with or purchase by Federal Reserve banks, providing the same are accepted or endorsed by a bank, or trust company incorporated under the laws of this state; or by any bank or trust company in the United States which is a member of the Federal Reserve System.\n(b) Not more than 20 percent of the assets of any savings bank shall be invested in such acceptances. Not more than seven percent of the aggregate amount credited to the depositors of any savings bank shall be invested in the acceptances of or deposited with a trust and banking company or with a national bank of which a trustee of such savings bank is a director.\nClass nine shall be railroad equipment trust obligations, comprising bonds, notes or certificates, which when issued are secured by new standard gauge rolling stock purchased or leased by any railroad incorporated in the United States or in Canada, or by the receiver or trustee of any such railroad, or by any corporation engaged in the business of leasing or furnishing railroad rolling stock, provided, that the entire issue of such obligations:\n(a) Is required to be paid, in United States dollars within the United States, within 15 years from date of issue in approximately equal annual or semiannual installments commencing not later than three years after the date of issue, and\n(b) Is of an aggregate amount not exceeding 80 percent of the cost of the equipment securing such issue; but if issued originally in an amount which exceeded such 80 percent, then investment in the obligations of such issue shall nevertheless be authorized as soon as or at any time after all the unpaid obligations of such issue are reduced to or are less than 50 percent of the cost of the equipment securing such issue.\nClass ten shall be the bonds of any corporation which at the time of such investment is incorporated under the laws of the United States or any state thereof, or the District of Columbia, and transacting the business of supplying electrical energy, or artificial gas, or natural gas purchased from another corporation and supplied in substitution for or in mixture with artificial gas, for light, heat, power and other purposes, or transacting any or all of such business, provided that at least 75 percent of the gross operating revenues of any such corporation are derived from such business and that not more than 15 percent of the gross operating revenues are derived from any one kind of business other than supplying electricity or gas or electricity and gas, and provided further that such corporation, if operating outside of Minnesota, is subject to regulation by a public utilities commission or public utility commissioner or other similar regulatory body duly established by the laws of the United States or the states or state in which such corporation operates, subject to the following conditions:\n(a) Such corporation shall have all franchises necessary to operate in the territory in which at least 75 percent of its gross income is earned, which franchises either shall be indeterminate permits or agreements with, or subject to the jurisdiction of, a public utilities commission or other duly constituted regulatory body, or shall extend at least five years beyond the maturity of such bonds, and such corporation shall file with the commissioner of commerce or make public each year a statement and a report giving the income account covering the previous fiscal year and the balance sheet showing in reasonable detail the assets and liabilities at the end of such fiscal year.\n(b) The book value of the outstanding capital stock of such corporation shall at the time of such investment be equal to at least two-thirds of its total funded debt.\n(c) Such corporation shall have been in existence for a period of not less than eight fiscal years and at no time within such period of eight fiscal years next preceding the date of such investment shall said corporation have failed to pay promptly and regularly the matured principal and interest of all its indebtedness direct, assumed or guaranteed, but the period of life of the corporation, together with the period of life of any predecessor corporation or corporations from which a substantial portion of its property was acquired by consolidation, merger, purchase, or as a successor corporation, shall be considered together in determining the required period.\n(d) For a period of five fiscal years next preceding the date of such investment the net earnings of such corporation shall have been each year not less than twice the annual interest charges on its total funded debt applicable to that period, and for such period the gross operating revenues of any such corporation shall have averaged per year not less than $1,000,000.\n(e) In determining the qualifications of any bond under this subdivision where a corporation shall have acquired its property or any substantial portion thereof within five years immediately preceding the date of such investment by consolidation, merger, purchase or as a successor corporation, the gross operating revenues, net earnings and interest charges of the predecessor or constituent corporations shall be consolidated and adjusted so as to ascertain whether the requirements of paragraph (d) have been complied with.\n(f) The gross operating revenues and expenses of a corporation for the purpose of this subdivision shall be respectively the total amount earned from the operation of, and the total expense of maintaining and operating, all property owned and operated or leased and operated by such corporation, as determined by the system of accounts prescribed by the public utility commission or other similar regulatory body having jurisdiction in the matter. The gross operating revenues and expenses, as defined above, of subsidiary companies must be included, provided that all the mortgage bonds and a controlling interest in stock or stocks of such subsidiary companies are pledged as part security for the mortgage debt of the principal corporation.\n(g) The net earnings of a corporation for the purpose of this subdivision shall be the balance obtained by deducting from its gross operating revenues its operating and maintenance expenses, taxes other than federal and state income taxes, rentals, depreciation and provision for renewals and retirements of the physical assets of the corporation, and by adding to said balance its income from securities and miscellaneous sources, but not, however, to exceed 15 percent of said balance. The term \"funded debt\" shall be construed to mean all interest-bearing debt excepting therefrom unsecured obligations maturing within one year of date of issue.\n(h) Such bonds must be part of an original issue of not less than $1,000,000 and must be mortgage bonds secured by a first or refunding mortgage secured by property owned and operated by the corporation issuing or assuming them, or must be underlying mortgage bonds secured by property owned and operated by the corporation issuing or assuming them, provided that such bonds are to be refunded by a junior mortgage providing for their retirement and provided further that the bonds under such junior mortgage comply with the requirements of this subdivision and that such underlying mortgage either is a closed mortgage or remains open solely for the issuance of additional bonds which are to be pledged under such junior mortgage. The aggregate principal amount of bonds secured by such first or refunding mortgage plus the principal amount of all the underlying outstanding bonds shall not exceed 60 percent of the value of the physical property owned as shown by the books of the corporation and subject to the lien of such mortgage or mortgages securing the total mortgage debt, provided that if a refunding mortgage, it must provide for the retirement on or before the date of their maturity of all bonds secured by prior liens on the property. No such savings bank shall loan upon or invest in bonds of such public utility companies in an amount exceeding in the aggregate ten percent of its deposits and surplus, nor exceeding five percent thereof in the bonds of any one public utility company.\nClass eleven shall be the bonds of any corporation which at the time of such investment is incorporated under the laws of the United States or any state thereof, or the District of Columbia, and authorized to engage, and engaging, in the business of furnishing telephone service in the United States, provided that such corporation is subject to regulation by a public utility commission or similar federal or state regulatory body duly established by the laws of the United States or the states or state in which such corporation operates, subject to the following conditions:\n(a) Such corporation shall have been in existence for a period of not less than eight fiscal years and at no time within such period of eight fiscal years next preceding the date of such investment shall said corporation have failed to pay promptly and regularly the matured principal and interest of all its indebtedness direct, assumed or guaranteed, but the period of life of the corporation, together with the period of life of any predecessor corporation or corporations from which a substantial portion of its property was acquired by consolidation, merger, purchase or as a successor corporation, shall be considered together in determining the required period; and such corporation shall file with the commissioner of commerce or make public in each year a statement and a report giving the income account covering the previous fiscal year and the balance sheet showing in reasonable detail the assets and liabilities at the end of such fiscal year.\n(b) The book value of the outstanding capital stock of such corporation shall at the time of such investment be equal to at least two-thirds of its total funded debt.\n(c) For a period of five fiscal years next preceding the date of such investment the net earnings of such corporation shall have been each year not less than twice the annual interest charges on its total funded debt applicable to that period, and for such period, the gross operating revenues of any such corporation shall have averaged per year not less than $5,000,000.\n(d) In determining the qualifications of any bond under this subdivision where a corporation shall have acquired its property or any substantial portion thereof within five years immediately preceding the date of such investment by consolidation, merger, purchase or as a successor corporation, the gross operating revenues, net earnings and interest charges of the predecessor or constituent corporations shall be consolidated and adjusted so as to ascertain whether the requirements of paragraph (c) have been complied with.\n(e) The gross operating revenues and expenses of a corporation for the purpose of this subdivision shall be respectively the total amount earned from the operation of, and the total expense of maintaining and operating, all property owned and operated or leased and operated by such corporation, as determined by the system of accounts prescribed by the public utility commission or similar federal or state regulatory body having jurisdiction in the matter.\n(f) The net earnings of a corporation for the purpose of this subdivision shall be the balance obtained by deducting from its gross operating revenues its operating and maintenance expenses, taxes, other than federal and state income taxes, rentals, depreciation and provision, for renewals and retirements of the physical assets of the corporation, and by adding to said balance its income from securities and miscellaneous sources, but not, however, to exceed 15 percent of said balance. The term \"funded debt\" shall be construed to mean all interest-bearing debt excepting therefrom unsecured obligations maturing within one year of date of issue.\n(g) Such bonds must be a part of an original issue or of a subsequent series of bonds of the aggregate amount of not less than $5,000,000, both the original issue and the subsequent series being protected by the same mortgage provisions, and must be secured by a first or refunding mortgage, and the aggregate principal amount of bonds secured by such first or refunding mortgage plus the principal amount of all the underlying outstanding bonds shall not exceed 60 percent of the value of the property, real and personal, owned absolutely as shown by the books of the corporation and subject to the lien of such mortgage, provided that if a refunding mortgage, it must provide for the retirement of all bonds secured by prior liens on the property. Not more than 33-1/3 percent of the property constituting the specific security for such bonds may consist of stock or unsecured obligations of affiliated or other telephone companies, or both. No such savings banks shall loan upon or invest in bonds of such telephone companies in an amount exceeding in the aggregate ten percent of its deposits and surplus, nor exceeding five percent thereof in the bonds of any one telephone company.\nClass twelve shall be:\n(a) bonds and obligations of the Federal Home Loan Banks established by Act of Congress known as the Federal Home Loan Bank Act, approved July 23, 1932, and Acts amendatory thereto, and in bonds and obligations of the Home Owners' Loan Corporation established by Act of Congress known as the Home Owners' Loan Act of 1933, and Acts amendatory thereto;\n(b) certificates of deposits of any bank or trust company, however organized, the deposits of which are insured in whole or in part by the Federal Deposit Insurance Corporation, to the extent that such certificates of deposit are fully insured;\n(c) loans secured by its own passbooks or other evidences of indebtedness;\n(d) shares, accounts, or certificates of any savings association, however organized, the accounts of which are insured in whole or in part by the federal savings and loan insurance corporation, to the extent that such shares, accounts, or certificates are fully insured.\n(a) The district court, upon petition of a trustee under a will or other instrument may, if the trust does not otherwise provide, authorize the trustee to invest the income or principal of the trust fund in policies of life or endowment insurance or annuity contracts issued by a life insurance company duly authorized to transact business in the state, on the life of any beneficiary of the trust or on the life of any person in whose life such beneficiary has an insurable interest.\n(b) The district court, upon the application of a guardian, may authorize the guardian to invest income or principal of the estate of the ward in policies of life or endowment insurance or annuity contracts, issued by a life insurance company duly authorized to transact business in the state, on the life of the ward or on the life of a person in whose life the ward has an insurable interest.\nClass thirteen shall be obligations payable in United States dollars issued or fully guaranteed by International Bank for Reconstruction and Development.\nClass fourteen shall be obligations payable in United States dollars issued or fully guaranteed by the Asian Development Bank.\nClass fifteen shall be obligations payable in United States dollars issued or fully guaranteed by the Inter-American Development Bank.\nClass sixteen shall be obligations payable in United States dollars issued or fully guaranteed by the African Development Bank.",
	"repealed": false
}