{
	"id": "446A.085",
	"url": "https://www.revisor.mn.gov/statutes/cite/446A.085",
	"title": "446A.085 TRANSPORTATION REVOLVING LOAN FUND.",
	"text": "(a) For the purposes of this section, the terms defined in this subdivision have the meanings given them.\n(b) \"Act\" means the National Highway System Designation Act of 1995, Public Law 104-59, as amended.\n(c) \"Borrower\" means the state, counties, cities, and other governmental entities eligible under the act and state law to apply for and receive loans from the transportation revolving loan fund.\n(d) \"Loan\" means financial assistance provided for all or part of the cost of a project including money disbursed in anticipation of reimbursement or repayment, loan guarantees, lines of credit, credit enhancements, equipment financing leases, bond insurance, or other forms of financial assistance.\nThe purpose of the transportation revolving loan fund is to provide loans for public transportation projects eligible for financing or aid under any federal act or program or state law, including, without limitation, the study of the feasibility of construction, reconstruction, resurfacing, restoring, rehabilitation, or replacement of transportation facilities; acquisition of right-of-way; and maintenance, repair, improvement, or construction of city, town, county, or state highways, roads, streets, rights-of-way, bridges, tunnels, railroad-highway crossings, drainage structures, signs, maintenance and operation facilities, guardrails, and protective structures used in connection with highways or transit projects. Enhancement items, including without limitation bicycle paths, ornamental lighting, and landscaping, are eligible for financing provided they are an integral part of overall project design and construction of a federal-aid highway. Money in the fund may not be used for any toll facilities project or congestion-pricing project.\nA transportation revolving loan fund is established to make loans for the purposes described in subdivision 2. A highway account is established in the fund for highway projects eligible under United States Code, title 23. A transit account is established in the fund for transit capital projects eligible under United States Code, title 49. A state funds general loan account is established in the fund for transportation projects eligible under state law. Other accounts may be established in the fund as necessary for its management and administration. The transportation revolving loan fund receives federal money under the act and money from any source. Money received under this section must be paid to the commissioner of management and budget and credited to the transportation revolving loan fund. Money in the fund is annually appropriated to the authority and does not lapse. The fund must be credited with investment income, and with repayments of principal and interest, except for servicing fees assessed under section 446A.04, subdivisions 5 and 15.\nThe authority shall manage and administer the transportation revolving loan fund and individual accounts in the fund. For those purposes, the authority may exercise all powers provided in this chapter.\nMS 2000 [Repealed by amendment, 1Sp2001 c 8 art 2 s 67]\nMS 2006 [Repealed by amendment, 2007 c 96 art 1 s 11]\n(a) Applicants for loans must submit an application to the authority on forms prescribed by the authority. The applicant must provide the following information:\n(1) the estimated cost of the project and the amount of the loan sought;\n(2) other possible sources of funding in addition to loans sought from the transportation revolving loan fund;\n(3) the proposed methods and sources of funds to be used for repayment of loans received; and\n(4) information showing the financial status and ability of the borrower to repay loans.\n(b) Each project must be certified by the commissioner of transportation under subdivision 8 before its consideration by the authority.\nThe commissioner of transportation shall consider the following information when evaluating projects to certify to the authority:\n(1) a description of the nature and purpose of the proposed transportation project including an explanation of the need for the project and the reasons why it is in the public interest;\n(2) the relationship of the project to the area transportation improvement program, the approved statewide transportation improvement program, and to any transportation plans required under state or federal law;\n(3) the estimated cost of the project and the amount of loans sought;\n(4) proposed sources of funding in addition to loans sought from the transportation revolving loan fund;\n(5) the need for the project as part of the overall transportation system;\n(6) the overall economic impact of the project; and\n(7) the extent to which completion of the project will improve the movement of people and freight.\nA loan made under this section must:\n(1) bear interest at or below market rates or as otherwise specified in federal law;\n(2) have a repayment term not longer than 30 years;\n(3) be fully amortized no later than 30 years after project completion;\n(4) be subject to repayment of principal and interest beginning not later than five years after the facility financed with a loan has been completed, or in the case of a highway project, five years after the facility has opened to traffic; and\n(5) be disbursed for specific project elements only after all applicable environmental requirements have been met.\nA loan may be made to a county, or to a statutory or home rule charter city having a population of 5,000 or more, in anticipation of repayment of the loan from sums that will be apportioned to a county from the county state-aid highway fund under section 162.07 or to a city from the municipal state-aid street fund under section 162.14.\nNotwithstanding the allocation provisions of section 162.08 for counties, and the apportionment provisions of section 162.14 for cities, sums apportioned under section 162.13 to a statutory or home rule charter city, or under section 162.07 to a county, that has loan repayments due to the transportation revolving loan fund, shall be paid by the commissioner of transportation to the appropriate loan fund to offset the loan repayments that are due.\nMS 2006 [Repealed by amendment, 2007 c 96 art 1 s 11]\nThe commissioner of transportation shall establish and adopt rules to implement a program to identify, assist with development, and certify projects eligible for loans under this section to the authority.\nMS 2006 [Repealed by amendment, 2007 c 96 art 1 s 11]\nA loan may be made to a statutory or home rule charter city to finance transportation infrastructure projects for the purposes described in subdivision 2 but without regard to whether they are eligible for financing under a federal act or program or state law. The loan must be repayable under the terms and conditions provided in this section and established by the authority and agreed to by the city. The loan must be repaid by the city from the proceeds of special assessments, tax increments, or other local taxes, such as sales taxes, lodging taxes, liquor taxes, admissions and recreation taxes, and food and beverage taxes, authorized to be used for purposes of the project. In addition to any method the authority considers to be appropriate, the authority may fund those loans by issuing Build America Bonds under section 54AA of the Internal Revenue Code, as amended.",
	"repealed": false
}