{
	"id": "60A.0789",
	"url": "https://www.revisor.mn.gov/statutes/cite/60A.0789",
	"title": "60A.0789 REMEDIES.",
	"text": "(a) If the beneficiary, assignee, or other payee receives the death benefits under a life insurance policy initiated by STOLI practices or a policy procured or effected in violation of section 60A.0783 or section 60A.0785, the personal representative of the insured's estate or other lawfully acting agent may maintain an action to recover such benefits from the person receiving them.\n(b) Where a person receives the death benefit as a result of a nonwillful violation of sections 60A.078 to 60A.0789, the court may limit the recovery to unjust enrichment, calculated as the benefits received plus interest from the date of receipt, less premiums paid under the policy by the recipient and any consideration paid by the recipient to the insured in connection with the policy.\n(c) Where a person receives the death benefits as the result of a willful violation of sections 60A.078 to 60A.0789, the court may, in addition to actual damages, order the defendant or defendants to pay exemplary damages in an amount up to two times the death benefits. A pattern of violations of sections 60A.078 to 60A.0789 and conduct involving one or more fraudulent acts are evidence of willfulness. The exemplary damages shall be paid to one or more governmental agencies charged with combating consumer fraud, including the Department of Commerce.\n(d) The court may award reasonable attorney fees, together with costs and disbursements, to any party that recovers damages in any action brought under this subdivision.\n(e) An action under this subdivision must be brought within two years after the death of the insured.\nAny contract, agreement, arrangement, or transaction prohibited under sections 60A.078 to 60A.0789 is voidable.\nIf, prior to payment of death benefits, the insurer believes the policy was initiated by STOLI practices, the insurer may bring a declaratory judgment action seeking a court order declaring the policy void.\nSections 60A.078 to 60A.0789 shall not:\n(1) preempt or limit other civil remedies, including, but not limited to, declaratory judgments, injunctive relief, and interpleaders;\n(2) preempt the authority or relieve the duty of other law enforcement or regulatory agencies to investigate, examine, and prosecute suspected violations of law;\n(3) limit the powers granted elsewhere by the laws of this state to the commissioner or an insurance fraud unit or the attorney general to investigate and examine possible violations of law and to take appropriate actions against wrongdoers; or\n(4) limit the power of this state to punish a person for conduct that constitutes a crime under other laws of this state.",
	"repealed": false
}