{
	"id": "123A.45",
	"url": "https://www.revisor.mn.gov/statutes/cite/123A.45",
	"title": "123A.45 DETACHMENT AND ANNEXATION OF LAND.",
	"text": "The owner of land which adjoins any independent district, and whose land is not in a special district may petition the county board of the county in which the greater part of the area proposed for detachment and annexation lies to detach all or any part of the land together with the intervening lands as defined in paragraph (b), from the district it now is in, and to attach it, together with such intervening land, to the adjoining district. For purpose of this section, land is adjoining a district if:\n(a) The boundary of the area proposed for detachment and annexation is the same as the district boundary to which attachment is sought at any point, including corners, or\n(b) The area proposed for detachment and annexation is separated at any point from the district to which annexation is sought by not more than one-half mile and the intervening land is vacant and unoccupied or is owned by one or more of the following: The United States, or the state of Minnesota or any of its political subdivisions, or an owner who is unknown or cannot be found or\n(c) The area proposed by a land owner for detachment and annexation is adjoining, as defined in paragraphs (a) and (b), any land proposed for detachment from and annexation to the same district in another pending petition.\nThe petition must contain:\n(a) A correct description of the area proposed for detachment and annexation, including supporting data regarding location and title to land to establish that the land is adjoining a district.\n(b) The reasons for the proposed change with facts showing that the granting of the petition will not reduce the size of any district to less than four sections, unless the district is not operating a school within the district.\n(c) Consent to the petition, if, at the time of the filing of the petition, any part of the area proposed for detachment is part of a district which maintains and operates a secondary school within the district. Before the hearing, the consent of the board of the district in which the area proposed for detachment lies must be endorsed on the petition.\n(d) An identification of the district to which annexation is sought.\n(e) Other information the petitioners may desire to affix.\n(f) An acknowledgment by the petitioner.\n(g) A description of whether bonded indebtedness will be allocated according to subdivision 6, paragraph (b) or (c).\nThe petition must be filed with the auditor who shall present it to the county board at its next meeting. At the meeting, the county board must fix a time and place for hearing the petition. The hearing shall be not more than 60 nor less than ten days from the date of the meeting. The auditor shall serve notice of the hearing on each district directly affected by the petition, by mail addressed to the clerk. If any area affected by the petition is in another county, the auditor shall mail a notice of hearing to the auditor of such county and shall also give one week's published notice of the hearing in the county in which the hearing is to be held, and ten days' posted notice in each school district affected. Such posted and published notice may combine pending petitions. At the hearing on the petition, the county board must receive and hear any evidence for or against the petition. The hearing may be adjourned from time to time.\nWithin six months of the filing of the petition, the county board must issue its order either granting or denying the petition. If any of the land area described in the petition is included in a plat for consolidation or combination which has been approved by the commissioner, then no order may be issued while consolidation or combination proceedings are pending. No order shall be issued which results in attaching to a district any territory not adjoining that district, as defined in subdivision 1, paragraph (a). No order shall be issued which reduces the size of any district to less than four sections unless the district is not operating a school within the district. The order may have a deferred effective date not later than July 1 immediately following its issuance. If the petition is granted, the auditor shall transmit a certified copy to the commissioner. Failure to issue an order within six months of the filing of the petition or termination of proceedings upon an approved consolidation plat, whichever is later, is a denial of the petition.\nUpon receipt of the order, the commissioner shall modify the records and any plats and petitions and proceedings involving districts affected by such order presently before the commissioner for action or record, to conform to the order.\n(a) Upon the effective date of the order, the detachment and annexation is effected. The bonded indebtedness must be assigned to the detached and annexed land under either paragraph (b) or (c).\n(b) Unless specified separately under paragraph (c), all taxable property in the area so detached and annexed remains taxable for payment of any school purpose obligations already authorized by or outstanding on the effective date of the order against the district from which detached. The order does not relieve such property from the obligation of any bonded debt already incurred to which it was subject prior to the order. All taxable property in the area so detached and annexed is taxable for payment of any district obligations authorized on or subsequent to the effective date of the order by the district to which annexation is made.\n(c) Alternatively, if the school board of the district in which the area is proposed for detachment and the school board of the district in which the area is proposed for annexation agree, all taxable property in the area detached and annexed shall be taxable by the school district to which the property is annexed. Detached and annexed property is relieved from the obligation of any bonded debt already incurred by the district in which the area is detached and is obligated for any bonded debt already incurred by the district to which the area is annexed.",
	"repealed": false
}