{
	"id": "360.59",
	"url": "https://www.revisor.mn.gov/statutes/cite/360.59",
	"title": "360.59 AIRCRAFT REGISTRATION AND LISTING FOR TAXATION.",
	"text": "Every owner of aircraft in this state, except as exempted by sections 360.54 and 360.55, shall, before July 1, in each fiscal year thereafter, or as soon after such date of becoming the owner thereof, file with the commissioner, on a blank provided by the commissioner, a listing for taxation and application for the registration of such aircraft, in such form and stating such information as the commissioner may require. The said owner shall certify that the statements made are correct and true, and any false statement willfully and knowingly made in regard thereto shall be deemed a perjury and punished accordingly. The listing and application for registration by dealers or manufacturers' agents within the state of aircraft received for sale or use within the state shall be accepted as compliance with the requirements of sections 360.54 to 360.67 imposed upon the manufacturer.\nAny act required herein of an owner may be performed in the owner's behalf by a duly authorized agent. Any person having a lien upon, or claim to, any aircraft may pay any tax due thereon to prevent the penalty for delayed registration from accruing, but the registration certificate shall not be issued until legal ownership is definitely determined.\nThe commissioner shall file such application and upon approval thereof and upon payment of the aircraft tax as provided in sections 360.54 to 360.67, together with all arrears and penalties, if any, and upon the delivery to the commissioner of the duly endorsed registration certificate of the former owner, if any, or proof of loss provided in lieu thereof, shall assign to it a distinctive number and issue to the owner a registration certificate which shall contain the name, place of residence, with street and number, if in a city, and post office address of the owner, a specific description of the aircraft, and the number assigned, together with a place on the face of the certificate in which the owner shall immediately upon receipt thereof place the owner's signature and on the reverse side thereof, an assignment and notice of sale or termination of ownership with places for the signature of both seller and purchaser, and a place for assignment of the tax that has been paid. The registration certificate shall be retained by the owner until surrender as herein provided. In the case of listing and registration by manufacturers' agents or dealers of aircraft not using the air space overlying the state of Minnesota and the airports thereof no registration certificate shall be issued, but a duplicate of such list may be retained by the dealer or manufacturer as the registration certificate.\nMS 2004 [Repealed, 2005 c 41 s 21]\nThe commissioner shall approve applications for any aircraft. When an applicant is listing the same aircraft for taxation and registration for the second and succeeding time the registration certificate issued for the prior year need not be delivered to the commissioner; but in case of a transfer or sale the registration certificate therefor issued or proof of loss thereof by sworn statement shall be delivered to the commissioner. The commissioner shall be satisfied from the records that all taxes and fees due hereunder shall have been paid, and endorsements upon said certificate or sworn proof of loss in writing signed by the seller and purchaser, shall furnish proof that the applicant for registration is paying or receiving credit for the tax upon the aircraft of which the applicant is the rightful possessor.\nThe registered owner's right to the registration certificate provided for herein and the right to use the number plates issued therewith shall expire upon the termination of ownership of any person in the aircraft for which the same was issued, and in any event at midnight on June 30 of the fiscal year for which the registration certificate was issued.\nUpon the transfer of ownership; the destruction, theft, or dismantling; or the permanent removal by the owner from this state, of any aircraft registered in accordance with sections 360.511 to 360.67, the right of the owner of the aircraft to use the registration certificate assigned the aircraft expires. The owner shall forthwith return the certificate with transportation prepaid to the commissioner with a signed notice of the date and manner of termination of ownership, giving the name and post office address, with street and number if in a city, of the person to whom transferred. On becoming the owner by gift, trade, or purchase of any aircraft for which a registration certificate has been issued under sections 360.511 to 360.67, a person, including a dealer or manufacturer, shall, within seven days after acquiring ownership, join with the registered owner in transmitting with an application the registration certificate with the assignment and notice of sale duly executed upon the reverse side, or in case of loss of the certificate, with such proof of loss by sworn statements in writing as shall be satisfactory to the commissioner. Upon the transfer of any aircraft by a manufacturer or dealer, for use within the state, whether by sale, lease, or otherwise, the manufacturer or dealer shall, within seven days after the transfer, transmit the transferee's application for registration.\nAll registrations are subject to amendment, suspension, modification, or revocation by the commissioner summarily for any violation of or neglect to comply with sections 360.511 to 360.67. In any case where the proper registration of an aircraft is dependent upon procuring information entailing such delay as to unreasonably deprive the owner of the use of the aircraft, the commissioner may issue a tax receipt conditionally. In any case when revoking a registration for cause, the commissioner has the authority to demand the return of the registration certificate.\nMS 2004 [Repealed, 2005 c 41 s 21]\n(a) Every owner of aircraft in this state when applying for registration, reregistration, or transfer of ownership shall supply any information the commissioner reasonably requires to determine that the aircraft during the period of its contemplated operation is covered by an insurance policy with limits of not less than $100,000 per passenger seat liability both for passenger bodily injury or death and for property damage; not less than $100,000 for bodily injury or death to each nonpassenger in any one accident; and not less than $300,000 per occurrence for bodily injury or death to nonpassengers in any one accident. The insurance must comply with section 60A.081, unless that section is inapplicable under section 60A.081, subdivision 3.\nThe information supplied to the commissioner must include but is not limited to the name and address of the owner, the period of contemplated use or operation, if any, and, if insurance coverage is then presently required, the name of the insurer, the insurance policy number, the term of the coverage, policy limits, and any other data the commissioner requires. No certificate of registration shall be issued pursuant to subdivision 3 in the absence of the information required by this subdivision.\n(b) In the event of cancellation of aircraft insurance by the insurer, the insurer shall notify the Department of Transportation at least ten days prior to the date on which the insurance coverage is to be terminated. Unless proof of a new policy of insurance is filed with the department meeting the requirements of this subdivision during the period of the aircraft's contemplated use or operation, the registration certificate for the aircraft shall be revoked forthwith.\n(c) Nothing in this subdivision shall be construed to require an owner of aircraft to maintain passenger seat liability coverage on aircraft for which an experimental certificate has been issued by the administrator of the Federal Aviation Administration pursuant to Code of Federal Regulations, title 14, sections 21.191 to 21.195 and 91.319, whereunder persons operating the aircraft are prohibited from carrying passengers in the aircraft or for an unmanned aircraft. Whenever the aircraft becomes certificated to carry passengers, passenger seat liability coverage shall be required as provided in this subdivision.\n(d) The requirements of this subdivision shall not apply to any aircraft built by the original manufacturer prior to December 31, 1939, and owned and operated solely as a collector's item, if the owner files an affidavit with the commissioner. The affidavit shall state the owner's name and address, the name and address of the person from whom the aircraft was purchased, the make, year, and model number of the aircraft, the federal aircraft registration number, the manufacturer's identification number, and that the aircraft is owned and operated solely as a collector's item and not for general transportation purposes.\n(e) A small unmanned aircraft system that meets the requirements of section 360.55, subdivision 9, is not subject to the requirements under paragraphs (a) and (b). Owners of small unmanned aircraft systems that meet the requirements of section 360.55, subdivision 9, must, at the time of registration, provide proof of insurability in a form acceptable to the commissioner. Additionally, such operators must maintain records and proof that each flight was insured for the limits established in paragraph (a).",
	"repealed": false
}