{
	"id": "103G.611",
	"url": "https://www.revisor.mn.gov/statutes/cite/103G.611",
	"title": "103G.611 WATER AERATION SAFETY.",
	"text": "(a) The fee for a permit to operate an aeration system on public waters during periods of ice cover is $250. The commissioner may waive the fee for aeration systems that are assisting efforts to maintain angling opportunities through the prevention of winterkill. To be eligible for the fee waiver, the lake being aerated must have public access and aeration must be identified as a desirable management tool in a plan approved by the commissioner. Operation of the aeration system in a manner not consistent with the approved plan represents justification for rescinding the fee waiver. The fee may not be charged to the state or a federal governmental agency applying for a permit. The money received for permits under this subdivision must be deposited in the treasury and credited to the game and fish fund.\n(b) A person operating an aeration system on public waters under a water aeration permit must comply with the sign posting requirements of this section and applicable rules of the commissioner.\nThe commissioner may issue a general permit to a governmental subdivision or to the general public to conduct one or more projects described in subdivision 1. A fee of $100 may be charged for each aeration system used under a general permit.\n(a) If an aeration system is used on the ice of public waters, signs must be posted by the water aeration permittee at a height of from four to six feet in a rectangular pattern at each corner of the open water, and additional signs between the corner signs so that a sign is posted at least every 100 feet.\n(b) Additional signs must be posted by the permittee on the shoreline of the public waters at each public access point and other areas commonly used by the public for access to the lake.\n(c) The signs must comply with the applicable rules of the commissioner.\nAdvance public notice of the commencement of any aeration system, authorized by a water aeration permit from the commissioner during periods of ice cover on public waters, must be given by the permittee. Minimum notice consists of publication of the location and date of commencement of the aeration system in a newspaper of general circulation in the area where the system is proposed to be operated at least two times between five and 60 days before aeration is started.\nIn an action for negligence arising out of the conduct of aeration operations authorized by a water aeration permit from the commissioner during periods of ice cover on public waters, evidence of compliance with the posting and publication requirements of this section and applicable rules and permit provisions of the commissioner are prima facie evidence of the exercise of due care by the permittee.\nThe commissioner shall adopt rules relating to the issuance of permits for aeration, bubbler, water circulation, and similar systems used to increase dissolved oxygen or to maintain open water on the surface of public waters.\n[Repealed, 2006 c 281 art 1 s 24]\nA person who receives a permit to operate an aeration system on a public water without a public access and who owns all of the riparian land or all of the possessory rights to the riparian land around that water is not subject to the provisions of subdivisions 2, paragraph (b), and 3.",
	"repealed": false
}