{
	"id": "465.722",
	"url": "https://www.revisor.mn.gov/statutes/cite/465.722",
	"title": "465.722 SEVERANCE PAY FOR HIGHLY COMPENSATED EMPLOYEES.",
	"text": "For the purposes of this section, the terms defined in this subdivision have the meanings given them.\n(a) \"Local unit of government\" means a statutory or home rule charter city, county, town, school district, metropolitan or regional agency, or other political subdivision.\n(b) \"Wages\" has the meaning provided by section 3401(a) of the Internal Revenue Code of 1986, as amended through December 31, 1992.\n(c) \"Highly compensated employee\" means an employee of a local unit of government with estimated annual wages that:\n(1) are greater than 60 percent of the governor's annual salary; and\n(2) are equal to, or greater than, 80 percent of the estimated annual wages of the second highest paid employee of the local unit of government.\nNotwithstanding any contrary provision of section 465.72, subdivision 1, severance pay for a highly compensated employee includes benefits or compensation with a quantifiable monetary value, that are provided for an employee upon termination of employment and are not part of the employee's annual wages and benefits and are not specifically excluded by this subdivision. Severance pay shall not include payments for accumulated vacation, accumulated sick leave, and accumulated sick leave liquidated to cover the cost of group term insurance provided under section 471.61 to retiring employees. Severance pay for a highly compensated employee does not include payments of periodic contributions by an employer toward premiums for group insurance policies. The severance pay for a highly compensated employee must be excluded from retirement deductions and from any calculations of retirement benefits. Severance pay for a highly compensated employee must be paid in a manner mutually agreeable to the employee and the governing body of the local unit of government over a period not to exceed five years from retirement or termination of employment. If a retired or terminated employee dies before all or a portion of the severance pay has been disbursed, the balance due must be paid to a named beneficiary or, lacking one, to the deceased's estate. Except as provided in subdivision 3, severance pay provided for a highly compensated employee leaving employment may not exceed an amount equivalent to six months of wages.\nSeverance pay for a highly compensated employee may exceed an amount equivalent to six months of wages if:\n(1) the severance pay benefit is included in an employment contract between the employee and the local unit of government that is in effect on August 1, 1993, and the termination of employment occurs before the expiration date of said contract;\n(2) the severance pay is part of an early retirement incentive offer approved by the governing body of the local unit of government and the same early retirement incentive offer is also made available to all other employees of the local unit of government who meet generally defined criteria relative to age or length of service;\n(3) the governing body of a local unit of government adopts a resolution certifying that:\n(i) the highly compensated employee was a full-time employee of the local unit of government for the entire period between January 1, 1983, and December 31, 1992;\n(ii) the highly compensated employee was covered by one or more employment contracts or agreements which entitled the employee to specified severance pay benefits throughout the entire ten-year period specified in clause (i);\n(iii) the employment contract or agreement in effect on December 31, 1992, will, at the time of the employee's separation from employment with the local unit of government, result in a severance payment that exceeds the limits specified in subdivision 2; and\n(iv) the amount of severance pay that exceeds the limits specified in subdivision 2 was based on a commitment to provide the employee with a specified severance guarantee in lieu of a higher level of some other form of compensation; or\n(4) the commissioner of management and budget has determined a position within a specific local unit of government requires special expertise necessitating a larger severance pay guarantee to attract or retain a qualified person. The commissioner shall develop a process for the governing body of a local unit of government to use when applying for an exemption under this clause. The commissioner shall review each proposed exemption giving due consideration to severance pay guarantees that are made to other persons with similar responsibilities in the state and nation.\nNothing in this subdivision shall be deemed to allow total severance payments for a highly compensated employee that exceed the limits established in section 465.72.\nNotwithstanding section 13.43, subdivision 2, any payment to a highly compensated employee for settling disputed claims, whether or not the claims have been filed, or any payment to a highly compensated employee for terminating a written employment contract, must be approved by the governing body of the local unit of government during a public meeting. The financial terms of a payment made pursuant to this subdivision must be made public at the meeting. The effective date of the governing body's approval of a payment made pursuant to this subdivision shall be 15 days after the date of the public meeting. The governing body of a local unit of government approving a payment pursuant to this subdivision, or the employee to whom the payment is to be made, may rescind or reject the payment, prior to the effective date of the governing body's approval.",
	"repealed": false
}