{
	"id": "86B.33",
	"url": "https://www.revisor.mn.gov/statutes/cite/86B.33",
	"title": "86B.33 OPERATING WHILE IMPAIRED.",
	"text": "For purposes of this section, \"controlled substance,\" \"intoxicating substance,\" and \"motorboat in operation\" have the meanings given under section 169A.03.\n(a) An owner or other person having charge or control of a motorboat must not authorize or allow an individual the person knows or has reason to believe is under the influence of alcohol, a controlled substance, or an intoxicating substance to operate the motorboat in operation on waters of the state.\n(b) A person who operates or is in physical control of a motorboat on waters of the state is subject to chapter 169A.\n(c) The provisions of chapters 169A, 171, and 609 relating to revoking, suspending, or canceling a driver's license, an instruction permit, or a nonresident operating privilege for alcohol, controlled substance, or intoxicating substance violations apply to motorboat operators and to operating privileges for motorboats.\n(d) The commissioner of public safety must notify a person of the period during which the person is prohibited from operating a motorboat under section 169A.52, 169A.54, or 171.177.\n(e) The court must promptly forward to the commissioner of public safety copies of all convictions and criminal and civil sanctions imposed under chapter 169A and section 171.177.\n(f) If the person operating or in physical control of a motorboat is a program participant in the ignition interlock device program described in section 171.306, the motorboat may be operated only if it is equipped with an approved ignition interlock device and all requirements of section 171.306 are satisfied. For purposes of this paragraph, \"program participant\" and \"ignition interlock device\" have the meanings given in section 171.306, subdivision 1.\n(a) A person who violates subdivision 2, paragraph (a), or an ordinance conforming with subdivision 2, paragraph (a), is guilty of a misdemeanor.\n(b) A person who operates a motorboat during the period the person is prohibited from operating a motorboat under subdivision 2, paragraph (d), is guilty of a misdemeanor.",
	"repealed": false
}