{
	"id": "270C.67",
	"url": "https://www.revisor.mn.gov/statutes/cite/270C.67",
	"title": "270C.67 LEVY AND DISTRAINT.",
	"text": "If any tax payable to the commissioner or to the department is not paid when due, such tax may be collected by the commissioner within five years after the date of assessment of the tax, or if a lien has been filed, during the period the lien is enforceable, or if the tax judgment has been filed, within the statutory period of enforcement of a valid tax judgment, by a levy upon all property and rights to property, including any property in the possession of law enforcement officials, of the person liable for the payment or collection of such tax or property on which there is a lien provided in section 270C.63. For this purpose, \"tax\" includes any penalty, interest, and costs, properly payable.\nA levy under this section is not enforceable against:\n(1) a purchaser with respect to tangible personal property purchased at retail in the ordinary course of the seller's trade or business, unless at the time of purchase the purchaser intends the purchase to or knows the purchase will hinder, evade, or defeat the collection of a tax; or\n(2) the personal property listed as exempt in (i) Minnesota Statutes 2022, section 550.37, and (ii) sections 550.38 and 550.39.\nThe term \"levy\" includes the power of distraint and seizure by any means; provided, no entry can be made upon the business premises or residence of a taxpayer in order to seize property without first obtaining a writ of entry listing the property to be seized and signed by a judge of the district court of the district in which the business premises or residence is located.\nBefore a levy is made, notice and demand for payment of the amount due must be given to the person liable for the payment or collection of the tax at least 30 days prior to the levy. The notice required under this subdivision must be sent to the taxpayer's last known address and must include a brief statement that sets forth in simple and nontechnical terms:\n(1) the administrative appeals available to the taxpayer with respect to the levy and sale; and\n(2) the alternatives available to the taxpayer that can prevent a levy, including installment payment agreements under section 270C.52, subdivision 2.\nIn making the execution of the levy and in collecting the taxes due, the commissioner shall have all of the powers provided in chapter 550 and in any other law for purposes of effecting an execution against property in this state. The sale of property levied upon, and the time and manner of redemption therefrom, shall, to the extent not provided in sections 270C.7101 to 270C.7109, be governed by chapter 550. The seal of the court, subscribed by the court administrator, as provided in section 550.04, shall not be required. The levy for collection of taxes may be made whether or not the commissioner has commenced a legal action for collection of such taxes.\n(a) Where a jeopardy assessment or any other assessment has been made by the commissioner, the property seized for collection of the tax shall not be sold until the time has expired for filing an appeal of the assessment with the Tax Court pursuant to chapter 271. If an appeal has been filed, no sale shall be made unless the taxes remain unpaid for a period of more than 30 days after final determination of the appeal by the Tax Court or by the appropriate judicial forum.\n(b) Notwithstanding paragraph (a), seized property may be sold if:\n(1) the taxpayer consents in writing to the sale; or\n(2) the commissioner determines that the property is perishable or may become greatly reduced in price or value by keeping, or that such property cannot be kept without great expense.\n(c) The Tax Court has jurisdiction to review a determination made under paragraph (b), clause (2). Review is commenced by motion of the commissioner or the taxpayer. The order of the court in response to the motion is reviewable in the same manner as any other decision of the Tax Court.\nWhere a levy has been made to collect taxes pursuant to this section and the property seized is properly included in a formal proceeding commenced under sections 524.3-401 to 524.3-505 and maintained under full supervision of the court, such property shall not be sold until the probate proceedings are completed or until the court so orders.\nThe property seized shall be returned by the commissioner if the owner gives a surety bond equal to the appraised value of the owner's interest in the property, as determined by the commissioner, or deposits with the commissioner security in such form and amount as the commissioner deems necessary to insure payment of the liability, but not more than twice the liability.\nNotwithstanding any other provision to the contrary, if a levy or sale pursuant to this section would irreparably injure rights in property which the court determines to be superior to rights of the state in such property, the district court may grant an injunction to prohibit the enforcement of such levy or to prohibit such sale.\nAny action taken by the commissioner pursuant to this section shall not constitute an election by the state to pursue a remedy to the exclusion of any other remedy.\nAfter the commissioner has seized the property of any person, that person may, upon giving 48 hours notice to the commissioner and to the court, bring a claim for equitable relief before the district court for the release of the property to the taxpayer upon such terms and conditions as the court may deem equitable.\nIf any tax payable to the commissioner or to the department is not paid as provided in subdivision 3, the commissioner may, within the time periods provided in subdivision 1 for collection of taxes, delegate the authority granted by subdivision 1, by means of issuing a warrant to the sheriff of any county of the state commanding the sheriff, as agent for the commissioner, to levy upon and sell the real and personal property of the person liable for the payment or collection of the tax and to levy upon the rights to property of that person within the county, or to levy upon and seize any property within the county on which there is a lien provided in section 270C.63, and to return the warrant to the commissioner and pay to the commissioner the money collected by virtue thereof by a time to be therein specified not less than 60 days from the date of the warrant. The sheriff shall proceed thereunder to levy upon and seize any property of the person and to levy upon the rights to property of the person within the county (except the person's homestead or that property which is exempt from execution pursuant to Minnesota Statutes 2022, section 550.37), or to levy upon and seize any property within the county on which there is a lien provided in section 270C.63. For purposes of the preceding sentence, \"tax\" includes any penalty, interest, and costs, properly payable. The sheriff shall then sell so much of the property levied upon as is required to satisfy the taxes, interest, and penalties, together with the sheriff's costs; but the sales, and the time and manner of redemption therefrom, shall, to the extent not provided in sections 270C.7101 to 270C.7109, be governed by Minnesota Statutes 2022, chapter 550. The proceeds of the sales, less the sheriff's costs, shall be turned over to the commissioner, who shall then apply the proceeds as provided in section 270C.7108.\nNotwithstanding section 52.12, a levy by the commissioner made pursuant to the provisions of this section upon a taxpayer's funds on deposit in a financial institution located in this state, shall have priority over any unexercised right of setoff of the financial institution to apply the levied funds toward the balance of an outstanding loan or loans owed by the taxpayer to the financial institution. A claim by the financial institution that it exercised its right to setoff prior to the levy by the commissioner must be substantiated by evidence of the date of the setoff, and shall be verified by the sworn statement of a responsible corporate officer of the financial institution. Furthermore, for purposes of determining the priority of any levy made under this section, the levy shall be treated as if it were an execution made pursuant to chapter 550.\nAny person in possession of (or obligated with respect to) property or rights to property subject to levy upon which a levy has been made who, upon demand by the commissioner, surrenders the property or rights to property (or who pays a liability under section 270C.70, subdivision 1) shall be discharged from any obligation or liability to the person liable for the payment or collection of the delinquent tax with respect to the property or rights to property so surrendered or paid.\nNotwithstanding any other provision of law to the contrary, the notice of any levy authorized by this section may be served by mail or by delivery by an agent of the department.\nNo levy may be made on property if the amount of the expenses that the commissioner estimates would be incurred by the department with respect to the levy and sale of the property exceeds the fair market value of the property at the anticipated time of levy.\nNo levy may be made on the property of a person on the day on which the person, or an officer or employee of the person, is required to appear in response to a subpoena issued by the commissioner to collect unpaid taxes, unless the commissioner determines that the collection of the tax is in jeopardy.",
	"repealed": false
}