{
	"id": "97A.133",
	"url": "https://www.revisor.mn.gov/statutes/cite/97A.133",
	"title": "97A.133 STATE WILDLIFE MANAGEMENT AREAS.",
	"text": "State wildlife management areas are established and designated as provided under this section. State wildlife management areas are located and named as indicated in this section.\n2000 c 485 s 16\nThe consolidated conservation lands included in state wildlife management areas are subject to the payment in lieu of tax as provided in section 477A.12, subdivision 1, clause (1).\n2000 c 485 s 16; 2017 c 40 art 1 s 10\n(a) On lands acquired by the state under chapter 84A that are designated after January 1, 1986, as wildlife management areas, the commissioner shall, by January 15, 2004, identify, designate, and sign at least 90 miles of all-terrain vehicle trails, not including public roads that are maintained and open to travel by other noncommercial vehicles, in corridors of disturbance that:\n(1) the commissioner determines are appropriate to connect trails, forest roads established under section 89.71, subdivision 1, and public highways to provide reasonable travel for all-terrain vehicles; or\n(2) are areas of historic all-terrain vehicle use, including trails that end within a wildlife management area.\nThe designated trails must be either within or contiguous to the wildlife management areas. The commissioner shall consult with wildlife management area users, including both motorized and nonmotorized trail users, in identifying and designating trails under this paragraph. Trail establishment must be in compliance with other state and federal law. Local governments and other trail sponsors may propose the designation of trails, including the designation as a grant-in-aid trail for the purposes of funding under section 84.927, subdivision 2. Designation of trails by the commissioner, authorized under this subdivision, shall be by written order published in the State Register. Designations are not subject to the rulemaking provisions of chapter 14 and section 14.386 does not apply.\n(b) The following roads shall be open to travel by all-terrain vehicles when the roads are open to other noncommercial vehicles:\n(1) the Rapid River Forest Road, beginning at the west boundary of the Red Lake Wildlife Management Area at the southwest corner of Section 7, Township 156 North, Range 35 West, Beltrami County, thence in an easterly and northeasterly direction through the Red Lake Wildlife Management Area to the east boundary of the Red Lake Wildlife Management Area at the southwest corner of Section 7, Township 157 North, Range 33 West, Lake of the Woods County;\n(2) the Blanchard Forest Road, beginning at the junction of the North Shore Road along the northern shore of Upper Red Lake and the Blanchard State Forest Road at the west section line of Section 30, Township 155 North, Range 31 West, Beltrami County, thence in a westerly direction to the west section line of Section 31, Township 155 North, Range 32 West;\n(3) the Moose River Forest Road, beginning at the junction of Dick's Parkway State Forest Road and the Moose River State Forest Road at the southwest corner of Section 31, Township 36 West, Range 158 North, thence in a westerly direction along the Moose River State Forest Road to the junction of Beltrami County Road 706; and\n(4) the existing west access road to the Moose River dike, which is included in meeting the required all-terrain vehicle trail mileage specified in paragraph (a).\n(c) The commissioner shall sign each road and trail designated under this subdivision indicating the motorized uses allowed.\n(d) During the regular firearms deer season, on all wildlife management area lands within the area described in paragraph (e), a person licensed to take deer may operate an all-terrain vehicle:\n(1) before legal shooting hours;\n(2) after legal shooting hours; and\n(3) from 11:00 a.m. to 2:00 p.m.\n(e) Paragraph (d) applies from where State Highway No. 1 intersects the west boundary of the Red Lake Indian Reservation, then west to State Highway No. 219, then north on State Highway No. 219 to State Highway No. 89, then north on State Highway No. 89 to County Highway No. 6, then east on County Highway No. 6 to County Highway No. 54 and County Highway No. 1 (Beltrami/Marshall county line) then north along the Beltrami/Marshall county line to Roseau county line, then east on Beltrami/Roseau county line to Dick's Parkway, then south on Dick's Parkway to County Road No. 704, Beltrami County, then south to County State-Aid Highway No. 44 to Fourtown, then south on State Highway No. 89 to the north boundary of the Red Lake Indian Reservation, then west and south following the boundary of the Red Lake Indian Reservation to where it intersects State Highway No. 1.\n(f) For the purposes of this subdivision, \"corridors of disturbance\" means rights-of-way such as ditches, ditch banks, transmission lines, pipelines, permanent roads, winter roads, and recreational trails. The existence of a corridor of disturbance eligible for corridor designation may be demonstrated by physical evidence, document recorded in the office of the county recorder or other public official, aerial survey, or other evidence similar to the above. Cross-country motorized use of land shall not cause that land to be considered a corridor of disturbance.\n2000 c 485 s 16; 2002 c 353 s 1; 2004 c 221 s 38\nAgder Wildlife Management Area, Marshall County.\n2000 c 485 s 16,21,27\nAitkin Wildlife Management Area, Aitkin County.\n2000 c 485 s 16,21,27; 2001 c 206 s 11\nBear Creek Wildlife Management Area, Roseau County.\n2000 c 485 s 16,27; 2002 c 353 s 4\nBenville Wildlife Management Area, Beltrami County.\n2000 c 485 s 16,21,27\nBorder Wildlife Management Area, Roseau County.\n2000 c 485 s 16,27; 2002 c 353 s 4\nCarmalee Wildlife Management Area, Beltrami County.\n2000 c 485 s 16,21,27; 2002 c 353 s 4\nCarp Swamp Wildlife Management Area, Lake of the Woods County.\n2000 c 485 s 16,21,27\nCedar Wildlife Management Area, Marshall County.\n2000 c 485 s 16,21,27\nCedarbend Wildlife Management Area, Roseau County.\n2000 c 485 s 16,27; 2002 c 353 s 4\nClear River Wildlife Management Area, Roseau County.\n2000 c 485 s 16,27; 2002 c 353 s 4\nEast Branch Wildlife Management Area, Roseau County.\n2000 c 485 s 16,27; 2002 c 353 s 4\nEast Park Wildlife Management Area, Marshall County.\n2000 c 485 s 16,27; 2002 c 353 s 4\nEckvoll Wildlife Management Area, Marshall County.\n2000 c 485 s 16,21,27\nElm Lake Wildlife Management Area, Marshall County.\n2000 c 485 s 16,21,27; 2002 c 353 s 4\nEnstrom Wildlife Management Area, Roseau County.\n2000 c 485 s 16,27; 2002 c 353 s 4\nEspelie Wildlife Management Area, Marshall County.\n2000 c 485 s 16,21,27; 2002 c 353 s 4\nFireweed Wildlife Management Area, Beltrami County.\n2000 c 485 s 16,27; 2002 c 353 s 4\nFoote Wildlife Management Area, Mahnomen County.\n2000 c 485 s 16,21,27\nFour Mile Bay Wildlife Management Area, Lake of the Woods County.\n2000 c 485 s 16,21,27\nGolden Valley Wildlife Management Area, Roseau County.\n2000 c 485 s 16,27; 2002 c 353 s 4\nGraceton Wildlife Management Area, Lake of the Woods County.\n2000 c 485 s 16,21,27\nGrayling Marsh Wildlife Management Area, Aitkin County.\n2000 c 485 s 16,21,27\nGrygla Wildlife Management Area, Marshall County.\n2000 c 485 s 16,21,27; 2002 c 353 s 4\nGun Dog Wildlife Management Area, Beltrami County.\n2000 c 485 s 16,21,27; 2002 c 353 s 4\nHamre Wildlife Management Area, Beltrami County.\n2000 c 485 s 16,21,27\nHayes Wildlife Management Area, Roseau County.\n2000 c 485 s 16,27; 2002 c 353 s 4\nHill Lake Wildlife Management Area, Aitkin County.\n2001 c 206 s 9\nHuntly Wildlife Management Area, Marshall County.\n2000 c 485 s 16,27; 2002 c 353 s 4\nKillian Wildlife Management Area, Mahnomen County.\n2000 c 485 s 16,21,27\nKimberly Wildlife Management Area, Aitkin County.\n2000 c 485 s 16,21,27\nLarry Bernhoft Wildlife Management Area, Lake of the Woods County.\n2000 c 485 s 16,21,27\nLee Wildlife Management Area, Beltrami County.\n2000 c 485 s 16,21,27; 2002 c 353 s 4; 2004 c 262 art 2 s 15 subd 1\nLittle Willow Wildlife Management Area, Aitkin County.\n2000 c 485 s 16,21,27\nMarbel Wildlife Management Area, Roseau County.\n2000 c 485 s 16,21,27\nMcGregor Marsh Wildlife Management Area, Aitkin County.\n2000 c 485 s 16,21,27\nMoose River Wildlife Management Area, Beltrami County.\n2000 c 485 s 16,21,27; 2002 c 353 s 4\nMoylan Wildlife Management Area, Marshall County.\n2000 c 485 s 16,21,27; 2002 c 353 s 4\nNereson Wildlife Management Area, Roseau County.\n2000 c 485 s 16,27; 2002 c 353 s 4\nNew Maine Wildlife Management Area, Marshall County.\n2000 c 485 s 16,27; 2002 c 353 s 4\nPalmville Wildlife Management Area, Marshall and Roseau Counties.\n2000 c 485 s 16,21,27; 2002 c 353 s 4\nProsper Wildlife Management Area, Lake of the Woods County.\n2000 c 485 s 16,21,27\nRed Lake Wildlife Management Area, Beltrami County.\n2000 c 485 s 16,21,27; 1Sp2003 c 13 s 12; 2004 c 262 art 2 s 15 subd 2\nRobert Wickstrom Wildlife Management Area, Aitkin County.\n2000 c 485 s 16,21,27\nRocky Point Wildlife Management Area, Lake of the Woods County.\n2000 c 485 s 16,21,27\nRoseau Lake Wildlife Management Area, Roseau County.\n2000 c 485 s 16,21,27; 2011 c 98 s 9\nRosver Wildlife Management Area, Roseau County.\n2000 c 485 s 16,27; 2002 c 353 s 4\nSalo Wildlife Management Area, Aitkin County.\n2000 c 485 s 16,21,27\nSaw-Whet Wildlife Management Area, Beltrami County.\n2000 c 485 s 16,21,27; 2002 c 353 s 4; 2004 c 262 art 2 s 15 subd 3\nSem Wildlife Management Area, Marshall County.\n2000 c 485 s 16,21,27; 2002 c 353 s 4\nSharp Wildlife Management Area, Marshall County.\n2000 c 485 s 16,27; 2002 c 353 s 4\nSkime Wildlife Management Area, Roseau County.\n2000 c 485 s 16,21,27; 2002 c 353 s 4\nSnowshoe Wildlife Management Area, Marshall County.\n2000 c 485 s 16,27; 2002 c 353 s 4\nSouth Shore Wildlife Management Area, Lake of the Woods and Roseau Counties.\n2000 c 485 s 16,21,27; 2002 c 353 s 4\nSpooner Wildlife Management Area, Lake of the Woods County.\n2000 c 485 s 16,21,27\nThief Lake Wildlife Management Area, Marshall County.\n2000 c 485 s 16,21,27; 2002 c 353 s 4\nValley Wildlife Management Area, Marshall County.\n2000 c 485 s 16,27; 2002 c 353 s 4\nVanose Wildlife Management Area, Mahnomen County.\n2000 c 485 s 16,21,27\nWabun Wildlife Management Area, Mahnomen County.\n2000 c 485 s 16,21,27\nWannaska Wildlife Management Area, Roseau County.\n2000 c 485 s 16,27; 2002 c 353 s 4\nWapiti Wildlife Management Area, Beltrami County.\n2000 c 485 s 16,21,27; 2002 c 353 s 4\nWillow Run Wildlife Management Area, Beltrami County.\n2000 c 485 s 16,21,27; 2002 c 353 s 4\nWillowsippi Wildlife Management Area, Aitkin County.\n2000 c 485 s 16,21,27\nWolf Trail Wildlife Management Area, Beltrami County.\n2000 c 485 s 16,21,27; 2002 c 353 s 4\nVermillion Highlands Wildlife Management Area, Dakota County.\n2007 c 57 art 1 s 82,168",
	"repealed": false
}