{
	"id": "327A.02",
	"url": "https://www.revisor.mn.gov/statutes/cite/327A.02",
	"title": "327A.02 STATUTORY WARRANTIES.",
	"text": "In every sale of a completed dwelling, and in every contract for the sale of a dwelling to be completed, the vendor shall warrant to the vendee that:\n(a) during the one-year period from and after the warranty date the dwelling shall be free from defects caused by faulty workmanship and defective materials due to noncompliance with building standards;\n(b) during the two-year period from and after the warranty date, the dwelling shall be free from defects caused by faulty installation of plumbing, electrical, heating, and cooling systems due to noncompliance with building standards; and\n(c) during the ten-year period from and after the warranty date, the dwelling shall be free from major construction defects due to noncompliance with building standards.\nThe statutory warranties provided in this section shall survive the passing of legal or equitable title in the dwelling to the vendee.\nThe statutory warranties provided in this section are not affected by the dissolution of a vendor or home improvement contractor that is a corporation or limited liability company.\n(a) In a sale or in a contract for the sale of home improvement work involving major structural changes or additions to a residential building, the home improvement contractor shall warrant to the owner that:\n(1) during the one-year period from and after the warranty date the home improvement shall be free from defects caused by faulty workmanship and defective materials due to noncompliance with building standards; and\n(2) during the ten-year period from and after the warranty date the home improvement shall be free from major construction defects due to noncompliance with building standards.\n(b) In a sale or in a contract for the sale of home improvement work involving the installation of plumbing, electrical, heating or cooling systems, the home improvement contractor shall warrant to the owner that, during the two-year period from and after the warranty date, the home improvement shall be free from defects caused by the faulty installation of the system or systems due to noncompliance with building standards.\n(c) In a sale or in a contract for the sale of any home improvement work not covered by paragraph (a) or (b), the home improvement contractor shall warrant to the owner that, during the one-year period from and after the warranty date, the home improvement shall be free from defects caused by faulty workmanship or defective materials due to noncompliance with building standards.\n(a) The vendee or owner must allow an inspection for purposes of the preparation of an offer to repair the alleged loss or damage under subdivision 5. The inspection must be performed by the vendor or home improvement contractor within 30 days of the notification under section 327A.03, clause (a). Any damage to property caused as a result of an inspection must be promptly repaired by the inspecting party to restore the property to its preinspected condition.\n(b) The applicable statute of limitations and statute of repose for an action based on breach of a warranty imposed by this section, or any other action in contract, tort, or other law for any injury to real or personal property or bodily injury or wrongful death arising out of the alleged loss or damage, is tolled from the date the written notice provided by the vendee or owner is postmarked, or if not sent through the mail, received by the vendor or home improvement contractor until the latest of the following:\n(1) the date of completion of the home warranty dispute resolution process under section 327A.051; or\n(2) 180 days.\n(c) Upon completion of repairs as described in an offer to repair, the vendor must provide the vendee with a list of the repairs made and a notice that the vendee may have a right to pursue a warranty claim under this chapter. Provision of this statement is not an admission of liability. Compliance with this subdivision does not affect any rights of the vendee under this chapter.\n(a) Within 15 days of completion of the inspection required by subdivision 4, the vendor or home improvement contractor must provide to the vendee or owner a written offer to repair. The offer to repair must include, at a minimum:\n(1) the scope of the proposed repair work; and\n(2) the proposed date on which the repair work would begin and the estimated date of completion.\n(b) This subdivision does not prevent the vendee or owner from obtaining the information in paragraph (a) from another contractor or from negotiating with the vendor or home improvement contractor for a different scope of work.\n(c) If the parties agree to a scope of work, the vendor or home improvement contractor must perform the repair work in accordance with the offer to repair. If the parties do not agree to a scope of work, the vendee or owner must submit the matter to the homeowner warranty dispute resolution process under section 327A.051.\n(d) Upon completion of repairs described in an offer to repair, the vendor or home improvement contractor must provide the vendee or owner with a written notice that the scope of the work agreed upon has been completed.\nIf the vendor or home improvement contractor fails to perform an inspection under subdivision 4 or fails to make an offer to repair or perform agreed upon repairs under subdivision 5, the vendee or owner may commence an action.\nExcept as provided in subdivision 6, a cause of action for which the statute of limitations or statute of repose is tolled under subdivision 4, paragraph (b), must not be commenced in district court until the earlier of:\n(1) the completion of the home warranty dispute resolution process under section 327A.051; or\n(2) 60 days after the written offer of repair is provided to the vendee or owner.",
	"repealed": false
}