{
	"id": "48A.15",
	"url": "https://www.revisor.mn.gov/statutes/cite/48A.15",
	"title": "48A.15 STATE BANKS AND TRUST COMPANIES; TRUST SERVICE OFFICES.",
	"text": "(a) A trust company organized under the laws of this state or a state bank and trust may, after completing the notification procedure required by this subdivision, establish and maintain a trust service office at any office in this state or of any other state or national bank. A state bank may, after completing the notification procedure required by this subdivision, permit a trust company organized under the laws of this state or a state bank and trust or a national bank in this state that is authorized to exercise trust powers to establish and maintain a trust service office at any of its banking offices.\n(b) The trust company or state bank and trust and a state bank at which a trust service office is to be established according to this section shall jointly file, on forms provided by the commissioner, a notification of intent to establish a trust service office. The notification must be accompanied by a filing fee of $100 payable to the commissioner, to be deposited in the financial institutions account under section 46.131, subdivision 11. No trust service office shall be established according to this section if disallowed by order of the commissioner within 30 days of the filing of a complete and acceptable notification of intent to establish a trust service office. An order of the commissioner to disallow the establishment of a trust service office under this section is subject to judicial review under sections 14.63 to 14.69.\nThe trust company or bank and trust that establishes a trust service office under this section may conduct at the office any trust business and business incidental to the trust business that it is permitted to conduct at its principal office. It may not accept deposits except as incidental to the trust business.\n(a) If the bank at which a trust service office is to be established has exercised trust powers, then the trust company or bank and trust that is establishing the trust service office shall enter into an agreement respecting those fiduciary powers to which the trust company or bank and trust shall succeed and shall file the agreement with the commissioner.\n(b) The trust company or bank and trust that is establishing a trust service office under this section shall publish a notice of the filing in the form prescribed by the commissioner in a newspaper published in the municipality in which the trust service office is to be located, and if there is no such newspaper, then in a qualified newspaper likely to give notice in the municipality in which the proposed trust service office is to be located. The trust company or bank and trust shall file proof of publication of the notice with the commissioner immediately after the notice is published.\n(c) After filing and publication, the trust company or bank and trust establishing the trust service office shall, as of the date the office first opens for business, succeed to and be substituted for the bank at which the trust service office is located as to all fiduciary powers, rights, duties, privileges, and liabilities of the bank in its capacity as fiduciary for all estates, trusts, conservatorships, guardianships, and other fiduciary relationships of which the bank is then serving as fiduciary, except as may be otherwise specified in the agreement between the bank and the trust company or bank and trust which has established the trust service office.\n(d) The trust company or bank and trust that has established the trust service office shall also be considered named as fiduciary in all writings, including, but not limited to, wills, trusts, court orders, and similar documents and instruments, naming the bank at which the trust service office is located signed before the date the trust service office first opens for business, unless expressly negated by the writing or otherwise specified in the agreement between the trust company or bank and trust and the bank at which the trust service office is located.\n(e) On the effective date of the substitution, the bank at which the trust service office has been established is released and absolved from all fiduciary duties and obligations under the writings and shall discontinue its exercise of trust powers on all matters not specifically retained by the agreement. This subdivision does not absolve the bank from liabilities arising out of a breach of fiduciary duty or obligation occurring before the date the trust service office first opens for business.\n(f) This subdivision does not affect the authority, duties, or obligations of a bank with respect to relationships that may be established without trust powers, whether the relationships arise before or after the establishment of the trust service office.\nA trust company or state bank and trust establishing and operating one or more trust service offices according to this section shall at all times maintain records acceptable to the commissioner regarding transactions originating at the trust service offices and available at its principal office for examination according to sections 46.04 and 46.05.\nIf a trust service office is established by a national bank at the banking office of another national bank, then the agreement respecting fiduciary powers required by subdivision 3 must be filed with the comptroller of the currency of the United States and the notice required by subdivision 3 must be in the form prescribed by the comptroller of the currency.\nNot less than 60 days before the effective date of the proposed substitution under subdivision 3 or 5, the parties to the substitution shall send written notice of the proposed substitution to each cofiduciary, each surviving settlor of a trust, each conservatee or ward under a conservatorship or guardianship, each person who alone or in conjunction with others has the power to remove the fiduciary being substituted, and each adult beneficiary currently receiving or entitled to receive a distribution of principal or income from a trust or estate with respect to which the substitution is to be effected. Intentional failure to send the notice to a party at the party's current address as shown on the fiduciary's records makes the substitution of fiduciaries ineffective with respect to the fiduciary relationship. An unintentional failure to give notice does not impair the validity or effect of any substitution of fiduciaries under subdivision 3 or 5. A trust company or bank that is substituted or about to be substituted as fiduciary with respect to a trust, estate, conservatorship, or guardianship under subdivision 3 or 5 may be removed as fiduciary, or the substitution may be denied, upon petition by a cofiduciary, by a beneficiary of a trust or estate, by the settlor of a trust, or on behalf of a conservatee or ward under a conservatorship or guardianship if the trust company or bank files a written consent to its removal or a written declination to act, or if the court having jurisdiction over the fiduciary relationship, upon notice and hearing, approves the petition as in the best interests of the petitioner and all other parties interested in the trust, estate, conservatorship, or guardianship. This section applies in addition to any applicable provision for removal of a fiduciary or appointment of a successor fiduciary in any other statute or in the instrument creating the fiduciary relationship.",
	"repealed": false
}