{
	"id": "149A.97",
	"url": "https://www.revisor.mn.gov/statutes/cite/149A.97",
	"title": "149A.97 PRENEED ARRANGEMENTS.",
	"text": "It is the intent of the legislature that this section be construed as a limitation upon the manner in which a funeral provider is permitted to accept funds in prepayment of funeral services or burial site services to be performed in the future or in prepayment of funeral or burial goods to be used in connection with the final disposition of human remains. It is further intended to allow members of the public to arrange and pay for funeral goods, funeral services, burial site goods, or burial site services for themselves and their families in advance of need while at the same time providing all possible safeguards so that the prepaid funds cannot be dissipated, whether intentionally or not, so as to be available for the payment of the services and goods selected.\nThis section shall not apply to a transportation protection agreement or to any funeral goods or burial site goods purchased and delivered, either at purchase or within a commercially reasonable amount of time thereafter. When prior to the death of any person, that person or another, on behalf of that person, enters into any transaction, makes a contract, or any series or combination of transactions or contracts with a funeral provider lawfully doing business in Minnesota, other than an insurance company licensed to do business in Minnesota selling approved insurance or annuity products, by the terms of which, goods or services related to the final disposition of that person will be furnished at-need, then the total of all money paid by the terms of the transaction, contract, or series or combination of transactions or contracts shall be held in trust for the purpose for which it has been paid. The person for whose benefit the money was paid shall be known as the beneficiary, the person or persons who paid the money shall be known as the purchaser, and the funeral provider shall be known as the depositor.\nExcept as provided in this section, nothing in this section shall abate the rights, duties, and powers granted under chapters 501C and 520. A trust created for the holding of preneed arrangement funds shall be revocable, in its entirety, unless specifically limited by the person purchasing the preneed funeral goods, funeral services, burial site goods, or burial site services. If the purchaser chooses to limit the revocability of the trust funds, the limitation must be declared in the trust instrument and must be limited to an amount equivalent to the allowable Supplemental Security Income asset exclusion used for determining eligibility for public assistance at the time the trust is created.\nIt is unlawful for any person residing or doing business in this state to enter a preneed funeral agreement unless the agreement:\n(1) is written in clear, understandable language and printed in a type that is easy to read in size and style;\n(2) contains a complete, itemized description of the funeral goods, funeral services, burial site goods, or burial site services selected or purchased, including, when appropriate, manufacturer's name, model numbers, style numbers, and description of the type of material used in construction;\n(3) discloses clearly and conspicuously whether the prices of the goods and services selected are guaranteed;\n(4) discloses that funding options for a preneed funeral agreement consist of either prepayment to the funeral provider or the purchase of an insurance policy;\n(5) discloses whether the funds received from the purchaser are required to be placed in a trust and, if the funds are required to be placed in a trust, provides the following information:\n(i) lists the location of the trust account, including the name, address, and telephone number of the institution where the money will be held and any identifying account numbers, the amount of money to be trusted, and the names of the trustees; and\n(ii) advises the purchaser as to the disposition of the interest from the trust and as to responsibility for taxes owed on the interest;\n(6) contains the names, addresses, and telephone numbers of the Minnesota Department of Health as the regulatory agency for preneed trust accounts and the Minnesota Attorney General's Office as the regulatory agency that handles consumer complaints;\n(7) discloses clearly and conspicuously that any person who makes payment under a preneed funeral agreement may cancel the agreement subject to the procedures for cancellation specified in subdivision 6a;\n(8) contains the following statement, in boldfaced type and a minimum size of ten points:\n\"Within 15 calendar days after receipt of any money required to be held in trust, all such money must be deposited in a banking institution, savings association, or credit union, organized under state or federal laws, the accounts of which are insured by an instrumentality of the federal government. The person for whose benefit the money was paid according to this agreement shall be known as the beneficiary; the person or persons who paid the money shall be known as the purchaser; and the funeral provider shall be known as the depositor. The money must be carried in a separate account with the names of the depositor and the purchaser as trustees for the beneficiary.\nThe preneed arrangement trust shall be considered an asset of the purchaser until the death of the beneficiary. At the death of the beneficiary, the money in the trust shall be considered an asset of the beneficiary's estate, to the extent that the value of the trust exceeds the actual value for the goods and services provided at-need. This does not alter any asset exclusion requirements that exist under federal law. The depositor as trustee must disclose in writing the location of the trust account, including the name and address of the institution where the money is being held and any identifying account numbers, to the beneficiary when the money is deposited and when there are any subsequent changes to the location of the trust account.\";\n(9) for agreements with revocable trusts, contains the following statement, in boldfaced type and a minimum size of ten points:\n\"REVOCABLE TRUST:\nThe preneed arrangement trust being created by the purchaser is revocable. These trust funds, including all principal and accrued interest, are the purchaser's assets. The purchaser may withdraw the principal and accrued interest at any time prior to the death of the beneficiary. At the death of the beneficiary, the funds shall be distributed in their entirety, principal plus accrued interest, with no fees retained by the trustees as administrative fees. The funds shall be distributed for the payment of the at-need funeral goods, funeral services, burial site goods, or burial site services selected, with any excess funds distributed to the beneficiary's estate. At any time before or at the time of the beneficiary's death, the purchaser may transfer the preneed arrangements and related trust funds for use in the payment of funeral goods, funeral services, burial site goods, or burial site services. The purchaser may not be charged any fee in connection with the transfer of a preneed arrangement and trust funds.\";\n(10) for agreements with irrevocable trusts, contains the following statement, in boldfaced type and a minimum size of ten points:\n\"IRREVOCABLE TRUST:\nA trust created to hold preneed arrangement funds is revocable in its entirety unless specifically limited by the purchaser. The purchaser has chosen to create an irrevocable trust in the amount of $ (insert the dollar amount of the purchaser's irrevocable trust). The revocable portion of this trust fund is limited to that amount that exceeds the allowable Supplemental Security Income asset exclusion used for determining eligibility for public assistance at the time the trust is created. The principal and accrued interest may not be withdrawn from the trust prior to the beneficiary's death, except to the extent that the trust funds exceed the irrevocable trust limitation. At the time of the beneficiary's death, the funds shall be distributed in their entirety, principal plus accrued interest, with no fees retained by the trustees as administrative fees. The funds shall be distributed for the payment of the at-need funeral goods, funeral services, burial site goods, or burial site services selected, with any excess funds distributed to the beneficiary's estate. At any time prior to or at the time of the beneficiary's death, the purchaser may transfer the preneed arrangements and trust funds for use in the payment of funeral goods, funeral services, burial site goods, or burial site services. The purchaser may not be charged any fee in connection with the transfer of a preneed arrangement and trust funds.\";\n(11) provides that if the particular funeral goods, funeral services, burial site goods, or burial site services specified in the agreement are unavailable at the time of delivery, the funeral provider must furnish goods and services similar in style and at least equal in quality to the material and workmanship of the goods or services specified and that the representative of the beneficiary has the right to choose the goods or services to be substituted; and\n(12) contains an itemization of the sale of grave lots, spaces, lawn crypts, niches, or mausoleum crypts separate from all other goods and services selected.\nThe purchaser, regardless of whether the funds held in trust are designated revocable or irrevocable, retains the right to designate the trustee. At any time prior to the death of the beneficiary, the purchaser may designate a different trustee. Upon the death of the beneficiary, subject to section 149A.80, the rights of the purchaser vest in the individual with the legal right to control the disposition of the remains of the beneficiary. The depositor as trustee shall not have the right or power to designate another trustee prior to the death of the beneficiary or subsequent to such death.\nFuneral providers are prohibited from assessing finance charges on preneed arrangements.\nWithin 15 calendar days after receipt of any money required to be held in trust, all of the money must be deposited in a banking institution, savings or building and loan association, or credit union, organized under state or federal laws, the accounts of which are insured by an instrumentality of the federal government. The money must be carried in a separate account with the name of the depositor and the purchaser as trustees for the beneficiary. The depositor as trustee shall not have power to distribute funds, either principal or interest, from the account until the death of the beneficiary, subject to section 149A.80. For purposes of this section, distribute does not mean transferring the trust funds to different investment accounts within an institution or between institutions provided that the depositor as trustee does not have sole access to the funds in a negotiable form. This section shall be construed to limit the depositor's access to trust funds, in a negotiable form, prior to the death of a beneficiary. The preneed arrangements trust shall be considered an asset of the purchaser until the death of the beneficiary, whereupon the money shall be considered an asset of the estate of the beneficiary, to the extent that the value of the trust exceeds the actual value for the goods and services provided at-need. The location of the trust account, including the name and address of the institution in which the money is being held and any identifying account numbers, must be disclosed in writing to the beneficiary by the depositor as trustee at the time the money is deposited and when there are any subsequent changes to the location of the trust account. The depositor shall annually report to the beneficiary the amount of funds in the beneficiary's preneed arrangement trust account, including principal and accrued interest. The depositor may arrange for the banking institution, savings or building and loan association, or credit union to issue such reports. Upon the provision of any funeral or burial site goods or services in connection with a preneed arrangement, the depositor shall provide a statement itemizing the goods or services provided and cost of such goods or services and describing the disposition of all funds in the account.\nThe funds held in trust, including principal and accrued interest, may be distributed prior to the death of the beneficiary upon demand by the purchaser as specified in subdivision 6a, to the extent that the trust is designated revocable. At the death of the beneficiary and with satisfactory proof of death provided to the institution holding the trust funds, the funds, including principal and accrued interest, may be distributed by either the depositor as trustee or the purchaser as trustee, subject to section 149A.80. The funds shall be distributed in their entirety, with no fees to be retained by the trustees as administrative fees. The funds shall be distributed for the payment of the actual at-need value of the funeral goods, funeral services, burial site goods, or burial site services selected with any excess funds distributed to the estate of the decedent.\n(a) If a purchaser cancels an agreement for an irrevocable trust for preneed arrangements at any time before midnight of the third business day after the date of the agreement, the purchaser shall receive a refund of all consideration paid according to the agreement. The refund must be distributed to the purchaser within 15 business days following receipt by the funeral provider of the cancellation notice from the purchaser.\n(b) If the purchaser cancels an agreement for a revocable trust for preneed arrangements at any time after the date of the agreement, all funds held in a revocable trust, including all principal and accrued interest, must be distributed to the purchaser within 15 business days following receipt by the funeral provider of the cancellation notice.\n(c) Cancellation is evidenced by the purchaser giving written notice of cancellation to the funeral provider at the address provided in the agreement. Notice of cancellation, if given by mail, is effective upon deposit in a mailbox, properly addressed to the funeral provider and postage prepaid. Notice of cancellation need not take any specific form and is sufficient if it indicates, by any form of written expression, the intention of the purchaser not to be bound by the agreement.\nEvery funeral provider lawfully doing business in Minnesota that accepts funds under subdivision 2 must make a complete annual report to the commissioner. The reports may be on forms provided by the commissioner or substantially similar forms containing, at least, identification and the state of each trust account, including all transactions involving principal and accrued interest, and must be filed by March 31 of the calendar year following the reporting year along with a filing fee of $25 for each report. Fees shall be paid to the commissioner of management and budget, state of Minnesota, for deposit in the state government special revenue fund in the state treasury. Reports must be signed by an authorized representative of the funeral provider and notarized under oath. All reports to the commissioner shall be reviewed for account inaccuracies or possible violations of this section. If the commissioner has a reasonable belief to suspect that there are account irregularities or possible violations of this section, the commissioner shall report that belief, in a timely manner, to the state auditor or other state agencies as determined by the commissioner. The commissioner may require a funeral provider reporting preneed trust accounts under this section to arrange for and pay an independent third-party auditing firm to complete an audit of the preneed trust accounts every other year. The funeral provider shall report the findings of the audit to the commissioner by March 31 of the calendar year following the reporting year. This report is in addition to the annual report. The commissioner shall also file an annual letter with the state auditor disclosing whether or not any irregularities or possible violations were detected in review of the annual trust fund reports filed by the funeral providers. This letter shall be filed with the state auditor by May 31 of the calendar year following the reporting year.\n[Repealed, 1Sp2003 c 1 art 2 s 136]\nEvery funeral provider lawfully doing business in Minnesota that accepts funds under subdivision 2 must create and maintain on its premises or other business location in Minnesota an accurate record of every trust fund established with the funeral provider as trustee. The record must contain the following information:\n(1) the names of the purchaser, beneficiary, and depositor;\n(2) the date, location, identifying account numbers, and amount of the funds originally deposited;\n(3) any subsequent changes to the location of the account, identifying account number, or trustee designation;\n(4) the date, amount, and payee of any distributions from the account; and\n(5) all supporting documentation, including a copy of the original trust agreement, copies of any contracts for the purchase of preneed goods and services, and any other appropriate documentation.\nRecords required under subdivision 9 shall be maintained for a period of three calendar years after the release of the trust funds. Following this period and subject to any other laws requiring retention of records, the funeral provider may then place the records in storage or reduce them to microfilm, microfiche, laser disc, or any other method that can produce an accurate reproduction of the original record, for retention for a period of ten calendar years from the date of release of the trust funds. At the end of this period and subject to any other laws requiring retention of records, the funeral provider may destroy the records by shredding, incineration, or any other manner that protects the privacy of the individuals identified.\nData on individuals collected and maintained under subdivision 7 are private data on individuals as defined in section 13.02, subdivision 12. Section 13.10 applies to data on decedents collected under subdivision 7.\nAny violation of this section is grounds for disciplinary action pursuant to sections 149A.04 to 149A.10.",
	"repealed": false
}