{
	"id": "462A.223",
	"url": "https://www.revisor.mn.gov/statutes/cite/462A.223",
	"title": "462A.223 MINNESOTA HOUSING FINANCE AGENCY; DESIGNATED AGENCY.",
	"text": "The agency is designated as a housing credit agency with authority to provide low-income housing credits for projects involving qualified nonprofit organizations under sections 501(c)(3) and 501(c)(4) of the Internal Revenue Code of 1986. The agency shall provide the ten percent minimum amount of the state ceiling required by section 42 of the Internal Revenue Code of 1986 for application to such projects.\nThe agency is designated as a housing credit agency to allocate the portion of the state ceiling for low-income housing tax credits (1) not reserved to cities and counties under section 462A.222; (2) not accepted for allocation by eligible cities and counties; (3) returned to the agency for allocation; and (4) not otherwise reserved to the agency for allocation under subdivision 1. Low-income housing tax credits shall be allocated by the agency as provided in section 462A.222. The agency shall make no allocation for projects located within the jurisdiction of the cities or counties that have received tax credits under section 462A.222, subdivision 1, except from the percentage set-aside for projects involving a qualified nonprofit organization as provided under section 42 of the Internal Revenue Code of 1986, as amended through December 31, 1989, until the amounts reserved to the cities and counties for allocation have been allocated or committed or returned to the agency for allocation. In order that all of a project's credits are allocated by a single allocating agency, the agency may apportion additional tax credits to a city or county that has received tax credits under section 462A.222, subdivision 1, for a project that has already received a commitment or allocation of tax credits from an eligible city or county, if all of the tax credits reserved to the eligible city or county have been committed or allocated. A city or county that has received tax credits under section 462A.222, subdivision 1, may apportion tax credits to the agency for a project located within the jurisdiction of the city or county.\nIn order to assist the Minnesota Housing Finance Agency to comply with the reporting requirements of section 42 of the Internal Revenue Code of 1986, as amended, cities and counties to which low-income housing tax credits are reserved under section 462A.222, subdivision 1, shall submit required documents relating to compliance, allocation or commitment, carryover, issuance, and audit or review and shall return unused tax credits to the Minnesota Housing Finance Agency by the deadlines established in the agency's qualified allocation plan. Cities and counties to which low-income housing tax credits are reserved under section 462A.222 that fail to meet the deadlines established by the agency for the submission of required documents relating to allocation or commitment, carryover, issuance, and allocation reporting shall pay the fees established in the agency's qualified allocation plan. Pursuant to the qualified allocation plan, the agency may waive fees imposed for failure to meet the deadlines for submission of required documents.\nThe agency may review the allocation and compliance monitoring processes established by a city or county to which low-income tax credits are reserved under section 462A.222, subdivision 1, and may review documentation related to the allocations made to and the compliance monitoring of projects allocated credits from a city or county to which low-income tax credits are reserved under section 462A.222, subdivision 1.",
	"repealed": false
}