{
	"id": "62Q.78",
	"url": "https://www.revisor.mn.gov/statutes/cite/62Q.78",
	"title": "62Q.78 DENTAL BENEFIT PLAN REQUIREMENTS.",
	"text": "(a) A dental organization that uses utilization profiling as a method of differentiating provider reimbursement or as a requirement for continued participation in the organization's provider network shall, upon request, make available to participating dentists the following information:\n(1) a description of the methodology used in profiling so that dentists can clearly understand why and how they are affected; and\n(2)(i) a list of the codes measured; (ii) a dentist's personal frequency data within each code so that the accuracy of the data can be verified; and (iii) an individual dentist's representation of scoring compared to classification points and how the dentist compares with peers in each category including the cutoff point of the score impacting qualification in order to inform the dentist about how the dentist may qualify or retain qualification for differentiated provider reimbursement or continued participation in the dental organization's provider network.\n(b) A dental organization that uses utilization profiling as a method of differentiating provider reimbursement or as a requirement for continued participation in the organization's provider network shall, upon request, provide a clear and concise description of the methodology of the utilization profiling on dental benefits to group purchasers and enrollees.\n(c) A dental organization shall not be considered to be engaging in the practice of dentistry pursuant to chapter 150A, to the extent it releases utilization profiling information as required by sections 62Q.76 to 62Q.79.\n(a) Unless the federal government requires the use of other procedural codes, for all dental care services in which a procedural code is used by the dental organization to determine coverage or reimbursement, the organization must use the most recent American Dental Association current dental terminology code that is available, within a year of its release. Current dental terminology codes must be used as specifically defined, must be listed separately, and must not be altered or changed by either the dentist or the dental organization.\n(b) Enrollee benefits must be determined on the basis of individual codes subject to provider and group contracts.\n(c) This subdivision does not prohibit or restrict dental organizations from setting reimbursement and pricing with groups, purchasers, and participating providers or addressing issues of fraud or errors in claims submissions.\nNo contractual provision between a dental organization and a dentist shall in any way prohibit or limit a dentist from discussing all clinical options for treatment with the patient.\nAn amendment or change in terms of an existing contract between a dental organization and a dentist must be disclosed to the dentist at least 90 days before the effective date of the proposed change.\n(a) A dental organization that conducts audits of dental providers shall:\n(1) provide a written explanation to the dental provider of the reason for the audit and the process the dental organization intends to use to audit patient charts, as well as a written explanation of the processes available to the provider once the dental organization completes its review of the audited patient records; and\n(2) allow the provider a reasonable period of time from the date that the provider receives the verified audit or investigation findings to review, meet, and negotiate a resolution to the audit or investigation.\n(b) If a dental organization conducts a provider audit, the dental organization must use a licensed dentist whose license is in good standing to review patient charts.\n(a) No contract of any dental plan or dental organization that covers any dental services or dental provider agreement with a dentist may require, directly or indirectly, that a dentist provide services to an enrolled participant at a fee set by, or at a fee subject to the approval of, the dental plan or dental organization unless the dental services are covered services.\n(b) A dental plan or dental organization or other person providing third-party administrator services shall not make available any providers in its dentist network to a plan that sets dental fees for any services except covered services.\n(c) \"Covered services\" means dental care services for which a reimbursement is available under an enrollee's plan contract, or for which a reimbursement would be available but for the application of contractual limitations such as deductibles, co-payments, coinsurance, waiting periods, annual or lifetime maximums, frequency limitations, alternative benefit payments, or any other limitation.\nA dental provider contract must include a method of payment for dental care services in which no fees associated with the method of payment, including credit card fees and fees related to payment in the form of digital or virtual currency, are incurred by the dentist or dental clinic. Any fees that may be incurred from a payment must be disclosed to a dentist prior to entering into or renewing a dental provider contract. For purposes of this section, fees related to a provider's electronic claims processing vendor, financial institution, or other vendor used by a provider to facilitate the submission of claims are excluded.\n(a) A dental organization may grant a third party access to a dental provider contract or a provider's dental care services or contractual discounts provided pursuant to a dental provider contract if, at the time the dental provider contract is entered into or renewed, the dental organization allows a dentist to choose not to participate in third-party access to the dental provider contract, without any penalty to the dentist. The third-party access provision of the dental provider contract must be clearly identified. A dental organization must not grant a third party access to the dental provider contract of any dentist who does not participate in third-party access to the dental provider contract.\n(b) Notwithstanding paragraph (a), if a dental organization exists solely for the purpose of recruiting dentists for dental provider contracts that establish a network to be leased to third parties, the dentist waives the right to choose whether to participate in third-party access.\n(c) A dental organization may grant a third party access to a dental provider contract, or a dentist's dental care services or contractual discounts under a dental provider contract, if the following requirements are met:\n(1) the dental organization lists all third parties that may have access to the dental provider contract on the dental organization's website, which must be updated at least once every 90 days;\n(2) the dental provider contract states that the dental organization may enter into an agreement with a third party that would allow the third party to obtain the dental organization's rights and responsibilities as if the third party were the dental organization, and the dentist chose to participate in third-party access at the time the dental provider contract was entered into; and\n(3) the third party accessing the dental provider contract agrees to comply with all applicable terms of the dental provider contract.\n(d) A dentist is not bound by and is not required to perform dental care services under a dental provider contract granted to a third party in violation of this section.\n(e) This subdivision does not apply when:\n(1) the dental provider contract is for dental services provided under a public health plan program, including but not limited to medical assistance, MinnesotaCare, Medicare, or Medicare Advantage; or\n(2) access to a dental provider contract is granted to a dental organization, an entity operating in accordance with the same brand licensee program as the dental organization or other entity, or to an entity that is an affiliate of the dental organization, provided the entity agrees to substantially similar terms and conditions as the originating dental provider contract between the dental organization and the dentist or dental clinic. A list of the dental organization's affiliates must be posted on the dental organization's website.",
	"repealed": false
}