{
	"id": "245I.09",
	"url": "https://www.revisor.mn.gov/statutes/cite/245I.09",
	"title": "245I.09 CLIENT FILES.",
	"text": "(a) A license holder must maintain a file for each client that contains the client's current and accurate records. The license holder must store each client file on the premises where the license holder provides or coordinates services for the client. The license holder must ensure that all client files are readily accessible for the commissioner's review. The license holder is not required to keep client files in a single location.\n(b) The license holder must protect client records against loss, tampering, or unauthorized disclosure of confidential client data according to the Minnesota Government Data Practices Act, chapter 13; the privacy provisions of the Minnesota health care programs provider agreement; the Health Insurance Portability and Accountability Act of 1996 (HIPAA), Public Law 104-191; and the Minnesota Health Records Act, sections 144.291 to 144.298.\nA license holder must retain client records of a discharged client for a minimum of five years from the date of the client's discharge. A license holder who closes a program must retain a client's records for a minimum of five years from the date that the license holder stopped providing services to the client and must notify the commissioner of the location of the client records and the name of the individual responsible for storing and maintaining the client records.\nA license holder must retain a clear and complete record of the information that the license holder receives regarding a client, and of the services that the license holder provides to the client. If applicable, each client's file must include the following information:\n(1) the client's screenings, assessments, and testing;\n(2) the client's treatment plans and reviews of the client's treatment plan;\n(3) the client's individual abuse prevention plans;\n(4) the client's health care directive under section 145C.01, subdivision 5a, and the client's emergency contacts;\n(5) the client's crisis plans;\n(6) the client's consents for releases of information and documentation of the client's releases of information;\n(7) the client's significant medical and health-related information;\n(8) a record of each communication that a staff person has with the client's other mental health providers and persons interested in the client, including the client's case manager, family members, primary caregiver, legal representatives, court representatives, representatives from the correctional system, or school administration;\n(9) written information by the client that the client requests to include in the client's file; and\n(10) the date of the client's discharge from the license holder's program, the reason that the license holder discontinued services for the client, and the client's discharge summaries.",
	"repealed": false
}