{
	"id": "144A.473",
	"url": "https://www.revisor.mn.gov/statutes/cite/144A.473",
	"title": "144A.473 ISSUANCE OF TEMPORARY LICENSE AND LICENSE RENEWAL.",
	"text": "(a) The department shall review each application to determine the applicant's knowledge of and compliance with Minnesota home care regulations. Before granting a temporary license or renewing a license, the commissioner may further evaluate the applicant or licensee by requesting additional information or documentation or by conducting an on-site survey of the applicant to determine compliance with sections 144A.43 to 144A.482.\n(b) Within 14 calendar days after receiving an application for a license, the commissioner shall acknowledge receipt of the application in writing. The acknowledgment must indicate whether the application appears to be complete or whether additional information is required before the application will be considered complete.\n(c) Within 90 days after receiving a complete application, the commissioner shall issue a temporary license, renew the license, or deny the license.\n(d) The commissioner shall issue a license that contains the home care provider's name, address, license level, expiration date of the license, and unique license number. All licenses, except for temporary licenses issued under subdivision 2, are valid for up to one year from the date of issuance.\n(a) For new license applicants, the commissioner shall issue a temporary license for either the basic or comprehensive home care level. A temporary license is effective for up to one year from the date of issuance, except that a temporary license may be extended according to subdivision 3. Temporary licensees must comply with sections 144A.43 to 144A.482.\n(b) During the temporary license period, the commissioner shall survey the temporary licensee within 90 calendar days after the commissioner is notified or has evidence that the temporary licensee is providing home care services.\n(c) Within five days of beginning the provision of services, the temporary licensee must notify the commissioner that it is serving clients. The notification to the commissioner may be mailed or emailed to the commissioner at the address provided by the commissioner. If the temporary licensee does not provide home care services during the temporary license period, then the temporary license expires at the end of the period and the applicant must reapply for a temporary home care license.\n(d) A temporary licensee may request a change in the level of licensure prior to being surveyed and granted a license by notifying the commissioner in writing and providing additional documentation or materials required to update or complete the changed temporary license application. The applicant must pay the difference between the application fees when changing from the basic level to the comprehensive level of licensure. No refund will be made if the provider chooses to change the license application to the basic level.\n(e) If the temporary licensee notifies the commissioner that the licensee has clients within 45 days prior to the temporary license expiration, the commissioner may extend the temporary license for up to 60 days in order to allow the commissioner to complete the on-site survey required under this section and follow-up survey visits.\n(a) If the temporary licensee is in substantial compliance with the survey, the commissioner shall issue either a basic or comprehensive home care license. If the temporary licensee is not in substantial compliance with the survey, the commissioner shall either: (1) not issue a license and terminate the temporary license; or (2) extend the temporary license for a period not to exceed 90 days and apply conditions, as permitted under section 144A.475, subdivision 2, to the extension of a temporary license. If the temporary licensee is not in substantial compliance with the survey within the time period of the extension, or if the temporary licensee does not satisfy the license conditions, the commissioner may deny the license.\n(b) If the temporary licensee whose basic or comprehensive license has been denied or extended with conditions disagrees with the conclusions of the commissioner, then the temporary licensee may request a reconsideration by the commissioner or commissioner's designee. The reconsideration request process must be conducted internally by the commissioner or commissioner's designee, and chapter 14 does not apply.\n(c) The temporary licensee requesting reconsideration must make the request in writing and must list and describe the reasons why the temporary licensee disagrees with the decision to deny the basic or comprehensive home care license or the decision to extend the temporary license with conditions.\n(d) The reconsideration request and supporting documentation must be received by the commissioner within 15 calendar days after the date the temporary licensee receives the correction order.\n(e) A temporary licensee whose license is denied is permitted to continue operating as a home care provider during the period of time when:\n(1) a reconsideration request is in process;\n(2) an extension of a temporary license is being negotiated;\n(3) the placement of conditions on a temporary license is being negotiated; or\n(4) a transfer of home care clients from the temporary licensee to a new home care provider is in process.\n(f) A temporary licensee whose license is denied must comply with the requirements for notification and transfer of clients in section 144A.475, subdivision 5.",
	"repealed": false
}