{
	"id": "342.13",
	"url": "https://www.revisor.mn.gov/statutes/cite/342.13",
	"title": "342.13 LOCAL CONTROL.",
	"text": "(a) A local unit of government may not prohibit the possession, transportation, or use of cannabis flower, cannabis products, lower-potency hemp edibles, or hemp-derived consumer products authorized under this chapter.\n(b) Except as provided in section 342.22, a local unit of government may not prohibit the establishment or operation of a cannabis business or hemp business licensed under this chapter.\n(c) A local unit of government may adopt reasonable restrictions on the time, place, and manner of the operation of a cannabis business provided that such restrictions do not prohibit the establishment or operation of cannabis businesses. A local unit of government may prohibit the operation of a cannabis business within 1,000 feet of a school, or 500 feet of a day care, residential treatment facility, or an attraction within a public park that is regularly used by minors, including a playground or athletic field.\n(d) The office shall work with local units of government to:\n(1) develop model ordinances for reasonable restrictions on the time, place, and manner of the operation of a cannabis business;\n(2) develop standardized forms and procedures for the issuance of a retail registration pursuant to section 342.22; and\n(3) develop model policies and procedures for the performance of compliance checks required under section 342.22.\n(e) If a local unit of government is conducting studies or has authorized a study to be conducted or has held or has scheduled a hearing for the purpose of considering adoption or amendment of reasonable restrictions on the time, place, and manner of the operation of a cannabis business, the governing body of the local unit of government may adopt an interim ordinance applicable to all or part of its jurisdiction for the purpose of protecting the planning process and the health, safety, and welfare of its citizens. Before adopting the interim ordinance, the governing body must hold a public hearing. The interim ordinance may regulate, restrict, or prohibit the operation of a cannabis business within the jurisdiction or a portion thereof until January 1, 2025.\n(f) Within 30 days of receiving a copy of an application from the office, a local unit of government shall certify on a form provided by the office whether a proposed cannabis business complies with local zoning ordinances and, if applicable, whether the proposed business complies with the state fire code and building code. The office may not issue a license if the local unit of government informs the office that the cannabis business does not meet local zoning and land use laws. If the local unit of government does not provide the certification to the office within 30 days of receiving a copy of an application from the office, the office may issue a license.\n(g) The office by rule shall establish an expedited complaint process to receive, review, and respond to complaints made by a local unit of government about a cannabis business. At a minimum, the expedited complaint process shall require the office to provide an initial response to the complaint within seven days and perform any necessary inspections within 30 days. Nothing in this paragraph prohibits a local unit of government from enforcing a local ordinance. If a local unit of government notifies the office that a cannabis business other than a cannabis retailer, cannabis microbusiness or cannabis mezzobusiness with a retail operations endorsement, lower-potency hemp edible retailer, or medical cannabis combination business operating a retail location poses an immediate threat to the health or safety of the public, the office must respond within one business day and may take any action described in section 342.19 or 342.21.\n(h) A local government unit that issues a cannabis retailer registration under section 342.22 may, by ordinance, limit the number of licensed cannabis retailers, cannabis mezzobusinesses with a retail operations endorsement, and cannabis microbusinesses with a retail operations endorsement to no fewer than one registration for every 12,500 residents.\n(i) If a county has one active registration for every 12,500 residents, a city or town within the county is not obligated to register a cannabis business.\n(j) Nothing in this section shall prohibit a local government unit from allowing licensed cannabis retailers in excess of the minimums set in paragraph (h).\n(k) Notwithstanding the foregoing provisions, the state shall not issue a license to any cannabis business to operate in Indian country, as defined in United States Code, title 18, section 1151, of a Minnesota Tribal government without the consent of the Tribal government.",
	"repealed": false
}