{
	"id": "151.471",
	"url": "https://www.revisor.mn.gov/statutes/cite/151.471",
	"title": "151.471 THIRD-PARTY LOGISTICS PROVIDER REQUIREMENTS.",
	"text": "Each third-party logistics provider shall comply with the requirements set forth in United States Code, title 21, sections 360eee to 360eee-4, that are applicable to third-party logistics providers.\n(a) The board shall license third-party logistics providers in a manner that is consistent with United States Code, title 21, section 360eee-3, and the regulations promulgated thereunder. In the event that the provisions of this section or of the rules of the board conflict with the provisions of United States Code, title 21, section 360eee-3, or the rules promulgated thereunder, the federal provisions shall prevail. The board shall not license a person as a third-party logistics provider unless the person is operating as such.\n(b) No person shall act as a third-party logistics provider without first obtaining a license from the board and paying any applicable fee specified in section 151.065.\n(c) Application for a third-party logistics provider license under this section shall be made in a manner specified by the board.\n(d) No license shall be issued or renewed for a third-party logistics provider unless the applicant agrees to operate in a manner prescribed by federal and state law and according to the rules adopted by the board.\n(e) No license may be issued or renewed for a third-party logistics provider facility that is located in another state unless the applicant supplies the board with proof of licensure or registration by the state in which the third-party logistics provider facility is physically located or by the United States Food and Drug Administration.\n(f) The board shall require a separate license for each third-party logistics provider facility located within the state and for each third-party logistics provider facility located outside of the state from which drugs are shipped into the state or to which drugs are reverse distributed.\n(g) The board shall not issue an initial or renewed license for a third-party logistics provider facility unless the facility passes an inspection conducted by an authorized representative of the board or is inspected and accredited by an accreditation program approved by the board. In the case of a third-party logistics provider facility located outside of the state, the board may require the applicant to pay the cost of the inspection, in addition to the license fee in section 151.065, unless the applicant furnishes the board with a report, issued by the appropriate regulatory agency of the state in which the facility is located, of an inspection that has occurred within the 24 months immediately preceding receipt of the license application by the board, or furnishes the board with proof of current accreditation. The board may deny licensure unless the applicant submits documentation satisfactory to the board that any deficiencies noted in an inspection report have been corrected.\n(h) As a condition for receiving and retaining a third-party logistics provider facility license issued under this section, an applicant shall satisfy the board that it:\n(1) has adequate storage conditions and facilities to allow for the safe receipt, storage, handling, and transfer of drugs;\n(2) has minimum liability and other insurance as may be required under any applicable federal or state law;\n(3) has a functioning security system that includes an after-hours central alarm or comparable entry detection capability, and security policies and procedures that include provisions for restricted access to the premises, comprehensive employee applicant screening, and safeguards against all forms of employee theft;\n(4) will maintain appropriate records of the handling of drugs, which shall be kept for a minimum of two years and be made available to the board upon request;\n(5) employs principals and other persons, including officers, directors, primary shareholders, and key management executives, who will at all times demonstrate and maintain their capability of conducting business in conformity with state and federal law, at least one of whom will serve as the primary designated representative for each licensed facility and who will be responsible for ensuring that the facility operates in a manner consistent with state and federal law;\n(6) will ensure that all personnel have sufficient education, training, and experience, in any combination, so that they may perform assigned duties in a manner that maintains the quality, safety, and security of drugs;\n(7) will provide the board with updated information about each third-party logistics provider facility to be licensed by the board;\n(8) will develop and, as necessary, update written policies and procedures that ensure reasonable preparation for, protection against, and handling of any facility security or operation problems, including but not limited to those caused by natural disaster or government emergency, inventory inaccuracies or drug shipping and receiving, outdated drugs, appropriate handling of returned goods, and drug recalls;\n(9) will have sufficient policies and procedures in place for the inspection of all incoming and outgoing drug shipments;\n(10) will operate in compliance with all state and federal requirements applicable to third-party logistics providers; and\n(11) will meet the requirements for inspections found in this subdivision.\n(i) An agent or employee of any licensed third-party logistics provider need not seek licensure under this section. Paragraphs (j) and (k) apply to third-party logistics provider personnel.\n(j) The board is authorized to and shall require fingerprint-based criminal background checks of facility managers or designated representatives. The criminal background checks shall be conducted as provided in section 214.075. The board shall use the criminal background check data received to evaluate the qualifications of persons for ownership of or employment by a licensed third-party logistics provider and shall not disseminate this data except as allowed by law.\n(k) A licensed third-party logistics provider shall not have as a facility manager or designated representative any person who has been convicted of any felony for conduct relating to wholesale distribution, any felony violation of United States Code, title 21, section 331, subsection (i) or (k), or any felony violation of United States Code, title 18, section 1365, relating to product tampering.",
	"repealed": false
}