{
	"id": "86B.401",
	"url": "https://www.revisor.mn.gov/statutes/cite/86B.401",
	"title": "86B.401 WATERCRAFT LICENSES.",
	"text": "(a) A person may apply to the commissioner, the commissioner of public safety, or an authorized deputy registrar of motor vehicles to license a watercraft in a format prescribed by the commissioner.\n(b) The application must state the names and addresses of all owners of the watercraft.\nA person who applies for a watercraft license may be issued a temporary license certificate to operate the watercraft. The temporary license certificate is valid for 21 days.\n(a) The license agent shall register the watercraft on receiving an application and the license fee. A license and registration sticker with a registration number shall be issued and must be affixed to the watercraft as prescribed by the commissioner of natural resources.\n(b) A license includes aquatic invasive species affirmation as provided in section 84D.106. The aquatic invasive species affirmation portion of the license must be on board or available with the signed license certificate. The aquatic invasive species affirmation will be provided with an application for a new, transfer, duplicate, or renewal watercraft license.\n(c) The license is not valid unless signed by at least one owner.\n(d) Failure to complete the aquatic invasive species affirmation in this subdivision is subject to the penalty prescribed in section 84D.13, subdivision 5.\nEach watercraft must be assigned a license number. The license number assigned a watercraft may remain the same even if not renewed in consecutive years. The owner of a watercraft must purchase the watercraft license numbers assigned and affix the license numbers as prescribed by the commissioner.\nA watercraft license is valid for three calendar years or a portion of the three-year period beginning in the calendar year the license is issued. The watercraft license expires on December 31 of the last calendar year of the license period.\nWatercraft licenses may be renewed in the same manner as applying for the original license.\nIf the address of an owner of a licensed watercraft changes so that it does not conform with the address on the watercraft license, the owner must notify the commissioner in writing by 30 days after the address change occurs on a form prescribed by the commissioner.\n(a) An owner of a watercraft must provide written notice to the commissioner on a form prescribed by the commissioner by 15 days after abandonment, destruction, or a change in ownership of a licensed watercraft.\n(b) A change in ownership does not include the transfer of a security interest.\n(c) After a change of ownership:\n(1) the new owners are subject to the penalties imposed by this chapter if they fail to give notice as required by this subdivision; and\n(2) the commissioner shall terminate the license without further action for failure to give the notice of ownership change.\n(d) A notice of ownership change must be accompanied by the duplicate license fee. The commissioner shall issue a duplicate license on receipt of the notice of ownership change and the duplicate license fee.\nThe commissioner shall issue a duplicate watercraft license if an owner provides to the commissioner an affidavit of loss or destruction of the watercraft license previously issued and pays the duplicate license fee.\nA new license may not be issued for a watercraft that has previously been issued a watercraft license by this state unless:\n(1) a notice of abandonment of the watercraft has been given at least one year before the date of application for the license; or\n(2) the application is accompanied by satisfactory proof that the watercraft has been continually outside this state at least one year before the date of the application.\n[Repealed, 1996 c 385 art 2 s 8]\n(a) A person applying for initial licensing of a watercraft must provide a receipt, invoice, or other document to prove that:\n(1) the sales and use tax under chapter 297A was paid;\n(2) the purchase was exempt from tax under chapter 297A; or\n(3) the watercraft was purchased from a retailer that is maintaining a place of business in this state as defined in section 297A.66, subdivision 1, and is a dealer.\n(b) The commissioner or authorized deputy registrars, acting as agents of the commissioner of revenue under an agreement between the commissioner and the commissioner of revenue, as provided in section 297A.825:\n(1) must collect use tax from the applicant if the applicant does not provide the proof required under paragraph (a); and\n(2) are authorized to issue refunds of use tax paid to them in error.\n(c) Section 86B.415, subdivision 11, does not apply to refunds under this subdivision.\n(a) The owner of a watercraft built before July 1, 1959, that is used solely as a collector's item may affix any license numbers and decals that are required for the watercraft by section 86B.301, subdivision 1, and rules adopted pursuant to that section so that the numbers and decals are readily detachable.\n(b) The authority issuing a permit under section 86B.121 for any exhibit, regatta, or boat parade held on the waters of this state may exempt a collector watercraft from displaying the license numbers and decals required by section 86B.301, subdivision 1, during the duration of the event. The authority may also exempt the collector watercraft from any equipment and operational requirements and any license requirements in section 86B.301 for the duration of the event.",
	"repealed": false
}