{
	"id": "453A.01",
	"url": "https://www.revisor.mn.gov/statutes/cite/453A.01",
	"title": "453A.01 INTENT.",
	"text": "Sections 453A.01 to 453A.12 are intended to provide a means for those Minnesota cities which now or hereafter own and operate a utility pursuant to law for the local distribution of gas to secure, by individual action or joint action among themselves or by contract with other public or private entities within or outside the state, an adequate, economical, and reliable supply of gas. To accomplish this purpose it is necessary for such cities to have power, by agreement between or among two or more of their number, to create a separate municipal corporation with the power and authority to finance, acquire, operate and dispose of, either as owner or agent, projects, located within or outside the state, for the production, exploration, transmission or storage of gas resources and to enter into contracts relating to the acquisition, operation, disposal or leasing of related projects or sale of related services. It is not the purpose of sections 453A.01 to 453A.12 to authorize said municipal corporation to engage in the distribution of gas to the end users. It is determined that an adequate, economical, and reliable supply of gas is essential to the orderly growth and prosperity of these communities, and a supply of such gas is necessary for the safety, health, morale and welfare of residents of the state and to the sound growth and development of its communities. The formation of municipal gas agencies will provide a means for Minnesota cities to provide an adequate, economic and reliable supply of gas by, among other things, achieving economies of size, limiting environmental impacts, and providing for peak and supplemental loads. Accordingly it is determined that the exercise of the powers granted herein will benefit the people of the state and serve a valid public purpose in improving and otherwise promoting their health, welfare, and prosperity.",
	"repealed": false
}