{
	"id": "48.93",
	"url": "https://www.revisor.mn.gov/statutes/cite/48.93",
	"title": "48.93 ACQUISITION PROCEDURE.",
	"text": "An out-of-state bank holding company may, through a purchase of stock or assets of a bank, or through a purchase of stock or assets of or merger with a bank holding company, acquire control in an existing bank or banks whose home state is Minnesota if it meets the conditions in this section and section 46.048 and it files an application in writing with the commissioner on forms provided by the department. The commissioner, upon receipt of the application, shall act upon it in the manner provided for in section 46.048, except that the commissioner may extend the 60-day period an additional 30 days if in the commissioner's judgment any material information submitted is substantially inaccurate or the acquiring party has not furnished all the information required by statute, rule, or the commissioner. Within three days after making the decision to disapprove any proposed acquisition, the commissioner shall notify the acquiring party in writing of the disapproval. The notice must provide a statement of the basis for the disapproval.\nWithin ten days of receipt of notice of disapproval pursuant to subdivision 1, the acquiring party may request an agency hearing on the proposed acquisition. At the hearing, all issues must be determined on the record pursuant to chapter 14 and the rules issued by the department. At the conclusion of the hearing, the commissioner shall by order approve or disapprove the proposed acquisition on the basis of the record made at the hearing.\nExcept as otherwise provided by rule of the department, an application filed pursuant to subdivision 1 must contain the information required by section 46.048.\nThe commissioner shall disapprove any proposed acquisition if:\n(1) the financial condition of any acquiring person is such as might jeopardize the financial stability of the bank or prejudice the interests of the depositors of the bank;\n(2) the competence, experience, integrity of any acquiring person or of any of the proposed management personnel indicates that it would not be in the interest of the depositors of the bank, or in the interest of the public to permit the person to control the bank;\n(3) the acquisition will result in undue concentration of resources or substantial lessening of competition in this state;\n(4) the application is incomplete or any acquiring party neglects, fails, or refuses to furnish all the information required by the commissioner;\n(5) a subsidiary of the acquiring bank holding company has failed to meet the requirements set forth in the federal Community Reinvestment Act; or\n(6) the bank to be acquired has not been in existence for at least five years. For purposes of this paragraph, a bank that has been chartered solely for the purpose of, and does not open for business before, acquiring control of, or acquiring all or substantially all of the assets of, an existing bank is considered to have been in existence for the same period of time as the bank to be acquired. For determining the time period of existence of a bank, the time period begins after the issuance of a certificate of authorization and from the date the approved bank actually opens for business.\nThe Court of Appeals of the state of Minnesota will have exclusive original jurisdiction of any judicial review of an order issued under this section. The bank holding company that is the subject of the order may seek judicial review at any time within 90 days of the date of an order lawfully issued pursuant to this section.",
	"repealed": false
}