{
	"id": "523.21",
	"url": "https://www.revisor.mn.gov/statutes/cite/523.21",
	"title": "523.21 DUTIES OF AN ATTORNEY-IN-FACT.",
	"text": "The attorney-in-fact shall keep complete records of all transactions entered into by the attorney-in-fact on behalf of the principal. The attorney-in-fact has no duty to render an accounting of those transactions unless: (1) requested to do so at any time by the principal; (2) the instrument conferring the power of attorney requires that the attorney-in-fact render accountings and specifies to whom the accounting must be delivered; or (3) the attorney-in-fact has reimbursed the attorney-in-fact for any expenditure the attorney-in-fact has made on behalf of the principal. A written statement that gives reasonable notice of all transactions entered into by the attorney-in-fact on behalf of the principal is an adequate accounting. The persons entitled to examine and copy the records of the attorney-in-fact are the principal, a person designated by the principal in the document creating the power of attorney as the recipient of accountings required by this section, and the guardian or conservator of the estate of the principal while the principal is living and the personal representative of the estate of the principal after the death of the principal. The attorney-in-fact has no affirmative duty to exercise any power conferred upon the attorney-in-fact under the power of attorney. In exercising any power conferred by the power of attorney, the attorney-in-fact shall exercise the power in the same manner as an ordinarily prudent person of discretion and intelligence would exercise in the management of the person's own affairs and shall have the interests of the principal utmost in mind. The attorney-in-fact is personally liable to any person, including the principal, who is injured by an action taken by the attorney-in-fact in bad faith under the power of attorney or by the attorney-in-fact's failure to account when the attorney-in-fact has a duty to account under this section.",
	"repealed": false
}