{
	"id": "82B.03",
	"url": "https://www.revisor.mn.gov/statutes/cite/82B.03",
	"title": "82B.03 PROHIBITIONS.",
	"text": "(a) It is unlawful for a person to act as a real estate appraiser in this state unless licensed under this chapter.\n(b) Only persons licensed under this chapter may advertise or represent themselves to be real estate appraisers.\n(c) No person, other than a licensed real estate appraiser, may assume or use that title or a title, designation, or abbreviation likely to create the impression of licensure as a real estate appraiser by this state.\n(a) An officer or employee of a corporation, partnership, or other business entity may act as a real estate appraiser without obtaining a license under this chapter if the corporation, partnership, or other business entity in which the person is employed or is an officer has an interest in the real estate that is the subject of the appraisal as owners, lenders, investors, or insurers.\n(b) Notwithstanding licensure under this chapter, any appraisal conducted by a person exempt under this subdivision is only subject to the guidelines for real estate appraisal policies and review procedures of the Federal Deposit Insurance Corporation, the Office of Thrift Supervision, the Federal Reserve Board, the Farm Credit Administration, the National Credit Union Administration, or the comptroller of the currency, if the appraisal was conducted only within the scope and purpose of this subdivision.\n(c) If a real estate appraisal is made by a person who is exempt from licensing under this subdivision, the person for whom the appraisal is conducted must be given written notice that the appraisal was not conducted by a licensed appraiser, and the appraisal report must clearly state that it was conducted by an interested party and not by a licensed real estate appraiser.\nA licensed real estate appraiser may provide an evaluation. When providing an evaluation, a licensed real estate appraiser is not engaged in real estate appraisal activity and is not subject to this chapter. An evaluation by a licensed real estate appraiser under this subdivision must contain a disclosure that the evaluation is not an appraisal.\nA real estate appraiser may provide a minimum damage acquisition report for purposes of section 117.036. When providing a minimum damage acquisition report, a real estate appraiser is not engaged in real estate appraisal activity and is not subject to this chapter.",
	"repealed": false
}