{
	"id": "298.17",
	"url": "https://www.revisor.mn.gov/statutes/cite/298.17",
	"title": "298.17 OCCUPATION TAXES TO BE APPORTIONED.",
	"text": "(a) All occupation taxes paid by persons, copartnerships, companies, joint stock companies, corporations, and associations, however or for whatever purpose organized, engaged in the business of mining or producing iron ore or other ores, when collected shall be apportioned and distributed in accordance with the Constitution of the state of Minnesota, article X, section 3, in the manner following: 90 percent shall be deposited in the state treasury and credited to the general fund of which four-ninths shall be used for the support of elementary and secondary schools; and ten percent of the proceeds of the tax imposed by this section shall be deposited in the state treasury and credited to the general fund for the general support of the university.\n(b) Of the money apportioned to the general fund by this section: (1) there is annually appropriated and credited to the mining environmental and regulatory account in the special revenue fund an amount equal to that which would have been generated by a 2-1/2 cent tax imposed by section 298.24 on each taxable ton produced in the preceding calendar year. Money in the mining environmental and regulatory account is appropriated annually to the commissioner of natural resources to fund agency staff to work on environmental issues and provide regulatory services for ferrous and nonferrous mining operations in this state. Payment to the mining environmental and regulatory account shall be made by July 1 annually. The commissioner of natural resources shall execute an interagency agreement with the Pollution Control Agency to assist with the provision of environmental regulatory services such as monitoring and permitting required for ferrous and nonferrous mining operations; (2) there is annually appropriated and credited to the Iron Range resources and rehabilitation account in the special revenue fund an amount equal to that which would have been generated by a 1.5 cent tax imposed by section 298.24 on each taxable ton produced in the preceding calendar year, to be expended for the purposes of section 298.22; and (3) there is annually appropriated and credited to the Iron Range resources and rehabilitation account in the special revenue fund for transfer to the Iron Range schools and community development account under section 298.28, subdivision 7a, an amount equal to that which would have been generated by a six cent tax imposed by section 298.24 on each taxable ton produced in the preceding calendar year. Payment to the Iron Range resources and rehabilitation account shall be made by May 15 annually.\n(c) The money appropriated pursuant to paragraph (b), clause (2), shall be used (i) to provide environmental development grants to local governments located within any county in region 3 as defined in governor's executive order number 60, issued on June 12, 1970, which does not contain a municipality qualifying pursuant to section 273.134, paragraph (b), or (ii) to provide economic development loans or grants to businesses located within any such county, provided that the county board or an advisory group appointed by the county board to provide recommendations on economic development shall make recommendations to the commissioner of Iron Range resources and rehabilitation regarding the loans. Payment to the Iron Range resources and rehabilitation account shall be made by May 15 annually.\n(d) Of the money allocated to Koochiching County, one-third must be paid to the Koochiching County Economic Development Commission.",
	"repealed": false
}