{
	"id": "120B.31",
	"url": "https://www.revisor.mn.gov/statutes/cite/120B.31",
	"title": "120B.31 SYSTEM ACCOUNTABILITY AND STATISTICAL ADJUSTMENTS.",
	"text": "Consistent with the direction to adopt statewide academic standards under section 120B.02, the department, in consultation with education and other system stakeholders, must establish a coordinated and comprehensive system of educational accountability and public reporting that promotes greater academic achievement, preparation for higher academic education, preparation for the world of work, citizenship, and the arts.\nMS 2022 [Repealed, 2024 c 109 art 2 s 32]\n[Repealed, 2012 c 239 art 2 s 21]\n(a) The commissioner of education shall designate up to six school districts or charter schools as rollout sites.\n(b) The rollout sites should represent urban school districts, suburban school districts, nonurban school districts, and charter schools. The commissioner shall designate rollout sites and notify the schools by August 1, 2017, and the designated school districts or charter schools shall have the right to opt in or out as rollout sites by September 1, 2017.\n(c) The commissioner must consult stakeholders and review the American Community Survey to develop recommendations for best practices for disaggregated data. Stakeholders consulted under this paragraph include at least:\n(1) the rollout sites;\n(2) parent groups; and\n(3) community representatives.\n(d) The commissioner shall report to the legislative committees having jurisdiction over kindergarten through grade 12 education policy and finance by February 1, 2018. The commissioner may research best practices from other states that have disaggregated data beyond the requirements of the most recent reauthorization of the Elementary and Secondary Education Act. The commissioner must consult with the stakeholders on how to measure a student's background as an immigrant or a refugee and provide a recommendation in the report on how to include the data in the statewide rollout. The recommendations may address:\n(1) the most meaningful use of disaggregated data, including but not limited to which reports should include further disaggregated data;\n(2) collection of additional student characteristics, including but not limited to ensuring enhanced enrollment forms:\n(i) provide context and the objective of additional data;\n(ii) are designed to convey respect and acknowledgment of the sensitive nature of the additional data; and\n(iii) are designed to collect data consistent with user feedback;\n(3) efficient data-reporting approaches when reporting additional information to the department;\n(4) the frequency by which districts and schools must update enrollment forms to meet the needs of the state's changing racial and ethnic demographics; and\n(5) the criteria for determining additional data. This recommendation should include a recommendation for frequency of reviews and updates of the additional data and should also identify the approach of updating any additional census data and data on new enrollees. This recommendation must consider additional student groups that may face education disparities and must take into account maintaining student privacy and providing nonidentifiable student level data.\nIn developing policies and assessment processes to hold schools and districts accountable for high levels of academic standards under section 120B.021, the commissioner shall use the student categories identified under the federal Elementary and Secondary Education Act, as most recently reauthorized, and student categories of:\n(1) homelessness;\n(2) ethnicity under section 120B.35, subdivision 3, paragraph (a), clause (2);\n(3) race under section 120B.35, subdivision 3, paragraph (a), clause (2);\n(4) home language;\n(5) English learners under section 124D.59;\n(6) free or reduced-price meals; and\n(7) other categories designated by federal law to organize and report the data so that state and local policy makers can understand the educational implications of changes in districts' demographic profiles over time as data are available.\nAny report the commissioner disseminates containing summary data on student performance must integrate student performance and the demographic factors that strongly correlate with that performance.\n(a) The commissioner must create and publish a form for parents and guardians that:\n(1) explains the need for state academic standards;\n(2) identifies the state assessments that are aligned with state standards;\n(3) identifies the consequences, if any, the school or student may face if a student does not participate in state or locally required standardized assessments;\n(4) states that students who receive a college ready benchmark on the high school Minnesota Comprehensive Assessment are not required to take a remedial, noncredit course at a Minnesota state college or university in the corresponding subject area;\n(5) summarizes the provisions in section 120B.306, subdivision 1; and\n(6) notifies a parent of the right to not have the parent's child participate in the state and locally required academic assessments, and asks a parent that chooses to not have a child participate5 in the assessments the basis for the decision.\n(b) A school district must post the form created by the commissioner on the district's website and include it in the district's student handbook.\nTo ensure the effective involvement of parents and to support a partnership between the school and parents, each district shall provide parents and teachers a timely written summary, in an electronic or other format, of their student's current and longitudinal performance and progress on the state's academic content standards as measured by state assessments. Providing parents with a summary prepared by the Department of Education fulfills the requirements of this subdivision.\nMS 2022 [Repealed, 2024 c 109 art 2 s 32]",
	"repealed": false
}