{
	"id": "142B.02",
	"url": "https://www.revisor.mn.gov/statutes/cite/142B.02",
	"title": "142B.02 RULES.",
	"text": "The commissioner shall adopt rules under chapter 14 to govern the operation, maintenance, and licensure of programs subject to licensure under this chapter. The commissioner shall not adopt any rules that are inconsistent with or duplicative of existing state or federal regulations. Nothing in this subdivision shall be construed to prohibit the commissioner from incorporating existing state or federal regulations or accreditation standards by reference.\nThis subdivision applies to rules governing this chapter. As appropriate for each type of license:\n(a) The commissioner shall give preference in rule to standards that describe program outcomes and the practices that have been shown to result in the desired program outcomes.\n(b) The rules may include model program standards for each type of program licensed by the commissioner.\n(c) The rules shall include basic licensing standards governing licensure of each type of program licensed by the commissioner. The basic licensing standards must be met by all applicants and license holders. Basic licensing standards must include, but are not limited to:\n(1) standards for adequate staff that take into account the age distribution and severity of the disability of persons served by the program;\n(2) safety standards that take into account the size and conditions of the physical plant and studies of fire safety including studies of the interaction between fire detection factors, fire spread factors, and evacuation factors in case of a fire;\n(3) standards for program services that describe, when appropriate, adequate levels of shelter, nutrition, planned activities, materials, and qualifications of individuals responsible for administering and delivering program services;\n(4) standards that describe the characteristics of the settings where program services are to be delivered; and\n(5) health and sanitation standards.\nThe commissioner may adopt rules under subdivision 1 to provide for the reduction of fees established under section 142B.12 when a license holder substantially exceeds the basic standards for licensure.\nThe commissioner shall evaluate the effects of the rules within three years after the date of adoption and at least once every five years thereafter. The evaluation must include an assessment of any discrepancies between the actual and intended effects of the rules, identification of necessary revisions, if any, and a discussion of the rules' effect on the availability and quality of licensed programs. The commissioner shall consider the results of the evaluation in amending and writing rules.\nThe commissioner shall:\n(1) summarize the rules in language understandable to the general public and inform license holders and applicants where they may obtain a copy of the rules and the summary;\n(2) develop and provide each applicant with information describing the services offered to applicants by the commissioner and explaining the penalties for operating an unlicensed program or failing to fully comply with the commissioner's correction orders or applicable laws or rules;\n(3) upon request, interpret rules for applicants and license holders; and\n(4) take measures to ensure that rules are enforced uniformly throughout the state.\nIn developing rules, the commissioner shall request and receive consultation from: other state departments and agencies; counties and other affected political subdivisions that reflect the diversity of political subdivisions affected by the rule; persons and relatives of persons using the program governed by the rule; advocacy groups; and representatives of license holders affected by the rule. In choosing parties for consultation, the commissioner shall choose individuals and representatives of groups that reflect a cross section of urban, suburban, and rural areas of the state.\n(a) Where appropriate and feasible, the commissioner shall identify and implement alternative methods of regulation and enforcement to the extent authorized in this subdivision. These methods shall include:\n(1) expansion of the types and categories of licenses that may be granted;\n(2) when the standards of another state or federal governmental agency or an independent accreditation body have been shown to require the same standards, methods, or alternative methods to achieve substantially the same intended outcomes as the licensing standards, the commissioner shall consider compliance with the governmental or accreditation standards to be equivalent to partial compliance with the licensing standards; and\n(3) use of an abbreviated inspection that employs key standards that have been shown to predict full compliance with the rules.\n(b) If the commissioner accepts accreditation as documentation of compliance with a licensing standard under paragraph (a), the commissioner shall continue to investigate complaints related to noncompliance with all licensing standards. The commissioner may take a licensing action for noncompliance under this chapter and shall recognize all existing appeal rights regarding any licensing actions taken under this chapter.\n(c) The commissioner shall work with the commissioners of human services, health, public safety, administration, and education in consolidating duplicative licensing and certification rules and standards if the commissioner determines that consolidation is administratively feasible, would significantly reduce the cost of licensing, and would not reduce the protection given to persons receiving services in licensed programs. Where administratively feasible and appropriate, the commissioner shall work with the commissioners of human services, health, public safety, administration, and education in conducting joint agency inspections of programs.\n(d) The commissioner shall work with the commissioners of human services, health, public safety, administration, and education in establishing a single point of application for applicants who are required to obtain concurrent licensure from more than one of the commissioners listed in this paragraph.\n(e) Unless otherwise specified in statute, the commissioner may conduct routine inspections biennially.\n(f) For a licensed child care center, the commissioner shall conduct one unannounced licensing inspection at least once per calendar year.\nThe commissioner of children, youth, and families may develop and publish interpretive guidelines.\nInterpretive guidelines do not have the force and effect of law and have no precedential effect, but may be relied on by consumers, providers of service, county agencies, the Department of Children, Youth, and Families, and others concerned until revoked or modified. A guideline may be expressly revoked or modified by the commissioner, by the issuance of another interpretive guideline, but may not be revoked or modified retroactively to the detriment of consumers, providers of service, county agencies, the Department of Children, Youth, and Families, or others concerned. A change in the law or an interpretation of the law occurring after the interpretive guidelines are issued, whether in the form of a statute, court decision, administrative ruling, or subsequent interpretive guideline, results in the revocation or modification of the previously adopted guidelines to the extent that the change affects the guidelines.\nThe issuance of interpretive guidelines is at the discretion of the commissioner of children, youth, and families.",
	"repealed": false
}