{
	"id": "473.704",
	"url": "https://www.revisor.mn.gov/statutes/cite/473.704",
	"title": "473.704 POWERS AND DUTIES.",
	"text": "The commission shall have the powers and duties set forth in this section.\nIt may undertake control programs in the district in accordance with expert and technical plans.\nIt may employ and fix the duties and compensation of a director who shall develop the control programs of the district and shall supervise its execution.\nIt may employ and fix the duties and compensation of a business administrator who shall administer the business affairs of the commission.\nIt may employ such other persons and contract for such other services as may be needed to carry out the control programs in the district, except that no person may be employed by the commission who is related to any commissioner.\nMS 1994 [Repealed, 1996 c 305 art 1 s 108]\nIt may purchase materials, supplies, and equipment as may be necessary to carry out the control programs in the district.\nIt may accept gifts of property for control program purposes.\nIt may sell and dispose of any of the property of the commission whenever such property is no longer needed for the purposes of the commission. If the estimated value of any such property is over $2,500, it shall be sold on competitive bids after two weeks' published notice.\nIt shall keep proper minutes of all its proceedings which shall be open to public inspection at all reasonable times.\nIt shall keep proper and adequate books of accounts showing all its receipts and disbursements by date, source, and amount.\nIt may obtain suitable, proper, and adequate public liability and workers' compensation insurance and such other insurance as it deems necessary.\nIt may enter into agreements with counties, cities or towns of the state of Minnesota outside of the district to conduct control program activities in these political subdivisions in order to effectuate control programs in the district and subdivisions.\nIt may collect and receive from all counties in the district the money for operation of the district.\nIt may perform whatever other acts are reasonable and necessary to carry out the general and specific powers of the commission.\nIt may require employees of the commission who handle commission funds to furnish surety bonds in such amount as is determined by the commission.\n(a) Members of the commission, its officers, and employees, while on the business of the commission, may enter upon any property within or outside the district at reasonable times to determine the need for control programs. They may take all necessary and proper steps for the control programs on property within the district as the director of the commission may designate. Subject to the paramount control of the county and state authorities, commission members and officers and employees of the commission may enter upon any property and clean up any stagnant pool of water, the shores of lakes and streams, and other breeding places for mosquitoes within the district. The commission may apply insecticides approved by the director to any area within or outside the district that is found to be a breeding place for mosquitoes. The commission shall give reasonable notification to the governing body of the local unit of government prior to applying insecticides outside of the district on land located within the jurisdiction of the local unit of government. The commission shall not enter upon private property if the owner objects except (1) to monitor for disease-bearing mosquitoes, ticks, or black gnats, or (2) for control of mosquito species capable of carrying a human disease in the local area of a human disease outbreak regardless of whether there has been an occurrence of the disease in a human being. The commission shall make a reasonable attempt to contact an objecting owner before entering on the owner's private property.\n(b) The commissioner of natural resources must approve mosquito control plans or make modifications as the commissioner of natural resources deems necessary for the protection of public water, wild animals, and natural resources before control operations are started on state lands administered by the commissioner of natural resources.\nThe commission may establish a research program to evaluate the effects of control programs on other fauna. The purpose of the program is to identify the types and magnitude of the adverse effects of the control program on fish and wildlife and associated food chain invertebrates. The commission may conduct research through contracts with qualified outside researchers.\nMS 2002 [Repealed, 1Sp2003 c 16 s 11]\nThe commission shall consult and cooperate with the state department of health in developing management techniques to control disease vectoring ticks.",
	"repealed": false
}