{
	"id": "508.35",
	"url": "https://www.revisor.mn.gov/statutes/cite/508.35",
	"title": "508.35 FORM OF CERTIFICATE.",
	"text": "The certificate of title shall contain the name and residence of the owner, a description of the land, and of the estate of the owner therein, and shall by memorial contain a description of all encumbrances, liens, and interests in which the estate of the owner is subject. In case the land is held in trust or subject to any condition or limitation, it shall state the nature and character of it. It shall be substantially in the following form:\nCERTIFICATE OF TITLE\nFirst certificate of title, pursuant to the order of the district court, ............... judicial district, county of ................., and state of Minnesota, date................, .......\nREGISTRATION\nThis is to certify that ..............., whose address is ..............., in the .................... of ...................., and state of ...................., is now the owner of an estate, ......................... of and in the following described land situated in the county of ............... and state of Minnesota, .........................\nSubject to the encumbrances, liens, and interest noted by the memorial underwritten or endorsed hereon; and subject to the following rights or encumbrances subsisting, as provided in Laws 1905, chapter 305, section 24, namely:\n(1) Liens, claims, or rights arising under the laws or the Constitution of the United States, which the statutes of this state cannot require to appear of record;\n(2) Any real property tax or special assessment;\n(3) Any lease for a period not exceeding three years, when there is actual occupation of the premises under the lease;\n(4) All rights in public highways upon the land;\n(5) Such right of appeal or right to appear and contest the application as is allowed by law;\n(6) The rights of any person in possession under deed or contract for deed from the owner of the certificate of title;\n(7) Any outstanding mechanics lien rights which may exist under sections 514.01 to 514.17.\nIn witness whereof, I have hereunto subscribed my name and affixed the seal of my office, this ............... day of ..........., ..........\n....................................................................\nRegistrar of Titles, in and for the county of\n..................... and State of Minnesota.\nAll certificates issued subsequent to the first certificate of title shall be in like form except that they shall be entitled \"Transfer from number (here give the number of the next previous certificate relating to the same land),\" and shall also contain the words \"Originally registered (date, volume, and page or certificate of title number of registration).\"",
	"repealed": false
}