{
	"id": "393.01",
	"url": "https://www.revisor.mn.gov/statutes/cite/393.01",
	"title": "393.01 ESTABLISHMENT.",
	"text": "There shall be established in each county of the state a local social services agency which shall consist of the number of members, as hereinafter provided, to be chosen as follows.\nExcept in counties which contain a city of the first class and counties having a poor and hospital commission, the local social services agency shall consist of seven members, including the board of county commissioners, to be selected as herein provided; two members, one of whom shall be a woman, shall be appointed by the board of county commissioners, one each year for a full term of two years, from a list of residents. As each term expires or a vacancy occurs by reason of death or resignation, a successor shall be appointed by the board of county commissioners for the full term of two years or the balance of any unexpired term from a list of one or more, not to exceed three residents. The board of county commissioners may, by resolution adopted by a majority of the board, determine that only three of their members shall be members of the local social services agency, in which event the local social services agency shall consist of five members instead of seven. When a vacancy occurs on the local social services agency by reason of the death, resignation, or expiration of the term of office of a member of the board of county commissioners, the unexpired term of such member shall be filled by appointment by the county commissioners. Except to fill a vacancy the term of office of each member of the local social services agency shall commence on the first Thursday after the first Monday in July, and continue until the expiration of the term for which such member was appointed or until a successor is appointed and qualifies.\nIn the county of Hennepin the board of county commissioners shall be the local social services agency. In such county the members shall be reimbursed by the county for expenses actually incurred in the performance of their official duties under the provisions of this chapter. In such county the county auditor shall be ex officio secretary of the board, but shall have no voice in its proceedings.\nMS 1971 [Repealed, 1974 c 435 art 6 s 1]\nThe local social services agency of St. Louis County shall be appointed or elected as provided by Laws 1974, chapter 266, sections 1 to 3. The board shall receive such compensation and shall have and exercise all the powers as provided by Laws 1907, chapter 222, and acts amendatory thereof, in addition to any other and further powers granted herein and shall have and perform all the additional duties referred to in section 393.07.\nIn any county now having a board of poor and hospital commissioners, said board of poor and hospital commissioners shall have the same powers and duties as the local social services agency in other counties, and shall be the local social services agency, and shall also retain and exercise the powers and duties conferred upon such agency by Laws 1917, chapter 187, as amended by Laws 1931, chapter 60, in counties in which said 1917 law as amended is applicable.\nNotwithstanding the provisions of subdivision 1 two or more counties may by resolution of their respective boards of county commissioners, agree to combine the functions of their separate local social services agency into one local social services agency to serve the two or more counties that enter into the agreement. Such agreement may be for a definite term or until terminated in accordance with its terms. When two or more counties have agreed to combine the functions of their separate local social services agency, a single local social services agency in lieu of existing individual local social services agency shall be established to direct the activities of the combined agency. This agency shall have the same powers, duties and functions as an individual local social services agency. The single local social services agency shall have representation from each of the participating counties with selection of the members to be as follows:\n(a) Each board of county commissioners entering into the agreement shall on an annual basis select one or two of its members to serve on the single local social services agency.\n(b) Each board of county commissioners entering into the agreement shall select one county resident who is not a county commissioner to serve as a local social services agency member.\n(c) The composition of the agency may be determined by the boards of county commissioners entering into the agreement providing that no less than one-third of the members are appointed as provided in paragraph (b).",
	"repealed": false
}