{
	"id": "127A.41",
	"url": "https://www.revisor.mn.gov/statutes/cite/127A.41",
	"title": "127A.41 DISTRIBUTION OF SCHOOL AIDS; APPROPRIATION.",
	"text": "The commissioner shall supervise distribution of school aids and grants in accordance with law. The commissioner may make rules consistent with law for the distribution to enable districts to perform efficiently the services required by law and further education in the state, including reasonable requirements for the reports and accounts to it as will assure accurate and lawful apportionment of aids. State and federal aids and discretionary or entitlement grants distributed by the commissioner shall not be subject to the contract approval procedures of the commissioner of administration or to chapter 16A, 16B, or 16C. The commissioner shall adopt internal procedures for administration and monitoring of aids and grants.\nOn determining that the amount of state aid distributed to a school district is in error, the commissioner is authorized to adjust the amount of aid consistent with this subdivision. On determining that the amount of aid is in excess of the school district's entitlement, the commissioner is authorized to recover the amount of the excess by any appropriate means. Notwithstanding the fiscal years designated by the appropriation, the excess may be recovered by reducing future aid payments to the district. Notwithstanding any law to the contrary, if the aid reduced is not of the same type as that overpaid, the district must adjust all necessary financial accounts to properly reflect all revenues earned in accordance with the uniform financial accounting and reporting standards pursuant to sections 123B.75 to 123B.83. Notwithstanding the fiscal years designated by the appropriation, on determining that the amount of an aid paid is less than the school district's entitlement, the commissioner is authorized to increase such aid from the current appropriation. If the aid program has been discontinued and has no appropriation, the appropriation for general education shall be used for recovery or payment of the aid decrease or increase. Any excess of aid recovery over aid payment shall be canceled to the state general fund.\nThe commissioner shall establish procedures for conducting and shall conduct audits of district records and files for the purpose of verifying district pupil counts, levy limitations, and aid entitlements. The commissioner shall establish procedures for selecting and shall select districts to be audited. Disparities, if any, between pupil counts, levy limitations, or aid entitlements determined by audit of district records and files and data reported by districts in reports, claims and other documents shall be reviewed by the commissioner who shall order increases or decreases accordingly. Whenever possible, the commissioner shall audit at least 25 districts each year pursuant to this subdivision. Procedures adopted under this subdivision are not subject to chapter 14, including section 14.386, and may differ from the procedures under section 127A.42.\nIf the commissioner audits fewer than 25 districts in a fiscal year pursuant to subdivision 3, the commissioner shall report the reasons for the number audited to the following legislative committees: house of representatives education, house of representatives appropriations, senate education, and senate finance.\nPublic schools shall at all times be open to the inspection of the commissioner. The accounts and records of any district must be open to inspection by the state auditor, or the commissioner for the purpose of audits conducted under this section. Each district shall keep for a minimum of three years at least the following: (1) identification of the annual session days held, together with a record of the length of each session day, (2) a record of each pupil's daily attendance, with entrance and withdrawal dates, and (3) identification of the to-and-from school transportation category for each pupil as defined in section 123B.92, subdivision 1.\n[Repealed, 1Sp2003 c 9 art 5 s 37]\n(a) It is the intention of the legislature to encourage efficient and effective use of staff and facilities by districts. Districts are encouraged to consider both cost and energy saving measures.\n(b) Any district operating a program pursuant to sections 124D.12 to 124D.127 or 124D.128, or operating a commissioner-designated area learning center program under section 123A.09, or that otherwise receives the approval of the commissioner to operate its instructional program to avoid an aid reduction in any year, may adjust the annual school schedule for that program throughout the calendar year.\n(a) If a direct appropriation from the general fund to the department for any education aid or grant authorized in this chapter and chapters 122A, 123A, 123B, 124D, 124E, 125A, 126C, and 134, excluding appropriations under sections 124D.135, 124D.16, 124D.20, 124D.22, 124D.52, 124D.531, 124D.55, and 124D.56, exceeds the amount required, the commissioner may transfer the excess to any education aid or grant appropriation that is insufficient. However, section 126C.20 applies to a deficiency in the direct appropriation for general education aid. Excess appropriations must be allocated proportionately among aids or grants that have insufficient appropriations. The commissioner of management and budget shall make the necessary transfers among appropriations according to the determinations of the commissioner. If the amount of the direct appropriation for the aid or grant plus the amount transferred according to this subdivision is insufficient, the commissioner shall prorate the available amount among eligible districts. The state is not obligated for any additional amounts.\n(b) Transfers for aids paid under section 127A.45, subdivisions 12 and 13, shall be made during the fiscal year after the fiscal year of the entitlement. Transfers for aids paid under section 127A.45, subdivisions 11 and 12a, shall be made during the fiscal year of the appropriation.\nIf a direct appropriation from the general fund to the Department of Education for an education aid or grant authorized under section 124D.135, 124D.16, 124D.20, 124D.22, 124D.52, 124D.531, 124D.55, or 124D.56 exceeds the amount required, the commissioner of education may transfer the excess to any education aid or grant appropriation that is insufficiently funded under these sections. Excess appropriations shall be allocated proportionately among aids or grants that have insufficient appropriations. The commissioner of management and budget shall make the necessary transfers among appropriations according to the determinations of the commissioner of education. If the amount of the direct appropriation for the aid or grant plus the amount transferred according to this subdivision is insufficient, the commissioner shall prorate the available amount among eligible districts. The state is not obligated for any additional amounts.\nThe commissioner, with the approval of the commissioner of management and budget, annually may transfer an amount from the appropriation for health and safety aid to the appropriation for debt service aid for the same fiscal year. The amount of the transfer equals the amount necessary to fund any shortage in the debt service aid appropriation created by a data correction that occurs between November 1 and June 30 of the preceding fiscal year.",
	"repealed": false
}