{
	"id": "123A.46",
	"url": "https://www.revisor.mn.gov/statutes/cite/123A.46",
	"title": "123A.46 DISSOLUTION AND ATTACHMENT.",
	"text": "Any district may be dissolved and the territory attached to other districts by proceeding in accordance with this section.\nProceedings under this section may be instituted by:\n(1) resolution of the county board of the county containing the greatest land area of the district proposed for dissolution when the district is dissolved pursuant to sections 123A.60 to 123A.72;\n(2) petition executed by a majority of the eligible voters of the district proposed for dissolution and addressed to the county board of the county containing the greatest land area of the district;\n(3) certification by the clerk of the district proposed for dissolution to the county board of the county containing the greatest land area of the district to the effect that a majority of votes cast at an election were in favor of dissolving the district.\nA resolution adopted pursuant to subdivision 2, clause (1), shall contain findings of necessary jurisdictional facts and shall set a date for hearing. The hearing shall be not less than 20 nor more than 60 days from the date of the resolution.\nA petition executed pursuant to subdivision 2, clause (2), shall be filed with the auditor. The petition must contain the following:\n(a) A statement that petitioners desire proceedings instituted leading to dissolution of the district and other provisions made for the education of the inhabitants of the territory and that petitioners are eligible voters of the district;\n(b) An identification of the district; and\n(c) The reasons supporting the petition which may include recommendations as to disposition of territory to be dissolved. The recommendations are advisory in nature only and are not binding on any petitioners or county board for any purpose.\nThe persons circulating the petition shall attach their affidavit swearing or affirming that the persons executing the petition are eligible voters, as defined in section 201.014, of the district and that they signed in the presence of one of the circulators.\nThe auditor shall present the petition to the county board at its next meeting. At that meeting, the county board must determine a date for a hearing. The hearing shall be not less than 20 nor more than 60 days from the date of that meeting.\nCertification executed pursuant to subdivision 2, clause (3), must be filed with the auditor. The certification must contain the following:\n(a) A copy of the resolution initiating the election;\n(b) A copy of the notice of election with an affidavit of publication or posting;\n(c) The question voted on;\n(d) The results of the election by number of votes cast for and number against the question; and\n(e) If an advisory ballot is taken on annexation, the question voted on and number of ballots cast for and against the proposal.\nThe auditor shall present the certification to the county board at its next meeting. At that meeting, the county board must determine a date for a hearing. The hearing shall be not less than 20 nor more than 60 days from the date of that meeting.\nWhen a hearing is ordered under this section, the auditor shall give ten days' posted notice of the hearing in the district proposed for dissolution, one week's published notice in the county, and ten days' mailed notice to the clerk of the district proposed for dissolution and to the clerk of each adjoining district and to the commissioner. If any part of the district proposed for dissolution or any adjoining district lies in another county, the auditor shall mail notice of the hearing to the auditor of each county so situated upon establishment of the hearing date.\nNo order dissolving a district may be issued by the county board if the district to be dissolved is included in a plat for consolidation which has been approved by the commissioner of education and upon which plat final action has not been taken unless all of the district to be dissolved and all of the district or districts to which attachment is proposed are included in the approved plat.\n(a) Before the day of a hearing ordered pursuant to this section, each district adjoining the district proposed for dissolution must provide the following information and resolution to the county auditor of the county containing the greatest land area of the district proposed for dissolution:\n(1) The outstanding bonded debt, outstanding energy loans made according to section 216C.37 or sections 298.292 to 298.297, and the capital loan obligation of the district;\n(2) The net tax capacity of the district;\n(3) The most current school tax rates for the district, including any referendum, discretionary, or other optional levies being assessed currently and the expected duration of the levies;\n(4) A resolution passed by the school board of the district stating that if taxable property of the dissolved district is attached to it, one of the following requirements is imposed:\n(i) the taxable property of the dissolving district which is attached to its district shall not be liable for the bonded debt, outstanding energy loans made according to section 216C.37 or sections 298.292 to 298.297, or the capital loan obligation of the district which existed as of the time of the attachment;\n(ii) the taxable property of the dissolving district which is attached to its district shall be liable for the payment of the bonded debt, outstanding energy loans made according to section 216C.37 or sections 298.292 to 298.297, or the capital loan obligation of the district which existed as of the time of the attachment in the proportion which the net tax capacity of that part of the dissolving district which is included in the newly enlarged district bears to the net tax capacity of the entire district as of the time of attachment; or\n(iii) the taxable property of the dissolving district which is attached to its district shall be liable for some specified portion of the amount that could be requested pursuant to item (ii).\n(b) An apportionment pursuant to paragraph (a), clause (4), item (ii) or (iii), shall be made by the county auditor of the county containing the greatest land area of the district proposed for transfer.\n(c) An apportionment of bonded indebtedness, outstanding energy loans made according to section 216C.37 or sections 298.292 to 298.297, or capital loan obligation pursuant to paragraph (a), clause (4), item (ii) or (iii), shall not relieve any property from any tax liability for payment of any bonded or capital obligation, but taxable property in a district enlarged pursuant to this section becomes primarily liable for the payment of the bonded debt, outstanding energy loans made according to section 216C.37 or sections 298.292 to 298.297, or capital loan obligation to the extent of the proportion stated.\nWithin 90 days of the date set for the original hearing or within 30 days of the termination of a consolidation proceeding which stays the order under subdivision 7, the county board may issue its order:\n(1) dismissing the proceedings; or\n(2) providing for the dissolution of the district and the annexation of the territory to adjoining districts, or the entire district as a unit may be attached to and become part of a district which maintains a secondary school located within the same high school area if there is no intervening district maintaining a secondary school.\nIf no order is issued within the limited time, the proceedings are dismissed.\nIf an order is issued pursuant to clause (2) the order is a final order, unless an election on the order is required pursuant to subdivision 11.\n(a) An order issued under subdivision 9, clause (2), must contain the following:\n(1) A statement that the district is dissolved unless the results of an election held pursuant to subdivision 11 provide otherwise;\n(2) A description by words or plat or both showing the disposition of territory in the district to be dissolved;\n(3) The outstanding bonded debt, outstanding energy loans made according to section 216C.37 or sections 298.292 to 298.297, and the capital loan obligation of the district to be dissolved;\n(4) A statement requiring the fulfillment of the requirements imposed by each adjoining district to which territory in the dissolving district is to be attached regarding the assumption of its outstanding preexisting bonded indebtedness by any territory from the dissolving district which is attached to it;\n(5) An effective date for the order. The effective date shall be July 1 of an odd-numbered year unless the school board and the exclusive representative of the teachers in each affected district agree to an effective date of July 1 of an even-numbered year. The agreement must be in writing and submitted to the commissioner; and\n(6) Other information the county board may desire to include.\n(b) The auditor shall within ten days from its issuance serve a copy of the order by mail upon the clerk of the district to be dissolved and upon the clerk of each district to which the order attaches any territory of the district to be dissolved and upon the auditor of each other county in which any part of the district to be dissolved or any district to which the order attaches territory lies, and upon the commissioner.\nIf the proceedings were instituted by petition, under subdivision 2, clause (2), or by election, under subdivision 2, clause (3), and an advisory recommendation was made in the petition or an advisory ballot taken at the election, as to annexation requested, and if the order makes a different provision for annexation than requested, then the order must be approved by a majority of those voting on the question at an election to be called in the district to be dissolved, under subdivision 12. The question voted on shall be:\n\"Shall the order of the County Board of ..... County, dated ..... providing for the dissolution of this school district be approved?\" Yes ..... No .....\nIf an election is required under subdivision 11, then before the expiration of a 45 day period after the date of the order for dissolution and attachment, the auditor shall set a date and call the election by filing a written order for the election and serving a copy of the order personally or by mail on the clerk of the district in which the election is to be held. The special election shall be held in the district proposed for dissolution and must be held on a date authorized in section 205A.05, subdivision 1a. The auditor shall post and publish notice of the election according to law. Upon receipt of the notice, the board shall conduct the election.\nThe board must certify the results of the election to the auditor. If a majority of all votes cast on the question at the election approve the order, the order becomes final and effective as of the date specified in the order. Each person served with the order shall be so notified. If a majority of all votes cast on the question disapprove the order, the proceedings are dismissed, and the order becomes void.\nThe bonded debt of a district dissolved under provisions of this section must be paid according to levies made for that debt under provision of chapter 475. The obligation of the taxable property in the dissolved district with reference to the payment of such bonded debt is not affected by this section.\nIf the dissolved district is not divided by the order of dissolution and attachment, all of its current assets and liabilities, real and personal, and all its legally valid and enforceable claims and contract obligations must pass to the district to which it is attached, except as provided in section 123A.75. If the district to be dissolved is divided by the order of dissolution and attachment, the commissioner shall, within 30 days after the order is issued, issue an order for the distribution of its current assets and liabilities, real and personal. If the commissioner's order provides for the transfer of an interest in real estate to a district, this order may also impose a dollar amount as a claim against that district in favor of other districts, and this claim shall be paid and enforced in the manner provided by law for the payment of judgments against a district. The obligations of districts to the teachers employed by the dissolved district shall be governed by the provisions of section 123A.75.\n(a) In the year prior to the effective date of the dissolution of a district, the board of a district to which all of the dissolving district is to be attached may adopt a resolution directing the board of the dissolving district to certify levies for general education, basic transportation, and capital expenditure equipment and facilities in an amount not to exceed the maximum amount authorized for the dissolving district for taxes payable in the year the dissolution is effective. If the dissolving district is to be attached to more than one district, the boards of the districts to which the dissolving district is to be attached may adopt a joint resolution that accomplishes the purpose in this paragraph.\n(b) Notwithstanding any other law to the contrary, upon receipt of a resolution under paragraph (a), the board of the dissolving district must certify levies in the amounts specified in the resolution for taxes payable in the year the dissolution is effective.",
	"repealed": false
}