{
	"id": "3.972",
	"url": "https://www.revisor.mn.gov/statutes/cite/3.972",
	"title": "3.972 AUDITS OF AGENCIES.",
	"text": "For the purposes of this section, \"public accountant\" means a certified public accountant or certified public accounting firm licensed in accordance with chapter 326A.\nThe legislative auditor shall, as resources permit, audit the financial activities of: (1) all departments, agencies, offices, and other organizations in the state executive branch; (2) courts, offices, and other organizations in the state judicial branch; and (3) public boards, associations, societies, and other public organizations created by state law or supported, wholly or in part, by state funds. The legislative auditor shall ascertain that all financial transactions and operations involving the public funds and property of the state comply with the spirit and purpose of the law, are sound by modern standards of financial management, and are for the best protection of public funds and other public resources.\nTo ensure effective legislative oversight and accountability, the legislative auditor shall give high priority to auditing the programs, services, and benefits administered by the Department of Human Services. As resources permit, the legislative auditor shall track and assess expenditures throughout the human service delivery system, from the department to the point of service delivery, and determine whether human services programs, services, and benefits are being provided cost-effectively and only to eligible individuals and organizations in compliance with applicable legal requirements.\n(a) The legislative auditor shall audit each managed care organization that contracts with the commissioner of human services to provide health care services under sections 256B.69, 256B.692, and 256L.12. The legislative auditor shall design the audits to determine if a managed care organization used the public money in compliance with federal and state laws, rules, and in accordance with provisions in the managed care organization's contract with the commissioner of human services. The legislative auditor shall determine the schedule and scope of the audit work and may contract with vendors to assist with the audits. The managed care organization must cooperate with the legislative auditor and must provide the legislative auditor with all data, documents, and other information, regardless of classification, that the legislative auditor requests to conduct an audit. The legislative auditor shall periodically report audit results and recommendations to the Legislative Audit Commission and the chairs and ranking minority members of the legislative committees with jurisdiction over health and human services policy and finance.\n(b) For purposes of this subdivision, a \"managed care organization\" means a demonstration provider as defined under section 256B.69, subdivision 2.\n[Repealed, 2021 c 31 art 1 s 27]\n[Repealed, 2021 c 31 art 1 s 27]\nA state department, board, commission, or other state agency contracting with a public accountant for an audit, except a contract negotiated by the state auditor for an audit of a local government, must provide the legislative auditor with a copy of the final report of the audit upon completion of the audit.\nMS 2018 [Repealed, 1Sp2019 c 3 art 3 s 140]",
	"repealed": false
}