{
	"id": "299F.362",
	"url": "https://www.revisor.mn.gov/statutes/cite/299F.362",
	"title": "299F.362 SMOKE ALARM; INSTALLATION; RULES; PENALTY.",
	"text": "For the purposes of this section, the following definitions shall apply:\n(a) \"Apartment house\" is any building, or portion thereof, which is designed, built, rented, leased, let, or hired out to be occupied, or which is occupied as the home or residence of three or more families living independently of each other and doing their own cooking in the building, and shall include buildings containing three or more flats or apartments.\n(b) \"Dwelling\" is any building, or any portion thereof, which is not an apartment house, lodging house, or a hotel and which contains one or two \"dwelling units\" which are, or are intended or designed to be, occupied for living purposes.\n(c) \"Dwelling unit\" is a single unit providing complete, independent living facilities for one or more persons including permanent provisions for living, sleeping, eating, cooking, and sanitation, or a single unit used by one or more persons for sleeping and sanitation pursuant to a work practice or labor agreement.\n(d) \"Hotel\" is any building, or portion thereof, containing six or more guest rooms intended or designed to be used, or which are used, rented, or hired out to be occupied, or which are occupied for sleeping purposes by guests.\n(e) \"Lodging house\" is any building, or portion thereof, containing not more than five guest rooms which are used or are intended to be used for sleeping purposes by guests and where rent is paid in money, goods, labor, or otherwise.\nThe commissioner of public safety shall promulgate rules concerning the placement of smoke alarms in dwellings, apartment houses, hotels, and lodging houses. The rules shall take into account designs of the guest rooms or dwelling units.\nEvery dwelling unit within a dwelling must be provided with a smoke alarm meeting the requirements of the State Fire Code. The smoke alarm must be mounted in accordance with the rules regarding smoke alarm location adopted under subdivision 2. When actuated, the smoke alarm must provide an alarm in the dwelling unit.\nIn construction of a new dwelling, each smoke alarm must be attached to a centralized power source.\nEvery dwelling unit within an apartment house and every guest room in a lodging house or hotel used for sleeping purposes must be provided with a smoke alarm conforming to the requirements of the State Fire Code. In dwelling units, smoke alarms must be mounted in accordance with the rules regarding smoke alarm location adopted under subdivision 2. When actuated, the smoke alarm must provide an alarm in the dwelling unit or guest room.\nFor all occupancies covered by this section where the occupant is not the owner of the dwelling unit or the guest room, the owner is responsible for maintenance of the smoke alarms. An owner may file inspection and maintenance reports with the local fire marshal for establishing evidence of inspection and maintenance of smoke alarms.\nThe occupant of a dwelling unit must inform the owner of the dwelling unit of a nonfunctioning smoke alarm within 24 hours of discovering that the smoke alarm in the dwelling unit is not functioning. If the occupant fails to inform the owner under this subdivision, the occupant's liability for damages is not greater than it otherwise would be.\n(a) Any person who violates any provision of this section is subject to the same penalty and enforcement mechanism that is provided for violation of the State Fire Code, as specified in section 299F.011, subdivision 6.\n(b) An occupant who willfully disables a smoke alarm or causes it to be nonfunctioning, resulting in damage or injury to persons or property, is guilty of a misdemeanor.\nThis section prohibits a local unit of government from adopting standards different from those provided in this section.\n[Repealed, 1991 c 199 art 1 s 67]\nNotwithstanding subdivision 7, or other law to the contrary, a local governing body may adopt, by ordinance, rules for the installation of a smoke alarm in single-family homes in the city that are more restrictive than the standards provided by this section. Rules adopted pursuant to this subdivision may be enforced through a truth-in-housing inspection.\nMS 1988 [Repealed, 1989 c 322 s 5]\nThe position of Minnesota public fire safety educator is established in the Department of Public Safety.\nNo insurer shall deny a claim for loss or damage by fire for failure of a person to comply with this section.",
	"repealed": false
}