{
	"id": "114C.11",
	"url": "https://www.revisor.mn.gov/statutes/cite/114C.11",
	"title": "114C.11 MINNESOTA XL PERMITS.",
	"text": "(a) The commissioner of the Pollution Control Agency may solicit requests for participation and shall select the participants in the project based on the policy set forth in section 114C.01 and to satisfy the criteria of subdivisions 2 and 3. In addition, the commissioner shall select participants that collectively represent a variety of facility types and projects that are expected to reduce air, water, and land pollution. A power generation facility may not be selected to participate in the project or be issued a Minnesota XL permit unless its proposal includes a plan for significantly reducing mercury emissions.\n(b) The prospective permittees must be regulated by the agency under chapter 115, chapter 116, or both, and voluntarily submit a proposal for a Minnesota XL permit. The proposal must address the major pollution impact from the facility or facilities included in the proposal.\n(c) If, in the course of preparing a Minnesota XL permit for a prospective permittee, the commissioner concludes that the Minnesota XL permit will not sufficiently promote the policy of section 114C.01 or meet the issuance criteria in this section, the commissioner may remove the prospective permittee from the project. In that event, the commissioner shall provide the prospective permittee with a reasonable amount of time to obtain alternative permits made necessary by removal from the project.\nThe Pollution Control Agency may issue and amend a Minnesota XL permit if the agency finds that the following minimum criteria are met:\n(1) the permit will facilitate pollution prevention and source reduction activities by the facility and result in significantly lower overall levels of pollution from the facility, its customers, or suppliers than would otherwise be required by applicable laws, without: (i) increasing the negative impact on the environment, the local community, or worker health and safety; or (ii) transferring pollution impacts into the product;\n(2) the pollution prevention, source reduction, or other pollution reduction goals are verifiable;\n(3) the pollution limits contained in the permit are verifiable and enforceable;\n(4) the stakeholder group has been involved through a decision-making process that seeks consensus in the design of the permit and will have the opportunity for continued involvement in the implementation and evaluation of it;\n(5) the permittee agrees to make available information that it gives the agency about the XL project, except information that is nonpublic under chapter 13 or confidential under section 116.075, to the stakeholder group in a format that is easily understood;\n(6) the permittee agrees to provide an assessment of the success of the project in reducing the time and money spent at the facility on paperwork and other administrative tasks that do not directly benefit the environment;\n(7) the permittee, the Pollution Control Agency, and other state and local agencies are likely to expend less time and resources over the long term to administer the Minnesota XL permit than other types of permits; and\n(8) the project is not inconsistent with the federal government's Project XL guidance or any federal laws governing the Project XL program.\nIn addition to the minimum criteria in subdivision 2, the commissioner in selecting participants and the agency in issuing or amending a Minnesota XL permit, must find that the permit meets one or more of the following criteria:\n(1) the permit allows the facility owner or operator as much operational flexibility as can be reasonably provided consistent with the need to achieve the anticipated pollution reduction and ensure the verifiability and enforceability of the permit's pollution limits;\n(2) the permit provides facility-wide pollution limits where practical, verifiable, and enforceable;\n(3) the permit regulates air, water, and land pollution effects, direct and indirect;\n(4) the permit encourages pollution prevention or source reduction;\n(5) the permit encourages innovation in the design, production, distribution, use, reuse, recycling, or disposal of a product such that air, water, and land pollution impacts are minimized over the life cycle of a product;\n(6) the permit reduces the emission of nontoxic pollutants regulated under applicable law;\n(7) the permit reduces indoor chemical exposure, water use, or energy use;\n(8) the permit minimizes transfer, direct and indirect, of pollution between the air, water, and land;\n(9) the regulatory techniques employed in the permit have potential application to other permittees;\n(10) the permittee agrees to measure and demonstrate the success of the Minnesota XL permit in addition to the assessment in subdivision 2, clause (6), such as tracking pollution prevention incentives and initiatives or using surveys to measure any attitudinal changes by facility personnel or the public;\n(11) the permit is multiagency, under subdivision 4.\nThe Pollution Control Agency may include or vary in a Minnesota XL permit the related requirements of other state or local agencies, if the Pollution Control Agency, the prospective permittee, and the other state or local agency find that it is reasonable to do so. Notwithstanding conflicting procedural requirements, the other agencies may exercise their related permitting, licensing, or other approval responsibilities by including their requirements in the Minnesota XL permit. The Pollution Control Agency may not include or vary the related requirements of other state or local agencies in a Minnesota XL permit unless the other agencies agree to sign the permit. The Minnesota XL permit shall identify any requirement, the source of which is not the Pollution Control Agency, and identify the source agency. The commissioner of the Pollution Control Agency and the other agencies may agree to share inspection or other responsibilities related to the Minnesota XL permit. For purposes of this subdivision, requirements are related if they have a direct or indirect bearing on environmental protection or indoor chemical exposure.\nSections 114C.10 to 114C.19 do not supersede the requirements of chapter 116D and the rules adopted under it.\nA permittee complies with the plan content and timing requirements of sections 115D.07, 115E.04, and 115E.045 if the Minnesota XL permit requires the permittee to include in an overall environmental management plan satisfactory alternative information. A permittee complies with the progress report content and timing requirements of section 115D.08 if the Minnesota XL permit requires the permittee to include in its overall reporting requirements satisfactory alternative information, and specifies a schedule for submitting the information.",
	"repealed": false
}