{
	"id": "123A.74",
	"url": "https://www.revisor.mn.gov/statutes/cite/123A.74",
	"title": "123A.74 OBLIGATIONS UPON DISTRICT REORGANIZATION.",
	"text": "If a district has a capital loan outstanding at the time of reorganization according to section 123A.46, 123A.48, or sections 123A.35 to 123A.43, and if the plan for reorganization provides for payment of all or a portion of the capital loan obligation by the newly created or enlarged district or makes no provision for payment, all of the taxable property in the newly created or enlarged district is taxable for the payment to the extent stated in the plan. Notwithstanding any contract to the contrary, if all of the taxable property in the newly created or enlarged district is taxable for the payment of the capital loan and until the capital loan is retired or canceled, the maximum effort debt service levy must be recalculated annually by the department to be equal to the required debt service levy plus an additional amount. The additional amount must be the greater of:\n(i) zero, or\n(ii) the maximum effort debt service levy of the preexisting district minus the required debt service levy of the preexisting district that received the capital loan.\nFor the purpose of the recalculation, additional bond issues after the date of the reorganization shall not impact the maximum effort debt service levy or the required debt service levy.\nNotwithstanding any contract to the contrary, the plan for reorganization may specify that the obligation for a capital loan remains solely with the preexisting district that incurred the obligation. This subdivision does not relieve any property from any tax liability for payment of any capital loan obligation.\nIf a district has an energy loan outstanding at the time of reorganization according to section 123A.46, 123A.48, or sections 123A.35 to 123A.43, and if the plan for reorganization provides for payment of all or a portion of the energy loan obligation by the newly created or enlarged district or makes no provision for payment, all of the taxable property in the newly created or enlarged district is taxable for the payment.\nNotwithstanding any contract to the contrary, the plan for reorganization may specify that the obligation for an energy loan remains solely with the preexisting district that incurred the obligation. This subdivision does not relieve any property from any tax liability for payment of any energy loan obligation.",
	"repealed": false
}