{
	"id": "245.470",
	"url": "https://www.revisor.mn.gov/statutes/cite/245.470",
	"title": "245.470 OUTPATIENT SERVICES.",
	"text": "(a) County boards must provide or contract for enough outpatient services within the county to meet the needs of adults with mental illness residing in the county. Services may be provided directly by the county through county-operated mental health clinics meeting the standards of chapter 245I; by contract with privately operated mental health clinics meeting the standards of chapter 245I; by contract with hospital mental health outpatient programs certified by the Joint Commission on Accreditation of Hospital Organizations; or by contract with a mental health professional. Clients may be required to pay a fee according to section 245.481. Outpatient services include:\n(1) conducting diagnostic assessments;\n(2) conducting psychological testing;\n(3) developing or modifying individual treatment plans;\n(4) making referrals and recommending placements as appropriate;\n(5) treating an adult's mental health needs through therapy;\n(6) prescribing and managing medication and evaluating the effectiveness of prescribed medication; and\n(7) preventing placement in settings that are more intensive, costly, or restrictive than necessary and appropriate to meet client needs.\n(b) County boards may request a waiver allowing outpatient services to be provided in a nearby trade area if it is determined that the client can best be served outside the county.\nThe county board shall require that all service providers of outpatient services:\n(1) meet the professional qualifications contained in sections 245.461 to 245.486;\n(2) use a multidisciplinary mental health professional staff including at a minimum, arrangements for psychiatric consultation, licensed psychologist consultation, and other necessary multidisciplinary mental health professionals;\n(3) develop individual treatment plans;\n(4) provide initial appointments within three weeks, except in emergencies where there must be immediate access as described in section 245.469; and\n(5) establish fee schedules approved by the county board that are based on a client's ability to pay.",
	"repealed": false
}