{
	"id": "299C.52",
	"url": "https://www.revisor.mn.gov/statutes/cite/299C.52",
	"title": "299C.52 MINNESOTA MISSING CHILDREN AND ENDANGERED PERSONS PROGRAM.",
	"text": "As used in sections 299C.52 to 299C.565, the following terms have the meanings given them:\n(a) \"Child\" means any person under the age of 18 years or any person certified or known to be mentally incompetent.\n(b) \"DNA\" means deoxyribonucleic acid from a human biological specimen.\n(c) \"Endangered\" means that a law enforcement official has received sufficient evidence that the missing person is at risk of physical injury or death. The following circumstances indicate that a missing person is at risk of physical injury or death:\n(1) the person is missing as a result of a confirmed abduction or under circumstances that indicate that the person's disappearance was not voluntary;\n(2) the person is missing under known dangerous circumstances;\n(3) the person is missing more than 30 days;\n(4) the person is under the age of 21 and at least one other factor in this paragraph is applicable;\n(5) there is evidence the person is in need of medical attention or prescription medication such that it will have a serious adverse effect on the person's health if the person does not receive the needed care or medication;\n(6) the person does not have a pattern of running away or disappearing;\n(7) the person is mentally impaired;\n(8) there is evidence that the person may have been abducted by a noncustodial parent;\n(9) the person has been the subject of past threats or acts of violence;\n(10) there is evidence the person is lost in the wilderness, backcountry, or outdoors where survival is precarious and immediate and effective investigation and search and rescue efforts are critical; or\n(11) any other factor that the law enforcement agency deems to indicate that the person may be at risk of physical injury or death, including a determination by another law enforcement agency that the person is missing and endangered.\n(d) \"Missing\" means the status of a person after a law enforcement agency that has received a report of a missing person has conducted a preliminary investigation and determined that the person cannot be located.\n(e) \"NCIC\" means National Crime Information Center.\nThe commissioner of public safety shall maintain a Minnesota missing children and endangered persons program within the department to enable documented information about missing Minnesota children and endangered persons to be entered into the NCIC computer.\n(a) The commissioner shall provide the necessary computer hardware and computer programs to enter, modify, and cancel information on missing children and endangered persons in the NCIC computer. These programs must provide for search and retrieval of information using the following identifiers: physical description, name and date of birth, name and Social Security number, name and driver's license number, vehicle license number, and vehicle identification number.\n(b) The commissioner shall also provide a system for regional, statewide, multistate, and nationwide broadcasts of information on missing children and endangered persons. These broadcasts shall be made by local law enforcement agencies where possible or, in the case of statewide or nationwide broadcasts, by the Bureau of Criminal Apprehension upon request of the local law enforcement agency.\nOnly law enforcement agencies may enter missing children and endangered persons information into the NCIC computer or retrieve information from the NCIC computer.\nThe commissioner shall annually compile and make available statistical information on the number of missing children and endangered persons entered into the NCIC computer and, if available, information on the number located.\nThe commissioner may adopt rules in conformance with sections 299C.52 to 299C.565 to provide for the orderly collection and entry of missing children and endangered persons information and requests for retrieval of missing children and endangered persons information.\nThe commissioner shall cooperate with other states and the NCIC in the exchange of information on missing persons.",
	"repealed": false
}