{
	"id": "2.724",
	"url": "https://www.revisor.mn.gov/statutes/cite/2.724",
	"title": "2.724 CHIEF JUSTICE OF SUPREME COURT, DUTIES.",
	"text": "When public convenience and necessity require it, the chief justice of the supreme court may assign any judge of any court to serve and discharge the duties of judge of any court in a judicial district not that judge's own at such times as the chief justice may determine. A judge may appeal an assignment to serve on a court in a judicial district not that judge's own to the supreme court and the appeal shall be decided before the assignment is effective. Notwithstanding the provisions of this subdivision, no judge shall be assigned to serve on a court in a judicial district which is located more than 50 miles from the boundary of that judge's judicial district for more than 15 working days in any 12-month period, unless the judge consents to the assignment.\nA transferred judge shall be subject to the assignment powers of the chief judge of the judicial district to which the judge is transferred.\nTo promote and secure more efficient administration of justice, the chief justice of the supreme court of the state shall supervise and coordinate the work of the courts of the state. The supreme court may provide by rule that the chief justice not be required to write opinions as a member of the supreme court. Its rules may further provide for it to hear and consider cases in divisions. It may by rule assign temporarily any retired justice of the supreme court or one judge of the court of appeals or district court judge at a time to act as a justice of the supreme court or any number of justices or retired justices of the supreme court to act as judges of the court of appeals. Upon the assignment of a court of appeals judge or a district court judge to act as a justice of the supreme court, a judge previously acting as a justice may complete unfinished duties of that position. Any number of justices may disqualify themselves from hearing and considering a case, in which event the supreme court may assign temporarily a retired justice of the supreme court, a court of appeals judge, or a district court judge to hear and consider the case in place of each disqualified justice.\n(a) The chief justice of the supreme court may assign a retired justice of the supreme court to act as a justice of the supreme court pursuant to subdivision 2 or as a judge of any other court. The chief justice may assign a retired judge of any court to act as a judge of any court except the supreme court. The chief justice of the supreme court shall determine the pay and expenses to be received by a justice or judge acting pursuant to this paragraph.\n(b) A judge who has been elected to office and who has retired as a judge in good standing and is not practicing law may also be appointed to serve as judge of any court except the supreme court. A retired judge acting under this paragraph will receive pay and expenses in the amount established by the supreme court.\nThe chief justice shall exercise general supervisory powers over the courts in the state, with powers including, but not limited to:\n(a) Supervision of the courts' financial affairs, programs of continuing education for judicial and nonjudicial personnel and planning and operations research;\n(b) Serving as chief representative of the court system and as liaison with other governmental agencies for the public; and\n(c) Supervision of the administrative operations of the courts.\nThe chief justice may designate other justices or judges to assist in the performance of duties.",
	"repealed": false
}