{
	"id": "41C.05",
	"url": "https://www.revisor.mn.gov/statutes/cite/41C.05",
	"title": "41C.05 AGRICULTURAL DEVELOPMENT BOND BEGINNING FARMER AND AGRICULTURAL BUSINESS ENTERPRISE LOAN PROGRAM.",
	"text": "The authority shall develop an agricultural development bond beginning farmer and agricultural business enterprise loan program to facilitate the acquisition of agricultural land and improvements and depreciable agricultural property by beginning farmers and real and personal property by an agricultural business enterprise. The authority shall exercise the powers granted to it in this chapter in order to fulfill the goal of providing financial assistance to beginning farmers and agricultural business enterprises in the acquisition of agricultural land, agricultural improvements, depreciable agricultural property, and real and personal property for an agricultural business enterprise. The authority may participate in and cooperate with programs of the Farmers Home Administration, Federal Land Bank, or any other agency or instrumentality of the federal government or with any program of any other state agency in the administration of the agricultural development bond beginning farmer and agricultural business enterprise loan program and in the making or purchasing of mortgage or secured loans under this chapter.\nThe authority shall provide in the agricultural development bond beginning farmer and agricultural business enterprise loan program that a mortgage or a contract on behalf of a beginning farmer may be provided if the borrower qualifies under authority rules and under federal tax law governing qualified small issue bonds and must:\n(1) be a resident of Minnesota;\n(2) have sufficient education, training, or experience in the type of farming for which the loan is desired;\n(3) have a low or moderate net worth, as defined in section 41C.02, subdivision 12;\n(4) certify that the agricultural land to be purchased will be used by the borrower for agricultural purposes;\n(5) certify that farming will be the principal occupation of an individual borrower;\n(6) agree to participate in a farm management program approved by the commissioner of agriculture for at least the first three years of the loan, if an approved program is available within 45 miles from the borrower's residence. The commissioner may waive this requirement for any of the programs administered by the authority if the participant requests a waiver and provides justification; and\n(7) agree to file an approved soil and water conservation plan with the Natural Resources Conservation Service office in the county where the land is located.\n(a) The authority shall provide in the agricultural development bond beginning farmer and agricultural business enterprise loan program that a mortgage or contract on behalf of an agricultural business enterprise may be provided if the borrower qualifies under this chapter and rules of the authority and under federal tax law governing qualified small issue bonds.\n(b) An agricultural business enterprise is eligible for a program loan in an aggregate amount not exceeding $250,000.\n(c) An agricultural business enterprise is eligible for program loans only for new or expanded operations located in a community with a population of 5,000 or less.\n(a) The authority may:\n(1) make loans to qualified beginning farmers for the acquisition of agricultural land, agricultural improvements, depreciable agricultural property, and real and personal property for an agricultural business enterprise. Each loan made by the authority under this program and all collateral securing the loan may be assigned as security for the authority's bond.\n(2) enter into contracts to purchase agricultural land, agricultural improvements, depreciable agricultural property, and real and personal property for an agricultural business enterprise. Each contract entered into by the authority under this program and all obligations of the authority under the contract shall be assigned to the beginning farmer or agricultural business enterprise without recourse.\n(b) Loan documents and contracts entered into by the authority shall contain such terms and conditions of repayment as may be agreed to between the beginning farmer or agricultural business enterprise and the individual or agricultural lender involved, and such terms and conditions as the authority may deem necessary.\n(c) Each individual or agricultural lender purchasing a bond from the authority under this program is responsible for making their own independent credit evaluation of the beginning farmer or the agricultural business enterprise involved, and for the creation and perfection of any security interest which they deem necessary for the loan or contract to be made on behalf of the beginning farmer or the agricultural business enterprise.\n(d) The authority shall bear no continuing responsibility for repayment of any bond issued under the program other than the assignment of its interests under the loan document made with the proceeds of the bond or the contract entered into in connection with the bond.\nThe authority may provide that loans and contracts made under this program may not be assumed or any interest in the agricultural land or improvements or depreciable agricultural property or real or personal property of an agricultural business enterprise may not be leased, sold, or otherwise conveyed without its prior written consent and may provide a due-on-sale clause with respect to the occurrence of any of the foregoing events without its prior written consent. The authority may provide by rule the grounds for permitted assumptions of loans and contracts or for the leasing, sale, or other conveyance of any interest in the agricultural land or improvements or real or personal property of an agricultural business enterprise. However, the authority shall provide and state in its loan documents and contracts that the interest rate of the loan or contracts shall increase to the then prevailing market rate if the loan or contract is assumed by anyone other than a qualified beginning farmer or agricultural business enterprise. This subdivision controls with respect to a loan or contract made under this program, notwithstanding other law.",
	"repealed": false
}