{
	"id": "326B.802",
	"url": "https://www.revisor.mn.gov/statutes/cite/326B.802",
	"title": "326B.802 DEFINITIONS.",
	"text": "The definitions in this section apply to sections 326B.802 to 326B.885.\nAn \"affiliate\" of another person means any person directly or indirectly controlling, controlled by, or under common control with the other person.\n\"Gross annual receipts\" means the total amount derived from residential contracting or remodeling activities, regardless of where the activities are performed, and must not be reduced by cost of goods sold, expenses, losses, or any other amount.\n\"Lessee\" means one who rents or leases residential real estate pursuant to a written lease agreement of at least one year's duration.\n\"Licensee\" means a residential building contractor, residential remodeler, manufactured home installer, or residential roofer licensed under sections 326B.802 to 326B.885.\n\"Manufactured home\" has the meaning given it in section 327.31, subdivision 6.\n\"Manufactured home installer\" has the meaning given it in section 327.31, subdivision 11.\n\"Mechanical contractor\" means a person, sole proprietor, partnership, joint venture, corporation, or other organization which is in the business of erection, installation, alteration, repair, relocation, replacement, addition to, use, or maintenance of any heating, ventilating, cooling, process piping, plumbing, fire protection, or refrigeration systems, incinerators, or other miscellaneous heat-producing appliance, piping, or equipment or appliances associated with those systems.\n\"Owner,\" when used in connection with real property, means a person who has any legal or equitable interest in the real property.\n\"Qualifying person\" means the individual who fulfills the examination and education requirements for licensure on behalf of the licensee.\n\"Residential building contractor\" means a person in the business of building residential real estate, or of contracting or offering to contract with an owner to build residential real estate, by providing two or more special skills as defined in this section. A residential building contractor may also contract or offer to contract with an owner to improve existing residential real estate.\n\"Residential remodeler\" means a person in the business of contracting or offering to contract with an owner to improve existing residential real estate by providing two or more special skills as defined in this section.\n\"Residential real estate\" means a new or existing building constructed for habitation by one to four families, and includes detached garages.\n\"Residential roofer\" means a person in the business of contracting, or offering to contract with an owner, to complete work on residential real estate in roof coverings, roof sheathing, roof weatherproofing and insulation, and repair of roof systems, but not construction of new roof systems.\n\"Special skill\" means one of the following eight categories:\n(a) Excavation. Excavation includes work in any of the following areas:\n(1) excavation;\n(2) trenching;\n(3) grading; and\n(4) site grading.\n(b) Masonry and concrete. Masonry and concrete includes work in any of the following areas:\n(1) drain systems;\n(2) poured walls;\n(3) slabs and poured-in-place footings;\n(4) masonry walls;\n(5) masonry fireplaces;\n(6) masonry veneer; and\n(7) water resistance and waterproofing.\n(c) Carpentry. Carpentry includes work in any of the following areas:\n(1) rough framing;\n(2) finish carpentry;\n(3) doors, windows, and skylights;\n(4) porches and decks, excluding footings;\n(5) wood foundations; and\n(6) drywall installation, excluding taping and finishing.\n(d) Interior finishing. Interior finishing includes work in any of the following areas:\n(1) floor covering;\n(2) wood floors;\n(3) cabinet and counter top installation;\n(4) insulation and vapor barriers;\n(5) interior or exterior painting;\n(6) ceramic, marble, and quarry tile;\n(7) ornamental guardrail and installation of prefabricated stairs; and\n(8) wallpapering.\n(e) Exterior finishing. Exterior finishing includes work in any of the following areas:\n(1) siding;\n(2) soffit, fascia, and trim;\n(3) exterior plaster and stucco;\n(4) painting; and\n(5) rain carrying systems, including gutters and down spouts.\n(f) Drywall and plaster. Drywall and plaster includes work in any of the following areas:\n(1) installation;\n(2) taping;\n(3) finishing;\n(4) interior plaster;\n(5) painting; and\n(6) wallpapering.\n(g) Residential roofing. Residential roofing includes work in any of the following areas:\n(1) roof coverings;\n(2) roof sheathing;\n(3) roof weatherproofing and insulation;\n(4) repair of roof support system, but not construction of new roof support system; and\n(5) penetration of roof coverings for purposes of attaching a solar photovoltaic system.\n(h) General installation specialties. Installation includes work in any of the following areas:\n(1) garage doors and openers;\n(2) pools, spas, and hot tubs;\n(3) fireplaces and wood stoves;\n(4) asphalt paving and seal coating;\n(5) ornamental guardrail and prefabricated stairs; and\n(6) assembly of the support system for a solar photovoltaic system.\n\"Specialty contractor\" means a person in the business of contracting or offering to contract to build or improve residential real estate by providing only one special skill as defined in this section.\n\"Garage\" means a structure attached to or in reasonable proximity to a dwelling, which is used or intended to be used primarily for the protection or storage of automobiles or other personal vehicles owned or driven by the occupants of the dwelling.",
	"repealed": false
}