{
	"id": "18B.316",
	"url": "https://www.revisor.mn.gov/statutes/cite/18B.316",
	"title": "18B.316 AGRICULTURAL PESTICIDE DEALER LICENSE AND REPORTING.",
	"text": "(a) A person must not offer for sale or sell an agricultural pesticide in the state or into the state without first obtaining an agricultural pesticide dealer license.\n(b) Each location or place of business from which an agricultural pesticide is offered for sale or sold in the state or into the state is required to have a separate agricultural pesticide dealer license.\n(c) A person who is a licensed pesticide dealer under section 18B.31 is not required to also be licensed under this subdivision.\nA person who is a pesticide registrant under provisions of this chapter is exempt from the requirement of subdivision 1, except in those cases where a registrant first sells an agricultural pesticide in or into the state to a pesticide end user, the registrant must first obtain an agricultural pesticide dealer license.\nA person required to be licensed under subdivisions 1 and 2, or a person licensed as a pesticide dealer pursuant to section 18B.31 and who operates from a location or place of business outside the state and who offers for sale or sells an agricultural pesticide into the state, must continuously maintain in this state the following:\n(1) a registered office; and\n(2) a registered agent, who may be either a resident of this state whose business office or residence is identical with the registered office under clause (1), a domestic corporation or limited liability company, or a foreign corporation of limited liability company authorized to transact business in this state and having a business office identical with the registered office.\nA person licensed under this section or section 18B.31 shall annually file with the commissioner, either at the time of initial licensing or as part of license renewal, the name, address, telephone number, and email address of the licensee's registered agent.\nFor licensees under section 18B.31 who are located in the state, the licensee is the registered agent.\nThe resident agent is responsible for the acts of a licensed agricultural pesticide dealer, or of a licensed pesticide dealer under section 18B.31 who operates from a location or place of business outside the state and who offers for sale or sells an agricultural pesticide into the state, as well as the acts of the employees of those licensees.\nA person licensed as an agricultural pesticide dealer, or a person licensed as a pesticide dealer pursuant to section 18B.31, must maintain for five years at the person's principal place of business accurate records of purchases, sales, and distributions of agricultural pesticides in and into this state, including those of its branch locations. The records shall be made available for audit under provisions of this chapter and chapter 18D.\n(a) Sales invoices for agricultural pesticides sold in or into this state by a licensed agricultural pesticide dealer or a pesticide dealer under this section must show the percent of gross sales fee rate assessed and the gross sales fee paid under section 18B.26, subdivision 3, paragraph (c).\n(b) A licensed agricultural pesticide dealer or a pesticide dealer may request an exemption from paragraph (a). The request for exemption must be in writing to the commissioner and must include verifiable information to justify that compliance with paragraph (a) is an extreme business hardship for the licensed agricultural pesticide dealer or pesticide dealer. The commissioner may approve or reject a request for exemption based upon review of the submitted information. An approved exemption under this paragraph is valid for one calendar year. The commissioner must maintain a list of those licensed agricultural pesticide dealers or pesticide dealers that have been granted an exemption on the department's website.\n(c) A licensed agricultural pesticide dealer or a pesticide dealer issued an exemption under paragraph (b) must include the following statement on each sales invoice for any sale of an agricultural pesticide: \"Minnesota Department of Agriculture Annual Gross Sales Fees of 0.55% have been Assessed and Paid on the Sale of an Agricultural Pesticide.\"\n(d) Only the person who actually will pay the gross sales fee may show the rate or the amount of the fee as a line item on the sales invoice.\nAn agricultural pesticide dealer license:\n(1) is issued by the commissioner upon receipt and review of a complete initial or renewal application;\n(2) is valid for one year and expires on January 31 of each year;\n(3) is not transferable from one location or place of business to another location or place of business; and\n(4) must be prominently displayed to the public in the agricultural pesticide dealer's place of business and in the registered office of the resident agent.\nA person who is an agricultural pesticide dealer, or is a licensed pesticide dealer under section 18B.31, who offers for sale or sells an agricultural pesticide in or into the state, and a pesticide registrant pursuant to section 18B.26, subdivision 3, paragraph (d), shall no later than January 31 of each year report and pay applicable fees on annual gross sales of agricultural pesticides to the commissioner pursuant to requirements under section 18B.26, subdivision 3, paragraphs (c) and (h).\n(a) A person must apply to the commissioner for an agricultural pesticide dealer license on forms and in a manner approved by the commissioner.\n(b) The applicant must be the person in charge of each location or place of business from which agricultural pesticides are offered for sale or sold in or into the state.\n(c) The commissioner may require that the applicant provide information regarding the applicant's proposed operations and other information considered pertinent by the commissioner.\n(d) The commissioner may require additional demonstration of licensee qualification if the licensee has had a license suspended or revoked, or has otherwise had a history of violations in another state or violations of this chapter.\n(e) A licensed agricultural pesticide dealer who changes the dealer's address or place of business must immediately notify the commissioner of the change.\n(f) Beginning January 1, 2011, an application for renewal of an agricultural pesticide dealer license is complete only when a report and any applicable payment of fees under subdivision 8 are received by the commissioner.\n(a) An application for an agricultural pesticide dealer license, or a renewal of an agricultural pesticide dealer license, must be accompanied by a nonrefundable fee of $150.\n(b) If an application for renewal of an agricultural pesticide dealer license is not filed before the license expires, an additional fee of 50 percent of the application fee must be paid by the applicant before the commissioner may issue the license.",
	"repealed": false
}