{
	"id": "145.958",
	"url": "https://www.revisor.mn.gov/statutes/cite/145.958",
	"title": "145.958 YOUTH VIOLENCE PREVENTION.",
	"text": "For purposes of this section, \"at-risk youth\" means adolescents and teenagers who are likely to be a threat to the health and well-being of themselves or others through gang involvement, alcohol and drug use, unsafe sexual activity, dropping out of school, or through violence and other criminal activity.\n(a) Community-based violence prevention programs may apply to the commissioner of health for technical assistance. The programs must be community-based efforts serving at-risk youth and must work in collaboration with local schools, law enforcement agencies, faith communities, and community groups to provide a comprehensive approach to reducing youth violence by addressing the needs of at-risk youth.\n(b) The programs must:\n(1) ensure that there are trusted adults serving as role models and mentors for at-risk youth;\n(2) intervene at the first signs that a youth may be at risk and strive to rehabilitate youth who are already involved in violence;\n(3) work to strengthen families;\n(4) work with schools in order to keep students engaged and help them prepare for higher education or job training; and\n(5) teach self-respect and respect of others so that unsafe and unhealthy behaviors may be avoided.\n(c) Violence prevention programs may include, but are not limited to:\n(1) mentorship;\n(2) job placement and support;\n(3) youth violence prevention training;\n(4) parent and family intervention and teaching parenting skills;\n(5) school-related initiative involving police liaison officers, youth leadership, peer mediation systems, after-school activities, and intervention in truancy cases;\n(6) substance use disorder and mental health intervention, screening, and assessment;\n(7) assisting juvenile offenders in reconnecting with families and reintegrating into the community;\n(8) working with youth to prevent sexual violence;\n(9) working with youth to prevent pregnancy and sexually transmitted infections; and\n(10) a youth helpline and street outreach workers to connect youth with needed services.\n(a) The commissioner of health, in collaboration with the commissioners of public safety, human services, and education, shall identify five community-based violence prevention programs that meet the criteria described in this section. One of these programs identified must be serving the youth in Minneapolis, one program must be serving the youth in St. Paul, and the remaining three programs must be serving youth in outstate communities.\n(b) The commissioner of health shall provide technical support to these community programs including, but not limited to, assistance in seeking and applying for federal grants and private foundation funding.\n(c) The commissioner of health shall monitor the progress of these programs in terms of the impact on public health and reducing juvenile violent crime and shall identify the effective aspects of each program in order to assist other programs in replicating these successful aspects.\n(d) The commissioner of health shall apply for private, state, or federal funding to support the activities described in this subdivision. This subdivision is effective upon the availability of funding to support these activities.",
	"repealed": false
}