{
	"id": "169.865",
	"url": "https://www.revisor.mn.gov/statutes/cite/169.865",
	"title": "169.865 SPECIAL FARM PRODUCTS PERMITS.",
	"text": "[Renumbered subd 1b]\nFor purposes of this section, \"qualifying agricultural products\" means:\n(1) agricultural crops, including but not limited to corn, soybeans, oats, grain, and by-products of agricultural crops;\n(2) livestock, including but not limited to cattle, hogs, and poultry;\n(3) food crops, including but not limited to sugar beets, potatoes, carrots, and onions;\n(4) fluid milk;\n(5) seed and material used for or in livestock and poultry feed;\n(6) livestock manure; and\n(7) raw or processed grass seed.\n(a) A road authority may issue an annual permit authorizing a vehicle or combination of vehicles with a total of six or more axles to haul qualifying agricultural products and be operated with a gross vehicle weight of up to:\n(1) 90,000 pounds; and\n(2) 99,000 pounds during the period set by the commissioner under section 169.826, subdivision 1.\n(b) Notwithstanding subdivision 3, paragraph (a), clause (4), a vehicle or combination of vehicles operated under this subdivision and transporting only sealed intermodal containers may be operated on an interstate highway if allowed by the United States Department of Transportation.\n(c) The fee for a permit issued under this subdivision is $300, or a proportional amount as provided in section 169.86, subdivision 5.\n(a) A road authority may issue an annual permit authorizing a vehicle or combination of vehicles with a total of seven or more axles to haul qualifying agricultural products and be operated with a gross weight of up to:\n(1) 97,000 pounds; and\n(2) 99,000 pounds during the period set by the commissioner under section 169.826, subdivision 1.\n(b) Drivers of vehicles operating under this subdivision must comply with driver qualification requirements adopted under section 221.0314, subdivisions 2 to 5, and Code of Federal Regulations, title 49, parts 40 and 382, unless exempt under section 221.031, subdivision 2c.\n(c) The fee for a permit issued under this subdivision is $500, or a proportional amount as provided in section 169.86, subdivision 5.\n(a) A vehicle or combination of vehicles operating under this section:\n(1) is subject to axle weight limitations under section 169.824, subdivision 1;\n(2) is subject to seasonal load restrictions under section 169.87;\n(3) is subject to bridge load limits posted under section 169.84;\n(4) may only be operated on paved streets and highways other than interstate highways;\n(5) may not be operated with loads that exceed the manufacturer's gross vehicle weight rating as affixed to the vehicle, or other certification of gross vehicle weight rating complying with Code of Federal Regulations, title 49, sections 567.4 to 567.7;\n(6) must be issued a permit from each road authority having jurisdiction over a road on which the vehicle is operated, if required;\n(7) must comply with the requirements of section 169.851, subdivision 4; and\n(8) must have brakes on all wheels.\n(b) The percentage allowances for exceeding gross weights if transporting unfinished forest products under section 168.013, subdivision 3, paragraph (b), or for the first haul of unprocessed or raw farm products or unfinished forest products under section 168.013, subdivision 3, paragraph (d), clause (3), do not apply to a vehicle or combination of vehicles operated under this section.\n(c) Notwithstanding paragraph (a), clause (4), a vehicle or combination of vehicles hauling fluid milk under a permit issued by the commissioner of transportation may also operate on interstate highways as provided under United States Code, title 23, section 127.\nRevenue from the permits issued by the commissioner under this section must be deposited in the bridge inspection and signing account as provided under section 169.86, subdivision 5b.\nUpon request of the permit applicant, the expiration date for a permit issued under this section must be the same as the expiration date of the permitted vehicle's registration.",
	"repealed": false
}