{
	"id": "222.63",
	"url": "https://www.revisor.mn.gov/statutes/cite/222.63",
	"title": "222.63 ABANDONED RIGHT-OF-WAY; STATE RAIL BANK.",
	"text": "The terms defined in section 222.48 have the same meanings when used in this section. Other terms used in this section have the following meanings:\n(a) \"Abandoned,\" when used with reference to a rail line or right-of-way, means a line or right-of-way with respect to which the Surface Transportation Board or other responsible federal regulatory agency has permitted discontinuance of rail service.\n(b) \"Right-of-way\" means any real property, including any interest in the real property that is or has been owned by a railroad company as the site, or is adjacent to the site, of an existing or former rail line.\n(c) \"State rail bank\" means abandoned rail lines and right-of-way acquired by the commissioner of transportation pursuant to this section.\nA state rail bank shall be established for the acquisition and preservation of abandoned rail lines and rights-of-way, and of rail lines and rights-of-way proposed for abandonment in a railroad company's system diagram map, for future public use including trail use, or for disposition for commercial use in serving the public, by providing transportation of persons or freight or transmission of energy, fuel, or other commodities. Abandoned rail lines and rights-of-way may be acquired for trail use by another state agency or department or by a political subdivision only if (1) no future commercial transportation use is identified by the commissioner, and (2) the commissioner and the owner of the abandoned rail line have not entered into or are not conducting good-faith negotiations for acquisition of the property.\nThe commissioner of transportation may acquire by purchase all or part of any abandoned rail line or right-of-way or rail line or right-of-way proposed for abandonment in a railroad company's system diagram map which is necessary for preservation in the state rail bank to meet the future public and commercial transportation and transmission needs of the state. The commissioner may acquire by eminent domain under chapter 117 an interest in abandoned rail lines or rights-of-way except that the commissioner may not acquire by eminent domain rail lines or rights-of-way that are not abandoned or are owned by a political subdivision of the state or by another state. All property taken by exercise of the power of eminent domain under this subdivision is declared to be taken for a public governmental purpose and as a matter of public necessity.\nAn abandoned rail line or right-of-way is eligible for preservation in the state rail bank if the commissioner determines that it provides or may be used to provide one or more of the following:\n(1) access to a present or proposed major energy generating or using facility such as an electrical generating plant, major heating plant or other major industrial user of energy;\n(2) access to a major storage or terminal facility in the marketing of agricultural commodities or forest products;\n(3) important access to surrounding states;\n(4) a present or potential corridor for a pipeline, electrical transmission line, highway, transit route, rail freight or passenger line or other similar transportation or transmission use; or\n(5) access to an extractive resource requiring rail or other transportation or transmission service for its development.\nThe commissioner shall provide for the maintenance, including control of weeds, of any rail line or right-of-way that is acquired for the rail bank, and for its management in a manner that minimizes maintenance costs and provides a benefit to the state. The commissioner may also require that any existing rail line on acquired right-of-way shall not be removed during any part or all of the period for which the right-of-way is included in the state rail bank.\nIf the commissioner desires to acquire, dispose of or utilize any right-of-way which is permitted to be or has been acquired pursuant to authorization under subdivision 2, the commissioner shall publish a notice of the proposed action in the state register and in at least one newspaper of general circulation in each area where the right-of-way is located. If any person objects in writing to the proposed action within 30 days of publication of notice the commissioner shall proceed in the manner provided for a contested case. If no written objection is received the commissioner may take the proposed action only after holding a public meeting to seek public comment on the action. At least one hearing or meeting required under this subdivision shall be held in the area where the right-of-way is located.\n(a) The commissioner may lease any rail line or right-of-way held in the state rail bank or enter into an agreement with any person for the operation of any rail line or right-of-way for any of the purposes set forth in subdivision 2 in accordance with a fee schedule to be developed by the commissioner.\n(b) The commissioner may convey any rail line or right-of-way, for consideration or for no consideration and upon other terms as the commissioner may determine to be in the public interest, to any other state agency or to a governmental subdivision of the state having power by law to utilize it for any of the purposes set forth in subdivision 2.\n(c) The commissioner may convey a portion of previously acquired rail bank right-of-way to a state agency or governmental subdivision when the commissioner determines that:\n(1) the portion to be conveyed is in excess of that needed for the purposes stated in subdivision 2;\n(2) the conveyance is upon terms and conditions agreed upon by both the commissioner and the state agency or governmental subdivision;\n(3) after the sale, the rail bank corridor will continue to meet the future public and commercial transportation and transmission needs of the state; and\n(4) the conveyance will not reduce the width of the rail bank corridor to less than 100 feet.\n(d) The commissioner may lease previously acquired state rail bank right-of-way to a state agency or governmental subdivision or to a private entity for nontransportation purposes when:\n(1) the portion to be leased is in excess of that needed for the purposes stated in subdivision 2;\n(2) the lease will not reduce the usable width of the rail bank corridor to less than 100 feet;\n(3) the cost of the lease is based on the fair market value of the portion to be leased, as determined by appraisal;\n(4) the lease allows the commissioner to terminate the lease on 90 days' written notice to the lessee; and\n(5) the lease prohibits the construction or erection of any permanent structure within the 100-foot rail bank corridor and requires any structure erected on the leased property to be removed and the land restored to its original condition on 90 days' written notice to the lessee.\n(e) Proceeds from a sale or lease must be deposited in the rail bank maintenance account described in subdivision 8.\n[Repealed, 1992 c 581 s 21]\nThe commissioner may intervene in a proceeding of the Surface Transportation Board on the issue of suitability for a public use of a rail line proposed to be abandoned if the commissioner finds that the right-of-way of the line would be eligible for inclusion in the state rail bank. To the extent practicable before intervening as provided in this section the commissioner shall hold at least one public meeting in the area in which the line is located to solicit opinions of interested persons concerning the commissioner's proposed action.\nThe commissioner of transportation shall adopt rules necessary to establish criteria for properties eligible for inclusion in the rail bank and to establish public procedures for acquisition and disposition of rail bank properties.\nA special account shall be maintained in the state treasury, designated as the rail bank maintenance account, to record the receipts and expenditures of the commissioner of transportation for the maintenance of rail bank property. Funds received by the commissioner of transportation from interest earnings, administrative payments, rentals, fees, or charges for the use of rail bank property, or received from rail line rehabilitation contracts shall be credited to the maintenance account and used for the maintenance of that property and held as a reserve for maintenance expenses in an amount determined by the commissioner, and amounts received in the maintenance account in excess of the reserve requirements shall be transferred to the rail service improvement account.\nAll proceeds of the sale of abandoned rail lines shall be deposited in the rail service improvement account. All money to be deposited in this rail service improvement account as provided in this subdivision is appropriated to the commissioner of transportation for the purposes of this section.\nThe appropriations shall not lapse but shall be available until the purposes for which the funds are appropriated are accomplished.\n(a) Except for the actions of road authorities and their agents, employees, and contractors, and of utilities, in carrying out their duties imposed by permit, law, or contract, and except as otherwise provided in this section, it is unlawful to knowingly perform any of the following activities on rail bank property:\n(1) obstruct any trail;\n(2) deposit snow or ice;\n(3) remove or place any earth, vegetation, gravel, or rock without authorization;\n(4) obstruct or remove any ditch-draining device, or drain any harmful or dangerous materials;\n(5) erect a fence, or place or maintain any advertising, sign, or memorial, except upon authorization by the commissioner of transportation;\n(6) remove, injure, displace, or destroy right-of-way markers or reference or witness monuments or markers placed to preserve section or quarter-section corners defining rail bank property limits;\n(7) drive upon any portion of rail bank property, except at approved crossings, and except where authorized for snowmobiles, emergency vehicles, maintenance vehicles, or other vehicles authorized to use rail bank property;\n(8) deface, mar, damage, or tamper with any structure, work, material, sign, marker, paving, guardrail, drain, or any other rail bank appurtenance;\n(9) park, overhang, or abandon any unauthorized vehicle or implement of husbandry on, across, or over the limits of rail bank property;\n(10) plow, disc, or perform any other detrimental operation; or\n(11) place or maintain any permanent structure.\n(b) Unless a greater penalty is provided elsewhere in statute, a violation of this subdivision is a petty misdemeanor. A second or subsequent violation is a misdemeanor.\n(c) The cost to remove, repair, or perform any other corrective action necessitated by a violation of this subdivision may be charged to the violator.",
	"repealed": false
}