{
	"id": "256L.02",
	"url": "https://www.revisor.mn.gov/statutes/cite/256L.02",
	"title": "256L.02 PROGRAM ADMINISTRATION.",
	"text": "The MinnesotaCare program is established to promote access to appropriate health care services to assure healthy children and adults.\n(a) The commissioner shall establish an office for the state administration of this plan. The plan shall be used to provide covered health services for eligible persons. Payment for these services shall be made to all participating entities under contract with the commissioner. The commissioner shall adopt rules to administer the MinnesotaCare program. The commissioner shall establish marketing efforts to encourage potentially eligible persons to receive information about the program and about other medical care programs administered or supervised by the Department of Human Services.\n(b) A toll-free telephone number and website must be used to provide information about medical programs and to promote access to the covered services.\n[Repealed, 2015 c 71 art 11 s 65]\n[Repealed, 1Sp2001 c 9 art 2 s 76; 2002 c 277 s 31]\n(a) The commissioner of human services shall seek federal approval to implement the MinnesotaCare program under this chapter as a basic health program. In any agreement with the Centers for Medicare and Medicaid Services to operate MinnesotaCare as a basic health program, the commissioner shall seek to include procedures to ensure that federal funding is predictable, stable, and sufficient to sustain ongoing operation of MinnesotaCare. These procedures must address issues related to the timing of federal payments, payment reconciliation, enrollee risk adjustment, and minimization of state financial risk. The commissioner shall consult with the commissioner of management and budget, when developing the proposal for establishing MinnesotaCare as a basic health program to be submitted to the Centers for Medicare and Medicaid Services.\n(b) The commissioner of human services, in consultation with the commissioner of management and budget, shall work with the Centers for Medicare and Medicaid Services to establish a process for reconciliation and adjustment of federal payments that balances state and federal liability over time. The commissioner of human services shall request that the secretary of health and human services hold the state, and enrollees, harmless in the reconciliation process for the first three years, to allow the state to develop a statistically valid methodology for predicting enrollment trends and their net effect on federal payments.\nMinnesotaCare shall be considered a public health care program for purposes of chapter 62V.",
	"repealed": false
}