{
	"id": "103G.2372",
	"url": "https://www.revisor.mn.gov/statutes/cite/103G.2372",
	"title": "103G.2372 ENFORCEMENT.",
	"text": "(a) The commissioner of natural resources, conservation officers, and peace officers shall enforce laws preserving and protecting groundwater quantity, wetlands, and public waters. The commissioner of natural resources, a conservation officer, or a peace officer may issue a cease and desist order to stop any illegal activity adversely affecting groundwater quantity, a wetland, or public waters.\n(b) In the order, or by separate order, the commissioner, conservation officer, or peace officer may require restoration or replacement of the wetland or public waters, as determined by the local soil and water conservation district for wetlands and the commissioner of natural resources for public waters. Restoration or replacement orders may be recorded or filed in the office of the county recorder or registrar of titles, as appropriate, in the county where the real property is located by the commissioner of natural resources, conservation officers, or peace officers as a deed restriction on the property that runs with the land and is binding on the owners, successors, and assigns until the conditions of the order are met or the order is rescinded. Notwithstanding section 386.77, the agency shall pay the applicable filing fee for any document filed under this section.\n(c) If a court has ruled that there has not been a violation of the restoration or replacement order, an order may not be recorded or filed under this section.\n(d) The commissioner must remove a deed restriction filed or recorded under this section on homesteaded property if the owner requests that it be removed and a court has found that the owner of the property is not guilty or that there has not been a violation of the restoration or replacement order. Within 30 days of receiving the request for removal from the owner, the commissioner must contact, in writing, the office of the county recorder or registrar of titles where the order is recorded or filed, along with all applicable fees, and have the order removed. Within 30 days of receiving notification from the office of the county recorder or registrar of titles that the order has been removed, the commissioner must inform the owner that the order has been removed and provide the owner with a copy of any documentation provided by the office of the county recorder or registrar of titles.\nA violation of an order issued under subdivision 1 is a misdemeanor and must be prosecuted by the county attorney where the wetland or public waters are located or the illegal activity occurred.\nThe court may, as part of sentencing, require a person convicted under subdivision 2 to restore or replace the wetland or public waters, as determined by the local soil and water conservation district for wetlands and the commissioner of natural resources for public waters.",
	"repealed": false
}