{
	"id": "273.0755",
	"url": "https://www.revisor.mn.gov/statutes/cite/273.0755",
	"title": "273.0755 TRAINING AND EDUCATION OF PROPERTY TAX PERSONNEL.",
	"text": "(a) Beginning with the four-year period starting on July 1, 2020, every person licensed by the state Board of Assessors at the Accredited Minnesota Assessor level or higher, shall successfully complete 30 hours of educational coursework on Minnesota laws, assessment administration, and administrative procedures sponsored by the Department of Revenue in every four-year period.\n(b) The commissioner of revenue may require that each county, and each city for which the city assessor performs the duties of county assessor, have (1) a person on the assessor's staff who is certified by the Department of Revenue in sales ratio calculations, (2) an officer or employee who is certified by the Department of Revenue in tax calculations, and (3) an officer or employee who is certified by the Department of Revenue in the proper preparation of information reported to the commissioner under section 270C.85, subdivision 2, clause (4). Certifications under this paragraph expire after four years.\n(c) Beginning with the four-year educational licensing period starting on July 1, 2004, every Minnesota assessor licensed by the State Board of Assessors must attend and participate in a seminar that focuses on ethics, professional conduct and the need for standardized assessment practices developed and presented by the commissioner of revenue. This requirement must be met at least once in every subsequent four-year period. This requirement applies to all assessors licensed for one year or more in the four-year period.\n(d) When the commissioner of revenue determines that an individual or board that performs functions related to property tax administration has performed those functions in a manner that is not uniform or equitable, the commissioner may require that the individual or members of the board complete supplemental training. The commissioner may not require that an individual complete more than 32 hours of supplemental training pursuant to this paragraph. If the individual is required to complete supplemental training due to that individual's membership on a local or county board of appeal and equalization, the commissioner may not require that the individual complete more than two hours of supplemental training.",
	"repealed": false
}