{
	"id": "41A.036",
	"url": "https://www.revisor.mn.gov/statutes/cite/41A.036",
	"title": "41A.036 SMALL BUSINESS DEVELOPMENT LOANS.",
	"text": "(a) The board may make, purchase, or participate with financial institutions in making or purchasing small business development loans not exceeding $1,000,000 in principal amount with respect to small business loans made or purchased by the board and not exceeding $1,000,000 principal amount with respect to the board's share when the board participates in making or purchasing small business loans.\n(b) With respect to loans that the board makes or purchases or participates in, the board may determine or provide for their servicing, the percentage of board participation, if any, the times the loans or participations are payable and the amounts of payment, their amount and interest rates, their security, if any, and other terms, conditions, and provisions necessary or convenient in connection with them and may enter into all necessary contracts and security instruments in connection with them. The board may enter into commitments to purchase or participate with financial institutions or other persons upon the terms, conditions, and provisions determined by it. Loans or participations may be serviced by financial institutions or other persons designated by the board.\n(c) The board shall obtain the best available security for all loans. The board may provide for or require the insurance or guaranteeing of the loans or board participations in whole or in part by the federal government or a department, agency, or instrumentality of it, by an appropriate board account, or by a private insurer.\nThe following eligible small businesses have preference among all business applicants for small business development loans:\n(1) businesses located in rural areas of the state that are experiencing the most severe unemployment rates in the state;\n(2) businesses that are likely to expand and provide additional permanent employment in rural areas of the state, or enhance the quality of existing jobs in those areas;\n(3) businesses located in border communities that experience a competitive disadvantage due to location;\n(4) businesses that have been unable to obtain traditional financial assistance due to a disadvantageous location, minority ownership, or other factors rather than due to the business having been considered a poor financial risk;\n(5) businesses that utilize state resources and reduce state dependence on outside resources, and that produce products or services consistent with the long-term social and economic needs of the state; and\n(6) businesses located in border city enterprise zones, as described in section 469.166.\nA business applying for a loan must be sponsored by a resolution of the governing body of the local governmental unit within whose jurisdiction the project is located. For purposes of this paragraph, \"local governmental unit\" means a home rule charter or statutory city when the project is located in an incorporated area, a county when the project is located in an unincorporated area, or an American Indian tribal council when the project is located within a federally recognized American Indian reservation or community.\nIf the board determines that an eligible small business is eligible for special assistance, the $1,000,000 limitation established in subdivision 1 does not apply.\nAn eligible small business is not eligible to receive special assistance unless the board has passed a resolution designating the eligible small business as being in need of special assistance. The resolution must include findings that the designation and receipt of the special assistance will be of exceptional benefit to the state of Minnesota in that at least three of the following criteria are met:\n(1) to expand or remain in Minnesota, the eligible small business has demonstrated that it cannot obtain suitable financing from other sources;\n(2) special assistance will enable an eligible small business not currently located in Minnesota to locate a facility in Minnesota that directly increases the number of jobs in the state;\n(3) the eligible small business will create or retain significant numbers of jobs in a Minnesota community;\n(4) the eligible small business has a significant potential for growth in jobs or economic activities in Minnesota during the ensuing five-year period; and\n(5) the eligible small business will maintain a significant level of productivity in Minnesota during the ensuing five-year period.\n[Repealed, 1988 c 615 s 7]",
	"repealed": false
}