{
	"id": "17.58",
	"url": "https://www.revisor.mn.gov/statutes/cite/17.58",
	"title": "17.58 POWERS AND DUTIES OF COMMISSIONER.",
	"text": "A council, with the approval of the commissioner, may contract and cooperate with any person, firm, corporation or association, or with any local, state, federal or international agency or institution, for market development, education, publicity, promotion, research, transportation and advertising within the purposes of sections 17.51 to 17.69.\nThe council, with the approval of the commissioner, shall appoint, employ, provide necessary bond, discharge, fix compensation for and prescribe the duties of the first chief administrative officer of any council established after July 1, 1982. The council, after consultation with the commissioner, shall appoint, employ, provide necessary bond, discharge, fix compensation for and provide duties of subsequent chief administrative officers. A council may employ other personnel as it deems necessary.\nIn administering sections 17.51 to 17.69, the commissioner shall have such other powers as may be conferred by law not inconsistent with the provisions of sections 17.51 to 17.69. The commissioner is authorized to cooperate with any appropriate agency of any state for the purpose of carrying out the provisions of sections 17.51 to 17.69, and in securing uniformity of administration and enforcement.\nThe organization, conduct of elections, referenda, and meetings of a council and the administration of a promotional order for any commodity shall be governed by rules promulgated by the commissioner pursuant to chapter 14.\nEach year the commissioner shall conduct a fiscal audit, and at least every three years the commissioner shall conduct a compliance audit of each council. A compliance audit is an audit to determine that a council has complied with the terms of sections 17.51 to 17.69, with all other applicable federal or state laws, and with the terms of any promotional orders established.",
	"repealed": false
}