{
	"id": "428A.01",
	"url": "https://www.revisor.mn.gov/statutes/cite/428A.01",
	"title": "428A.01 SPECIAL SERVICE DISTRICT PROCEDURES; DEFINITIONS.",
	"text": "As used in sections 428A.01 to 428A.10, the terms defined in this section have the meanings given them.\n\"City\" means a home rule charter or statutory city.\n\"Special services\" has the meaning given in the city's ordinance but special services may not include a service that is ordinarily provided throughout the city from general fund revenues of the city unless an increased level of the service is provided in the special service district.\n\"Special service district\" means a defined area within the city where special services are rendered and the costs of the special services are paid from revenues collected from service charges imposed within that area.\nExcept as provided in section 428A.05, \"net tax capacity\" means the net tax capacity most recently certified by the county auditor under section 428A.03, subdivision 1a, before the effective date of the ordinance or resolution adopted under section 428A.02 or 428A.03.\n\"Land area\" means the land area in the district that is subject to property taxes.\n\"Multiunit residential property\" means:\n(1) property classified as class 4a under section 273.13, subdivision 25, paragraph (a);\n(2) condominiums, as defined under section 515A.1-103, clause (7), that are classified as class 1a under section 273.13, subdivision 22, paragraph (a); class 4b under section 273.13, subdivision 25, paragraph (b), clause (1); class 4bb under section 273.13, subdivision 25, paragraph (c), clause (1); or condominiums under chapters 515 and 515A established prior to the enactment of the Minnesota Common Interest Ownership act under chapter 515B;\n(3) condominium-type storage units classified as class 4bb under section 273.13, subdivision 25, paragraph (c), clause (3); and\n(4) duplex or triplex property classified as class 1a under section 273.13, subdivision 22, paragraph (a); or classified as class 4b under section 273.13, subdivision 25, paragraph (b), clause (1).\nMultiunit residential property does not include any unit that is an affordable housing unit classified as 4d low-income rental housing under section 273.13, subdivision 25, paragraph (e).\n\"Nonresidential property\" means property that is classified under section 273.13 and used for commercial, industrial, or public utility purposes, or is zoned for vacant land or designated on a land use plan for commercial or industrial use.",
	"repealed": false
}