{
	"id": "319B.10",
	"url": "https://www.revisor.mn.gov/statutes/cite/319B.10",
	"title": "319B.10 MERGERS AND OTHER REORGANIZATIONS.",
	"text": "A professional firm may enter into a merger, consolidation, exchange of ownership interests, conversion, or any other reorganization permitted by its generally applicable governing law.\n(a) If a professional firm participates in and survives a reorganization but the reorganization causes the surviving firm to be out of compliance with section 319B.07 or 319B.09, or both:\n(1) the surviving firm's election under section 319B.03, subdivision 2, or 319B.04, subdivision 2, is automatically rescinded;\n(2) the surviving firm immediately loses its status as a professional firm and the authority created by that election and status terminates; and\n(3) the surviving firm must immediately and accordingly update its organizational document, certificate of authority, or statement of foreign qualification. Even without that amendment, however, the rescission, loss of status, and termination of authority occur automatically when the reorganization takes effect.\n(b) If, before a reorganization takes effect, the 90-day deadline established in section 319B.07, subdivision 1, has been triggered but has not yet elapsed with regard to an ownership interest in a professional firm participating in the reorganization, the surviving firm is not out of compliance with sections 319B.07 and 319B.09 merely because the reorganization accords a comparable ownership interest in the surviving firm to the disqualified owner or the representative of the deceased owner's estate. The original 90-day deadline applies to the comparable ownership interest and the surviving firm.\n(a) For a Minnesota professional firm involved in a merger, the document filed with the secretary of state to effectuate the merger must state whether that Minnesota professional firm will survive the merger, and if so, whether that Minnesota professional firm will remain a Minnesota professional firm once the merger takes effect.\n(b) For a foreign professional firm involved in a merger, the certificate filed with the secretary of state under section 303.11 or 322C.1004 must be accompanied by a statement as to whether that foreign firm will survive the merger, and if so, whether that foreign professional firm will remain a foreign professional firm once the merger takes effect.\nIf a reorganization involves the creation of a new firm, that firm may make an election under section 319B.03, subdivision 2, or 319B.04, subdivision 2, and become a professional firm if the firm meets the requirements of sections 319B.01 to 319B.12.",
	"repealed": false
}