{
	"id": "216C.37",
	"url": "https://www.revisor.mn.gov/statutes/cite/216C.37",
	"title": "216C.37 ENERGY CONSERVATION INVESTMENT LOAN.",
	"text": "In this section:\n(a) \"Commissioner\" means the commissioner of commerce.\n(b) \"Energy conservation investments\" means all capital expenditures that are associated with conservation measures identified in an energy project study, and that have a ten-year or less payback period.\n(c) \"Municipality\" means any county, statutory or home rule charter city, town, school district, or any combination of those units operating under an agreement to jointly undertake projects authorized in this section.\n(d) \"Energy project study\" means a study of one or more energy-related capital improvement projects analyzed in sufficient detail to support a financing application. At a minimum, it must include one year of energy consumption and cost data, a description of existing conditions, a description of proposed conditions, a detailed description of the costs of the project, and calculations sufficient to document the proposed energy savings.\nThe commissioner shall approve loans to municipalities for energy conservation investments. A loan may be made to a municipality that has demonstrated that it has complied with all the appropriate provisions of this section and has made adequate provisions to assure proper and efficient operation of the municipal facilities after improvements and modifications are completed.\nApplication for a loan to be made pursuant to this section shall be made by a municipality to the commissioner on a form the commissioner prescribes by rule. The commissioner shall review each application to determine:\n(1) whether or not the municipality's proposal is complete;\n(2) whether the calculations and estimates contained in the energy project study are appropriate, accurate, and reasonable;\n(3) whether the project is eligible for a loan;\n(4) the amount of the loan for which the project is eligible; and\n(5) the means by which the municipality proposes to finance the project including:\n(i) a loan authorized by this section;\n(ii) a grant of money appropriated by state law;\n(iii) a grant to the municipality by an agency of the federal government within the amount of money then appropriated to that agency; or\n(iv) the appropriation of other money of the municipality to an account for the construction of the project.\nDuring application review, the commissioner may request additional information about a proposed energy conservation investment, including information on project cost. Failure to provide information requested disqualifies a loan applicant.\nData contained in an application submitted to the commissioner for a loan to be made pursuant to this section, including supporting technical documentation, is classified as \"public data not on individuals\" under section 13.02, subdivision 14.\nThe commissioner shall approve loans to municipalities on the following conditions:\n(a) A municipality must demonstrate that the project is economically feasible, and that it has made adequate provisions to assure proper and efficient operation of the facility once the project is completed.\n(b) A loan made pursuant to this section is repayable over a period of not more than ten years from the date the loan is made. Interest shall accrue from the date the loan is made, but the first payment of interest or principal shall not be due until one year after the loan was made. The principal shall be amortized in equal periodic payments over the remainder of the term of the loan. The accrued interest on the balance of the loan principal shall be due with each payment. Interest attributable to the first year of deferred payment shall be paid in the same manner as principal.\n(c) Public schools shall receive funding priority whenever approvable loan applications exceed available funds.\nThe commissioner shall not approve payment to a municipality pursuant to an approved loan until the commissioner has determined that financing of the project is assured by an irrevocable undertaking, by resolution of the governing body of the municipality, to annually levy or otherwise collect an amount of money sufficient to pay the principal and interest due on the loan as well as any of the commissioner of management and budget's administrative expenses according to the terms of the loan.\nThe commissioner of management and budget shall deposit in the state treasury all principal and interest payments received in repayment of the loans authorized by this section. These payments shall be credited to the bond proceeds fund and are appropriated to the commissioner of management and budget for the purposes of that account.\nThe commissioner shall adopt rules necessary to implement this section. The rules shall contain as a minimum:\n(1) procedures for application by municipalities;\n(2) criteria for reviewing loan applications; and\n(3) procedures and guidelines for program monitoring, closeout, and evaluation.\n[Repealed, 1994 c 616 s 12]",
	"repealed": false
}