{
	"id": "477A.19",
	"url": "https://www.revisor.mn.gov/statutes/cite/477A.19",
	"title": "477A.19 AQUATIC INVASIVE SPECIES PREVENTION AID.",
	"text": "(a) When used in this section, the following terms have the meanings given them in this subdivision.\n(b) \"Aquatic invasive species\" means nonnative aquatic organisms that invade water beyond their natural and historic range.\n(c) \"Watercraft trailer launch\" means any public water access site designed for launching watercraft.\n(d) \"Watercraft trailer parking space\" means a parking space designated for a boat trailer at any public water access site designed for launching watercraft.\nThe money appropriated to aquatic invasive species prevention aid under this section shall be allocated to all counties in the state as follows: 50 percent based on each county's share of watercraft trailer launches and 50 percent based on each county's share of watercraft trailer parking spaces.\nA county that receives a distribution under this section must use the proceeds solely to prevent the introduction or limit the spread of aquatic invasive species at all access sites within the county. The county must establish, by resolution or through adoption of a plan, guidelines for the use of the proceeds. The guidelines set by the county board may include, but are not limited to, providing for site-level management, countywide awareness, and other procedures that the county finds necessary to achieve compliance. The county may appropriate the proceeds directly, or may use any portion of the proceeds to provide funding for a joint powers board or cooperative agreement with another political subdivision, a soil and water conservation district in the county, a watershed district in the county, or a lake association located in the county. Any money appropriated by the county to a different entity or political subdivision must be used as required under this section. Each county must submit a copy of its guidelines for use of the proceeds to the Department of Natural Resources by December 31 of the year the payments are received.\nOn or before June 1 of each year, the commissioner of natural resources shall certify to the commissioner of revenue the number of watercraft launches and the number of watercraft trailer parking spaces in each county.\nOn or before June 1 of each year, the commissioner of natural resources shall certify to the commissioner of revenue the counties that complied with the requirements of subdivision 3 the prior year and are eligible to receive aid under this section.\nThe commissioner of revenue must compute the amount of aquatic invasive species prevention aid payable to each county under this section. On or before August 1 of each year, the commissioner shall certify the amount to be paid to each county in the following year. The commissioner shall pay aquatic invasive species prevention aid to counties annually at the times provided in section 477A.015.\n$10,000,000 each year is appropriated from the general fund to the commissioner of revenue to make the payments required under this section.",
	"repealed": false
}