{
	"id": "146B.06",
	"url": "https://www.revisor.mn.gov/statutes/cite/146B.06",
	"title": "146B.06 HEALTH AND SAFETY STANDARDS.",
	"text": "(a) The body art establishment must meet the health and safety standards in this subdivision before a licensed technician may conduct body art procedures at the establishment.\n(b) The procedure area must be separated from any other area that may cause potential contamination of work surfaces.\n(c) For clients requesting privacy, at a minimum, a divider, curtain, or partition must be provided to separate multiple procedure areas.\n(d) All procedure surfaces must be smooth, nonabsorbent, and easily cleanable.\n(e) The establishment must have an accessible hand sink equipped with:\n(1) liquid hand soap;\n(2) single-use paper towels or a mechanical hand drier or blower; and\n(3) a nonporous washable garbage receptacle with a foot-operated lid or with no lid and a removable liner.\n(f) All ceilings in the body art establishment must be in good condition.\n(g) All walls and floors must be free of open holes or cracks and be washable and no carpeting may be in areas used for body art procedures unless the carpeting is entirely covered with a rigid, nonporous, easily cleanable material.\n(h) All facilities within the establishment must be maintained in a clean and sanitary condition and in good working order.\n(i) No animals may be present during a body art procedure, unless the animal is a service animal.\n(a) Equipment, instruments, and supplies must comply with the health and safety standards in this subdivision before a licensed technician may conduct body art procedures.\n(b) Jewelry used as part of a body art procedure must be made of surgical implant-grade stainless steel, solid 14-karat or 18-karat white or yellow gold, niobium, titanium, or platinum, or a dense low-porosity plastic. Use of jewelry that is constructed of wood, bone, or other porous material is prohibited.\n(c) Jewelry used as part of a body art procedure must be free of nicks, scratches, or irregular surfaces and must be properly sterilized before use.\n(d) Reusable instruments must be thoroughly washed to remove all organic matter, rinsed, and sterilized before and after use.\n(e) Needles must be single-use needles and sterilized before use.\n(f) Sterilization must be conducted using steam heat or chemical vapor.\n(g) All sterilization units must be operated according to the manufacturer's specifications.\n(h) At least once a month, but not to exceed 30 days between tests, a spore test must be conducted on each sterilizer used to ensure proper functioning. If a positive spore test result is received, the sterilizer at issue may not be used until a negative result is obtained.\n(i) All inks and other pigments used in a body art procedure must be specifically manufactured for tattoo procedures.\n(j) Immediately before applying a tattoo, the ink needed must be transferred from the ink bottle and placed into single-use paper or plastic cups. Upon completion of the tattoo, the single-use cups and their contents must be discarded.\n(k) All tables, chairs, furniture, or other procedure surfaces that may be exposed to blood or body fluids during the body art procedure must be cleanable and must be sanitized after each client with a liquid chemical germicide.\n(l) Single-use towels or wipes must be provided to the client. These towels must be dispensed in a manner that precludes contamination and disposed of in a nonporous washable garbage receptacle with a foot-operated lid or with no lid and a removal liner.\n(m) All bandages and surgical dressings used must be sterile or bulk-packaged clean and stored in a clean, closed nonporous container.\n(n) All equipment and instruments must be maintained in good working order and in a clean and sanitary condition.\n(o) All instruments and supplies must be stored clean and dry in covered containers.\n(p) Single-use disposable barriers or a chemical germicide must be used on all equipment that cannot be sterilized as part of the procedure as required under this section including, but not limited to, spray bottles, procedure light fixture handles, and tattoo machines.\n(a) All body art procedures must comply with the health and safety standards in this subdivision.\n(b) The skin area subject to a body art procedure must be thoroughly cleaned with soap and water, rinsed thoroughly, and swabbed with an antiseptic solution. Only single-use towels or wipes may be used to clean the skin.\n(c) Whenever it is necessary to shave the skin, a new disposable razor or a stainless steel straight edge must be used. The disposable razor must be discarded after use. The stainless steel straight edge must be thoroughly washed to remove all organic matter and sterilized before use on another client.\n(d) No body art procedure may be performed on any area of the skin where there is an evident infection, irritation, or open wound.\n(e) Single-use nonabsorbent gloves of adequate size and quality to preserve dexterity must be used for touching clients, for handling sterile instruments, or for handling blood or body fluids. Nonlatex gloves must be used with clients or employees who request them or when petroleum products are used. Gloves must be changed if a glove becomes damaged or comes in contact with any nonclean surface or objects or with a third person. At a minimum, gloves must be discarded after the completion of a procedure on a client. Upon leaving the procedure area, hands and wrists must be washed before putting on a clean pair of gloves and after removing a pair of gloves.\n(a) Technicians must comply with the health and safety standards in this subdivision.\n(b) Technicians must scrub their hands and wrists thoroughly before and after performing a body art procedure, after contact with the client receiving the procedure, and after contact with potentially contaminated materials.\n(c) A technician may not smoke, eat, or drink while performing body art procedures.\n(d) A technician may not perform a body art procedure if the technician has any open sores visible or in a location that may come in contact with the client.\n(a) Infectious waste and sharps must be managed according to sections 116.76 to 116.83 and must be disposed of by an approved infectious waste hauler at a site permitted to accept the waste, according to Minnesota Rules, parts 7035.9100 to 7035.9150. Sharps ready for disposal must be disposed of in an approved sharps container.\n(b) Contaminated waste that may release liquid blood or body fluids when compressed or that may release dried blood or body fluids when handled must be placed in an approved red bag that is marked with the international biohazard symbol.\n(c) Contaminated waste that does not release liquid blood or body fluids when compressed or handled may be placed in a covered receptacle and disposed of through normal approved disposal methods.\n(d) Storage of contaminated waste on site must not exceed the overflow level of any container.",
	"repealed": false
}