{
	"id": "86B.205",
	"url": "https://www.revisor.mn.gov/statutes/cite/86B.205",
	"title": "86B.205 WATER SURFACE USE ORDINANCE.",
	"text": "The commissioner shall develop and publish guidelines to assist counties adopting water surface use ordinances for waters within their jurisdiction.\n(a) A county board may, by ordinance, regulate the surface use of bodies of water located entirely or partially within the county and not located entirely within the boundary of a single city or lake conservation district established by law.\n(b) If a body of water is located within more than one county, a surface use ordinance is not effective until adopted by the county boards of all the counties where the body of water lies under section 471.59 or placed into effect by order of the commissioner under subdivision 9.\n(c) With the authorization of an affected city or lake conservation district, a county board may assume and exercise the powers in subdivisions 2 to 5 with respect to bodies of water lying entirely within that city or lake conservation district. The regulation by the county of the surface use of a portion of a body of water located within the boundary of a city must be consistent with any city regulation existing on May 25, 1973, of the surface use of that portion of the body of water. After January 1, 1975, the ordinance must be consistent with the provisions of this chapter and rules of the commissioner under this chapter.\nA surface use zoning ordinance adopted under subdivisions 2 to 5 by a local governmental unit after May 25, 1973, is invalid unless it is approved by the commissioner.\nA proposed surface use zoning ordinance must be submitted to the commissioner for review and approval before adoption. The commissioner must approve or disapprove the proposed ordinance within 120 days after receiving it. If the commissioner disapproves the proposed ordinance, the commissioner must return it to the local governmental unit with a written statement of the reasons for disapproval.\nA county board may:\n(1) regulate and police public beaches, public docks, and other public facilities for access to a body of water, except:\n(i) regulations are subject to subdivision 6;\n(ii) a county board may not regulate state accesses; and\n(iii) a municipality may by ordinance preempt the county from exercising power under this subdivision within its jurisdiction;\n(2) regulate the construction, configuration, size, location, and maintenance of commercial marinas and their related facilities including parking areas and sanitary facilities in a manner consistent with other state law and the rules of the commissioner of natural resources, the Pollution Control Agency, and the commissioner of health, and with the applicable municipal building codes and zoning ordinances where the marinas are located;\n(3) regulate the construction, installation, and maintenance of permanent and temporary docks and moorings in a manner consistent with state and federal law, permits required under chapter 103G, and sections 86B.111 and 86B.115;\n(4) except as provided in subdivision 6, regulate the type and size of watercraft allowed to use the body of water and set access fees;\n(5) subject to subdivision 6, limit the types and horsepower of motors used on the body of water;\n(6) limit the use of the body of water at various times and the use of various parts of the body of water;\n(7) regulate the speed of watercraft on the body of water and the conduct of other activities on the body of water to secure the safety of the public and the most general public use; and\n(8) contract with other law enforcement agencies to police the body of water and its shore.\nThe county board must allow the same types and sizes of watercraft and horsepower of motors to access and enter the lake or water body as are generally allowed to be operated on the lake or water body. Special use exceptions that are not dependent on lakeshore or property ownership may be granted by permit.\nA county board may acquire by purchase, gift, or devise land for public access to a lake or stream and may improve the land as a park or playground if the land is less than ten acres and is contiguous to the meander line of a navigable lake or stream wholly or partly within the county and not entirely within the corporate limits of a city.\nThe county board may invite any municipal council or town board or the soil and water conservation district board of supervisors or watershed district board of managers to designate a representative to advise and consult with the county board on water use regulation and improvement.\n(a) On request of a county, city, or town, the commissioner may, after determining it to be in the public interest, establish rules relating to the use of watercraft on waters of this state that border upon or are within, in whole or in part, the territorial boundaries of the governmental unit.\n(b) The rules shall be established in the manner provided by sections 14.02 to 14.62, but may not be submitted to the attorney general nor filed with the secretary of state until first approved by resolutions of the county boards of a majority of the counties affected by the proposed rules.\n(c) The rules may restrict:\n(1) the type and size of watercraft and size of motor that may use the waters affected by the rule;\n(2) the areas of water that may be used by watercraft;\n(3) the speed of watercraft;\n(4) the times permitted for use of watercraft; or\n(5) the minimum distance between watercraft.\n(d) When establishing rules, the commissioner shall consider the physical characteristics of the waters affected, their historical uses, shoreland uses and classification, and other features unique to the waters affected by the rules.\n(e) The commissioner shall inform the users of the waters of the rules affecting them at least two weeks before the effective date of the rules by distributing copies of the rules and by posting of the public accesses of the waters. The failure of the commissioner to comply with this paragraph does not affect the validity of the rules or a conviction for violation of the rules.\n(f) The cost of publishing rules and of marking and posting waters under this subdivision shall be paid by the counties affected by the rules, as apportioned by the commissioner.\n(g) Regulations or ordinances relating to the use of waters of this state enacted by a local governmental unit before January 1, 1972, shall continue in effect until repealed by the local governmental unit or superseded by a rule of the commissioner adopted under this subdivision.",
	"repealed": false
}