{
	"id": "148.604",
	"url": "https://www.revisor.mn.gov/statutes/cite/148.604",
	"title": "148.604 REPORTING OBLIGATIONS.",
	"text": "A person who has knowledge of any conduct constituting grounds for discipline under sections 148.52 to 148.62 may report the violation to the board.\nAny hospital, clinic, prepaid medical plan, or other health care institution or organization located in this state shall report to the board any action taken by the institution or organization or any of its administrators or medical or other committees to revoke, suspend, restrict, or condition an optometrist's privilege to practice or treat patients in the institution, or as part of the organization, any denial of privileges, or any other disciplinary action. The institution or organization shall also report the resignation of any optometrist prior to the conclusion of any disciplinary proceeding, or prior to the commencement of formal charges but after the optometrist had knowledge that formal charges were contemplated or in preparation. Each report made under this subdivision must state the nature of the action taken, state in detail the reasons for the action, and identify the specific patient medical records upon which the action was based. No report shall be required of an optometrist voluntarily limiting the practice of the optometrist at a hospital provided that the optometrist notifies all hospitals where the optometrist has privileges of the voluntary limitation and the reasons for it.\nA licensed optometrist shall report to the board personal knowledge of any conduct by any optometrist which the person reasonably believes constitutes grounds for disciplinary action under sections 148.52 to 148.62, including any conduct indicating that the person may be incompetent, may have engaged in unprofessional conduct, or may be physically unable to safely engage in the practice of optometry.\nAn optometrist shall report to the board any personal action which would require that a report be filed with the board by any person, health care facility, business, or organization pursuant to subdivisions 2 and 3.\nReports required by subdivisions 2 to 4 must be submitted not later than 30 days after the occurrence of the reportable event or transaction. The board may provide forms for the submission of reports required by this section, may require that reports be submitted on the forms provided, and may adopt rules necessary to ensure prompt and accurate reporting.\nThe board may issue subpoenas for the production of any reports required by subdivisions 2 to 4 or any related documents.",
	"repealed": false
}