{
	"id": "354A.094",
	"url": "https://www.revisor.mn.gov/statutes/cite/354A.094",
	"title": "354A.094 QUALIFIED PART-TIME TEACHERS; PARTICIPATION IN FUND.",
	"text": "For purposes of this section, the term \"teachers\" has the meaning given in section 122A.15, subdivision 1, except that the term must not include superintendents.\nFor purposes of this section, the term \"part-time teaching position\" means a teaching position within Independent School District No. 625, St. Paul, in which the teacher is employed for at least 50 full days or a fractional equivalent of 50 full days calculated using the appropriate minimum number of hours which would result in a full day of service credit by the association and for which the teacher is compensated in an amount not to exceed 80 percent of the compensation rate established by the board for a full-time teacher with identical education and experience within the district.\n(a) A teacher in Independent School District No. 625, St. Paul, who is vested, or who has combined years of full-time teaching service in Minnesota public elementary schools, Minnesota secondary schools, and Minnesota State Colleges and Universities system at least equal to the number of years specified for vesting in the association, may, by agreement with the board of the district, be assigned to teaching service within the district in a part-time teaching position. The agreement must be executed before October 1 of the year for which the teacher requests to make retirement contributions under subdivision 4. A copy of the executed agreement must be filed with the executive director of the teachers retirement fund association. If the copy of the executed agreement is filed with the association after October 1 of the year for which the teacher requests to make retirement contributions under subdivision 4, the school district must pay a fine of $5 for each calendar day that elapsed since the October 1 due date. The association may not accept an executed agreement that is received by the association more than 15 months late. The association may not waive the fine required by this section.\n(b) Notwithstanding paragraph (a), if the teacher is also a legislator:\n(1) the agreement in paragraph (a) must be executed before March 1 of the school year for which the teacher requests to make retirement contributions under subdivision 4; and\n(2) the fines specified in paragraph (a) apply if the employing unit does not file the executed agreement with the executive director of the teachers retirement fund association by March 1.\nNotwithstanding any provision to the contrary in this chapter or the articles of incorporation or bylaws of the association relating to the salary figure to be used for the determination of contributions or the accrual of service credit, a teacher assigned to a part-time position under this section must continue to make employee contributions to and to accrue allowable service credit in the association during the period of part-time employment on the same basis and in the same amounts as would have been paid and accrued if the teacher had been employed on a full-time basis provided that, prior to June 30 each year the member and the employing board make that portion of the required employer contribution to the association in any proportion which they may agree upon, that is based on the difference between the amount of compensation that would have been paid if the teacher had been employed on a full-time basis and the amount of compensation actually received by the teacher for services rendered in the part-time assignment. The employer contributions to the association on behalf of the teacher must be based on the amount of compensation actually received by the teacher for the services rendered in the part-time assignment in the manner described in section 354A.12, subdivision 2a. The employee and employer contributions must be based upon the rates of contribution prescribed by section 354A.12. Full membership, accrual of allowable service credit and employee contributions for part-time teaching service by a teacher pursuant to this section and section 354.66 must not continue for a period longer than ten years.\n[Repealed, 1987 c 398 art 7 s 43]\nA teacher entitled to full membership, accrual of allowable service credit and employee contributions for part time teaching service pursuant to this section must not be entitled during the same period of time to be a member of, accrue allowable service credit in or make employee contributions to any other Minnesota public pension plan, except a firefighters relief association governed by sections 424A.091 to 424A.096 or the statewide volunteer firefighter plan governed by chapter 353G.\nThe board of Independent School District No. 625, St. Paul, entering into an agreement authorized by this section must take all steps necessary to assure continuance of any insurance programs furnished or authorized a full-time teacher on an identical basis and with identical sharing of costs for a part time teacher pursuant to this section.\nOnly teachers who are in the bargaining unit as defined in section 179A.03, subdivision 7, during the year preceding the period of part time employment pursuant to this section shall qualify for full membership in, accrual of service credit from, and employee contributions to the teachers retirement fund association for part time teaching service pursuant to subdivision 4. Notwithstanding the provisions of section 179A.03, subdivision 14, paragraph (a), clauses (5) and (6), teachers who are employed on a part time basis for purposes of this section and who would therefore be disqualified from the bargaining unit by one or both of those provisions, shall continue to be in the bargaining unit during the period of part time employment pursuant to this section for purposes of compensation, fringe benefits and the grievance procedure.\nNo teacher shall qualify for full membership in, accrual of service credit from and employee contributions to the Teachers Retirement Association or the teachers retirement fund association for part time teaching service pursuant to subdivision 4 or section 354.66, subdivision 4, in more than one district at the same time. No teacher shall qualify for full membership in, accrual of service credit from and employee contributions to the teachers retirement fund association during part time employment in Independent School District No. 625, St. Paul, pursuant to this section in any year if the teacher also takes a full time or part time teaching position in another Minnesota school district.\n[Repealed, 1987 c 398 art 7 s 43]\nNothing in this section shall be construed to limit the authority of a school board to assign a teacher to a part time teaching position which does not qualify for employee contributions to the teachers retirement fund association pursuant to this section.\nNeither subdivision 5 nor subdivision 8 shall be construed to prohibit a teacher who qualifies for full membership in, accrual of service credit from and employee contributions to the teachers retirement fund association pursuant to this section in any year from being employed as a substitute teacher by any school district during that year. Notwithstanding the provisions of this chapter or the bylaws of the association, a teacher may not pay retirement contributions or receive allowable service credit in the association for other teaching service rendered for any part of any year for which the teacher qualifies for full membership in, accrual of service credit from and employee contributions to the Teachers Retirement Association or the teachers retirement fund association pursuant to section 354.66 or this section.\nIndependent School District No. 625, St. Paul, must furnish to the teachers retirement fund association whatever information and reports deemed necessary by the board of trustees of the teachers retirement fund association to administer the provisions of this section.",
	"repealed": false
}