{
	"id": "121A.038",
	"url": "https://www.revisor.mn.gov/statutes/cite/121A.038",
	"title": "121A.038 STUDENT SAFETY DRILLS AT SCHOOL.",
	"text": "(a) For the purposes of this section, the following terms have the meanings given.\n(b) \"Active shooter drill\" means an emergency preparedness drill designed to teach students, teachers, school personnel, and staff how to respond in the event of an armed intruder on campus or an armed assailant in the immediate vicinity of the school. An active shooter drill is not an active shooter simulation, nor may an active shooter drill include any sensorial components, activities, or elements which mimic a real life shooting.\n(c) \"Active shooter simulation\" means an emergency exercise including full-scale or functional exercises, designed to teach adult school personnel and staff how to respond in the event of an armed intruder on campus or an armed assailant in the immediate vicinity of the school which also incorporates sensorial components, activities, or elements mimicking a real life shooting. Activities or elements mimicking a real life shooting include, but are not limited to, simulation of tactical response by law enforcement. An active shooter simulation is not an active shooter drill.\n(d) \"Evidence-based\" means a program or practice that demonstrates any of the following:\n(1) a statistically significant effect on relevant outcomes based on any of the following:\n(i) strong evidence from one or more well designed and well implemented experimental studies;\n(ii) moderate evidence from one or more well designed and well implemented quasi-experimental studies; or\n(iii) promising evidence from one or more well designed and well implemented correlational studies with statistical controls for selection bias; or\n(2) a rationale based on high-quality research findings or positive evaluations that the program or practice is likely to improve relevant outcomes, including the ongoing efforts to examine the effects of the program or practice.\n(e) \"Full-scale exercise\" means an operations-based exercise that is typically the most complex and resource-intensive of the exercise types and often involves multiple agencies, jurisdictions, organizations, and real-time movement of resources.\n(f) \"Functional exercise\" means an operations-based exercise designed to assess and evaluate capabilities and functions while in a realistic, real-time environment, however, movement of resources is usually simulated.\nAn active shooter drill conducted according to section 121A.037 with students in early childhood through grade 12 must be:\n(1) accessible;\n(2) developmentally appropriate and age appropriate, including using appropriate safety language and vocabulary;\n(3) culturally aware;\n(4) trauma-informed; and\n(5) inclusive of accommodations for students with mobility restrictions, sensory needs, developmental or physical disabilities, mental health needs, and auditory or visual limitations.\nActive shooter drill protocols must include a reasonable amount of time immediately following the drill for teachers to debrief with their students. The opportunity to debrief must be provided to students before regular classroom activity may resume. During the debrief period, students must be allowed to access any mental health services available on campus, including counselors, school psychologists, social workers, or cultural liaisons. An active shooter drill must not be combined or conducted consecutively with any other type of emergency preparedness drill. An active shooter drill must be accompanied by an announcement prior to commencing. The announcement must use concise and age-appropriate language and, at a minimum, inform students there is no immediate danger to life and safety.\n(a) A school district or charter school must provide notice of a pending active shooter drill to every student's parent or legal guardian before an active shooter drill is conducted. Whenever practicable, notice must be provided at least 24 hours in advance of a pending active shooter drill and inform the parent or legal guardian of the right to opt their student out of participating.\n(b) If a student is opted out of participating in an active shooter drill, no negative consequence must impact the student's general school attendance record nor may nonparticipation alone make a student ineligible to participate in or attend school activities.\n(c) The commissioner of education must ensure the availability of alternative safety education for students who are opted out of participating or otherwise exempted from an active shooter drill. Alternative safety education must provide essential safety instruction through less sensorial safety training methods and must be appropriate for students with mobility restrictions, sensory needs, developmental or physical disabilities, mental health needs, and auditory or visual limitations.\nAny student in early childhood through grade 12 must not be required to participate in an active shooter drill that does not meet the criteria in subdivision 2.\nA student must not be required to participate in an active shooter simulation. An active shooter simulation must not take place during regular school hours if a majority of students are present, or expected to be present, at the school. A parent or legal guardian of a student in grades 9 through 12 must have the opportunity to opt their student into participating in an active shooter simulation.\n(a) A school district or charter school conducting an active shooter drill must provide students in middle school and high school at least one hour, or one standard class period, of violence prevention training annually.\n(b) The violence prevention training must be evidence-based and may be delivered in-person, virtually, or digitally. Training must, at a minimum, teach students the following:\n(1) how to identify observable warning signs and signals of an individual who may be at risk of harming oneself or others;\n(2) the importance of taking threats seriously and seeking help; and\n(3) the steps to report dangerous, violent, threatening, harmful, or potentially harmful activity.\n(c) By July 1, 2024, the commissioner of public safety and the commissioner of education must jointly develop a list of evidence-based trainings that a school district or charter school may use to fulfill the requirements of this section, including no-cost programming, if any. The agencies must:\n(1) post the list publicly on the Minnesota School Safety Center's website; and\n(2) update the list every two years.\n(d) A school district or charter school must ensure that students have the opportunity to contribute to their school's safety and violence prevention planning, aligned with the recommendations for multihazard planning for schools, including but not limited to:\n(1) student opportunities for leadership related to prevention and safety;\n(2) encouragement and support to students in establishing clubs and programs focused on safety; and\n(3) providing students with the opportunity to seek help from adults and to learn about prevention connected to topics including bullying, sexual harassment, sexual assault, and suicide.\nAt a regularly scheduled school board meeting, a school board of a district that has conducted an active shooter drill must consider the following:\n(1) the effect of active shooter drills on the safety of students and staff; and\n(2) the effect of active shooter drills on the mental health and wellness of students and staff.",
	"repealed": false
}