{
	"id": "18H.14",
	"url": "https://www.revisor.mn.gov/statutes/cite/18H.14",
	"title": "18H.14 LABELING AND ADVERTISING OF NURSERY STOCK.",
	"text": "(a) Plants, plant materials, or nursery stock must not be labeled or advertised with false or misleading information including, but not limited to, the scientific name, variety, place of origin, and hardiness zone as defined by the United States Department of Agriculture.\n(b) All nonhardy nursery stock as designated by the commissioner must be labeled correctly for hardiness or be labeled \"nonhardy\" in Minnesota.\n(c) An entity may not offer for distribution plants, plant materials, or nursery stock, represented by some specific or special form of notation, including, but not limited to, \"free from\" or \"grown free of,\" unless the plants are produced under a specific program approved by the commissioner to address the specific plant properties addressed in the special notation claim.\n(d) Nursery stock collected from the wild state must be inspected and certified prior to sale and at the time of sale must be labeled \"Collected from the Wild.\" The label must remain on each plant or clump of plants while it is offered for sale and during the distribution process. The collected stock may be grown in nursery rows at least two years, after which the plants may be sold without the labeling required by this paragraph.\n(e) An entity may not label or advertise an annual plant, bedding plant, or other plant, plant material, or nursery stock as beneficial to pollinators if the annual plant, bedding plant, plant material, or nursery stock has:\n(1) been treated with a systemic insecticide that:\n(i) has a pollinator protection box on the label; or\n(ii) has a pollinator, bee, or honey bee precautionary statement in the environmental hazards section of the insecticide product label; and\n(2) a concentration in its flowers or leaves greater than the reference value.\nThe commissioner shall enforce this paragraph as provided in chapter 18J.\n(f) For the purposes of paragraph (e):\n(1) \"systemic insecticide\" means an insecticide that is both absorbed by the plant and translocated through the plant's vascular system; and\n(2) \"reference value\" means the most appropriate value determined by the commissioner of agriculture based on the commissioner's review of pollinator protective reference values published or approved by the United States Environmental Protection Agency. If a United States Environmental Protection Agency reference value is not available for a specific systemic insecticide or is not appropriate for use in Minnesota or for a specific type of plant, plant material, or nursery stock, the commissioner may consider reference values from other states, peer-reviewed literature, or other appropriate sources.",
	"repealed": false
}