{
	"id": "245.4873",
	"url": "https://www.revisor.mn.gov/statutes/cite/245.4873",
	"title": "245.4873 COORDINATION OF CHILDREN'S MENTAL HEALTH SYSTEM.",
	"text": "Coordination of the development and delivery of mental health services for children shall occur on the state and local levels to assure the availability of services to meet the mental health needs of children in a cost-effective manner.\nThe Children's Cabinet, under section 4.045, in consultation with a representative of the Minnesota District Judges Association Juvenile Committee, shall:\n(1) educate each agency about the policies, procedures, funding, and services for children with emotional disturbances of all agencies represented;\n(2) develop mechanisms for interagency coordination on behalf of children with emotional disturbances;\n(3) identify barriers including policies and procedures within all agencies represented that interfere with delivery of mental health services for children;\n(4) recommend policy and procedural changes needed to improve development and delivery of mental health services for children in the agency or agencies they represent; and\n(5) identify mechanisms for better use of federal and state funding in the delivery of mental health services for children.\n[Repealed, 2014 c 262 art 3 s 18]\nThe case manager designated under section 245.4881 is responsible for ongoing coordination with any other person responsible for planning, development, and delivery of social services, education, corrections, health, or vocational services for the individual child. The individual family community support plan developed by the case manager shall reflect the coordination among the local service system providers.\nThe commissioner shall supervise the development and coordination of locally available children's mental health services by the county boards in a manner consistent with sections 245.487 to 245.4889. The commissioner shall provide technical assistance to county boards in developing and maintaining locally available and coordinated children's mental health services. The commissioner shall monitor the county board's progress in developing its full system capacity and quality through ongoing review of the county board's children's mental health proposals and other information as required by sections 245.487 to 245.4889.\n[Repealed, 2014 c 262 art 3 s 18]",
	"repealed": false
}