{
	"id": "62B.04",
	"url": "https://www.revisor.mn.gov/statutes/cite/62B.04",
	"title": "62B.04 AMOUNT OF CREDIT LIFE INSURANCE AND CREDIT ACCIDENT AND HEALTH INSURANCE.",
	"text": "(1) The initial amount of credit life insurance shall not exceed the amount of principal repayable under the contract of indebtedness plus an amount equal to one monthly payment. Thereafter, if the indebtedness is repayable in substantially equal installments according to a predetermined schedule, the amount of insurance shall not exceed the scheduled indebtedness plus one monthly payment or actual amount of indebtedness, whichever is greater. If the contract of indebtedness provides for a variable rate of finance charge or interest, the initial rate or the scheduled rates based on the initial index must be used in determining the scheduled amount of indebtedness and subsequent changes to the rate must be disregarded in determining whether the contract is repayable in substantially equal installments according to a predetermined schedule.\n(2) Notwithstanding clause (1), the amount of credit life insurance written in connection with credit transactions repayable over a specified term exceeding 63 months shall not exceed the greater of: (i) the actual amount of unpaid indebtedness as it exists from time to time; or (ii) where an indebtedness is repayable in substantially equal installments according to a predetermined schedule, the scheduled amount of unpaid indebtedness, less any unearned interest or finance charges, plus an amount equal to two monthly payments. If the credit transaction provides for a variable rate of finance charge or interest, the initial rate or the scheduled rates based on the initial index must be used in determining the scheduled amount of unpaid indebtedness and subsequent changes in the rate must be disregarded in determining whether the contract is repayable in substantially equal installments according to a predetermined schedule.\n(3) Notwithstanding clauses (1) and (2), insurance on educational, agricultural, and horticultural credit transaction commitments may be written on a nondecreasing or level term plan for the amount of the loan commitment.\n(4) If the contract of indebtedness provides for a variable rate of finance charge or interest, the initial rate or the scheduled rates based on the initial index shall be used in determining the scheduled amount of indebtedness, and subsequent changes to the rate shall be disregarded in determining whether the contract is repayable in substantially equal installments according to a predetermined schedule.\n(a) The total amount of periodic indemnity payable by credit accident and health insurance in the event of disability, as defined in the policy, shall not exceed the aggregate of the periodic scheduled unpaid installments of the indebtedness; and the amount of each periodic indemnity payment shall not exceed the original indebtedness divided by the number of periodic installments. If the credit transaction provides for a variable rate of finance charge or interest, the initial rate or the scheduled rates based on the initial index must be used in determining the aggregate of the periodic scheduled unpaid installments of the indebtedness.\n(b) If for any reason a policy of credit disability insurance will not or may not provide the policyholder or certificate holder with coverage for the total amount of indebtedness on the related loan or debt in the event of any one instance of disability, the applicant must be given a written disclosure on or accompanying the application. If the disclosure is on the application, it must be immediately above the signature line, within a box and the word \"WARNING\" must be in 14-point boldface capital letters. The rest of the text must be in capital letters and boldface 10-point print. If the disclosure is on a separate sheet, it must be on an 8-1/2 inch by 11 inch sheet of paper with the word \"WARNING\" in 14-point boldface capital letters with the remaining text in 10-point boldface capital letters. If a separate disclosure is used, it must be signed by the applicant with one copy provided to the applicant and one copy maintained by the insurer for at least the term of the policy or certificate, if coverage is issued. The disclosure must state:\nWARNING: IF YOU BECOME DISABLED AS DEFINED IN THE POLICY/CERTIFICATE, THIS DISABILITY INSURANCE POLICY/CERTIFICATE MAY NOT COVER YOUR ENTIRE INDEBTEDNESS. IF YOU BECOME DISABLED AT A POINT WHERE THE NUMBER OF MONTHLY INSTALLMENT PAYMENTS REMAINING EXCEEDS THE PERIOD OF COVERAGE BEING PROVIDED BY THIS POLICY/CERTIFICATE, THE BENEFITS AVAILABLE WILL BE LESS THAN THE AMOUNT NECESSARY TO PAY OFF YOUR LOAN. IF YOU WANT COVERAGE FOR THE FULL AMOUNT OF YOUR INDEBTEDNESS OR HAVE ANY QUESTIONS ABOUT THE EXTENT OR NATURE OF YOUR COVERAGE, YOU SHOULD DISCUSS THEM WITH YOUR AGENT AND/OR ENROLLER BEFORE SUBMITTING YOUR APPLICATION.\n(c) Any policy or certificate of credit disability insurance which contains a critical period must make available for any single instance of disability monthly indemnity benefit payments for the term of the loan, 24 months, or the term of the disability, whichever is less. For the purposes of this section, a critical period is when there is a limited number of monthly benefit payments that may be paid to the beneficiary or the policyholder or certificate holder as a result of any one instance of disability.\n(d) Unless the policy or certificate provides for such coverage, nothing in this section shall be interpreted as requiring an insurer to provide coverage for the final payment of a balloon loan or for a period that exceeds the age limitation in the policy or certificate or for amounts that exceed the insurer's maximum liability limits.\nThe total amount of periodic indemnity payable by credit involuntary unemployment insurance in the event of involuntary unemployment shall not exceed the aggregate of the periodic scheduled unpaid installments of the indebtedness; and the amount of each periodic indemnity payment shall not exceed the original indebtedness divided by the number of periodic installments.",
	"repealed": false
}