{
	"id": "135A.52",
	"url": "https://www.revisor.mn.gov/statutes/cite/135A.52",
	"title": "135A.52 PROGRAM AND QUALIFICATIONS.",
	"text": "Except for an administration fee established by the governing board at a level to recover costs, to be collected only when a course is taken for credit, a senior citizen who is a legal resident of Minnesota is entitled without payment of tuition or activity fees to attend courses offered for credit, audit any courses offered for credit, or enroll in any noncredit courses in any state supported institution of higher education in Minnesota when space is available after all tuition-paying students have been accommodated. A senior citizen enrolled under this section must pay any materials, personal property, or service charges for the course. In addition, a senior citizen who is enrolled in a course for credit must pay an administrative fee in an amount established by the governing board of the institution to recover costs. There shall be no administrative fee charges to a senior citizen auditing a course. For the purposes of this section and section 135A.51, the term \"noncredit courses\" shall not include those courses designed and offered specifically and exclusively for senior citizens.\nThe provisions of this section and section 135A.51 do not apply to noncredit courses designed and offered by the University of Minnesota, and the Minnesota State Colleges and Universities specifically and exclusively for senior citizens. Senior citizens enrolled under the provisions of this section and section 135A.51 shall not be included by such institutions in their computation of full-time equivalent students when requesting staff or appropriations.\n(a) Except under paragraph (b), there shall be no limit to the number of terms, quarters or semesters a senior citizen may attend courses, nor income limitation imposed in determining eligibility.\n(b) A senior citizen enrolled in a closed enrollment contract training program is not eligible for benefits under subdivision 1.\nEach state supported institution of higher education shall prominently include in its catalogue a statement of benefits provided for senior citizens.\nThe institution shall determine whether a person qualifies for, and require execution of appropriate forms to request, the senior citizen benefits.\nThe institution shall refer interested senior citizens to social service, community, and educational agencies for employment or volunteer work.\nMinnesota State Colleges and Universities campuses that offer farm business management may specify space availability in the delivery of farm business management courses.",
	"repealed": false
}