{
	"id": "260E.30",
	"url": "https://www.revisor.mn.gov/statutes/cite/260E.30",
	"title": "260E.30 CONCLUSION OF SCHOOL OR FACILITY INVESTIGATION.",
	"text": "If the commissioner of education conducts an investigation, the commissioner shall determine whether maltreatment occurred and what corrective or protective action was taken by the school facility. If a determination is made that maltreatment occurred, the commissioner shall report to the employer, the school board, and any appropriate licensing entity the determination that maltreatment occurred and what corrective or protective action was taken by the school facility. In all other cases, the commissioner shall inform the school board or employer that a report was received; the subject of the report; the date of the initial report; the category of maltreatment alleged as defined in section 260E.03, subdivision 12; the fact that maltreatment was not determined; and a summary of the specific reasons for the determination.\n(a) When maltreatment is determined in an investigation involving a facility, the investigating agency shall also determine whether the facility or individual was responsible, or whether both the facility and the individual were responsible for the maltreatment using the mitigating factors in subdivision 4. Determinations under this subdivision must be made based on a preponderance of the evidence and are private data on individuals or nonpublic data as maintained by the commissioner of education.\n(b) Any operator, employee, or volunteer worker at any facility who intentionally maltreats any child in the care of that facility may be charged with a violation of section 609.255, 609.377, or 609.378. Any operator of a facility who knowingly permits conditions to exist that result in maltreatment of a child in a facility while in the care of that facility may be charged with a violation of section 609.378. The facility operator shall inform all mandated reporters employed by or otherwise associated with the facility of the duties required of mandated reporters and shall inform all mandatory reporters of the prohibition against retaliation for reports made in good faith under this section.\n(a) If paragraph (b) applies, rather than making a determination of substantiated maltreatment by the individual, the commissioner of children, youth, and families shall determine that the individual made a nonmaltreatment mistake.\n(b) A nonmaltreatment mistake occurs when:\n(1) the individual has not been determined responsible for a similar incident that resulted in a finding of maltreatment for at least seven years;\n(2) the individual has not been determined to have committed a similar nonmaltreatment mistake under this paragraph for at least four years;\n(3) any injury to a child resulting from the incident, if treated, is treated only with remedies that are available over the counter, whether ordered by a medical professional or not;\n(4) except for the period when the incident occurred, the facility and the individual providing services were both in compliance with all licensing and certification requirements relevant to the incident; and\n(5) at the time of the incident, the individual was performing duties identified in the licensed center's child care program plan required under Minnesota Rules, part 9503.0045. This clause applies only to child care centers licensed under Minnesota Rules, chapter 9503.\n(c) This subdivision only applies to child care centers certified under chapter 142C and licensed under Minnesota Rules, chapter 9503.\n(a) When determining whether the facility or individual is the responsible party or whether both the facility and the individual are responsible for determined maltreatment in a facility, the investigating agency shall consider at least the following mitigating factors:\n(1) whether the actions of the facility or the individual caregivers were according to, and followed the terms of, an erroneous physician order, prescription, individual care plan, or directive; however, this is not a mitigating factor when the facility or caregiver was responsible for the issuance of the erroneous order, prescription, individual care plan, or directive or knew or should have known of the errors and took no reasonable measures to correct the defect before administering care;\n(2) comparative responsibility between the facility, other caregivers, and requirements placed upon an employee, including the facility's compliance with related regulatory standards and the adequacy of facility policies and procedures, facility training, an individual's participation in the training, the caregiver's supervision, and facility staffing levels and the scope of the individual employee's authority and discretion; and\n(3) whether the facility or individual followed professional standards in exercising professional judgment.\n(b) The evaluation of the facility's responsibility under paragraph (a), clause (2), must not be based on the completeness of the risk assessment or risk reduction plan required under section 245A.66, but must be based on the facility's compliance with the regulatory standards for policies and procedures, training, and supervision as cited in Minnesota Statutes and Minnesota Rules.\n(c) Notwithstanding paragraphs (a) and (b), when maltreatment is determined to have been committed by an individual who is also the facility license holder, both the individual and the facility must be determined responsible for the maltreatment, and both the background study disqualification standards under section 245C.15, subdivision 4, and the licensing or certification actions under section 142C.06, 142C.07, 245A.06, or 245A.07 apply.\n(a) When the commissioner of the agency responsible for investigating the report or local welfare agency has completed its investigation, every parent, guardian, or legal custodian previously notified of the investigation by the commissioner or local welfare agency shall be provided with the following information in a written memorandum: the name of the facility investigated; the nature of the alleged maltreatment of a child in the facility; the investigator's name; a summary of the investigation findings; a statement of whether maltreatment was found; and the protective or corrective measures that are being or will be taken.\n(b) The memorandum shall be written in a manner that protects the identity of the reporter and the child and shall not contain the name or, to the extent possible, reveal the identity of the alleged offender or the identity of individuals interviewed during the investigation.\n(c) If maltreatment is determined to exist, the commissioner or local welfare agency shall also provide the written memorandum to the parent, guardian, or legal custodian of each child in the facility who had contact with the individual responsible for the maltreatment.\n(d) When the facility is the responsible party for maltreatment, the commissioner or local welfare agency shall also provide the written memorandum to the parent, guardian, or legal custodian of each child who received services in the population of the facility where the maltreatment occurred.\n(e) This notification must be provided to the parent, guardian, or legal custodian of each child receiving services from the time the maltreatment occurred until either the individual responsible for maltreatment is no longer in contact with a child or children in the facility or the conclusion of the investigation.\n(f) In the case of maltreatment within a school facility, as defined in section 120A.05, subdivisions 9, 11, and 13, and chapter 124E, the commissioner of education need not provide notification to parents, guardians, or legal custodians of each child in the facility, but shall, within ten days after the investigation is completed, provide written notification to the parent, guardian, or legal custodian of any student alleged to have been maltreated.\n(g) The commissioner of education may notify the parent, guardian, or legal custodian of any student involved as a witness to alleged maltreatment.\n(a) Within ten working days of the conclusion of an investigation, the local welfare agency or agency responsible for investigating the report of maltreatment in a facility shall notify the parent or guardian of the child, the person determined to be maltreating the child, and the director of the facility of the determination and a summary of the specific reasons for the determination.\n(b) When the investigation involves a child foster care setting that is monitored by a private licensing agency under section 245A.16, the local welfare agency responsible for investigating the report shall notify the private licensing agency of the determination and shall provide a summary of the specific reasons for the determination. The notice to the private licensing agency must include identifying private data, but not the identity of the reporter of maltreatment.\n(c) The notice must also include a certification that the information collection procedures under section 260E.20, subdivision 3, were followed and a notice of the right of a data subject to obtain access to other private data on the subject collected, created, or maintained under this section.\n(d) In addition, the notice shall include the length of time that the records will be kept under section 260E.35, subdivision 6.\n(e) The investigating agency shall notify the parent or guardian of the child who is the subject of the report and any person or facility determined to have maltreated a child of their appeal or review rights under this section.\n(f) The notice must also state that a finding of maltreatment may result in denial of a license or certification application or background study disqualification under chapter 245C related to employment or services that are licensed by the Department of Human Services under chapter 245A; the Department of Children, Youth, and Families under chapter 142B or 142C; the Department of Health under chapter 144 or 144A; or the Department of Corrections under section 241.021 and from providing services related to an unlicensed personal care provider organization under chapter 256B.",
	"repealed": false
}