{
	"id": "216B.167",
	"url": "https://www.revisor.mn.gov/statutes/cite/216B.167",
	"title": "216B.167 PERFORMANCE-BASED GAS PURCHASING PLAN.",
	"text": "A public utility that furnishes natural gas may petition the commission for approval of a performance-based gas purchasing plan under this section. The commission may approve a plan if it finds that:\n(1) the plan provides incentives for the utility to achieve lower natural gas costs than would have been achieved in the absence of the plan, as measured by the benchmarks established in clause (3), by linking financial rewards and penalties to natural gas costs;\n(2) the potential benefits of the plan apply, at a minimum, to each customer class purchasing firm natural gas service from the utility;\n(3) the plan establishes one or more benchmarks against which actual natural gas costs will be measured and the benchmarks reflect relevant market conditions and represent reasonable and achievable natural gas costs in Minnesota for the term of the plan; and\n(4) the plan provides that the utility cannot curtail or interrupt service to any customer class purchasing firm natural gas service during the term of the plan except for causes outside the reasonable control of the utility or causes not directly related to the gas purchasing practices of the utility.\nA plan must include a mechanism through which the utility shares with its customers the difference between actual natural gas costs and the plan's benchmark costs during the term of the plan. A plan must provide details of the sharing mechanism and may include an allowed level of costs above and below the benchmark before any sharing is to take place. The commission must determine an appropriate percentage of the difference between the benchmark and actual natural gas costs to be shared between customers and the utility. The sharing mechanism shall be implemented annually under section 216B.16, subdivision 7a. Financial rewards or penalties under the plan shall not be considered in the determination of the utility's revenue requirements in a general rate case pursuant to section 216B.16.\nA plan must allow for the imposition of penalties if the standard for reliability of service established in subdivision 1, clause (4), is not met.\nA plan must include an evaluation process and mechanism that is reasonable and capable of supporting a full review of the utility's performance under the plan. The commission shall evaluate the various customer and utility impacts of a plan based on this evaluation process and mechanism, including the impact on customer bills over time, the impact on utility revenues, and the effectiveness of the plan in meeting the purposes contained in subdivision 1. The evaluation must occur within a reasonable time following the end of the plan.\nThe utility shall provide an annual report to the commission documenting its performance in meeting the requirements of the plan. Upon review of this report, the commission shall determine and approve rewards or penalties as provided in the plan.\nA plan may be filed and approved within a miscellaneous tariff filing pursuant to section 216B.16. The commission may approve, reject, or modify the plan in a manner which meets the requirements of this section. An approved plan is effective for a period of not less than two years unless:\n(1) the plan is withdrawn by the utility within 30 days of a final appealable order approving the plan; or\n(2) the commission, after notice and hearing, rescinds or amends its order approving the plan.\n[Repealed, 1999 c 21 s 1]\n[Repealed, 1999 c 21 s 1]",
	"repealed": false
}