{
	"id": "469.1655",
	"url": "https://www.revisor.mn.gov/statutes/cite/469.1655",
	"title": "469.1655 QUALIFIED GREEN BUILDING AND SUSTAINABLE DESIGN PROJECTS.",
	"text": "(a) A municipality or redevelopment agency issuing revenue bonds under sections 469.152 to 469.165 may designate the project for which the bonds are issued as a qualified green building and sustainable design project as provided in this section.\n(b) The issuer must ensure that each designated project substantially:\n(1) reduces consumption of electricity compared to conventional construction;\n(2) reduces daily carbon dioxide emissions compared to energy generated from coal;\n(3) increases the use of solar photovoltaic cells or solar thermal cells in this state; or\n(4) increases the use of fuel cells to generate energy.\n(c) Before designating a project under this section, the issuer must document in writing that the project will satisfy the eligibility criteria in this section.\n(d) At least 75 percent of the square footage of commercial buildings that are part of the project must be registered with a recognized green building rating system, including Minnesota's sustainable building guidelines or the United States Green Building Council's LEED certification or the Green Building Initiative's Green Globes certification, or in the case of residential buildings, Minnesota GreenStar rating or the National Association of Home Builders National Green Building Standard certification, and must be reasonably expected to receive the certification.\nAn application for designation under this section must include a project proposal that describes the energy-efficiency, renewable energy, and sustainable design features of the project and demonstrates that the project satisfies the eligibility criteria in this section. The application must include a description of:\n(1) the amount of electric consumption reduced as compared to conventional construction;\n(2) the amount of carbon dioxide daily emissions reduced compared to energy generated from coal;\n(3) the amount of the gross installed capacity of the project's solar photovoltaic capacity measured in megawatts; and\n(4) the amount in megawatts of the project's energy generated by fuel cells.\nThe project proposal must include a description of the bond financing that will be allocated for financing of one or more of the following:\n(1) the purchase, construction, integration, or other use of energy-efficiency, renewable energy, and sustainable design features of the project; or\n(2) compliance with certification standards cited under subdivision 1, paragraph (d).",
	"repealed": false
}