{
	"id": "48.056",
	"url": "https://www.revisor.mn.gov/statutes/cite/48.056",
	"title": "48.056 REVERSE STOCK SPLIT.",
	"text": "(a) A banking institution may effect a reverse stock split by reducing its outstanding shares of stock if the commissioner finds that the transaction:\n(1) has a legitimate business purpose including, but not limited to, reducing corporate expenses, simplifying corporate procedures, or becoming a qualified S corporation under the Internal Revenue Code of 1986, as amended through December 31, 1998; and\n(2) complies with safe and sound banking practices.\n(b) The stock reduction is effective upon approval by the shareholders and the commissioner and filing with the commissioner and with the secretary of state, of the articles of amendment to the certificate of incorporation of the banking institution.\nA banking institution may issue fractions of a share as a result of a reverse stock split by reducing its outstanding shares of stock according to this subdivision. If a banking institution inserts into its certificate of incorporation a provision prohibiting the issue of fractions of a share, it shall pay in cash the value of fractions of a share as of the time when persons entitled to receive the fractions are determined.\n[Repealed, 2005 c 69 art 4 s 1]\nA stockholder of the banking institution not voting in favor of the amendment of the certificate of incorporation of the banking institution to effect a reverse stock split that will impact upon the stockholder's voting rights in the banking institution may, at the meeting of the stockholders held on the amendment, or within 20 days after the meeting, object to the stock reduction and demand payment for that person's stock. If the stock reduction takes effect at any time after this demand, the stockholder may, at any time within 60 days after the demand, apply to the district court in the county of the banking institution's principal place of business for the appointment of three persons to appraise the value of that person's stock. The court shall appoint the appraisers and designate the time and place of their first meeting, give directions with regard to their proceedings the court considers proper, and direct the time and manner in which payment must be made of the value of that person's stock to the stockholder. The appraisers shall meet at the time and place designated, after being duly sworn to discharge their duties honestly and faithfully, make and certify a written estimate of the value of the stock at the time of the appraisal, and deliver one copy to the banking institution and another to the stockholder. The stockholder and the banking institution shall each pay one-half of the charges and expenses of the appraisers.",
	"repealed": false
}