{
	"id": "349A.10",
	"url": "https://www.revisor.mn.gov/statutes/cite/349A.10",
	"title": "349A.10 LOTTERY FUNDS.",
	"text": "The director shall establish a lottery fund outside the state treasury, consisting of the gross revenues of the lottery and all other money credited or transferred to it by law, except for money set aside and deposited in the lottery prize fund under subdivision 2.\n(a) The director shall establish a lottery prize fund outside the state treasury. The fund consists of all money deposited in it under this subdivision and all interest earned thereon.\n(b) The director shall deposit in the lottery prize fund, from gross receipts from the sale of lottery tickets, an amount sufficient to pay lottery prizes from the lottery prize fund according to the following provisions:\n(1) for games which require online terminal connections, the prizes paid in any fiscal year must be at least 45 percent of gross receipts from those games in that fiscal year;\n(2) for games which do not require online terminal connections, the prizes paid in any fiscal year must be at least the following percentages of gross receipts from those games:\n(i) 50 percent through fiscal year 1991;\n(ii) 55 percent from July 1, 1991, to June 30, 1992; and\n(iii) 60 percent thereafter.\n(a) The director shall establish a lottery operations account in the lottery fund. The director shall pay all costs of operating the lottery, including payroll costs or amounts transferred to the state treasury for payroll costs, but not including lottery prizes, from the lottery operating account. The director shall credit to the lottery operations account amounts sufficient to pay the operating costs of the lottery.\n(b) Except as provided in paragraph (e), the director may not credit in any fiscal year thereafter amounts to the lottery operations account which when totaled exceed nine percent of gross revenue to the lottery fund in that fiscal year. In computing total amounts credited to the lottery operations account under this paragraph the director shall disregard amounts transferred to or retained by lottery retailers as sales commissions or other compensation.\n(c) The director of the lottery may not expend after July 1, 1991, more than 2-3/4 percent of gross revenues in a fiscal year for contracts for the preparation, publication, and placement of advertising.\n(d) Except as the director determines, the lottery is not subject to chapter 16A relating to budgeting, payroll, and the purchase of goods and services.\n(e) In addition to the amounts credited to the lottery operations account under paragraph (b), the director is authorized, if necessary, to meet the current obligations of the lottery and to credit up to 25 percent of an amount equal to the average annual amount which was authorized to be credited to the lottery operations account for the previous three fiscal years but was not needed to meet the obligations of the lottery.\n(a) The director may require lottery retailers to:\n(1) deposit in a separate account to the credit of the lottery fund, in banks designated by the director, all money received by the lottery retailer from the sale of lottery tickets, less money retained as the lottery retailer's commission and for payment of prizes;\n(2) file with the director reports of the lottery retailer's receipts and transactions in ticket sales in a form that the director prescribes; and\n(3) allow money deposited by the lottery retailer from the sale of lottery tickets to be transferred to the lottery through electronic fund transfer.\n(b) The director may make arrangements for any person, including a financial institution, to perform functions, activities, or services in connection with the receipt and distribution of lottery revenues.\n(c) A lottery retailer who fails to pay any money due to the director within the time prescribed by the director shall pay interest on the amount owed at the rate determined by rule.\nWithin 30 days after the end of each month, the director shall deposit in the state treasury the net proceeds of the lottery, which is the balance in the lottery fund after transfers to the lottery prize fund and credits to the lottery operations account. Of the net proceeds, 40 percent must be credited to the Minnesota environment and natural resources trust fund and the remainder must be credited to the general fund.\n(a) The director shall prepare and submit a biennial budget plan to the commissioner of management and budget. The governor shall recommend the maximum amount available for the lottery in the budget the governor submits to the legislature under section 16A.11. The maximum amount available to the lottery for operating expenses and capital expenditures shall be determined by law. In addition, the director shall appear at least once each fiscal year before the senate and house of representatives committees having jurisdiction over gambling policy to present and explain the lottery's plans for future games and the related advertising and promotions and spending plans for the next fiscal year.\n(b) For purposes of this section, operating expenses shall not include:\n(1) expenses that are a direct function of lottery sales, which include the cost of lottery prizes, amounts paid to lottery retailers as sales commissions or other compensation, amounts paid to produce and deliver scratch lottery games, and amounts paid to an outside vendor to operate and maintain an online gaming system; and\n(2) expenses related solely to the noncash year-end adjustment required for government agencies to adjust the net actuarially determined pension liability which includes deferred inflows, deferred outflows, noncash pension expense, unrestricted net deficit, and net pension liability, in accordance with Statement 68 of the Governmental Accounting Standards Board.\n(a) A lottery cash flow account is created in the special revenue fund in the state treasury. At the end of each week the director shall deposit in the lottery cash flow account from the lottery fund and the lottery prize fund all amounts that the director determines are not required for immediate use in the lottery fund or the lottery prize fund. The commissioner of management and budget shall credit to the lottery cash flow account interest on all money deposited in the lottery cash flow account under this subdivision.\n(b) The director shall notify the commissioner of management and budget whenever the director determines that money transferred under paragraph (a) is required for the immediate use of the lottery fund or the lottery prize fund. Upon receiving the notification the commissioner shall transfer the amount identified in the notification. Amounts necessary to make immediate payment for expenses or prizes from the lottery fund or the prize fund are appropriated from the lottery cash flow account to the director.\n(c) The director shall notify the commissioner of management and budget 30 days after each month as to the amount of the net proceeds that must be transferred under subdivision 5, and the director shall notify the commissioner of management and budget 20 days after each month as to the amount that must be transferred under section 297A.65, and as necessary the director shall notify the commissioner of other amounts required by law to be transferred.",
	"repealed": false
}