{
	"id": "16D.11",
	"url": "https://www.revisor.mn.gov/statutes/cite/16D.11",
	"title": "16D.11 COLLECTION COSTS.",
	"text": "As determined by the commissioner of revenue, collection costs shall be added to the debts referred to the commissioner or private collection agency for collection. Collection costs are collectible by the commissioner or private agency from the debtor at the same time and in the same manner as the referred debt. If the commissioner or private agency collects an amount less than the total due, the payment is applied proportionally to collection costs and the underlying debt unless the commissioner has waived this requirement for certain categories of debt pursuant to the department's internal guidelines. Collection costs collected by the commissioner under this subdivision or retained under subdivision 6 shall be deposited in the general fund as nondedicated receipts. Collections of collection costs in excess of collection agency fees must be deposited in the general fund as nondedicated receipts.\n[Repealed, 2014 c 308 art 9 s 94]\nCollection costs imposed under subdivision 1 shall be canceled and subtracted from the amount due if:\n(1) the debtor's household income as defined in section 290A.03, subdivision 5, excluding the exemption subtractions in subdivision 3, paragraph (c), of that section, for the 12 months preceding the date of referral is less than twice the annual federal poverty guideline under United States Code, title 42, section 9902, subsection (2);\n(2) within 60 days after the first contact with the debtor by the commissioner or collection agency, the debtor establishes reasonable cause for the failure to pay the debt prior to referral of the debt to the commissioner;\n(3) a good faith dispute as to the legitimacy or the amount of the debt is made, and payment is remitted or a payment agreement is entered into within 30 days after resolution of the dispute;\n(4) good faith litigation occurs and the debtor's position is substantially justified, and if the debtor does not totally prevail, the debt is paid or a payment agreement is entered into within 30 days after the judgment becomes final and nonappealable; or\n(5) collection costs have been added by the referring agency and are included in the amount of the referred debt.\nDecisions of the commissioner denying an application to cancel collection costs under subdivision 3 are subject to the contested case procedure under chapter 14.\nIf collection costs are collected and then canceled, the amount of the collection costs shall be refunded to the debtor within 30 days. The amount necessary to pay the refunds is annually appropriated to the commissioner.\nIf collection costs are canceled under subdivision 3, an amount equal to the costs is retained by the commissioner from the debt collected, and is accounted for and subject to the same provisions of this chapter as if the costs had been collected from the debtor.\nBy June 1 of each year, the commissioner shall determine the rate of collection costs for debts referred to the commissioner during the next fiscal year. The rate is a percentage of the debts in an amount that most nearly equals the costs of the commissioner necessary to process and collect referred debts under this chapter. In no event shall the rate of the collection costs exceed 25 percent of the debt. Determination of the rate of collection costs under this section is not subject to the fee setting requirements of section 16A.1283.",
	"repealed": false
}