{
	"id": "254B.04",
	"url": "https://www.revisor.mn.gov/statutes/cite/254B.04",
	"title": "254B.04 ELIGIBILITY FOR BEHAVIORAL HEALTH FUND SERVICES.",
	"text": "This section governs the administration of the behavioral health fund, establishes the criteria to be applied by local agencies to determine a client's financial eligibility under the behavioral health fund, and determines a client's obligation to pay for substance use disorder treatment services.\n(a) Persons eligible for benefits under Code of Federal Regulations, title 25, part 20, who meet the income standards of section 256B.056, subdivision 4, and are not enrolled in medical assistance, are entitled to behavioral health fund services. State money appropriated for this paragraph must be placed in a separate account established for this purpose.\n(b) Persons with dependent children who are determined to be in need of substance use disorder treatment pursuant to an assessment under section 260E.20, subdivision 1, or in need of chemical dependency treatment pursuant to a case plan under section 260C.201, subdivision 6, or 260C.212, shall be assisted by the local agency to access needed treatment services. Treatment services must be appropriate for the individual or family, which may include long-term care treatment or treatment in a facility that allows the dependent children to stay in the treatment facility. The county shall pay for out-of-home placement costs, if applicable.\n(c) Notwithstanding paragraph (a), any person enrolled in medical assistance or MinnesotaCare is eligible for room and board services under section 254B.05, subdivision 5, paragraph (b), clause (9).\n(d) A client is eligible to have substance use disorder treatment paid for with funds from the behavioral health fund when the client:\n(1) is eligible for MFIP as determined under chapter 142G;\n(2) is eligible for medical assistance as determined under Minnesota Rules, parts 9505.0010 to 9505.0150;\n(3) is eligible for general assistance, general assistance medical care, or work readiness as determined under Minnesota Rules, parts 9500.1200 to 9500.1318; or\n(4) has income that is within current household size and income guidelines for entitled persons, as defined in this subdivision and subdivision 7.\n(e) Clients who meet the financial eligibility requirement in paragraph (a) and who have a third-party payment source are eligible for the behavioral health fund if the third-party payment source pays less than 100 percent of the cost of treatment services for eligible clients.\n(f) A client is ineligible to have substance use disorder treatment services paid for with behavioral health fund money if the client:\n(1) has an income that exceeds current household size and income guidelines for entitled persons as defined in this subdivision and subdivision 7; or\n(2) has an available third-party payment source that will pay the total cost of the client's treatment.\n(g) A client who is disenrolled from a state prepaid health plan during a treatment episode is eligible for continued treatment service that is paid for by the behavioral health fund until the treatment episode is completed or the client is re-enrolled in a state prepaid health plan if the client:\n(1) continues to be enrolled in MinnesotaCare, medical assistance, or general assistance medical care; or\n(2) is eligible according to paragraphs (a) and (b) and is determined eligible by a local agency under section 254B.04.\n(h) When a county commits a client under chapter 253B to a regional treatment center for substance use disorder services and the client is ineligible for the behavioral health fund, the county is responsible for the payment to the regional treatment center according to section 254B.05, subdivision 4.\n(i) Persons enrolled in MinnesotaCare are eligible for room and board services when provided through intensive residential treatment services and residential crisis services under section 256B.0622.\n[Repealed, 1989 c 155 s 5]\nA person eligible for room and board services under section 254B.05, subdivision 5, paragraph (b), must score at level 4 on assessment dimensions related to readiness to change, relapse, continued use, or recovery environment in order to be assigned to services with a room and board component reimbursed under this section. Whether a treatment facility has been designated an institution for mental diseases under United States Code, title 42, section 1396d, shall not be a factor in making placements.\nMS 2022 [Repealed, 2023 c 50 art 2 s 63]\nMS 2022 [Repealed, 2023 c 50 art 2 s 63]\n[Repealed, 2014 c 262 art 3 s 18]\n(a) The level of care determination must follow criteria approved by the commissioner.\n(b) Dimension 1: Acute intoxication and withdrawal potential. A vendor must use the following criteria in Dimension 1 to determine a client's acute intoxication and withdrawal potential, the client's ability to cope with withdrawal symptoms, and the client's current state of intoxication.\n(c) Dimension 2: Biomedical conditions and complications. The vendor must use the following criteria in Dimension 2 to determine a client's biomedical conditions and complications, the degree to which any physical disorder of the client would interfere with treatment for substance use, and the client's ability to tolerate any related discomfort. If the client is pregnant, the provider must determine the impact of continued substance use on the unborn child.\n(d) Dimension 3: Emotional, behavioral, and cognitive conditions and complications. The vendor must use the following criteria in Dimension 3 to determine a client's emotional, behavioral, and cognitive conditions and complications; the degree to which any condition or complication is likely to interfere with treatment for substance use or with functioning in significant life areas; and the likelihood of harm to self or others.\n(e) Dimension 4: Readiness for change. The vendor must use the following criteria in Dimension 4 to determine a client's readiness for change and the support necessary to keep the client involved in treatment services.\n(f) Dimension 5: Relapse, continued use, and continued problem potential. The vendor must use the following criteria in Dimension 5 to determine a client's relapse, continued use, and continued problem potential and the degree to which the client recognizes relapse issues and has the skills to prevent relapse of either substance use or mental health problems.\n(g) Dimension 6: Recovery environment. The vendor must use the following criteria in Dimension 6 to determine a client's recovery environment, whether the areas of the client's life are supportive of or antagonistic to treatment participation and recovery.\nThe local agency may employ individuals to conduct administrative activities and facilitate access to substance use disorder treatment services.\n(a) The local agency shall determine a client's financial eligibility for the behavioral health fund according to section 254B.04, subdivision 1a, with the income calculated prospectively for one year from the date of request. The local agency shall pay for eligible clients according to chapter 256G. Client eligibility must be determined using only forms prescribed by the commissioner unless the local agency has a reasonable basis for believing that the information submitted on a form is false. To determine a client's eligibility, the local agency must determine the client's income, the size of the client's household, the availability of a third-party payment source, and a responsible relative's ability to pay for the client's substance use disorder treatment.\n(b) A client who is a minor child must not be deemed to have income available to pay for substance use disorder treatment, unless the minor child is responsible for payment under section 144.347 for substance use disorder treatment services sought under section 144.343, subdivision 1.\n(c) The local agency must determine the client's household size as follows:\n(1) if the client is a minor child, the household size includes the following persons living in the same dwelling unit:\n(i) the client;\n(ii) the client's birth or adoptive parents; and\n(iii) the client's siblings who are minors; and\n(2) if the client is an adult, the household size includes the following persons living in the same dwelling unit:\n(i) the client;\n(ii) the client's spouse;\n(iii) the client's minor children; and\n(iv) the client's spouse's minor children.\nFor purposes of this paragraph, household size includes a person listed in clauses (1) and (2) who is in an out-of-home placement if a person listed in clause (1) or (2) is contributing to the cost of care of the person in out-of-home placement.\n(d) The local agency must determine the client's current prepaid health plan enrollment, the availability of a third-party payment source, including the availability of total payment, partial payment, and amount of co-payment.\n(e) The local agency must provide the required eligibility information to the department in the manner specified by the department.\n(f) The local agency shall require the client and policyholder to conditionally assign to the department the client and policyholder's rights and the rights of minor children to benefits or services provided to the client if the department is required to collect from a third-party pay source.\n(g) The local agency must redetermine a client's eligibility for the behavioral health fund every 12 months.\n(h) A client, responsible relative, and policyholder must provide income or wage verification, household size verification, and must make an assignment of third-party payment rights under paragraph (f). If a client, responsible relative, or policyholder does not comply with the provisions of this subdivision, the client is ineligible for behavioral health fund payment for substance use disorder treatment, and the client and responsible relative must be obligated to pay for the full cost of substance use disorder treatment services provided to the client.\nThe local agency must enter the financial eligibility span within five business days of a request. If the comprehensive assessment is completed within the timelines required under chapter 245G, then the span of eligibility must begin on the date services were initiated. If the comprehensive assessment is not completed within the timelines required under chapter 245G, then the span of eligibility must begin on the date the comprehensive assessment was completed.\nA client whose household income is within current household size and income guidelines for entitled persons as defined in section 254B.04, subdivision 1a, must pay no fee for care related to substance use disorder, including drug screens.\nTo be eligible for payment under the behavioral health fund, a vendor must participate in the Drug and Alcohol Abuse Normative Evaluation System (DAANES) or submit to the commissioner the information required in the DAANES in the format specified by the commissioner.",
	"repealed": false
}