{
	"id": "182.668",
	"url": "https://www.revisor.mn.gov/statutes/cite/182.668",
	"title": "182.668 PROTECTION OF TRADE SECRETS.",
	"text": "Subject to the restrictions on the withholding of information pursuant to Minnesota Rules, part 5205.0010, a manufacturer or employer who believes that all or a part of the information required under section 182.653, subdivision 4a, 4b, 4c, 4e, or 4f or requested under section 182.654, subdivision 10 is a trade secret as defined in section 325C.01, subdivision 5, may register the information with the commissioner as trade secret information.\nInformation that has been registered pursuant to subdivision 1 shall be classified as nonpublic or private data as defined in section 13.02, subdivisions 9 and 12.\nAll other information reported to or otherwise obtained by the commissioner or a representative in connection with any inspection or proceeding under this chapter which contains or which might reveal a trade secret shall be classified as nonpublic or private data as defined in section 13.02, subdivisions 9 and 12. Information classified as nonpublic or private may be disclosed to other officers or employees concerned with carrying out this chapter or when relevant in any proceeding under this chapter or when otherwise required in order to comply with federal law or regulation but only to the extent required by the federal law or regulation.\nOn the request of a manufacturer, employer, employee or employee representative, the commissioner shall determine whether information registered pursuant to subdivision 1 or otherwise reported to or obtained by the commissioner is a trade secret as defined in section 325C.01, subdivision 5. In making a determination the commissioner shall also determine whether the information should in any event be disclosed in order to properly protect the health and safety of employees.\nAn employer or manufacturer that disagrees with a determination under this subdivision may pursue its remedies as provided in chapter 325C or other relevant law.\nThe commissioner shall issue orders as may be appropriate to protect the classification of trade secrets and may, at the request of an employer, in inspections of trade secrets areas or in discussions involving trade secrets, allow an authorized representative of employees to be replaced by an employee authorized by the employer. The commissioner may also allow the employer to screen out trade secret details where photographs are deemed essential to the investigation and to restrict samples to be taken where trade secrets might be exposed.\nInformation provided to an employee or designated representative pursuant to section 182.653, subdivisions 4a, 4b, 4c, 4e, or 182.654, subdivision 10 which has been determined by the commissioner to be a trade secret shall not be disclosed to anyone except as required for medical treatment or as otherwise required in this chapter. An employee, designated representative or other person who knowingly discloses information in violation of this subdivision or any person knowingly receiving the information is subject to the provisions of section 609.52 relating to the theft of trade secrets and to the civil liabilities provided by chapter 325C or other relevant law.",
	"repealed": false
}