{
	"id": "134.195",
	"url": "https://www.revisor.mn.gov/statutes/cite/134.195",
	"title": "134.195 LIBRARY OPERATED BY CITY AND SCHOOL DISTRICT.",
	"text": "A school district and a city that has established a public library under sections 134.07 and 134.08, by ordinance or resolution, may jointly finance and operate a public library for use by school students and the public. If the city is already taxed for public library service by a county, approval of the board of county commissioners is required. If the city is served by a regional public library system, approval of the regional public library system board is required. Public library service established under this section may be discontinued by action of the city council or the school board upon one year's notice to the other party.\nThe ordinance or resolution shall establish a library board of five, seven, or nine members and shall state the number of members to be appointed by the mayor, with the approval of the city council, and the number of members to be appointed by the school board. One member of the city council and one member of the school board shall be appointed to the library board. The remaining members of the library board may not be members of either the city council or the school board. Board members shall be residents of the city or the school district.\nThe terms of office for board members shall be established according to section 134.09, subdivision 2.\nThe mayor, with the approval of the council, or the school board may remove for misconduct or neglect any member it has appointed to the library board.\nUpon recommendation of a majority of the library board established under subdivision 2, the city council and the school board may abolish the library board provided that the city council and the school district shall immediately establish, by ordinance or resolution, a successor library board of five, seven, or nine members. The appointment of successor board members shall be as provided in subdivision 2 and the terms shall be as provided in subdivision 3.\nThe library board president shall report a vacancy on the board to the appointing authority who shall fill the vacancy by appointment for the unexpired term. Library board members shall receive no compensation for their services but may be reimbursed for actual and necessary travel expenses incurred in the discharge of library board duties and activities.\nExcept as provided in subdivision 9, the library board has the powers and duties set forth in section 134.11, subdivision 2.\nThe ordinance or resolution establishing the library shall provide for joint financing of the library by the school district and the city. The city shall provide at least the minimum dollar amount established in section 134.34, subdivision 1. The school district shall provide money for staff and materials for the library at least in proportion to the use related to curriculum, as determined by the circulation statistics of the library.\nThe library board may contract with the school board, the regional library board, or the city in which the library is situated to provide personnel, fiscal, or administrative services. The contract shall state the personnel, fiscal, and administrative services and payments to be provided by each party.\nPublic library services established according to this section, including materials, programs, equipment, and other public library services, whether located in an elementary or secondary school building or elsewhere, shall be available for simultaneous use by students and residents of the area. If public library services are located in an elementary or secondary school building, a separate entrance, accessible from the outside of the school building, shall be provided for use by the residents. The library shall meet all requirements in statutes and rules applicable to public libraries and school media centers. A media supervisor licensed by the Professional Educator Licensing and Standards Board may be the director of the library. The library shall be centrally located in the community and available for use by residents during all hours the school is in session, at least 15 additional hours each week during evenings, and on Saturdays. When school is not in session, the library may reduce its hours to maintain at least the average number of hours each week of other public libraries serving its population size. The library shall have telephone service that is separate from the telephone service for the school. Public parking, restrooms, drinking water, and other necessities shall be easily accessible to residents.",
	"repealed": false
}