{
	"id": "142B.72",
	"url": "https://www.revisor.mn.gov/statutes/cite/142B.72",
	"title": "142B.72 FAMILY CHILD CARE PHYSICAL SPACE REQUIREMENTS.",
	"text": "(a) At least one emergency escape route separate from the main exit from the space must be available in: (1) each room used for sleeping by anyone receiving licensed care; and (2) a basement used for child care. One means of escape must be a stairway or door leading to the floor of exit discharge. The other must be a door or window leading directly outside. A window used as an emergency escape route must be openable without special knowledge.\n(b) In homes with construction that began before March 31, 2020, the interior of the window leading directly outside must have a net clear opening area of not less than 4.5 square feet or 648 square inches and have minimum clear opening dimensions of 20 inches wide and 20 inches high. The net clear opening dimensions shall be the result of normal operation of the opening. The opening must be no higher than 48 inches from the floor. The height to the window may be measured from a platform if a platform is located below the window.\n(c) In homes with construction that began on or after March 31, 2020, the interior of the window leading directly outside must have minimum clear opening dimensions of 20 inches wide and 24 inches high. The net clear opening dimensions shall be the result of normal operation of the opening. The opening must be no higher than 44 inches from the floor.\nAdditional requirements are dependent on the distance of the openings from the ground outside the window: (1) windows or other openings with a sill height not more than 44 inches above or below the finished ground level adjacent to the opening (grade-floor emergency escape and rescue openings) must have a minimum opening of five square feet; and (2) non-grade-floor emergency escape and rescue openings must have a minimum opening of 5.7 square feet.\n(a) If there is an opening between an attached garage and a day care residence, there must be a door that is:\n(1) a solid wood bonded-core door at least 1-3/8 inches thick;\n(2) a steel insulated door at least 1-3/8 inches thick; or\n(3) a door with a fire protection rating of 20 minutes.\n(b) The separation wall on the garage side between the residence and garage must consist of 1/2-inch-thick gypsum wallboard or its equivalent.\n(a) Notwithstanding Minnesota Rules, part 9502.0425, subpart 7, item C, items that can be ignited and support combustion, including but not limited to plastic, fabric, and wood products must not be located within:\n(1) 18 inches of a gas or fuel-oil heater or furnace; or\n(2) 36 inches of a solid-fuel-burning appliance.\n(b) If a license holder produces manufacturer instructions listing a smaller distance, then the manufacturer instructions control the distance combustible items must be from gas, fuel-oil, or solid-fuel burning heaters or furnaces.\nA portable, operational, multipurpose, dry chemical fire extinguisher with a minimum 2 A 10 BC rating must be located in or near the kitchen and cooking areas of the residence at all times. The fire extinguisher must be serviced annually by a qualified inspector. All caregivers must know how to properly use the fire extinguisher.\n(a) All homes must have an approved and operational carbon monoxide alarm installed within ten feet of each room used for sleeping children in care.\n(b) Smoke alarms that have been listed by the Underwriter Laboratory must be properly installed and maintained in hallways outside of rooms used for sleeping children and on all levels, including basements but not including crawl spaces and uninhabitable attics.\n(c) In homes with construction that began on or after March 31, 2020, smoke alarms must be installed and maintained in each room used for sleeping children in care.\nAfter readoption of the Minnesota State Fire Code, the fire marshal must notify the commissioner of any changes that conflict with this section and Minnesota Rules, chapter 9502. The state fire marshal must identify necessary statutory changes to align statutes with the revised code. The commissioner must recommend updates to sections of this chapter that are derived from the Minnesota State Fire Code in the legislative session following readoption of the code.\nWhen a variance is requested of the standards contained in subdivision 1, 2, 3, 4, or 5, an applicant or provider must submit written approval from the state fire marshal of the variance requested and the alternative measures identified to ensure the safety of children in care.\n(a) All stairways must meet the requirements in this subdivision.\n(b) Stairways of four or more steps must have handrails on at least one side.\n(c) Any open area between the handrail and stair tread must be enclosed with a protective guardrail as specified in the State Building Code. At open risers, openings located more than 30 inches or 762 millimeters as measured vertically to the floor or grade below must not permit the passage of a sphere four inches or 102 millimeters in diameter.\n(d) Gates or barriers must be used when children aged six to 18 months are in care.\n(e) Stairways must be well lit, in good repair, and free of clutter and obstructions.",
	"repealed": false
}