{
	"id": "103B.661",
	"url": "https://www.revisor.mn.gov/statutes/cite/103B.661",
	"title": "103B.661 BOARD.",
	"text": "(a) The district shall be governed by the board composed of members elected by the governing bodies of the municipalities included in the district. Each municipality shall elect two members.\n(b) The term of office of each member shall be three years.\nSubject to the provisions of chapters 97A, 103D, 103E, 103G, and 115, and the rules and regulations of the respective agencies and governing bodies vested with jurisdiction and authority under those chapters, the district has the following powers to:\n(1) regulate the types of boats permitted to use the lake and set service fees;\n(2) limit the use of motors, including their types and horsepower, on the lake;\n(3) regulate, maintain, and police public beaches, public docks, and other public facilities for access to the lake within the territory of the municipalities;\n(4) limit by rule the use of the lake at various times and the use of various parts of the lake;\n(5) regulate the speed of boats on the lake and the conduct of other activities on the lake to secure the safety of the public and the most general public use;\n(6) contract with other law enforcement agencies to police the lake and its shores;\n(7) regulate the construction, installation, and maintenance of permanent and temporary docks and moorings consistent with federal and state law;\n(8) regulate the construction and use of mechanical and chemical means of deicing the lake and to regulate the mechanical and chemical means of removal of weeds and algae from the lake;\n(9) regulate the construction, configuration, size, location, and maintenance of commercial marinas and their related facilities including parking areas and sanitary facilities. The regulation shall be consistent with the applicable municipal building codes and zoning ordinances where said marinas are situated;\n(10) contract with other governmental bodies to perform any of the functions of the district;\n(11) undertake research to determine the condition and development of the lake and the water entering it and to transmit their studies to the Pollution Control Agency and other interested authorities; and to develop a comprehensive program to eliminate pollution;\n(12) receive financial assistance from and join in projects or enter into contracts with federal and state agencies for the study and treatment of pollution problems and demonstration programs related to them;\n(13) petition the board of managers of a watershed district where the White Bear Lake Conservation District is located for improvements under section 103D.705, for which a bond may not be required of the district; and\n(14) to require the submission of all plans pertaining to or affecting construction or other lakeshore use on any lot or parcel of land abutting the shoreline including: length of setback from the shoreline, adjoining property, or any street or highway; problems of population density; possible water, air or visual pollution; or height of construction. The board shall have 60 days after submission of plans or any part thereof for review. If, within 60 days of submission the board finds the plan or any part is inconsistent with its plans or ordinances, it may recommend that the plan or any part be revised and resubmitted.\nThe board shall adopt a seal, bylaws for the regulation of the affairs of the district, and rules of procedure to govern the board's actions that are consistent with law.",
	"repealed": false
}