{
	"id": "354A.32",
	"url": "https://www.revisor.mn.gov/statutes/cite/354A.32",
	"title": "354A.32 OPTIONAL RETIREMENT ANNUITIES.",
	"text": "The board of the St. Paul Teachers Retirement Fund Association shall establish for the coordinated program an optional retirement annuity which must take the form of a joint and survivor annuity. The board may also, in its discretion, establish an optional annuity which may take the form of an annuity payable for a period certain and for life thereafter. The board shall also establish an optional retirement annuity that guarantees payment of the balance of the annuity recipient's accumulated deductions to a designated beneficiary upon the death of the annuity recipient. Except as provided in subdivision 1a, the optional annuity forms must be the actuarial equivalent of the normal forms provided in section 354A.31. In establishing these optional annuity forms, the board shall obtain the written recommendation of the actuary retained under section 356.214. The recommendation must be a part of the permanent records of the board.\n(a) If a former coordinated member or disabilitant has selected a joint and survivor annuity option under subdivision 1 after June 30, 1989, the former member or disabilitant must receive a normal single life annuity if the designated optional annuity beneficiary dies before the former member or disabilitant. Under this option, no reduction may be made in the person's annuity to provide for restoration of the normal single life annuity in the event of the death of the designated optional annuity beneficiary.\n(b) The annuity adjustment specified in paragraph (a) also applies to joint and survivor annuity options elected before July 1, 1989. The annuity adjustment under this paragraph occurs on July 1, 1989, or on the first day of the first month following the death of the designated optional annuity beneficiary, whichever is later. This paragraph may not be interpreted as authorizing retroactive payments.\n(c) Unless otherwise specified in this subdivision, the restoration of the normal single life annuity under this subdivision takes effect on the first of the month following the date of death of the designated optional annuity beneficiary or on the first of the month following one year before the date on which a certified copy of the death record of the designated optional annuity beneficiary is received in the office of the teachers retirement fund association, whichever date is later.\n[Repealed, 1989 c 319 art 13 s 98]",
	"repealed": false
}