{
	"id": "179A.07",
	"url": "https://www.revisor.mn.gov/statutes/cite/179A.07",
	"title": "179A.07 EMPLOYER RIGHTS AND OBLIGATIONS.",
	"text": "A public employer is not required to meet and negotiate on matters of inherent managerial policy. Matters of inherent managerial policy include, but are not limited to, such areas of discretion or policy as the functions and programs of the employer, its overall budget, utilization of technology, the organizational structure, selection of personnel, and direction of personnel. No public employer shall sign an agreement which limits its right to select persons to serve as supervisory employees or state managers under section 43A.18, subdivision 3, or requires the use of seniority in their selection.\n(a) A public employer has an obligation to meet and negotiate in good faith with the exclusive representative of public employees in an appropriate unit regarding grievance procedures and the terms and conditions of employment, but this obligation does not compel the public employer or its representative to agree to a proposal or require the making of a concession.\nThe public employer's duty under this subdivision exists notwithstanding contrary provisions in a municipal charter, ordinance, or resolution. A provision of a municipal charter, ordinance, or resolution which limits or restricts a public employer from negotiating or from entering into binding contracts with exclusive representatives is superseded by this subdivision.\n(b) In addition, a public employer may, but does not have an obligation to, meet and negotiate in good faith with the exclusive representative of public employees in an appropriate unit regarding an employer contribution to the state of Minnesota deferred compensation plan authorized by section 356.24, paragraph (a), clause (4), within the limits set by section 356.24, paragraph (a), clause (4).\nA public employer has the obligation to meet and confer, under section 179A.08, with professional employees to discuss policies and other matters relating to their employment which are not terms and conditions of employment.\nIf an exclusive representative has been certified for an appropriate unit, the employer shall not meet and negotiate or meet and confer with any employee or group of employees who are in that unit except through the exclusive representative. This subdivision does not prevent communication to the employer, other than through the exclusive representative, of advice or recommendations by professional employees, if this communication is a part of the employee's work assignment. This subdivision does not prevent communication between public postsecondary employers and postsecondary professional employees, other than through the exclusive representative, regarding policies and matters that are not terms and conditions of employment.\nAn employer may hire and pay for arbitrators desired or required by sections 179A.01 to 179A.25.\nA public employer must afford reasonable time off to elected officers or appointed representatives of the exclusive representative to conduct the duties of the exclusive representative and must, upon request, provide for leaves of absence to elected or appointed officials of the exclusive representative, to elected or appointed officials of an affiliate of an exclusive representative, or to a full-time appointed official of an exclusive representative of teachers in another Minnesota school district.\n[Repealed, 1Sp2001 c 10 art 2 s 102]\n(a) Within 20 calendar days after a bargaining unit employee is hired, a public employer must provide the following information on the employee to the unit's exclusive representative or its affiliate in an Excel file format or other format agreed to by the exclusive representative:\n(1) name;\n(2) job title;\n(3) worksite location, including location in a facility when appropriate;\n(4) home address;\n(5) work telephone number;\n(6) home and personal cell phone numbers on file with the public employer;\n(7) date of hire; and\n(8) work email address and personal email address on file with the public employer.\n(b) Every 120 calendar days, a public employer must provide to a bargaining unit's exclusive representative in an Excel file or similar format agreed to by the exclusive representative the information under paragraph (a) for all bargaining unit employees.\n(c) If a bargaining unit employee separates from employment or transfers out of a bargaining unit, the employee's public employer must notify the employee's exclusive representative within 20 calendar days after the separation or transfer, including whether the unit departure was due to a transfer, promotion, demotion, discharge, resignation, or retirement.\n(a) A public employer must allow an exclusive representative or the representative's agent to meet in person with a newly hired employee within 30 calendar days from the date of hire during new employee orientations or, if the employer does not conduct new employee orientations, at individual or group meetings arranged by the employer in coordination with the exclusive representative or the representative's agent during the newly hired employees' regular working hours. For an orientation or meeting under this paragraph, an employer must allow the employee and exclusive representative up to 30 minutes to meet and must not charge the employee's pay or leave time during the orientation or meeting, or the pay or leave time of an employee of the public employer acting as an agent of the exclusive representative using time off under subdivision 6. An orientation or meeting may be held virtually or for longer than 30 minutes only by mutual agreement of the employer and exclusive representative.\n(b) An exclusive representative must receive at least ten days' notice of an orientation, but a shorter notice may be provided if there is an urgent need critical to the employer's operations that was not reasonably foreseeable. Notice of and attendance at new employee orientations and other meetings under this paragraph and paragraph (a) are limited to:\n(1) the employees;\n(2) the exclusive representative;\n(3) any vendor contracted to provide a service for the meeting; and\n(4) the public employer or its designee, who may attend only by mutual agreement of the public employer and exclusive representative.\n(c) A public employer must allow an exclusive representative to communicate with bargaining unit members by email on:\n(1) collective bargaining;\n(2) the administration of collective bargaining agreements;\n(3) the investigation of grievances and other workplace-related complaints and issues; and\n(4) internal matters involving the governance or business of the exclusive representative.\n(d) An exclusive representative may communicate with bargaining unit members under paragraph (c) via the members' employer-issued email addresses, but the communication must be consistent with the employer's generally applicable technology use policies.\n(e) A public employer must allow an exclusive representative to meet with bargaining unit members in facilities owned or leased by the public employer to communicate on:\n(1) collective bargaining;\n(2) the administration of collective bargaining agreements;\n(3) the investigation of grievances and other workplace-related complaints and issues; and\n(4) internal matters involving the governance or business of the exclusive representative.\n(f) The following applies for a meeting under paragraph (e):\n(1) a meeting cannot interfere with government operations;\n(2) the exclusive representative must comply with employer-established worksite security protocols;\n(3) a meeting in a government building cannot be for supporting or opposing any candidate for partisan political office or for distributing literature or information on partisan elections; and\n(4) an exclusive representative conducting a meeting in a government building or other government facility may be charged for maintenance, security, and other costs related to using the government building or facility that would not otherwise be incurred by the government entity.",
	"repealed": false
}