{
	"id": "142F.103",
	"url": "https://www.revisor.mn.gov/statutes/cite/142F.103",
	"title": "142F.103 CAMPUS-BASED EMPLOYMENT AND TRAINING PROGRAM FOR STUDENTS ENROLLED IN HIGHER EDUCATION.",
	"text": "(a) Within six months of the effective date of this section, the Board of Trustees of Minnesota State Colleges and Universities must, and the Board of Regents of the University of Minnesota is requested to, submit an application to the commissioner of children, youth, and families verifying whether each of its institutions meets the requirements to be a campus-based employment and training program that qualifies for the student exemption for Supplemental Nutrition Assistance Program (SNAP) eligibility, as described in Code of Federal Regulations, title 7, section 273.5(b)(11)(iv).\n(b) An institution of higher education must be designated as a campus-based employment and training program by the commissioner of children, youth, and families if that institution meets the requirements set forth in the guidance under subdivision 3. The commissioner of children, youth, and families must maintain a list of approved programs on its website.\nA student is eligible to participate in a campus-based employment and training program under this section if the student is enrolled in:\n(1) a public two-year community or technical college and received a state grant under section 136A.121, received a federal Pell grant, or has a student aid index of $0 or less;\n(2) a Tribal college as defined in section 136A.62 and received a state grant under section 136A.121, received a federal Pell grant, or has a student aid index of $0 or less; or\n(3) a public four-year university and received a state grant under section 136A.121, received a federal Pell grant, or has a student aid index of $0 or less.\nWithin three months of the effective date of this section and annually thereafter, the commissioner of children, youth, and families, in consultation with the commissioner of higher education, must issue guidance to counties, Tribal Nations, Tribal colleges, and Minnesota public postsecondary institutions that:\n(1) clarifies the state and federal eligibility requirements for campus-based employment and training programs for low-income households;\n(2) clarifies the application process for campus-based employment and training programs for low-income households including but not limited to providing a list of the supporting documents required for program approval;\n(3) clarifies how students in an institution of higher education approved as a campus-based employment and training program for low-income households qualify for a SNAP student exemption; and\n(4) clarifies the SNAP eligibility criteria for students that qualify for a SNAP student exemption under this section.\nWithin three months of the effective date of this section, the commissioner of children, youth, and families, in consultation with the commissioner of higher education, must design an application for institutions of higher education to apply for a campus-based employment and training program designation.\nAt the beginning of each academic semester, an institution of higher education with a designated campus-based employment and training program must send a letter to students eligible under this section to inform them that they may qualify for SNAP benefits and direct them to resources to apply. The letter under this subdivision shall serve as proof of a student's enrollment in a campus-based employment and training program.",
	"repealed": false
}