{
	"id": "66A.15",
	"url": "https://www.revisor.mn.gov/statutes/cite/66A.15",
	"title": "66A.15 ASSESSMENTS.",
	"text": "When the net assets of any mutual insurance company are insufficient for the payment of incurred losses and expenses above its unearned premium reserve, as provided by law, it shall make an assessment for the amount required ratably upon its members liable thereto. The order for assessment shall be duly entered upon its records, with a statement of its condition at the date thereof, including all cash assets, deposit notes, and contingent amount liable to the assessment, the amount of the assessment, and the particular losses or other liabilities for which it is made. This record shall be signed by each director voting for the order before any part of the assessment is collected and any person liable thereto may inspect and take a copy thereof.\nThe commissioner may by written order relieve the company from an assessment or other proceedings to restore the assets during the time fixed in the order, when the deficiency does not exceed ten percent of its admitted assets.\nWhen, by reason of depreciation, loss, or otherwise, the net assets, after providing for other debts, are less than the required premium reserve upon policies the deficiency shall be restored by assessment, as provided in this subdivision, notice of which shall be filed with the commissioner. When the board of directors or the commissioner shall be of the opinion that the insolvency of any company is probable, the board or, upon its failure so to do, the commissioner may order two assessments made, the first to determine what each policyholder should equitably pay or receive in case of withdrawal from the company and cancellation of the policy; the second, such further sum as each should pay to reinsure the unexpired term at the same rate as the first insurance. The directors shall forthwith cause written notice and demand of payment to be served personally or by mail upon each policyholder subject thereto.\nAfter adjustment of the first assessment, every policy upon which the second assessment shall not be paid shall be canceled; but in no case shall there be credited upon a policy more than if canceled by the board of directors under the bylaws. If, within two months after the last assessment is payable, the amount of the policies whose holders have paid the same is less than $500,000, all other policies shall be void and the company shall continue only for the purpose of adjusting the deficiency or excess of premiums and settling outstanding claims. No assessment shall be valid against a policyholder who has not been duly notified thereof in writing within one year after the expiration or cancellation of the policy.\nAll policies issued by such companies shall provide for a premium or premium deposit payable in cash and, except as herein provided, for a contingent liability of the members at least equal to the premium or premium deposit as adjusted by audit, if any. If at any time the admitted assets are less than the reserves and other liabilities, the company shall immediately collect upon policies with a contingent liability a sufficient proportionate part thereof to restore such assets and the commissioner may, when such deficiency does not exceed ten percent of its admitted assets, by written order direct that proceedings to restore such assets be deferred during the period of time fixed in such order. The contingent liabilities, if any, of the policyholders shall be plainly and legibly stated in every policy in terms of either dollars or premiums.",
	"repealed": false
}