{
	"id": "259A.01",
	"url": "https://www.revisor.mn.gov/statutes/cite/259A.01",
	"title": "259A.01 DEFINITIONS.",
	"text": "For the purposes of this chapter, the terms defined in this section have the meanings given them except as otherwise indicated by the context.\n\"Adoption assistance\" means medical coverage and reimbursement of nonrecurring adoption expenses, and may also include financial support and reimbursement for specific nonmedical expenses provided under agreement with the parent of an adoptive child who would otherwise remain in foster care and whose special needs would otherwise make it difficult to place the child for adoption. Financial support may include a basic maintenance payment and a supplemental needs payment.\n\"Adoptive parent\" means the adult who has been made the legal parent of a child through a court-ordered adoption decree or a customary adoption through tribal court.\n\"AFDC\" means the aid to families with dependent children program under sections 142A.418, 518A.81, and 518A.82.\n\"Assessment\" means the process by which the child-placing agency determines the benefits an eligible child may receive under this chapter.\n\"At-risk child\" means a child who does not have a documented disability but who is at risk of developing a physical, mental, emotional, or behavioral disability based on being related within the first or second degree to persons who have an inheritable physical, mental, emotional, or behavioral disabling condition, or from a background that has the potential to cause the child to develop a physical, mental, emotional, or behavioral disability that the child is at risk of developing. The disability must manifest during childhood.\n\"Basic maintenance payment\" means the maintenance payment made on behalf of a child to support the costs an adoptive parent incurs to meet a child's needs consistent with the care parents customarily provide, including: food, clothing, shelter, daily supervision, school supplies, and a child's personal incidentals. It also supports reasonable travel to participate in face-to-face visitation between child and birth relatives, including siblings.\n\"Child\" means an individual under 18 years of age. For purposes of this chapter, child also includes individuals up to age 21 who have approved adoption assistance agreement extensions under section 259A.45, subdivision 1.\n\"Child-placing agency\" means a business, organization, or department of government, including the responsible social services agency or a federally recognized Minnesota tribe, designated or authorized by law to place children for adoption and assigned legal responsibility for placement, care, and supervision of the child through a court order, voluntary placement agreement, or voluntary relinquishment.\n\"Child under guardianship of the commissioner of children, youth, and families\" means a child the court has ordered under the guardianship of the commissioner of children, youth, and families pursuant to section 260C.325.\n\"Commissioner\" means the commissioner of children, youth, and families or any employee of the Department of Children, Youth, and Families to whom the commissioner has delegated authority regarding children under the commissioner's guardianship.\n\"Consent of parent to adoption under chapter 260C\" means the consent executed pursuant to section 260C.515, subdivision 3.\n\"Department\" means the Minnesota Department of Children, Youth, and Families.\n\"Disability\" means a physical, mental, emotional, or behavioral impairment that substantially limits one or more major life activities. Major life activities include, but are not limited to: thinking, walking, hearing, breathing, working, seeing, speaking, communicating, learning, developing and maintaining healthy relationships, safely caring for oneself, and performing manual tasks. The nature, duration, and severity of the impairment shall be used in determining if the limitation is substantial.\n\"Foster care\" has the meaning given in section 260C.007, subdivision 18.\n\"Guardian\" means an adult who is appointed pursuant to section 260C.325. For a child under guardianship of the commissioner, the child's guardian is the commissioner of children, youth, and families.\n\"Guardianship\" means the court-ordered rights and responsibilities of the guardian of a child and includes legal custody of the child.\n\"Indian child\" has the meaning given in section 260.755, subdivision 8.\n\"Legal custodian\" means a person to whom permanent legal and physical custody of a child has been transferred under chapter 260C, or for children under tribal court jurisdiction, a similar provision under tribal code which means that the individual responsible for the child has responsibility for the protection, education, care, and control of the child and decision making on behalf of the child.\n\"Medical assistance\" means Minnesota's implementation of the federal Medicaid program.\n\"Parent\" has the meaning given in section 257.52. Parent does not mean a putative father of a child unless the putative father also meets the requirements of section 257.55 or unless the putative father is entitled to notice under section 259.49, subdivision 1. For matters governed by the Indian Child Welfare Act, parent includes any Indian person who has adopted a child by tribal law or custom, as provided in section 260.755, subdivision 14, and does not include the unwed father where paternity has not been acknowledged or established.\n\"Permanent legal and physical custody\" means permanent legal and physical custody ordered by a Minnesota court under section 260C.515, subdivision 4, or for children under tribal court jurisdiction, a similar provision under tribal code which means that the individual with permanent legal and physical custody of the child has responsibility for the protection, education, care, and control of the child and decision making on behalf of the child.\n\"Preadoptive parent\" means an adult who is caring for a child in an adoptive placement, but where the court has not yet ordered a final decree of adoption making the adult the legal parent of the child.\n\"Reassessment\" means an update of a previous assessment through the process under this chapter completed for a child who has been continuously eligible for this benefit.\n\"Relative\" means a person related to the child by blood, marriage, or adoption, or an individual who is an important friend with whom the child has resided or had significant contact. For an Indian child, relative means a person who is a member of the Indian child's family as defined in the Indian Child Welfare Act of 1978, United States Code, title 25, section 1903, paragraphs (2), (6), and (9).\n\"Relative search\" means the search that is required under section 260C.221.\n\"Sibling\" has the meaning given in section 260C.007, subdivision 32.\n\"Social and medical history\" means the document, on a form or forms prescribed by the commissioner, that contains a child's genetic, medical, and family background as well as the history and current status of a child's physical and mental health, behavior, demeanor, foster care placements, education, and family relationships and has the same meaning as the history required under sections 259.43 and 260C.609.\n\"Supplemental needs payment\" means the payment which is negotiated with the adoptive parent for a child who has a documented physical, mental, emotional, or behavioral disability. The payment is made based on the requirements associated with parenting duties to nurture the child, preserve the child's connections, and support the child's functioning in the home.\n\"Termination of parental rights\" means a court order that severs all rights, powers, privileges, immunities, duties, and obligations, including any rights to custody, control, visitation, or support, existing between a parent and child. For an Indian child who is a ward of tribal court, termination of parental rights means any action resulting in the termination or suspension of the parent-child relationship when the tribe has made a judicial determination that the child cannot or should not be returned to the home of the child's parent or parents.",
	"repealed": false
}