{
	"id": "115.84",
	"url": "https://www.revisor.mn.gov/statutes/cite/115.84",
	"title": "115.84 WASTEWATER LABORATORY CERTIFICATION.",
	"text": "(a) Laboratories performing wastewater or water analytical laboratory work, the results of which are reported to the agency to determine compliance with a national pollutant discharge elimination system (NPDES) or state disposal system (SDS) permit condition or other regulatory document, must be certified according to this section.\n(b) This section does not apply to:\n(1) laboratories that are private and for-profit;\n(2) laboratories that perform drinking water analyses; or\n(3) laboratories that perform remediation program analyses, such as Superfund or petroleum analytical work.\n(c) Until adoption of rules under subdivision 2, laboratories required to be certified under this section that submit data to the agency must: (1) register with the agency by submitting registration information required by the agency; or (2) be certified or accredited by a recognized authority, such as the commissioner of health under sections 144.97 to 144.99, for the analytical methods required by the agency.\nThe agency may adopt rules to govern certification of laboratories according to this section. Notwithstanding section 16A.1283, the agency may adopt rules establishing fees.\n(a) Until the agency adopts a rule establishing fees for certification, the agency shall collect fees from laboratories registering with the agency, but not accredited by the commissioner of health under sections 144.97 to 144.99, in amounts necessary to cover the reasonable costs of the certification program, including reviewing applications, issuing certifications, and conducting audits and compliance assistance.\n(b) Fees under this section must be based on the number, type, and complexity of analytical methods that laboratories are certified to perform.\n(c) Revenue from fees charged by the agency for certification shall be credited to the environmental fund.\n(a) The commissioner may deny, suspend, or revoke wastewater laboratory certification for, but is not limited to, any of the following reasons: fraud, failure to follow applicable requirements, failure to respond to documented deficiencies or complete corrective actions necessary to address deficiencies, failure to pay certification fees, or other violations of federal or state law.\n(b) This section and the rules adopted under it may be enforced by any means provided in section 115.071.",
	"repealed": false
}