{
	"id": "501C.1205",
	"url": "https://www.revisor.mn.gov/statutes/cite/501C.1205",
	"title": "501C.1205 TRUST PROVISIONS LINKED TO PUBLIC ASSISTANCE ELIGIBILITY; SUPPLEMENTAL NEEDS TRUSTS.",
	"text": "(a) Except as allowed by subdivision 2 or 3, a provision in a trust that provides for the suspension, termination, limitation, or diversion of the principal, income, or beneficial interest of a beneficiary if the beneficiary applies for, is determined eligible for, or receives public assistance or benefits under a public health care program is unenforceable as against the public policy of this state, without regard to the irrevocability of the trust or the purpose for which the trust was created.\n(b) This subdivision applies to trust provisions created after July 1, 1992. For purposes of this section, a trust provision is created on the date of execution of the first instrument that contains the provision, even though the trust provision is later amended or reformed or the trust is not funded until a later date.\n(a) It is the public policy of this state to enforce supplemental needs trusts as provided in this subdivision.\n(b) For purposes of this subdivision, a \"supplemental needs trust\" is a trust created for the benefit of a person with a disability and funded by someone other than the trust beneficiary, the beneficiary's spouse, or anyone obligated to pay any sum for damages or any other purpose to or for the benefit of the trust beneficiary under the terms of a settlement agreement or judgment.\n(c) For purposes of this subdivision, a \"person with a disability\" means a person who, prior to creation of a trust which otherwise qualifies as a supplemental needs trust for the person's benefit:\n(1) is considered to be a person with a disability under the disability criteria specified in title II or title XVI of the Social Security Act; or\n(2) has a physical or mental illness or condition which, in the expected natural course of the illness or condition, either prior to or following creation of the trust, to a reasonable degree of medical certainty, is expected to:\n(i) last for a continuous period of 12 months or more; and\n(ii) substantially impair the person's ability to provide for the person's care or custody.\nDisability may be established conclusively for purposes of this subdivision by the written opinion of a licensed professional who is qualified to diagnose the illness or condition, confirmed by the written opinion of a second licensed professional who is qualified to diagnose the illness or condition.\n(d) The general purpose of a supplemental needs trust must be to provide for the reasonable living expenses and other basic needs of a person with a disability when benefits from publicly funded benefit programs are not sufficient to provide adequately for those needs. Subject to the restrictions contained in this paragraph, a supplemental needs trust may authorize distributions to provide for all or any portion of the reasonable living expenses of the beneficiary. A supplemental needs trust may allow or require distributions only in ways and for purposes that supplement or complement the benefits available under medical assistance, Minnesota supplemental aid, and other publicly funded benefit programs for disabled persons. A supplemental needs trust must contain provisions that prohibit disbursements that would have the effect of replacing, reducing, or substituting for publicly funded benefits otherwise available to the beneficiary or rendering the beneficiary ineligible for publicly funded benefits.\n(e) A supplemental needs trust is not enforceable if the trust beneficiary becomes a patient or resident after age 64 in a state institution or nursing facility for six months or more and, due to the beneficiary's medical need for care in an institutional setting, there is no reasonable expectation that the beneficiary will ever be discharged from the institution or facility. For purposes of this paragraph \"reasonable expectation\" means that the beneficiary's attending physician has certified that the expectation is reasonable. For purposes of this paragraph, a beneficiary participating in a group residential program is not deemed to be a patient or resident in a state institution or nursing facility.\n(f) The trust income and assets of a supplemental needs trust are considered available to the beneficiary for medical assistance purposes to the extent they are considered available to the beneficiary under medical assistance, Supplemental Security Income, or Minnesota family investment program methodology, whichever is used to determine the beneficiary's eligibility for medical assistance. For other public assistance programs established or administered under state law, assets and income will be considered available to the beneficiary in accordance with the methodology applicable to the program.\n(g) Nothing in this subdivision requires submission of a supplemental needs trust to a court for interpretation or enforcement.\n(h) Paragraphs (a) to (g) apply to supplemental needs trusts whenever created, but the limitations and restrictions in paragraphs (c) to (g) apply only to trusts created after June 30, 1993.\nA trust created on or after August 11, 1993, which qualifies as a supplemental needs trust for a person with a disability under United States Code, title 42, section 1396p(c)(2)(B)(iv) or 1396p(d), as amended by section 13611(b) of the Omnibus Budget Reconciliation Act of 1993, Public Law 103-66, commonly known as OBRA 1993, is enforceable, and the courts of this state may authorize creation and funding of a trust which so qualifies.\n(a) A trustee of a trust under subdivision 3 and United States Code, title 42, section 1396p(d)(4)(A) or (C), shall submit to the commissioner of human services, at the time of a beneficiary's request for medical assistance, the following information about the trust:\n(1) a copy of the trust instrument; and\n(2) an inventory of the beneficiary's trust account assets and the value of those assets.\n(b) A trustee of a trust under subdivision 3 and United States Code, title 42, section 1396p(d)(4)(A) or (C), shall submit an accounting of the beneficiary's trust account to the commissioner of human services at least annually until the trust, or the beneficiary's interest in the trust, terminates. Accountings are due on the anniversary of the execution date of the trust unless another annual date is established by the terms of the trust. The accounting must include the following information for the accounting period:\n(1) an inventory of trust assets and the value of those assets at the beginning of the accounting period;\n(2) additions to the trust during the accounting period and the source of those additions;\n(3) itemized distributions from the trust during the accounting period, including the purpose of the distributions and to whom the distributions were made;\n(4) an inventory of trust assets and the value of those assets at the end of the accounting period; and\n(5) changes to the trust instrument during the accounting period.\n(c) For the purpose of paragraph (b), an accounting period is 12 months unless an accounting period of a different length is permitted by the commissioner.",
	"repealed": false
}