{
	"id": "507.072",
	"url": "https://www.revisor.mn.gov/statutes/cite/507.072",
	"title": "507.072 PROPERTY INSURANCE FOR GRANTEE BENEFICIARIES OF TRANSFER ON DEATH DEEDS.",
	"text": "(a) For purposes of this section, the following definitions apply unless the context indicates otherwise.\n(b) \"Grantee beneficiary\" has the meaning given in section 507.071, subdivision 1.\n(c) \"Insurance policy\" means an insurance policy governed by chapter 65A.\n(d) \"Transfer on death deed\" means a deed described in section 507.071.\n(e) \"Grantor owner\" has the meaning given in section 507.071, subdivision 1.\n(f) \"Extended coverage\" or \"temporary extended coverage\" means insurance coverage continuing beyond the death of the named insured.\nAn insurer providing an insurance policy on real property transferred by a transfer on death deed shall provide temporary extended coverage on the real property to the designated grantee beneficiary for a period commencing on the date of death of the grantor owner and ending when the grantee beneficiary replaces the insurance policy on the insured property with an insurance policy or the expiration of the time limitations set forth in subdivision 4, whichever is sooner.\nTo obtain temporary extended coverage for a transfer on death deed as provided in this section, the grantor owner must notify the insurer of the existence of a transfer on death deed. The notice shall include the names and contact information of all designated grantee beneficiaries.\nThe coverage to be extended under this section applies only with respect to the insurance policy insuring the real property of the grantor owner. The period of extended coverage shall not exceed 30 days from the date of the grantor owner's death or the expiration date of the insurance policy, whichever is less. An insurer is not required to provide notice to the grantee beneficiary for cancellation of coverage following the shorter of the 30 days or expiration date of the policy or the placement of replacement insurance coverage.\nBefore making any payment for a claim under this section, the insurer may require proof that the claimant is a grantee beneficiary under a transfer on death deed, the transfer on death deed was recorded as provided in section 507.071, and that an affidavit of survivorship and death certificate of the grantor owner was recorded as provided in section 507.071. The grantee beneficiary shall comply with the conditions of the policy.\nA grantee beneficiary does not hold an insurable interest in the real property described in a transfer on death deed prior to the death of the grantor owner. Any claim on the insured real property described in a transfer on death deed initiated before the death of the grantor owner or the death benefits associated with the policy prior to the death of the grantor owner shall be settled with the estate of the grantor owner, not with the grantee beneficiary. A grantee beneficiary is not entitled to recover benefits under an insurance policy extended as provided in this section in an amount greater than the grantee beneficiary's insurable interest at the time of loss or damage. A grantee beneficiary is not entitled to any amounts paid out in prior claims on the property. If the transfer on death deed designates multiple grantee beneficiaries, nothing in this section requires the insurer to pay an amount for loss or damage to the insured real property that exceeds the amount that would be owed to the grantor owner if the grantor owner was living at the time of loss or damage.\nOn or after August 1, 2024, a transfer on death deed shall contain the following warnings in substantially the following form:\n\"Warning to Grantor Owner: Temporary extended coverage of any fire and casualty insurance policy on the property under Minnesota Statutes, chapter 65A, will exist only if the grantor owner has given notice to the insurer under Minnesota Statutes, section 507.072, subdivision 3, including the existence of a transfer on death deed and the names and contact information of all designated grantee beneficiaries. Any temporary extended coverage terminates on the earlier of (1) 30 days after the date of the grantor owner's death, (2) the expiration date of the policy, or (3) upon placement of a replacement insurance policy.\nWarning to Grantee Beneficiary: A grantee beneficiary shall not presume insurance coverage continues after the death of the grantor owner. Upon the death of the grantor owner, the grantee beneficiary should determine whether the provisions of Minnesota Statutes, section 507.072, apply and consult with an insurance agent or attorney.\"\nThe failure to include warnings in a transfer on death deed in accordance with this subdivision shall not invalidate the transfer on death deed or affect recording of the transfer on death deed.",
	"repealed": false
}