{
	"id": "237.295",
	"url": "https://www.revisor.mn.gov/statutes/cite/237.295",
	"title": "237.295 ASSESSMENT OF REGULATORY EXPENSES.",
	"text": "An application for a new authority must be accompanied by a payment not to exceed $2,000 as determined by the Public Utilities Commission. This fee will be reviewed annually and adjusted accordingly.\nThe department and commission shall quarterly, at least 30 days before the start of each quarter, estimate the total of their expenditures in the performance of their duties relating to telephone companies, other than amounts chargeable to telephone companies under subdivision 1, 5, or 6. The remainder must be assessed by the department to the telephone companies operating in this state in proportion to their respective gross jurisdictional operating revenues during the last calendar year. The assessment must be paid into the state treasury within 30 days after the bill has been transmitted via mail, personal delivery, or electronic service to the telephone companies. The bill constitutes notice of the assessment and demand of payment. The total amount that may be assessed to the telephone companies under this subdivision may not exceed three-eighths of one percent of the total gross jurisdictional operating revenues during the calendar year. The assessment for the third quarter of each fiscal year must be adjusted to compensate for the amount by which actual expenditures by the commission and department for the preceding fiscal year were more or less than the estimated expenditures previously assessed. A telephone company with gross jurisdictional operating revenues of less than $5,000 is exempt from assessments under this subdivision.\nWithin 30 days after the date of the transmittal of any bill as provided by subdivisions 1, 2, 5, and 6, the parties to the proceeding, against which the bill has been assessed, may file with the commission objections setting out the grounds upon which it is claimed the bill is excessive, erroneous, unlawful, or invalid. The commission shall within 60 days issue an order in accordance with its findings. The order is appealable in the same manner as other final orders of the commission.\nThe amounts assessed against any telephone company or other party that is not paid after 30 days after the transmittal of a notice advising the telephone company or other party of the amount assessed against it, draw interest at the rate of six percent per annum; and, upon failure to pay the assessment, the attorney general shall proceed by action in the name of the state against the telephone company or other party to collect the amount due, together with interest and the cost of the suit.\nAny amounts billed to the commission or the department by the Office of Administrative Hearings for contested case hearings held pursuant to section 237.25 must be assessed by the commissioner or the department against the parties to the proceeding. The assessment must be paid into the state treasury within 30 days after a bill, which constitutes notice of the assessment and demand for payment of it, has been transmitted to the parties. Money received must be credited to a special account and is appropriated to the commissioner or the department for payment to the Office of Administrative Hearings.\nThe extended area service balloting account is created as a separate account in the special revenue fund in the state treasury. The commission shall render separate bills to telephone companies only for direct balloting costs incurred by the commission. The bill constitutes notice of the assessment and demand of payment. The amount of a bill assessed by the commission under this subdivision must be paid by the telephone company into the state treasury within 30 days from the date of assessment. Money received under this subdivision must be credited to the extended area service balloting account and is appropriated to the commission.",
	"repealed": false
}