{
	"id": "241.06",
	"url": "https://www.revisor.mn.gov/statutes/cite/241.06",
	"title": "241.06 RECORD OF INMATES; COMMISSIONER OF CORRECTIONS.",
	"text": "The commissioner of corrections shall keep in the commissioner's office, accessible only by the commissioner's consent or on the order of a judge or court of record, a record showing the residence, sex, age, nativity, occupation, civil condition, and date of entrance or commitment of every person, inmate, or convict in the facilities under the commissioner's exclusive control, the date of discharge and whether such discharge was final, the condition of such person when the person left the facility, and the date and cause of all deaths. The records shall state every transfer from one facility to another, naming each. This information shall be furnished to the commissioner of corrections by each facility, with such other obtainable facts as the commissioner may from time to time require. The chief executive officer of each such facility, within ten days after the commitment or entrance thereto of a person, inmate, or convict, shall cause a true copy of the entrance record to be forwarded to the commissioner of corrections. When a person, inmate, or convict leaves, is discharged or transferred, or dies in any facility, the chief executive officer, or other person in charge shall inform the commissioner of corrections within ten days thereafter on forms furnished by the commissioner.\nThe commissioner of corrections may authorize the chief executive officer of any facility under the commissioner's control to release to probation officers, local social services agencies or other specifically designated interested persons or agencies any information regarding any person, inmate, or convict thereat, if, in the opinion of the commissioner, it will be for the benefit of the person, inmate, or convict.\nWhen an offender who is required to register as a predatory offender under section 243.166 is being released from prison, the commissioner shall provide to the corrections agency that will supervise the offender, the offender's prison records relating to psychological assessments, medical and mental health issues, and treatment.\nWhen an offender is being released from prison, the commissioner shall provide to the corrections agency that will supervise the offender prison records relating to that offender's prison-based substance abuse assessments, treatment, and any other substance abuse-related services provided to the offender. If the offender did not participate in the prison-based substance abuse program to which the offender was directed, the commissioner shall provide the supervising agency with an explanation of the reasons.",
	"repealed": false
}