{
	"id": "317A.907",
	"url": "https://www.revisor.mn.gov/statutes/cite/317A.907",
	"title": "317A.907 CORPORATIONS TO SECURE OR MAINTAIN HOMES FOR DEPENDENT CHILDREN.",
	"text": "A corporation may be formed for the following purposes:\n(1) securing homes for orphaned, homeless, abandoned, neglected, or mistreated children; or\n(2) establishing and maintaining homes for those children.\nWhen it files its articles with the secretary of state, the corporation shall file an accompanying certificate of the commissioner of children, youth, and families declaring that the corporation has complied with applicable rules of the commissioner of children, youth, and families governing the operation of child caring agencies or child caring institutions and is reputable and trustworthy.\nA corporation formed under subdivision 1 shall:\n(1) comply with rules established by the commissioner of children, youth, and families to govern its operation; and\n(2) maintain the financial records of the corporation open to public inspection.\nUpon its own motion, or upon application, a court of equity has visitorial powers over the corporation, its affairs and officers.\nIf the commissioner of children, youth, and families currently certifies that a corporation formed for the purpose set out in subdivision 1, clause (1), is a licensed child caring agency complying with the rules established by the commissioner of children, youth, and families to govern its operation, the corporation has the power to become the guardian of a child in the manner prescribed for securing the guardianship of children in need of protection or services under chapter 260.\nAn organization, association, or society licensed by the commissioner of children, youth, and families may receive payment for expenses related to adoption services in an amount that fairly reflects the agency's reasonable and necessary expenses of:\n(1) adoptive counseling, whether or not legal adoption is completed;\n(2) provision of services to children before adoptive placement;\n(3) the supervision of children in the home until legal adoption is completed; or\n(4) expenses of a birth parent authorized under section 259.55 if paid to the agency to forward to the birth parent.\nOnly that part of the expenses may be requested that the person seeking to adopt is financially able to meet. No person may be barred from receiving a child for adoption because of inability to pay part of the expenses referred to in this subdivision. In addition to other reports as may be required, a licensed agency shall file annually with the commissioner of children, youth, and families a full accounting of expense reimbursement received under this subdivision, together with the record of the services given for which the reimbursement was made. If the person returns the child to the corporation, the person may not receive compensation for the care, clothing, or medical expenses of the child.\nA corporation formed for one or both of the purposes set out in subdivision 1 and personal and real property owned by it are exempt from taxation.",
	"repealed": false
}