{
	"id": "62J.497",
	"url": "https://www.revisor.mn.gov/statutes/cite/62J.497",
	"title": "62J.497 ELECTRONIC PRESCRIPTION DRUG PROGRAM.",
	"text": "(a) For the purposes of this section, the following terms have the meanings given.\n(b) \"Dispense\" or \"dispensing\" has the meaning given in section 151.01, subdivision 30. Dispensing does not include the direct administering of a controlled substance to a patient by a licensed health care professional.\n(c) \"Dispenser\" means a person authorized by law to dispense a controlled substance, pursuant to a valid prescription.\n(d) \"Electronic media\" has the meaning given under Code of Federal Regulations, title 45, part 160.103.\n(e) \"E-prescribing\" means the transmission using electronic media of prescription or prescription-related information between a prescriber, dispenser, pharmacy benefit manager, or group purchaser, either directly or through an intermediary, including an e-prescribing network. E-prescribing includes, but is not limited to, two-way transmissions between the point of care and the dispenser and two-way transmissions related to eligibility, formulary, and medication history information.\n(f) \"Electronic prescription drug program\" means a program that provides for e-prescribing.\n(g) \"Group purchaser\" has the meaning given in section 62J.03, subdivision 6.\n(h) \"HL7 messages\" means a standard approved by the standards development organization known as Health Level Seven.\n(i) \"National Provider Identifier\" or \"NPI\" means the identifier described under Code of Federal Regulations, title 45, part 162.406.\n(j) \"NCPDP\" means the National Council for Prescription Drug Programs, Inc.\n(k) \"NCPDP Formulary and Benefits Standard\" means the most recent version of the National Council for Prescription Drug Programs Formulary and Benefits Standard or the most recent standard adopted by the Centers for Medicare and Medicaid Services for e-prescribing under Medicare Part D as required by section 1860D-4(e)(4)(D) of the Social Security Act and regulations adopted under it. The standards shall be implemented according to the Centers for Medicare and Medicaid Services schedule for compliance.\n(l) \"NCPDP SCRIPT Standard\" means the most recent version of the National Council for Prescription Drug Programs SCRIPT Standard, or the most recent standard adopted by the Centers for Medicare and Medicaid Services for e-prescribing under Medicare Part D as required by section 1860D-4(e)(4)(D) of the Social Security Act, and regulations adopted under it. The standards shall be implemented according to the Centers for Medicare and Medicaid Services schedule for compliance.\n(m) \"Pharmacy\" has the meaning given in section 151.01, subdivision 2.\n(n) \"Prescriber\" means a licensed health care practitioner, other than a veterinarian, as defined in section 151.01, subdivision 23.\n(o) \"Prescription-related information\" means information regarding eligibility for drug benefits, medication history, or related health or drug information.\n(p) \"Provider\" or \"health care provider\" has the meaning given in section 62J.03, subdivision 8.\n(a) Effective January 1, 2011, all providers, group purchasers, prescribers, and dispensers must establish, maintain, and use an electronic prescription drug program. This program must comply with the applicable standards in this section for transmitting, directly or through an intermediary, prescriptions and prescription-related information using electronic media.\n(b) If transactions described in this section are conducted, they must be done electronically using the standards described in this section. Nothing in this section requires providers, group purchasers, prescribers, or dispensers to electronically conduct transactions that are expressly prohibited by other sections or federal law.\n(c) Providers, group purchasers, prescribers, and dispensers must use either HL7 messages or the NCPDP SCRIPT Standard to transmit prescriptions or prescription-related information internally when the sender and the recipient are part of the same legal entity. If an entity sends prescriptions outside the entity, it must use the NCPDP SCRIPT Standard or other applicable standards required by this section. Any pharmacy within an entity must be able to receive electronic prescription transmittals from outside the entity using the adopted NCPDP SCRIPT Standard. This exemption does not supersede any Health Insurance Portability and Accountability Act (HIPAA) requirement that may require the use of a HIPAA transaction standard within an organization.\n(a) Prescribers and dispensers must use the NCPDP SCRIPT Standard for the communication of a prescription or prescription-related information.\n(b) Providers, group purchasers, prescribers, and dispensers must use the NCPDP SCRIPT Standard for communicating and transmitting medication history information.\n(c) Providers, group purchasers, prescribers, and dispensers must use the NCPDP Formulary and Benefits Standard for communicating and transmitting formulary and benefit information.\n(d) Providers, group purchasers, prescribers, and dispensers must use the national provider identifier to identify a health care provider in e-prescribing or prescription-related transactions when a health care provider's identifier is required.\n(e) Providers, group purchasers, prescribers, and dispensers must communicate eligibility information and conduct health care eligibility benefit inquiry and response transactions according to the requirements of section 62J.536.\n(a) The commissioner of health, in consultation with the Minnesota Administrative Uniformity Committee, shall develop by July 1, 2009, a uniform formulary exception form that allows health care providers to request exceptions from group purchaser formularies using a uniform form. Upon development of the form, all health care providers must submit requests for formulary exceptions using the uniform form, and all group purchasers must accept this form from health care providers.\n(b) No later than January 1, 2011, the uniform formulary exception form must be accessible and submitted by health care providers, and accepted and processed by group purchasers, through secure electronic transmissions.\n(a) The commissioner of health, in consultation with the Minnesota e-Health Advisory Committee and the Minnesota Administrative Uniformity Committee, shall, by February 15, 2010, identify an outline on how best to standardize drug prior authorization request transactions between providers and group purchasers with the goal of maximizing administrative simplification and efficiency in preparation for electronic transmissions.\n(b) By January 1, 2014, the Minnesota Administrative Uniformity Committee shall develop the standard companion guide by which providers and group purchasers will exchange standard drug authorization requests using electronic data interchange standards, if available, with the goal of alignment with standards that are or will potentially be used nationally.\n(c) No later than January 1, 2016, drug prior authorization requests must be accessible and submitted by health care providers, and accepted by group purchasers, electronically through secure electronic transmissions. Facsimile shall not be considered electronic transmission.",
	"repealed": false
}