{
	"id": "334.01",
	"url": "https://www.revisor.mn.gov/statutes/cite/334.01",
	"title": "334.01 RATE OF INTEREST.",
	"text": "The interest for any legal indebtedness shall be at the rate of $6 upon $100 for a year, unless a different rate is contracted for in writing. No person shall directly or indirectly take or receive in money, goods, or things in action, or in any other way, any greater sum, or any greater value, for the loan or forbearance of money, goods, or things in action, than $8 on $100 for one year. In the computation of interest upon any bond, note, or other instrument or agreement, interest shall not be compounded, but any contract to pay interest, not usurious, upon interest overdue, shall not be construed to be usury. Contracts shall bear the same rate of interest after they become due as before, and any provision in any contract, note, or instrument providing for an increase of the rate of interest after maturity, or any increase therein after making and delivery, shall work a forfeiture of the entire interest; but this provision shall not apply to notes or contracts which bear no interest before maturity nor shall it apply to any agreement which extends the maturity date of any contract, note, or instrument, and provides for an increased rate of interest after the original maturity date on the indebtedness then due. Any agreement which extends maturity date of any contract, note or instrument shall not provide for an increased rate of interest in excess of $8 on $100 for one year.\nNotwithstanding any law to the contrary, except as stated in section 58.137, and with respect to contracts for deed, section 47.20, subdivision 4a, no limitation on the rate or amount of interest, points, finance charges, fees, or other charges applies to a loan, mortgage, credit sale, or advance made under a written contract, signed by the debtor, for the extension of credit to the debtor in the amount of $100,000 or more, or any written extension and other written modification of the written contract. The written contract, written extension, and written modification are exempt from the other provisions of this chapter.\nA contract entered into on or after December 31, 1974, for the loan or forbearance of money, goods, or things in action and any extensions, including extensions of installments and related changes in its terms between a participant, former participant, or beneficiary, and a plan which is subject to the provisions of the Employee Retirement Income Security Act of 1974, United States Code, title 29, chapter 18, as amended through December 31, 1982, is exempt from the provisions of this chapter.",
	"repealed": false
}