{
	"id": "469.0722",
	"url": "https://www.revisor.mn.gov/statutes/cite/469.0722",
	"title": "469.0722 LIMITATION OF POWERS.",
	"text": "An enabling resolution may impose the limits listed in this section on the actions of the port authority of Cannon Falls or Redwood Falls.\nAn enabling resolution may require that the port authority must not use specified powers contained in chapters 458 and 462, or that the port authority must not use powers without the prior approval of the city council.\nAn enabling resolution may require the port authority to transfer a portion of the reserves generated by activities of the port authority that the city council determines is not necessary for the successful operation of the port authority, to the city general fund, to be used for any general purpose of the city. Reserves previously pledged by the port authority must not be transferred.\nAn enabling resolution may require that the sale of bonds or obligations other than general obligation tax-supported bonds or obligations issued by the port authority be approved by the city council before issuance.\nAn enabling resolution may require that the port authority follow the budget process for city departments as provided by the city and as implemented by the city council and mayor.\nAn enabling resolution may require that the port authority must not levy a tax for its benefit without approval of the city council.\nAn enabling resolution may require that all official actions of the port authority must be consistent with the adopted comprehensive plan of the city, and official controls implementing the comprehensive plan.\nAn enabling resolution may require that the port authority submit to the city council for approval by resolution any proposed project as defined in section 469.174, subdivision 8.\nAn enabling resolution may require that the port authority submit all planned activities for influencing the action of any other governmental agency, subdivision, or body to the city council for approval.\nAn enabling resolution may require that the port authority submit its administrative structure and management practices to the city council for approval.\nAn enabling resolution may require that the port authority must not employ anyone without the approval of the city council.\nAn enabling resolution may impose any other limit or control established by the city council.\nAn enabling resolution may be modified at any time, subject to subdivision 16. A modification must be made according to the procedural requirements of section 469.0723.\nEach year, within 60 days of the anniversary date of the first adoption of the enabling resolution, the port authority shall submit a report to the city council stating whether and how it wishes the enabling resolution to be modified. Within 30 days of receipt of the recommendation, the city council shall review the enabling resolution, consider the recommendations of the port authority, and make any modification it considers appropriate. A modification must be made according to the procedural requirements of section 469.0723. The petition requirement does not limit the right of the port authority to petition the city council at any time.\nA determination by the city council that the limits imposed under this section have been complied with by the port authority is conclusive.\nLimits imposed under this section must not be applied in a manner that impairs the security of any bonds issued or contracts executed before the limit is imposed. The city council must not modify any limit in effect at the time any bonds or obligations are issued or contracts executed to the detriment of the holder of the bonds or obligations or any contracting party.",
	"repealed": false
}