{
	"id": "144A.10",
	"url": "https://www.revisor.mn.gov/statutes/cite/144A.10",
	"title": "144A.10 INSPECTION; COMMISSIONER OF HEALTH; FINES.",
	"text": "The commissioner of health is the exclusive state agency charged with the responsibility and duty of inspecting all facilities required to be licensed under section 144A.02. The commissioner of health shall enforce the rules established pursuant to sections 144A.01 to 144A.155, subject only to the authority of the Department of Public Safety respecting the enforcement of fire and safety standards in nursing homes and the responsibility of the commissioner of human services under sections 245A.01 to 245A.16 or 252.28.\nThe commissioner may request and must be given access to relevant information, records, incident reports, or other documents in the possession of a licensed facility if the commissioner considers them necessary for the discharge of responsibilities. For the purposes of inspections and securing information to determine compliance with the licensure laws and rules, the commissioner need not present a release, waiver, or consent of the individual. The identities of patients or residents must be kept private as defined by section 13.02, subdivision 12.\nThe commissioner of health must establish and implement a prescribed process and program for providing training and education to providers licensed by the Department of Health, in conjunction with the industry trade associations, before using any new regulatory guideline, regulation, interpretation, program letter or memorandum, or any other materials used in surveyor training to survey licensed providers. The process should include, but is not limited to, the following key components:\n(1) facilitate the implementation of immediate revisions to any course curriculum for nursing assistants which reflect any new standard of care practice that has been adopted or referenced by the Health Department concerning the issue in question;\n(2) conduct training of long-term care providers and health department survey inspectors jointly on the department's new expectations; and\n(3) the commissioner shall consult with experts in the field to develop or make available training resources on current standards of practice and the use of technology.\nThe commissioner of health shall inspect each nursing home to ensure compliance with sections 144A.01 to 144A.155 and the rules promulgated to implement them. The inspection shall be a full inspection of the nursing home. If upon a reinspection provided for in subdivision 5 the representative of the commissioner of health finds one or more uncorrected violations, a second inspection of the facility shall be conducted. The second inspection need not be a full inspection. No prior notice shall be given of an inspection conducted pursuant to this subdivision. Any employee of the commissioner of health who willfully gives or causes to be given any advance notice of an inspection required or authorized by this subdivision shall be subject to suspension or dismissal in accordance with chapter 43A. An inspection required by a federal rule or statute may be conducted in conjunction with or subsequent to any other inspection. Any inspection required by this subdivision may be in addition to or in conjunction with the reinspections required by subdivision 5. Nothing in this subdivision shall be construed to prohibit the commissioner of health from making more than one unannounced inspection of any nursing home during its license year. The commissioner of health shall coordinate inspections of nursing homes with inspections by other state and local agencies consistent with the requirements of this section and the Medicare and Medicaid certification programs.\nThe commissioner shall conduct inspections and reinspections of health facilities with a frequency and in a manner calculated to produce the greatest benefit to residents within the limits of the resources available to the commissioner. In performing this function, the commissioner may devote proportionately more resources to the inspection of those facilities in which conditions present the most serious concerns with respect to resident health, treatment, comfort, safety, and well-being.\nThese conditions include but are not limited to: change in ownership; frequent change in administration in excess of normal turnover rates; complaints about care, safety, or rights; where previous inspections or reinspections have resulted in correction orders related to care, safety, or rights; and, where persons involved in ownership or administration of the facility have been indicted for alleged criminal activity. Any facility that has none of the above conditions or any other condition established by the commissioner that poses a risk to resident care, safety, or rights shall be inspected once every two years.\nAfter each inspection or reinspection required or authorized by this section, the commissioner of health shall, by certified mail, send copies of any correction order or notice of noncompliance to the nursing home. A copy of each correction order and notice of noncompliance, and copies of any documentation supplied to the commissioner of health or the commissioner of human services under section 144A.03 or 144A.05 shall be kept on file at the nursing home and shall be made available for viewing by any person upon request. Except as otherwise provided by this subdivision, a copy of each correction order and notice of noncompliance received by the nursing home after its most recent inspection or reinspection shall be posted in a conspicuous and readily accessible place in the nursing home. No correction order or notice of noncompliance need be posted until any appeal, if one is requested by the facility, pursuant to subdivision 8, has been completed. All correction orders and notices of noncompliance issued to a nursing home owned and operated by the state or political subdivision of the state shall be circulated and posted at the first public meeting of the governing body after the order or notice is issued. Confidential information protected by section 13.05 or 13.46, shall not be made available or posted as provided in this subdivision unless it may be made available or posted in a manner authorized by chapter 13.\nWhenever a duly authorized representative of the commissioner of health finds upon inspection of a nursing home, that the facility or a controlling person or an employee of the facility is not in compliance with sections 144.411 to 144.417, 144.651, 144.6503, 144A.01 to 144A.155, or 626.557 or the rules promulgated thereunder, a correction order shall be issued to the facility. The correction order shall state the deficiency, cite the specific rule or statute violated, state the suggested method of correction, and specify the time allowed for correction. If the commissioner finds that the nursing home had uncorrected or repeated violations which create a risk to resident care, safety, or rights, the commissioner shall notify the commissioner of human services.\n[Repealed, 1989 c 282 art 3 s 98]\nA nursing home issued a correction order under this section shall be reinspected at the end of the period allowed for correction. The reinspection may be made in conjunction with the next annual inspection or any other scheduled inspection. If upon reinspection the representative of the commissioner of health determines that the facility has not corrected a violation identified in the correction order, a notice of noncompliance with the correction order shall be mailed by certified mail to the nursing home. The notice shall specify the violations not corrected and the fines assessed in accordance with subdivision 6.\nA nursing home which is issued a notice of noncompliance with a correction order shall be assessed a civil fine in accordance with a schedule of fines established by the commissioner of health before December 1, 1983. In establishing the schedule of fines, the commissioner shall consider the potential for harm presented to any resident as a result of noncompliance with each statute or rule. The fine shall be assessed for each day the facility remains in noncompliance and until a notice of correction is received by the commissioner of health in accordance with subdivision 7. No fine for a specific violation may exceed $500 per day of noncompliance.\n[Repealed, 1989 c 155 s 5]\nIf the commissioner determines that a nursing home or certified boarding care home does not meet a requirement of section 1919(b), (c), or (d), of the Social Security Act, or any regulation adopted under that section of the Social Security Act, the nursing home or certified boarding care home may be assessed a civil fine for each day of noncompliance and until a notice of correction is received by the commissioner under subdivision 7. Money collected because of these fines must be applied to the protection of the health or property of residents of nursing facilities the commissioner finds deficient. A fine for a specific deficiency may not exceed $500 for each day of noncompliance. The commissioner shall adopt rules establishing a schedule of fines.\nIf a nursing home is subject to fines under both subdivisions 6 and 6b for the same requirement, condition, situation, or practice, the commissioner shall assess either the fine provided by subdivision 6 or the fine provided by subdivision 6b.\n(a) The schedule of fines for noncompliance with correction orders issued to nursing homes that was adopted under the provisions of section 144A.10, subdivision 6, and in effect on May 1, 1989, is effective until repealed, modified, or superseded by rule.\n(b) By September 1, 1990, the commissioner shall amend the schedule of fines to increase to $250 the fines for violations of section 144.651, subdivisions 18, 20, 21, 22, 27, and 30, and for repeated violations.\n(c) The commissioner shall adopt rules establishing the schedule of fines for deficiencies in the requirements of section 1919(b), (c), and (d), of the Social Security Act, or regulations adopted under that section of the Social Security Act.\nWhen the commissioner of health determines the use of, or provides recommendations on the use of fines collected under subdivision 6 or 6b, two representatives of the nursing home industry, appointed by nursing home trade associations, and two consumer representatives as appointed by the commissioner must be included in the process of developing or preparing any information, reviews, or recommendations on the use of the fines. This includes, but is not limited to, including two representatives of the nursing home industry in any committee designed to provide information and recommendations for the use of the fines.\nA nursing home shall promptly notify the commissioner of health in writing when a violation noted in a notice of noncompliance is corrected. Upon receipt of written notification by the commissioner of health, the daily fine assessed for the deficiency shall stop accruing. The facility shall be reinspected within three working days after receipt of the notification. If upon reinspection the representative of the commissioner of health determines that a deficiency has not been corrected as indicated by the notification of compliance the daily fine assessment shall resume and the amount of fines which otherwise would have accrued during the period prior to resumption shall be added to the total assessment due from the nursing home. The commissioner of health shall notify the nursing home of the resumption by certified mail. The nursing home may challenge the resumption as a contested case in accordance with the provisions of chapter 14. Recovery of the resumed fine shall be stayed if a controlling person or a legal representative on behalf of the nursing home makes a written request for a hearing on the resumption within 15 days of receipt of the notice of resumption. The cost of a reinspection conducted pursuant to this subdivision shall be added to the total assessment due from the nursing home.\nFines assessed under this section shall be payable 15 days after receipt of the notice of noncompliance and at 15-day intervals thereafter, as the fines accrue. Recovery of an assessed fine shall be stayed if a controlling person or a legal representative on behalf of the nursing home makes a written request for a hearing on the notice of noncompliance within 15 days after the home's receipt of the notice. A hearing under this subdivision shall be conducted as a contested case in accordance with chapter 14. If a nursing home, after notice and opportunity for hearing on the notice of noncompliance, or on the resumption of the fine, does not pay a properly assessed fine in accordance with this subdivision, the commissioner of health shall notify the commissioner of human services who shall deduct the amount from reimbursement moneys due or to be due the facility under chapter 256B. The commissioner of health may consolidate the hearings provided for in subdivisions 7 and 8 in cases in which a facility has requested hearings under both provisions. The hearings provided for in subdivisions 7 and 8 shall be held within 30 days after the request for the hearing. If a consolidated hearing is held, it shall be held within 30 days of the request which occurred last.\n[Repealed, 2017 c 40 art 1 s 122]\nEach nursing home or boarding care home shall establish a resident advisory council and a family council, unless fewer than three persons express an interest in participating. If one or both councils do not function, the nursing home or boarding care home shall document its attempts to establish the council or councils at least once each calendar year. This subdivision does not alter the rights of residents and families provided by section 144.651, subdivision 27. A nursing home or boarding care home that is issued a notice of noncompliance with a correction order for violation of this subdivision shall be assessed a civil fine of $100 for each day of noncompliance.\nNothing in this section shall be construed to limit the powers granted to the commissioner of health by section 144A.11.\nWhenever a duly authorized representative of the commissioner of health has reasonable cause to believe that a resident has died as a direct or indirect result of abuse or neglect, the representative shall report that information to the appropriate medical examiner or coroner and police department or county sheriff. The medical examiner or coroner shall complete an investigation as soon as feasible and report the findings to the police department or county sheriff, and to the commissioner of health.\n(a) The provisions of this subdivision apply to Minnesota nursing facilities:\n(1) that received immediate jeopardy citations between April 1, 1998, and January 13, 1999, for violations of regulations governing the use of physical restraints; and\n(2) on whose behalf the commissioner recommended to the federal government that fines for these citations not be imposed or be rescinded.\n(b) The commissioner:\n(1) shall grant all possible waivers for the continuation of an approved nurse aide training program, an approved competency evaluation program, or an approved nurse aide training and competency evaluation program conducted by or on the site of a facility referred to in this subdivision; and\n(2) shall notify the Board of Nursing Home Administrators by June 1, 1999, that the commissioner has recommended to the federal government that fines not be imposed on the facilities referred to in this subdivision or that any fines imposed on these facilities for violations of regulations governing use of physical restraints be rescinded.\n(a) If requested, and not prohibited by federal law, the commissioner shall make available to the nursing home associations and the public photocopies of statements of deficiencies and related letters from the department pertaining to federal certification surveys. The commissioner may charge for the actual cost of reproduction of these documents.\n(b) The commissioner shall also make available on a quarterly basis aggregate data for all statements of deficiencies issued after federal certification follow-up surveys related to surveys that were conducted in the quarter prior to the immediately preceding quarter. The data shall include the number of facilities with deficiencies, the total number of deficiencies, the number of facilities that did not have any deficiencies, the number of facilities for which a resurvey or follow-up survey was not performed, and the average number of days between the follow up or resurvey and the exit date of the preceding survey.\nBecause any disruption or delay in the training and registration of nurse aides may reduce access to care in certified facilities, the commissioner shall grant all possible waivers for the continuation of an approved nurse aide training and competency evaluation program or nurse aide training program or competency evaluation program conducted by or on the site of any certified nursing facility or skilled nursing facility that would otherwise lose approval for the program or programs. The commissioner shall take into consideration the distance to other training programs, the frequency of other training programs, and the impact that the loss of the on-site training will have on the nursing facility's ability to recruit and train nurse aides.\nWhen conducting survey certification and enforcement activities related to regular, expanded, or extended surveys under Code of Federal Regulations, title 42, part 488, the commissioner may not issue a finding of immediate jeopardy unless the specific event or omission that constitutes the violation of the requirements of participation poses an imminent risk of life-threatening or serious injury to a resident. The commissioner may not issue any findings of immediate jeopardy after the conclusion of a regular, expanded, or extended survey unless the survey team identified the deficient practice or practices that constitute immediate jeopardy and the residents at risk prior to the close of the exit conference.\nThe commissioner shall respond in writing to a request from a nursing facility certified under the federal Medicare and Medicaid programs for an informal dispute resolution within ten calendar days of the facility's receipt of the notice of deficiencies. The commissioner's response shall identify the commissioner's decision regarding each deficiency citation challenged by the nursing facility, as well as a statement of any changes in findings, level of severity or scope, and proposed remedies or sanctions for each deficiency citation.\n(a) Notwithstanding subdivision 15, a facility certified under the federal Medicare or Medicaid programs that has been assessed a civil money penalty as provided by Code of Federal Regulations, title 42, section 488.430, may request from the commissioner, in writing, an independent informal dispute resolution process regarding any deficiency. The facility must submit its request in writing within ten calendar days of receiving notice that a civil money penalty will be imposed.\n(b) The facility and commissioner have the right to be represented by an attorney at the hearing.\n(c) An independent informal dispute resolution may not be requested for any deficiency that is the subject of an active informal dispute resolution requested under subdivision 15. The facility must withdraw its informal dispute resolution prior to requesting independent informal dispute resolution.\n(d) Within five calendar days of receipt of a written request for an independent informal dispute resolution, the commissioner shall file with the Office of Administrative Hearings a request for the appointment of an administrative law judge from the Office of Administrative Hearings and simultaneously serve the facility with notice of the request.\n(e) An independent informal dispute resolution proceeding shall be scheduled to occur within 30 calendar days of the commissioner's request to the Office of Administrative Hearings, unless the parties agree otherwise or the chief administrative law judge deems the timing to be unreasonable. The independent informal dispute resolution process must be completed within 60 calendar days of the facility's request.\n(f) Five working days in advance of the scheduled proceeding, the commissioner and the facility must submit written statements and arguments, documentary evidence, depositions, and any other materials supporting their position to the administrative law judge.\n(g) The independent informal dispute resolution proceeding shall be informal and conducted in a manner so as to allow the parties to fully present their positions and respond to the opposing party's positions. This may include presentation of oral statements and arguments at the proceeding.\n(h) Within ten working days of the close of the proceeding, the administrative law judge shall issue findings and recommendations regarding each of the deficiencies in dispute. The findings shall be one or more of the following:\n(1) Supported in full. The citation is supported in full, with no deletion of findings and no change in the scope or severity assigned to the deficiency citation.\n(2) Supported in substance. The citation is supported, but one or more findings are deleted without any change in the scope or severity assigned to the deficiency.\n(3) Deficient practice cited under wrong requirement of participation. The citation is amended by moving it to the correct requirement of participation.\n(4) Scope not supported. The citation is amended through a change in the scope assigned to the citation.\n(5) Severity not supported. The citation is amended through a change in the severity assigned to the citation.\n(6) No deficient practice. The citation is deleted because the findings did not support the citation or the negative resident outcome was unavoidable.\n(i) The findings and recommendations of the administrative law judge are not binding on the commissioner.\n(j) Within ten calendar days of receiving the administrative law judge's findings and recommendations, the commissioner shall issue a recommendation to the Center for Medicare and Medicaid Services.\n(k) The commissioner shall reimburse the Office of Administrative Hearings for the costs incurred by that office for the proceeding.\n[See Note.]\n(a) The commissioner shall establish a quality improvement program for the nursing facility survey and complaint processes. The commissioner must regularly consult with consumers, consumer advocates, and representatives of the nursing home industry and representatives of nursing home employees in implementing the program. The commissioner, through the quality improvement program, shall submit to the legislature an annual survey and certification quality improvement report, beginning December 15, 2004, and each December 15 thereafter. This report is exempt from section 144.05, subdivision 7.\n(b) The report must include, but is not limited to, an analysis of:\n(1) the number, scope, and severity of citations by region within the state;\n(2) cross-referencing of citations by region within the state and between states within the Centers for Medicare and Medicaid Services region in which Minnesota is located;\n(3) the number and outcomes of independent dispute resolutions;\n(4) the number and outcomes of appeals;\n(5) compliance with timelines for survey revisits and complaint investigations;\n(6) techniques of surveyors in investigations, communication, and documentation to identify and support citations;\n(7) compliance with timelines for providing facilities with completed statements of deficiencies; and\n(8) other survey statistics relevant to improving the survey process.\n(c) The report must also identify and explain inconsistencies and patterns across regions of the state; include analyses and recommendations for quality improvement areas identified by the commissioner, consumers, consumer advocates, and representatives of the nursing home industry and nursing home employees; and provide action plans to address problems that are identified.",
	"repealed": false
}