{
	"id": "611.27",
	"url": "https://www.revisor.mn.gov/statutes/cite/611.27",
	"title": "611.27 OFFICES OF DISTRICT PUBLIC DEFENDER; FINANCING; REPRESENTATION.",
	"text": "Money appropriated to the State Board of Public Defense for the board's administration, for the state public defender, for the judicial district public defenders, and for the public defense corporations shall be expended as determined by the board. In distributing funds to district public defenders, the board shall consider public defender case loads and the results of the weighted case load study.\n[Repealed, 1998 c 367 art 8 s 26]\n[Renumbered 611.24, subd 2]\n[Repealed, 1998 c 367 art 8 s 26]\nThe Board of Public Defense is solely responsible to provide counsel in adult criminal and juvenile cases, as specified under section 611.14. The court shall not appoint counsel at county expense for representation under section 611.14, except as provided in section 611.26, subdivision 3a, paragraph (c).\nMS 2022 [Repealed, 2024 c 123 art 14 s 23]\nThe state's obligation for the costs of the public defender services is limited to the appropriations made to the Board of Public Defense.\nIn a case where the chief district public defender does not believe that the office can provide adequate representation, the chief public defender of the district shall immediately notify the state public defender. The chief district public defender may request that the state public defender authorize appointment of counsel other than the district public defender in the case.\nMS 2022 [Repealed, 2024 c 123 art 14 s 23]\nThe chief public defender may not request nor may the state public defender approve the addition of permanent staff under this section.\n(a) If the state public defender finds that the provision of adequate legal representation, including associated services, is beyond the ability of the district public defender to provide, the state public defender may approve counsel to be appointed, with compensation and expenses to be paid under this subdivision. Counsel in these cases shall be appointed by the chief district public defender.\n(b) All billings for services rendered and ordered under this subdivision shall require the approval of the chief district public defender before being forwarded to the state public defender for payment. Counsel appointed under this subdivision shall document the time worked and expenses incurred in a manner prescribed by the chief district public defender. In cases where adequate representation cannot be provided by the district public defender and where counsel has been approved by the state public defender, the Board of Public Defense shall pay all services from county program aid transferred by the commissioner of revenue for that purpose under section 477A.03, subdivision 2b, paragraph (a).\n[Repealed, 2024 c 123 art 14 s 23]\nThe costs of appointed counsel and associated services in cases arising from new criminal charges brought against indigent inmates who are incarcerated in a Minnesota state correctional facility are the responsibility of the State Board of Public Defense. In these cases the state public defender may follow the procedures outlined in this section for obtaining court-ordered counsel.\n[Repealed, 1997 c 7 art 2 s 67]\n[Renumbered 611.24, subd 3]\n[Renumbered 611.24, subd 4]",
	"repealed": false
}