{
	"id": "356.30",
	"url": "https://www.revisor.mn.gov/statutes/cite/356.30",
	"title": "356.30 COMBINED SERVICE ANNUITY.",
	"text": "(a) Notwithstanding any provisions of the laws governing the covered retirement plans listed in subdivision 3, a person may elect to receive, upon retirement, a retirement annuity from each covered retirement plan, subject to the provisions of paragraph (b), if the person has:\n(1) allowable service in any two or more of the covered plans;\n(2) at least one-half year of allowable service in each covered plan, based on the allowable service in each plan;\n(3) total allowable service that equals or exceeds the longest service credit vesting requirement of the applicable retirement plan; and\n(4) not begun to receive an annuity from any covered plan or made application for benefits from each applicable plan and the retirement annuity effective dates of each plan are within a one-year period.\n(b) If all requirements in paragraph (a) have been satisfied, the retirement annuity from each plan must be based upon the allowable service, accrual rates, and average salary in the applicable plan except as further specified or modified in the following clauses:\n(1) the laws governing annuities must be the law in effect on the date of termination from the last period of public service under a covered retirement plan with which the person earned a minimum of one-half year of allowable service credit during that employment;\n(2) the average salary used to calculate the annuity for each formula plan must be based on the employee's highest five successive years of covered salary during the entire service in covered plans;\n(3) the accrual rates under each plan must be the percentages prescribed by each plan's formula in effect for the respective years of allowable service from one plan to the next, recognizing all previous allowable service with the other covered plans;\n(4) the allowable service in all the covered plans must be combined in determining eligibility for and the application of each plan's provisions with respect to reduction in the annuity amount for retirement prior to normal retirement age; and\n(5) the annuity amount payable for any allowable service under a nonformula plan that is a covered plan must not be affected, but such service and covered salary must be used in the above calculation.\n(c) If a person eligible for an annuity under paragraph (a) from each covered plan terminates all public service, the deferred annuity must be augmented from the date of termination until the earlier of:\n(1) the effective date of retirement; or\n(2) December 31, 2018, for the Minnesota State Retirement System and the Public Employees Retirement Association or June 30, 2019, for the Teachers Retirement Association and the St. Paul Teachers Retirement Association.\nA deferred annuity must not be augmented after the applicable dates under clause (2). The appropriate rate of augmentation is the rate in effect on the date on which the person entered into public employment and subsequently adjusted according to the laws governing each covered plan, as applicable.\n(d) This section does not apply to any person whose final termination from the last public service under a covered plan was before May 1, 1975.\n(e) For the purpose of computing annuities under this section:\n(1) the judges retirement fund accrual rate must not exceed 3.2 percent per year of service for any year of service or fraction thereof;\n(2) the public employees police and fire plan and the State Patrol retirement plan accrual rate must not exceed 3.0 percent per year of service for any year of service or fraction thereof;\n(3) the legislators retirement plan accrual rate must not exceed 2.5 percent, but this limit does not apply to the adjustment provided under section 3A.02, subdivision 1, paragraph (c); and\n(4) any other covered plan's accrual rate must not exceed 2.7 percent per year of service for any year of service or fraction thereof.\n(f) Any period of time for which a person has credit in more than one of the covered plans must be used only once for the purpose of determining total allowable service.\n(g) If the period of duplicated service credit is more than one-half year, or the person has credit for more than one-half year, with each of the plans, each plan must apply its formula to a prorated service credit for the period of duplicated service based on a fraction of the salary on which deductions were paid to that fund for the period divided by the total salary on which deductions were paid to all plans for the period.\n(h) If the period of duplicated service credit is less than one-half year, or when added to other service credit with that plan is less than one-half year, the service credit must be ignored and a refund of contributions made to the person in accord with that plan's refund provisions.\nA person who has service credit in one of the retirement plans enumerated in subdivision 3 and who is employed or was formerly employed in a position covered by one of these covered plans but also has received a refund from any other of these covered plans, may repay the refund to the respective plan under terms and conditions that are consistent with the laws governing the other plan, except that the person need not be a currently contributing member of the plan to which the refund is repaid at the time the repayment is made. Unless otherwise provided by statute, the repayment of a refund under this subdivision may only be made within six months following termination of employment from a position covered by one of the covered plans enumerated in subdivision 3 or before the date of retirement from the plan to which the refund is repaid, whichever is earlier.\nIf a purchase of prior service is made under the provisions of Laws 1988, chapter 709, article 3, or any similar special or general law provision which allows a purchase of service credit in any of the retirement plans enumerated in subdivision 3, the amount of required reserves calculated as prescribed in Laws 1988, chapter 709, article 3, must be paid to each plan based on the amount of benefit increase payable from that plan as a result of the purchase of prior service.\nThis section applies to the following retirement plans:\n(1) the general state employees retirement plan of the Minnesota State Retirement System, established under chapter 352;\n(2) the correctional state employees retirement plan of the Minnesota State Retirement System, established under chapter 352;\n(3) the unclassified employees retirement program, established under chapter 352D;\n(4) the State Patrol retirement plan, established under chapter 352B;\n(5) the legislators retirement plan, established under chapter 3A, including constitutional officers as specified in that chapter;\n(6) the general employees retirement plan of the Public Employees Retirement Association, established under chapter 353;\n(7) the public employees police and fire retirement plan of the Public Employees Retirement Association, established under chapter 353;\n(8) the local government correctional service retirement plan of the Public Employees Retirement Association, established under chapter 353E;\n(9) the Teachers Retirement Association, established under chapter 354;\n(10) the St. Paul Teachers Retirement Fund Association, established under chapter 354A; and\n(11) the judges retirement fund, established by chapter 490.",
	"repealed": false
}