{
	"id": "256.021",
	"url": "https://www.revisor.mn.gov/statutes/cite/256.021",
	"title": "256.021 VULNERABLE ADULT MALTREATMENT REVIEW PANEL.",
	"text": "(a) The commissioner of human services shall establish a review panel for purposes of reviewing lead investigative agency determinations regarding maltreatment of a vulnerable adult in response to requests received under section 626.557, subdivision 9d, paragraph (b). The panel shall hold quarterly meetings for purposes of conducting reviews under this section.\n(b) The review panel consists of:\n(1) the commissioners of health and human services or their designees;\n(2) the ombudsman for long-term care and ombudsman for mental health and developmental disabilities, or their designees;\n(3) a member of the board on aging, appointed by the board; and\n(4) a representative from the county human services administrators appointed by the commissioner of human services or the administrator's designee.\n(a) If a vulnerable adult or an interested person acting on behalf of the vulnerable adult requests a review under this section, the panel shall review the request at its next quarterly meeting. If the next quarterly meeting is within ten days of the panel's receipt of the request for review, the review may be delayed until the next subsequent meeting. The panel shall review the request and the investigation memorandum and may review any other data on the investigation maintained by the lead investigative agency that are pertinent and necessary to its review of the final disposition. If more than one person requests a review under this section with respect to the same final disposition, the review panel shall combine the requests into one review. The panel shall submit its written request for the case file and other documentation relevant to the review to the supervisor of the investigator conducting the investigation under review.\n(b) Within 30 days of the review under this section, the panel shall notify the director or manager of the lead investigative agency and the vulnerable adult or interested person who requested the review as to whether the panel concurs with the final disposition or whether the lead investigative agency must reconsider the final disposition. If the panel determines that the lead investigative agency must reconsider the final disposition, the panel must make specific recommendations to the director or manager of the lead investigative agency. The recommendation must include an explanation of the factors that form the basis of the recommendation to reconsider the final disposition and must specifically identify the disputed facts, the disputed application of maltreatment definitions, the disputed application of responsibility for maltreatment, and the disputed weighing of evidence, whichever apply. Within 30 days the lead investigative agency shall conduct a review and report back to the panel with its determination and the specific rationale for its final disposition. At a minimum, the specific rationale must include a detailed response to each of the factors identified by the panel that formed the basis for the recommendations of the panel.\n(c) Upon receiving the report of reconsideration from the lead investigative agency, the panel shall communicate the decision in writing to the vulnerable adult or interested person acting on behalf of the vulnerable adult who requested the review. The panel shall include the specific rationale provided by the lead investigative agency as part of the communication.\nMS 2022 [Repealed, 2024 c 85 s 115]\nData of the review panel created or received as part of a review under this section are private data on individuals as defined in section 13.02.",
	"repealed": false
}