{
	"id": "161.38",
	"url": "https://www.revisor.mn.gov/statutes/cite/161.38",
	"title": "161.38 SPECIAL AGREEMENTS FOR HIGHWAYS IN MUNICIPALITIES.",
	"text": "Road authorities, including the road authorities of any city may enter into an agreement with the commissioner for the construction of a roadway or structure of greater width or capacity than would be necessary to accommodate the normal trunk highway traffic upon any trunk highway within its boundaries, and may appropriate from any funds available and pay into the trunk highway fund such sums of money as may be agreed upon. Nothing herein contained shall prevent any city from constructing the portions of the street not included in the trunk highway system independent of any contract with the commissioner; provided the construction conforms to the reasonable rules as the commissioner may prescribe as to grade and drainage.\nWhere a trunk highway is located over or along a street in any city which street is or may be improved to a width greater than the normal width of such trunk highway, the road authority of the city may enter into an agreement with the commissioner for the maintenance of the additional width by the commissioner and shall in accordance with the agreement appropriate and pay into the trunk highway fund such sums of money as may be agreed upon. Nothing herein contained shall be construed to prevent any city maintaining such additional width at its own expense independent of any contract with the commissioner.\nThe commissioner for and on behalf of the state may enter into agreements with municipalities for the construction, improvement, and maintenance of trunk highways within the limits of said municipalities, including but not limited to agreements for the construction and maintenance of frontage roads upon and along trunk highways within the limits of said municipalities. Such frontage roads may be constructed along the main-traveled lanes of the trunk highway, or they may be constructed a reasonable distance out from the limits of the right-of-way acquired for the main-traveled lanes if in the considered judgment of the commissioner such location is necessary to eliminate unreasonable circuity of local travel or to provide access to properties otherwise denied access to public highways by the establishment and construction of the trunk highway. Such frontage roads shall connect, at least at one terminal, either with the main lanes of the trunk highway or with another public highway. The municipalities are authorized to enter into such agreement with the commissioner for the performance and responsibility of the work upon such terms as may be agreed upon.\nWhenever the road authority of any city enters into an agreement with the commissioner pursuant to this section, and a portion of the cost is to be assessed against benefited property, the letting of a public contract by the commissioner for the work shall be deemed to comply with statutory or charter provisions requiring the city (1) to advertise for bids before awarding a contract for a public improvement, (2) to let the contract to the lowest responsible bidder or to the vendor or contractor offering the best value, and (3) to require a performance bond to be filed by the contractor before undertaking the work. The contract so let by the commissioner and the performance bond required of the contractor by the commissioner shall be considered to be the contract and bond of the city for the purposes of complying with the requirements of any applicable law or charter provision, and the bond shall inure to the benefit of the city and operate for their protection to the same extent as though they were parties thereto.\nFor the purpose of this section the term \"municipalities\" shall include counties, cities, and towns.\nIf any municipality fails to fulfill its obligations as provided in any mutual agreement entered into pursuant to this section, the commissioner may retain and withhold payment of any state aid money apportioned to such municipality under the provisions of sections 162.01 to 162.181 until such municipality fulfills its obligations under the agreement. If the obligation which the municipality has failed to fulfill is a monetary obligation, the amount of state aid money which the commissioner may withhold shall not exceed the amount of the monetary obligation in default. If the obligation is other than a monetary obligation, the commissioner may withhold a reasonable amount of such state aid money until the municipality fulfills the obligation.\nThe commissioner may act as agent for any municipality, at its request and on its approval, for the construction of street or highway improvements outside the limits of a state construction project. Administration of a contract in this manner must be based on an estimated cost savings for both the state and the municipality. All costs of such work shall be paid by the municipality. Prior to the letting of the state construction contract, the provisions for payment and all details of the work to be done outside of the limits of the state construction project shall be set out in an agency agreement between the municipality and the state.\nThe commissioner must maintain information on expenditures by local road authorities from local funding sources for trunk highway system projects.",
	"repealed": false
}