{
	"id": "325J.01",
	"url": "https://www.revisor.mn.gov/statutes/cite/325J.01",
	"title": "325J.01 DEFINITIONS.",
	"text": "As used in this chapter, the following terms have the meanings given them unless the context clearly indicates otherwise.\n\"Appropriate law enforcement agency\" means the attorney general of the state of Minnesota, the sheriff of each county in which a pawnbroker maintains an office, or the police chief of the municipality or law enforcement officers of the municipality in which a pawnbroker maintains an office.\n\"Municipality\" means any town, home rule charter or statutory city, or county that elects to regulate and license pawnbrokers within its jurisdiction pursuant to local ordinance.\n(a) Except as provided in paragraph (b), \"pawnbroker\" means a person engaged in whole or in part in the business of lending money on the security of pledged goods left in pawn, or in the business of purchasing tangible personal property to be left in pawn on the condition that it may be redeemed or repurchased by the seller for a fixed price within a fixed period of time.\n(b) The following are exempt from the definition of \"pawnbroker\": any bank regulated by the state of Minnesota, the comptroller of the currency of the United States, the Federal Deposit Insurance Corporation, the board of governors of the Federal Reserve System, or any other federal or state authority and their affiliates; any bank or savings association whose deposits or accounts are eligible for insurance by the Federal Deposit Insurance Corporation or any successor to it and all affiliates of those banks and savings associations; any state or federally chartered credit union; and any industrial loan and thrift company or regulated lender subject to licensing and regulation by the Department of Commerce.\n\"Pawnshop\" means the location at which or premises in which a pawnbroker regularly conducts business.\n\"Pawn transaction\" means any loan on the security of pledged goods or any purchase of pledged goods on the condition that the pledged goods are left with the pawnbroker and may be redeemed or repurchased by the seller for a fixed price within a fixed period of time.\n\"Person\" means an individual, partnership, corporation, limited liability company, joint venture, trust, association, or any other legal entity, however organized.\n\"Pledged goods\" means tangible personal property other than choses in action, securities, bank drafts, or printed evidence of indebtedness, that are purchased by, deposited with, or otherwise actually delivered into the possession of a pawnbroker in connection with a pawn transaction.",
	"repealed": false
}