{
	"id": "260C.163",
	"url": "https://www.revisor.mn.gov/statutes/cite/260C.163",
	"title": "260C.163 HEARING.",
	"text": "(a) Except for hearings arising under section 260C.425, hearings on any matter shall be without a jury and may be conducted in an informal manner. In all adjudicatory proceedings regarding juvenile protection matters under this chapter, the court shall admit only evidence that would be admissible in a civil trial. To be proved at trial, allegations of a petition alleging a child to be in need of protection or services must be proved by clear and convincing evidence.\n(b) Except for proceedings involving a child alleged to be in need of protection or services and petitions for the termination of parental rights, hearings may be continued or adjourned from time to time. In proceedings involving a child alleged to be in need of protection or services and for the termination of parental rights, hearings may not be continued or adjourned for more than one week unless the court makes specific findings that the continuance or adjournment is in the best interests of the child. If a hearing is held on a petition involving physical or sexual abuse of a child who is alleged to be in need of protection or services or neglected and in foster care, the court shall file the decision with the court administrator as soon as possible but no later than 15 days after the matter is submitted to the court. When a continuance or adjournment is ordered in any proceeding, the court may make any interim orders as it deems in the best interests of the minor in accordance with this chapter.\n(c) Absent exceptional circumstances, hearings under this chapter, except hearings in adoption proceedings, are presumed to be accessible to the public, however the court may close any hearing and the records related to any matter as provided in the Minnesota Rules of Juvenile Protection Procedure.\n(d) Adoption hearings are closed to the public and all records related to an adoption are inaccessible except as provided in the Minnesota Rules of Adoption Procedure.\n(e) In any permanency hearing, including the transition of a child from foster care to independent living, the court shall ensure that its consult with the child during the hearing is in an age-appropriate manner.\n(a) A child who is the subject of a petition, and the parents, guardian, or legal custodian of the child have the right to participate in all proceedings on a petition, including the opportunity to personally attend all hearings. Official tribal representatives have the right to participate in any proceeding that is subject to the Indian Child Welfare Act of 1978, United States Code, title 25, sections 1901 to 1963.\n(b) A parent with a legally recognized parent and child relationship must be provided the right to be heard in any review or hearing held with respect to the child, which includes the right to be heard on the disposition order under section 260C.201, subdivision 1, parental visitation under section 260C.178, and the out-of-home placement plan under section 260C.212, subdivision 1. The right to be heard does not automatically confer party status. Party status is governed by the Minnesota Rules of Juvenile Protection Procedure.\n(c) Any grandparent of the child has a right to participate in the proceedings to the same extent as a parent, if the child has lived with the grandparent within the two years preceding the filing of the petition. At the first hearing following the filing of a petition, the court shall ask whether the child has lived with a grandparent within the last two years, except that the court need not make this inquiry if the petition states that the child did not live with a grandparent during this time period. Failure to notify a grandparent of the proceedings is not a jurisdictional defect.\n(d) If, in a permanency proceeding involving a child in need of protection or services, any party files a petition for transfer of permanent legal and physical custody to a named relative, the relative has a right to participate in the permanency proceeding as a party on the issues of the relative's suitability to be a legal and physical custodian for the child, whether the transfer is in the child's best interests, and the needs of the child. Thereafter the named relative shall receive notice of any hearing in the proceedings.\n(a) The child, parent, guardian, or custodian has the right to effective assistance of counsel in connection with a proceeding in juvenile court as provided in this subdivision.\n(b) Except in proceedings where the sole basis for the petition is habitual truancy, if the child desires counsel but is unable to employ it, the court shall appoint counsel to represent the child who is ten years of age or older under section 611.14, clause (4), or other counsel at public expense.\n(c) In all child protection proceedings where a child risks removal from the care of the child's parent, guardian, or custodian, including a child in need of protection or services petition, an action pursuing removal of a child from the child's home, a termination of parental rights petition, or a petition for permanent out-of-home placement, if the parent, guardian, or custodian desires counsel and is eligible for counsel under section 611.17, the court shall appoint counsel to represent each parent, guardian, or custodian prior to the first hearing on the petition and at all stages of the proceedings. Court appointed counsel shall be at county expense as outlined in paragraph (h).\n(d) In any proceeding where the subject of a petition for a child in need of protection or services is ten years of age or older, the responsible social services agency shall, within 14 days after filing the petition or at the emergency removal hearing under section 260C.178, subdivision 1, if the child is present, fully and effectively inform the child of the child's right to be represented by appointed counsel upon request and shall notify the court as to whether the child desired counsel. Information provided to the child shall include, at a minimum, the fact that counsel will be provided without charge to the child, that the child's communications with counsel are confidential, and that the child has the right to participate in all proceedings on a petition, including the opportunity to personally attend all hearings. The responsible social services agency shall also, within 14 days of the child's tenth birthday, fully and effectively inform the child of the child's right to be represented by counsel if the child reaches the age of ten years while the child is the subject of a petition for a child in need of protection or services or is a child under the guardianship of the commissioner.\n(e) In any proceeding where the sole basis for the petition is habitual truancy, the child, parent, guardian, and custodian do not have the right to appointment of a public defender or other counsel at public expense. However, before any out-of-home placement, including foster care or inpatient treatment, can be ordered, the court must appoint a public defender or other counsel at public expense in accordance with this subdivision.\n(f) Counsel for the child shall not also act as the child's guardian ad litem.\n(g) In any proceeding where the subject of a petition for a child in need of protection or services is not represented by an attorney, the court shall determine the child's preferences regarding the proceedings, including informing the child of the right to appointed counsel and asking whether the child desires counsel, if the child is of suitable age to express a preference.\n(h) Court-appointed counsel for the parent, guardian, or custodian under this subdivision is at county expense. If the county has contracted with counsel, the court shall appoint the counsel retained by the county, unless a conflict of interest exists. If a conflict exists, after consulting with the chief judge of the judicial district or the judge's designee, the county shall contract with competent counsel to provide the necessary representation. The court may appoint only one counsel at public expense for the first court hearing to represent the interests of the parents, guardians, and custodians, unless, at any time during the proceedings upon petition of a party, the court determines and makes written findings on the record that extraordinary circumstances exist that require counsel to be appointed to represent a separate interest of other parents, guardians, or custodians subject to the jurisdiction of the juvenile court.\nIn representing the responsible social services agency, the county attorney shall also have the responsibility for advancing the public interest in the welfare of the child.\n(a) The court shall appoint a guardian ad litem to protect the interests of the minor when it appears, at any stage of the proceedings, that the minor is without a parent or guardian, or that the minor's parent is a minor or incompetent, or that the parent or guardian is indifferent or hostile to the minor's interests, and in every proceeding alleging a child's need for protection or services under section 260C.007, subdivision 6, except proceedings where the sole allegation is that the child is a runaway or habitual truant. In any other case the court may appoint a guardian ad litem to protect the interests of the minor when the court feels that such an appointment is desirable. The court shall appoint the guardian ad litem on its own motion or in the manner provided for the appointment of a guardian ad litem in the district court. The court may appoint separate counsel for the guardian ad litem if necessary.\n(b) A guardian ad litem shall carry out the following responsibilities:\n(1) conduct an independent investigation to determine the facts relevant to the situation of the child and the family, which must include, unless specifically excluded by the court, reviewing relevant documents; meeting with and observing the child in the home setting and considering the child's wishes, as appropriate; and interviewing parents, caregivers, and others with knowledge relevant to the case;\n(2) advocate for the child's best interests by participating in appropriate aspects of the case and advocating for appropriate community services when necessary;\n(3) maintain the confidentiality of information related to a case, with the exception of sharing information as permitted by law to promote cooperative solutions that are in the best interests of the child;\n(4) monitor the child's best interests throughout the judicial proceeding; and\n(5) present written reports on the child's best interests that include conclusions and recommendations and the facts upon which they are based.\n(c) Except in cases where the child is alleged to have been abused or neglected, the court may waive the appointment of a guardian ad litem pursuant to paragraph (a), whenever counsel has been appointed pursuant to subdivision 2 or is retained otherwise, and the court is satisfied that the interests of the minor are protected.\n(d) In appointing a guardian ad litem pursuant to paragraph (a), the court shall not appoint the party filing a petition pursuant to section 260C.141.\n(e) The following factors shall be considered when appointing a guardian ad litem in a case involving an Indian or minority child:\n(1) whether a person is available who is the same racial or ethnic heritage as the child or, if that is not possible;\n(2) whether a person is available who knows and appreciates the child's racial or ethnic heritage.\n(f) The court shall require a background study for each guardian ad litem as provided under section 518.165. The court shall have access to data collected pursuant to section 245C.32 for purposes of the background study.\nIn any child in need of protection or services proceeding, neglected and in foster care, or termination of parental rights proceeding the court may, on its own motion or the motion of any party, take the testimony of a child witness informally when it is in the child's best interests to do so. Informal procedures that may be used by the court include taking the testimony of a child witness outside the courtroom. The court may also require counsel for any party to the proceeding to submit questions to the court before the child's testimony is taken, and to submit additional questions to the court for the witness after questioning has been completed. The court may excuse the presence of the child's parent, guardian, or custodian from the room where the child is questioned in accordance with subdivision 7.\nThe court may waive the presence of the minor in court at any stage of the proceedings when it is in the best interests of the minor to do so. In any proceeding, the court may temporarily excuse the presence of the parent or guardian of a minor from the hearing when it is in the best interests of the minor to do so. The attorney or guardian ad litem, if any, has the right to continue to participate in proceedings during the absence of the minor, parent, or guardian.\nThe minor and the minor's parent, guardian, or custodian are entitled to be heard, to present evidence material to the case, and to cross-examine witnesses appearing at the hearing.\nIn determining whether a child is neglected and in foster care, the court shall consider, among other factors, the following:\n(1) the length of time the child has been in foster care;\n(2) the effort the parent has made to adjust circumstances, conduct, or conditions that necessitates the removal of the child to make it in the child's best interest to be returned to the parent's home in the foreseeable future, including the use of rehabilitative services offered to the parent;\n(3) whether the parent has visited the child within the three months preceding the filing of the petition, unless extreme financial or physical hardship or treatment for mental disability or chemical dependency or other good cause prevented the parent from visiting the child or it was not in the best interests of the child to be visited by the parent;\n(4) the maintenance of regular contact or communication with the agency or person temporarily responsible for the child;\n(5) the appropriateness and adequacy of services provided or offered to the parent to facilitate a reunion;\n(6) whether additional services would be likely to bring about lasting parental adjustment enabling a return of the child to the parent within an ascertainable period of time, whether the services have been offered to the parent, or, if services were not offered, the reasons they were not offered; and\n(7) the nature of the efforts made by the responsible social services agency to rehabilitate and reunite the family and whether the efforts were reasonable.\n(a) Waiver of any right which a child has under this chapter must be an express waiver made voluntarily, intelligently, and in writing by the child after the child has been fully and effectively informed of the right to counsel and after consulting with an appointed attorney.\n(b) Waiver of a child's right to be represented by counsel provided under the juvenile court rules must be an express waiver made voluntarily, intelligently, and in writing by the child after the child has been fully and effectively informed of the right being waived by the responsible social services agency and consultation with an appointed attorney. In determining whether a child has voluntarily and intelligently waived the right to counsel, the court shall look to the totality of the circumstances which includes but is not limited to the child's age, maturity, intelligence, education, experience, and ability to comprehend, and the presence and competence of the child's parents, guardian, or guardian ad litem. The court shall not permit the child's parent, other person legally responsible for the child's care, or the child's guardian ad litem to waive the child's right to be represented by counsel. If the court accepts the child's waiver, it shall state on the record the findings and conclusions that form the basis for its decision to accept the waiver.\n(a) A child's absence from school is presumed to be due to the parent's, guardian's, or custodian's failure to comply with compulsory instruction laws if the child is under 12 years old and the school has made appropriate efforts to resolve the child's attendance problems; this presumption may be rebutted based on a showing by clear and convincing evidence that the child is habitually truant. A child's absence from school without lawful excuse, when the child is 12 years old or older, is presumed to be due to the child's intent to be absent from school; this presumption may be rebutted based on a showing by clear and convincing evidence that the child's absence is due to the failure of the child's parent, guardian, or custodian to comply with compulsory instruction laws, sections 120A.22 and 120A.24.\n(b) Consistent with section 125A.091, subdivision 5, a parent's refusal to provide the parent's child with sympathomimetic medications does not constitute educational neglect.\nThe court may authorize parties and participants in any child in need of protection or services, permanency, or termination of parental rights petition to participate in any appropriate form of alternative dispute resolution including family group decision making, parallel protection process, and mediation when such alternative dispute resolution is in the best interests of the child. The court may order that a child be included in the alternative dispute resolution process, as appropriate and in the best interests of the child. An alternative dispute resolution process, including family group decision making, parallel protection process, and mediation, may be used to resolve part or all of a matter before the court at any point in the proceedings subject to approval by the court that the resolution is in the best interests of the child.",
	"repealed": false
}