{
	"id": "14.25",
	"url": "https://www.revisor.mn.gov/statutes/cite/14.25",
	"title": "14.25 PUBLIC HEARING.",
	"text": "If, during the 30-day period allowed for comment, 25 or more persons submit to the agency a written request for a public hearing of the proposed rule, the agency shall proceed under the provisions of sections 14.14 to 14.20. The written request must include: (1) the name and address of the person requesting the public hearing; and (2) the portion or portions of the rule to which the person objects or a statement that the person opposes the entire rule. If not previously published under section 14.22, subdivision 2, a notice of the public hearing must be published in the State Register and mailed to those persons who submitted a written request for the public hearing. Unless the agency has modified the proposed rule, the notice need not include the text of the proposed rule but only a citation to the State Register pages where the text appears.\nA written request for a public hearing that does not comply with the requirements of this section is invalid and may not be counted by the agency for purposes of determining whether a public hearing must be held.\nIf a request for a public hearing has been withdrawn so as to reduce the number of requests below 25, the agency must give written notice of that fact to all persons who have requested the public hearing. No public hearing may be canceled by an agency within three working days of the hearing. The notice must explain why the request is being withdrawn, and must include a description of any action the agency has taken or will take that affected or may have affected the decision to withdraw the requests. The notice must also invite persons to submit written comments within five working days to the agency relating to the withdrawal. The notice and any written comments received by the agency is part of the rulemaking record submitted to the administrative law judge under section 14.14 or 14.26. The administrative law judge shall review the notice and any comments received and determine whether the withdrawal is consistent with section 14.001, clauses (2), (4), and (5).\nThis subdivision applies only to a withdrawal of a hearing request that affects whether a public hearing must be held and only if the agency has taken any action to obtain the withdrawal of the hearing request.",
	"repealed": false
}