{
	"id": "216C.146",
	"url": "https://www.revisor.mn.gov/statutes/cite/216C.146",
	"title": "216C.146 COMMUNITY ENERGY EFFICIENCY AND RENEWABLE ENERGY LOAN REVENUE BONDS.",
	"text": "(a) The commissioner of management and budget, if requested by the commissioner of commerce, shall sell and issue state revenue bonds for the following purposes:\n(1) to make community energy efficiency and renewable energy loans under section 216C.145;\n(2) to pay the costs of issuance, debt service, including capitalized interest, and bond insurance or other credit enhancements, to fund reserves, and make payments under other agreements entered into under subdivision 2, but excludes refunding bonds sold and issued under this subdivision; and\n(3) to refund bonds issued under this section.\n(b) The aggregate principal amount of bonds for the purposes of paragraph (a), clause (1), that may be outstanding at any time may not exceed $100,000,000, of which up to $20,000,000 shall be reserved for community energy efficiency and renewable energy projects taking place in small businesses and public buildings; the principal amount of bonds that may be issued for the purposes of paragraph (a), clauses (2) and (3), is not limited.\n(c) For the purpose of this section, \"commissioner\" means the commissioner of management and budget.\n(d) Revenue bonds may be issued from time to time in one or more series on the terms and conditions the commissioner determines to be in the best interests of the state at any price or percentages of par value, but the term on any series of revenue bonds may not exceed 25 years. The revenue bonds of each issue and series thereof shall be dated and bear interest, and may be includable in or excludable from the gross income of the owners for federal income tax purposes.\n(e) Revenue bonds may be sold at either public or private sale. Any bid received may be rejected.\n(f) The revenue bonds are not subject to chapter 16C.\n(g) Notwithstanding any other law, revenue bonds issued under this section shall be fully negotiable.\n(h) Revenue bond terms must be no longer than the term of any corresponding loan made under section 216C.145.\nThe commissioner may sell and issue the bonds on the terms and conditions the commissioner determines to be in the best interests of the state. The bonds may be sold at public or private sale. The commissioner may enter into any agreements or pledges the commissioner determines necessary or useful to sell the bonds that are not inconsistent with section 216C.145. Sections 16A.672 to 16A.675 apply to the bonds. The proceeds of the bonds issued under this section must be credited to the community energy efficiency and renewable energy loan account created under section 216C.145.\nThe debt service on the bonds is payable only from the following sources:\n(1) revenue credited to the community energy efficiency and renewable energy loan account from the sources identified in section 216C.145 or from any other source; and\n(2) other revenues pledged to the payment of the bonds, including reserves established by a local government unit.\nThe commissioner may issue bonds to refund outstanding bonds issued under subdivision 1, including the payment of any redemption premiums on the bonds and any interest accrued or to accrue to the first redemption date after delivery of the refunding bonds. The proceeds of the refunding bonds may, at the discretion of the commissioner, be applied to the purchases or payment at maturity of the bonds to be refunded, or the redemption of the outstanding bonds on the first redemption date after delivery of the refunding bonds and may, until so used, be placed in escrow to be applied to the purchase, retirement, or redemption. Refunding bonds issued under this subdivision must be issued and secured in the manner provided by the commissioner.\nBonds issued under this section are not public debt, and the full faith, credit, and taxing powers of the state are not pledged for their payment. The bonds may not be paid, directly in whole or in part from a tax of statewide application on any class of property, income, transaction, or privilege. Payment of the bonds is limited to the revenues explicitly authorized to be pledged under this section. The state neither makes nor has a moral obligation to pay the bonds if the pledged revenues and other legal security for them is insufficient.\nThe commissioner may contract with and appoint a trustee for bondholders. The trustee has the powers and authority vested in it by the commissioner under the bond and trust indentures.\nA pledge made by the commissioner is valid and binding from the time the pledge is made. The money or property pledged and later received by the commissioner is immediately subject to the lien of the pledge without any physical delivery of the property or money or further act, and the lien of the pledge is valid and binding as against all parties having claims of any kind in tort, contract, or otherwise against the commissioner, whether or not those parties have notice of the lien or pledge. Neither the order nor any other instrument by which a pledge is created need be recorded.\nThe commissioner, subject to agreements with bondholders that may then exist, may, out of any money available for the purpose, purchase bonds of the commissioner at a price not exceeding (1) if the bonds are then redeemable, the redemption price then applicable plus accrued interest to the next interest payment date thereon, or (2) if the bonds are not redeemable, the redemption price applicable on the first date after the purchase upon which the bonds become subject to redemption plus accrued interest to that date.\nThe state pledges and agrees with the holders of any bonds that the state will not limit or alter the rights vested in the commissioner to fulfill the terms of any agreements made with the bondholders, or in any way impair the rights and remedies of the holders until the bonds, together with interest on them, with interest on any unpaid installments of interest, and all costs and expenses in connection with any action or proceeding by or on behalf of the bondholders, are fully met and discharged. The commissioner may include this pledge and agreement of the state in any agreement with the holders of bonds issued under this section.\nAny of the following entities may legally invest any sinking funds, money, or other funds belonging to them or under their control in any revenue bonds issued under this section:\n(1) the state, the investment board, public officers, municipal corporations, political subdivisions, and public bodies;\n(2) banks and bankers, savings and loan associations, credit unions, trust companies, savings banks and institutions, investment companies, insurance companies, insurance associations, and other persons carrying on a banking or insurance business; and\n(3) personal representatives, guardians, trustees, and other fiduciaries.\nThe waiver of immunity by the state provided for by section 3.751, subdivision 1, shall be applicable to the revenue bonds and any ancillary contracts to which the commissioner is a party.",
	"repealed": false
}