{
	"id": "475.55",
	"url": "https://www.revisor.mn.gov/statutes/cite/475.55",
	"title": "475.55 EXECUTION; NEGOTIABILITY; INTEREST RATES.",
	"text": "All obligations shall be securities as provided in the Uniform Commercial Code, chapter 336, article 8, may be issued as certificated securities or as uncertificated securities, and if issued as certificated securities may be issued in bearer form or in registered form, as defined in section 336.8-102. The validity of an obligation shall not be impaired by the fact that one or more officers authorized to execute it by the governing body of the municipality shall have ceased to be in office before delivery to the purchaser or shall not have been in office on the formal issue date of the obligation. Every obligation, as to certificated securities, or transaction statement, as to uncertificated securities, shall be signed manually by one officer of the municipality or by a person authorized to act on behalf of a bank or trust company, located in or outside of the state, which has been designated by the governing body of the municipality to act as authenticating agent. Other signatures and the seal of the issuer may be printed, lithographed, stamped, or engraved thereon and on any interest coupons to be attached thereto. The seal need not be used. A municipality may do all acts and things which are permitted or required of issuers of securities under the Uniform Commercial Code, chapter 336, article 8, and may designate a corporate registrar to perform on behalf of the municipality the duties of a registrar as set forth in those sections. Any registrar shall be an incorporated bank or trust company, located in or outside of the state, authorized by the laws of the United States or of the state in which it is located to perform the duties. If obligations are issued as uncertificated securities, and a law requires or permits the obligations to contain a statement or recital, whether on their face or otherwise, it shall be sufficient compliance with the law that the statement or recital is contained in the transaction statement or in an ordinance, resolution, or other instrument which is made a part of the obligation by reference in the transaction statement as provided in section 336.8-202.\nInterest on obligations issued after April 1, 1986, is not subject to any limitation on rate or amount.\nThe provisions of this section shall supersede any maximum interest rate fixed by any other law or a city charter with respect to obligations of the state or any municipality or governmental or public subdivision, district, corporation, commission, board, council, or authority of whatsoever kind, including warrants or orders issued in evidence of allowed claims for property or services furnished to the issuer.\nNotwithstanding any contrary provisions of law or charter, special assessments pledged to the payment of obligations may bear interest at the rate the governing body by resolution determines, not exceeding the maximum interest rate permitted to be charged against the assessments under the city charter pursuant to which the assessments were levied.\nOn or before the 20th day of each month, the commissioner of management and budget shall determine the most recently published yield for the Bond Buyer's Index of 20 Municipals. This rate plus one percent and rounded to the next highest percent per annum shall be the rate for the next succeeding month for the purpose set forth in subdivision 7. The commissioner of management and budget shall publish the maximum rate in the State Register each month.\nMS 1986 [Repealed, 1987 c 344 s 37]\nAll information contained in any register maintained by a municipality or by a corporate registrar with respect to the ownership of municipal obligations is nonpublic data as defined in section 13.02, subdivision 9, or private data on individuals as defined in section 13.02, subdivision 12. The information is not public and is accessible only to the individual or entity that is the subject of it, except if disclosure:\n(1) is necessary for the performance of the duties of the municipality or the registrar;\n(2) is requested by an authorized representative of the state commissioner of revenue or attorney general or of the commissioner of internal revenue of the United States for the purpose of determining the applicability of a tax;\n(3) is required under section 13.03, subdivision 4; or\n(4) is requested at any time by the corporate trust department of a bank or trust company acting as a tender agent pursuant to documents executed at the time of issuance of the obligations to purchase obligations described in section 475.54, subdivision 5a, or obligations to which a tender option has been attached in connection with the performance of such person's duties as tender agent, or purchaser of the obligations.\nA municipality or its agent may use the information in a register for purposes of offering obligations under a bond reinvestment program.\nIf an obligation is not subject to a maximum interest rate pursuant to Minnesota Statutes 1986, section 475.55, subdivision 1, paragraph (1), and another law provides for a calculation of a debt service levy, determination of a rate of interest on a special assessment, or other factor based on an assumption that a maximum interest rate applies to the obligation, the governing body of the municipality may estimate or determine an assumed maximum interest rate for purposes of that law. If the municipality does not determine, specify or estimate the maximum interest rate for such purpose, then the maximum interest rate for purposes of the other law is the interest rate determined by the commissioner of management and budget under subdivision 4. This subdivision does not limit the interest rate that may be paid on obligations under subdivision 1a.\nIn connection with a bond reinvestment program, the governing body may by resolution delegate to any appropriate officer of the municipality authority to establish from time to time the interest rate or rates, subject to limitations imposed by law, on such obligations and other terms of obligations issued under a bond reinvestment program. Obligations issued under a bond reinvestment program may be in any denomination as determined by the governing body or an officer acting pursuant to delegation from the governing body.",
	"repealed": false
}