{
	"id": "65B.43",
	"url": "https://www.revisor.mn.gov/statutes/cite/65B.43",
	"title": "65B.43 DEFINITIONS.",
	"text": "The following words and phrases shall, for the purpose of sections 65B.41 to 65B.71, have the meanings ascribed to them, except where the context clearly indicates a different meaning.\n\"Motor vehicle\" means every vehicle, other than a motorcycle or other vehicle with fewer than four wheels, which (a) is required to be registered pursuant to chapter 168, and (b) is designed to be self-propelled by an engine or motor for use primarily upon public roads, highways or streets in the transportation of persons or property, and includes a trailer with one or more wheels, when the trailer is connected to or being towed by a motor vehicle.\n\"Maintenance or use of a motor vehicle\" means maintenance or use of a motor vehicle as a vehicle, including, incident to its maintenance or use as a vehicle, occupying, entering into, and alighting from it. Maintenance or use of a motor vehicle does not include (1) conduct within the course of a business of repairing, servicing, or otherwise maintaining motor vehicles unless the conduct occurs off the business premises, or (2) conduct in the course of loading and unloading the vehicle unless the conduct occurs while occupying, entering into or alighting from it.\n\"Owner\" means a person, other than a lienholder or secured party, who owns or holds legal title to a motor vehicle or is entitled to the use and possession of a motor vehicle subject to a security interest held by another person. If a motor vehicle is the subject of a lease having an initial term of six months or longer, the lessee shall be deemed the owner for the purposes of sections 65B.41 to 65B.71, and 169.09, subdivision 5a, notwithstanding the fact that the lessor retains title to the vehicle and notwithstanding the fact that the lessee may be the owner for the purposes of chapter 168A.\n\"Insured\" means an insured under a plan of reparation security as provided by sections 65B.41 to 65B.71, including the named insured and the following persons not identified by name as an insured while (a) residing in the same household with the named insured and (b) not identified by name in any other contract for a plan of reparation security complying with sections 65B.41 to 65B.71 as an insured:\n(1) a spouse,\n(2) other relative of a named insured, or\n(3) a minor in the custody of a named insured or of a relative residing in the same household with a named insured.\nA person resides in the same household with the named insured if that person's home is usually in the same family unit, even though temporarily living elsewhere.\n\"Income\" means salary, wages, tips, commissions, professional fees, and other earnings from work or tangible things of economic value produced through work in individually owned businesses, farms, ranches or other work.\n\"Loss\" means economic detriment resulting from the accident causing the injury, consisting only of medical expense, income loss, replacement services loss and, if the injury causes death, funeral expense, survivor's economic loss and survivor's replacement services loss. Noneconomic detriment is not loss; however, economic detriment is loss although caused by pain and suffering or physical or mental impairment.\n\"Noneconomic detriment\" means all dignitary losses suffered by any person as a result of injury arising out of the ownership, maintenance, or use of a motor vehicle including pain and suffering, loss of consortium, and inconvenience.\n\"Reparation obligor\" means an insurer or self-insurer obligated to provide the benefits required by sections 65B.41 to 65B.71, including natural persons, firms, partnerships, associations, corporations, governmental units, trusts and syndicates.\n\"Basic economic loss benefits\" means benefits as described in section 65B.44.\n\"Injury\" means bodily harm to a person and death resulting from such harm.\n\"Commercial vehicle\" means:\n(a) any motor vehicle used as a common carrier,\n(b) any motor vehicle, other than a passenger vehicle defined in section 168.002, subdivision 24, which has a curb weight in excess of 5,500 pounds apart from cargo capacity, or\n(c) any motor vehicle while used in the for-hire transportation of property.\nCommercial vehicle does not include a \"commuter van,\" which for purposes of this chapter means (1) a motor vehicle having a capacity of seven to 16 persons which is used principally to provide prearranged transportation of persons to or from their place of employment or to or from a transit stop authorized by a local transit authority which vehicle is to be operated by a person who does not drive the vehicle as a principal occupation but is driving it only to or from the principal place of employment, to or from a transit stop authorized by a local transit authority or, for personal use as permitted by the owner of the vehicle, or (2) a private passenger vehicle driven by a volunteer driver.\n\"Motorcycle\" means a self-propelled vehicle designed to travel on fewer than four wheels which has an engine rated at greater than five horsepower, and includes (1) a trailer with one or more wheels, when the trailer is connected to or being towed by a motorcycle; and (2) a motorized bicycle as defined in section 169.011, subdivision 45, but does not include an electric-assisted bicycle as defined in section 169.011, subdivision 27.\nExcept where otherwise indicated, \"commissioner\" means the commissioner of commerce of the state of Minnesota.\n\"Plan of reparation security\" means a contract, self-insurance, or other legal means under which there is an obligation to pay the benefits described in section 65B.49.\n\"Uninsured motor vehicle\" means a motor vehicle or motorcycle for which a plan of reparation security meeting the requirements of sections 65B.41 to 65B.71 is not in effect.\n\"Underinsured motor vehicle\" means a motor vehicle or motorcycle to which a bodily injury liability policy applies at the time of the accident but its limit for bodily injury liability is less than the amount needed to compensate the insured for actual damages.\n\"Uninsured motorist coverage\" means coverage for the protection of persons insured under that coverage who are legally entitled to recover damages for bodily injury from owners or operators of uninsured motor vehicles and hit-and-run motor vehicles.\n\"Underinsured motorist coverage\" means coverage for the protection of persons insured under that coverage who are legally entitled to recover damages for bodily injury from owners or operators of underinsured motor vehicles.\n\"Political subdivision\" means any statutory or home rule charter city; county; town; school district; or metropolitan council, board or commission operating under chapter 473.",
	"repealed": false
}