{
	"id": "122A.441",
	"url": "https://www.revisor.mn.gov/statutes/cite/122A.441",
	"title": "122A.441 SHORT-CALL SUBSTITUTE TEACHER PILOT PROGRAM.",
	"text": "(a) A school district or charter school and applicant may jointly request the Professional Educator Licensing and Standards Board approve an application for a short-call substitute teaching license. The application information must sufficiently demonstrate the following:\n(1) the applicant:\n(i) holds a minimum of an associate's degree or equivalent and has or will receive substitute training from the school district or charter school; or\n(ii) holds a minimum of a high school diploma or equivalent and has been employed as an education support personnel or paraprofessional within the district or charter school for at least one academic year; and\n(2) the school district or charter school has obtained the results of a background check completed in accordance with section 123B.03.\n(b) The Professional Educator Licensing and Standards Board may issue a temporary teaching license under this section pending a background check under section 122A.18, subdivision 8, and may immediately suspend or revoke the license upon receiving background check information. An applicant submitting an application for a short-call substitute teaching license in accordance with section 122A.18, subdivision 7a, paragraph (a), must not be required to complete a joint application with a district and must not be issued a license pending a background check under section 122A.18, subdivision 8.\n(c) The board may prioritize short-call substitute teaching license applications to expedite the review process.\n(d) A school district or charter school must provide a substitute teacher who receives a substitute teaching license through the pilot program with substitute teacher training. The board may remove a school district or charter school from the pilot program for failure to provide the required training.\n(e) A school district or charter school must not require an employee to apply for a substitute teaching license, or retaliate against an employee that does not apply for a substitute teaching license under the pilot program.\n(f) A school district or charter school must compensate an employee working as a short-call substitute teacher under the pilot program with the greater of $200 per day or the employee's regular rate of pay.\n(g) This section expires on June 30, 2025.",
	"repealed": false
}