{
	"id": "359.061",
	"url": "https://www.revisor.mn.gov/statutes/cite/359.061",
	"title": "359.061 RECORD OF COMMISSION.",
	"text": "The commission of every notary commissioned under section 359.01, together with: (1) a signature that matches the first, middle, and last name as listed on the notary's commission and shown on the notarial stamp, and (2) a sample signature in the style in which the notary will actually execute notarial acts, shall be recorded in the office of the local registrar of the notary's county of residence or in the county department to which duties relating to notaries public have been assigned under section 485.27, in a record kept for that purpose.\nThe commission of a nonresident notary must be recorded in the Minnesota county the notary designates pursuant to section 359.01, subdivision 2, clause (3), in the county department to which duties relating to notaries public have been assigned under section 485.27.\nThe court administrator, when requested, shall certify to official acts in the manner and for the fees prescribed by statute or court rule.\nThe county department, to which duties relating to notaries public have been assigned under section 485.27, shall certify to official acts under this section for the fee of $5 and in the form of:\nState of Minnesota\n.......................... County\n\"I the undersigned .........................................., in and for said county and state, do hereby certify that ..................................., whose name is subscribed to on the attached document held the office of notary public in said county and state at the date of said subscription and was authorized under the laws of this state to take acknowledgments, to administer oaths, take depositions, acknowledgments of deeds, and other written instruments, and exercise all such powers and duties authorized by the laws of Minnesota as notary public. I further certify that I have compared the subscribed signature to the signature on file in this office and believe them to be the same.\nSigned this date ................................. in the county of ......................................, state of Minnesota.\"\nSignature ................................................\nTitle ........................................................",
	"repealed": false
}