{
	"id": "428A.13",
	"url": "https://www.revisor.mn.gov/statutes/cite/428A.13",
	"title": "428A.13 ESTABLISHMENT OF HOUSING IMPROVEMENT AREA.",
	"text": "The governing body of the city may adopt an ordinance establishing one or more housing improvement areas. The ordinance must specifically describe the portion of the city to be included in the area, the basis for the imposition of the fees, and the number of years the fee will be in effect. In addition, the ordinance must include findings that without the housing improvement area, the proposed improvements could not be made by the condominium associations or housing unit owners, and the designation is needed to maintain and preserve the housing units within the housing improvement area. The ordinance shall designate the implementing entity. The ordinance may not be adopted until a public hearing has been held regarding the ordinance. The ordinance may be amended by the governing body of the city, provided the governing body complies with the public hearing notice provisions of subdivision 2. Within 30 days after adoption of the ordinance under this subdivision, the governing body shall send a copy of the ordinance to the commissioner of revenue.\nPrior to establishment of a housing improvement area, the governing body of the city must:\n(1) provide full disclosure of public expenditures, as well as the terms of any loans, bonds, or other financing arrangements for housing improvement area projects; and\n(2) determine whether the association or the implementing entity will contract for the housing improvements, and ensure that any contracts made by the implementing entity are subject to section 471.345.\nThe notice of public hearing must include the time and place of hearing, a map showing the boundaries of the proposed area, and a statement that all persons owning housing units in the proposed area that would be subject to a fee for housing improvements will be given an opportunity to be heard at the hearing. Notice of the hearing must be given by publication in the official newspaper of the city. The public hearing must be held at least seven days after the publication. Not less than ten days before the hearing, notice must also be mailed to the owner of each housing unit within the proposed area. For the purpose of giving mailed notice, owners are those shown on the records of the county auditor. Other records may be used to supply the necessary information. At the public hearing a person owning property in the proposed housing improvement area may testify on any issues relevant to the proposed area. The hearing may be adjourned from time to time. The ordinance establishing the area may be adopted at any time within six months after the date of the conclusion of the hearing by a vote of the majority of the governing body of the city.\nAt the public hearing held under subdivision 2, the proposed implementing entity shall provide a preliminary listing of the housing improvements to be made in the area. The listing shall identify those improvements, if any, that are proposed to be made to all or a portion of the common elements of a condominium. The listing shall also identify those housing units that have completed the proposed housing improvements and are proposed to be exempted from a portion of the fee. In preparing the list the proposed implementing entity shall consult with the residents of the area and the condominium associations.\nBefore the ordinance is adopted or at the hearing at which it is to be adopted, the owner of a housing unit in the proposed housing improvement area may file a written objection with the city clerk asserting that the owner's property should not be included in the area or should not be subjected to a fee and objecting to the inclusion of the housing unit in the area, for the reason that the property would not benefit from the improvements.\nThe governing body shall make a determination of the objection within 60 days of its filing. Pending its determination, the governing body may delay adoption of the ordinance or it may adopt the ordinance with a reservation that the landowner's property may be excluded from the housing improvement area or fee when the determination is made.\nWithin 30 days after the determination of the objection, any person aggrieved, who is not precluded by failure to object before or at the hearing, or whose failure to object is due to a reasonable cause, may appeal to the district court by serving a notice upon the mayor or city clerk. The notice shall be filed with the court administrator of the district court within ten days after its service. The city clerk shall furnish the appellant a certified copy of the findings and determination of the governing body. The court may affirm the action objected to or, if the appellant's objections have merit, modify or cancel it. If the appellant does not prevail upon the appeal, the costs incurred are taxed to the appellant by the court and judgment entered for them. All objections are deemed waived unless presented on appeal.",
	"repealed": false
}