{
	"id": "609.3241",
	"url": "https://www.revisor.mn.gov/statutes/cite/609.3241",
	"title": "609.3241 PENALTY ASSESSMENT AUTHORIZED.",
	"text": "(a) When a court sentences an adult convicted of violating section 609.27, 609.282, 609.283, 609.322, 609.324, 609.33, 609.352, 617.246, 617.247, or 617.293, while acting other than as a prostitute, the court shall impose an assessment of not less than $500 and not more than $750 for a misdemeanor violation of section 609.27, a violation of section 609.324, subdivision 2, a violation of section 609.33, or a violation of section 617.293; otherwise the court shall impose an assessment of not less than $750 and not more than $1,000. The assessment shall be distributed as provided in paragraph (c) and is in addition to the surcharge required by section 357.021, subdivision 6.\n(b) The court may not waive payment of the minimum assessment required by this section. If the defendant qualifies for the services of a public defender or the court finds on the record that the convicted person is indigent or that immediate payment of the assessment would create undue hardship for the convicted person or that person's immediate family, the court may reduce the amount of the minimum assessment to not less than $100. The court also may authorize payment of the assessment in installments.\n(c) The assessment collected under paragraph (a) must be distributed as follows:\n(1) 40 percent of the assessment shall be forwarded to the political subdivision that employs the arresting officer for use in enforcement, training, and education activities related to combating sexual exploitation of youth, or if the arresting officer is an employee of the state, this portion shall be forwarded to the commissioner of public safety for those purposes identified in clause (3);\n(2) 20 percent of the assessment shall be forwarded to the prosecuting agency that handled the case for use in training and education activities relating to combating sexual exploitation activities of youth; and\n(3) 40 percent of the assessment must be forwarded to the commissioner of health to be deposited in the safe harbor for youth account in the special revenue fund and are appropriated to the commissioner for distribution to crime victims services organizations that provide services to sexually exploited youth, as defined in section 260C.007, subdivision 31.\n(d) A safe harbor for youth account is established as a special account in the state treasury.",
	"repealed": false
}