{
	"id": "260C.329",
	"url": "https://www.revisor.mn.gov/statutes/cite/260C.329",
	"title": "260C.329 REESTABLISHMENT OF THE LEGAL PARENT AND CHILD RELATIONSHIP.",
	"text": "This section may be cited as the \"Family Reunification Act of 2013.\"\n\"Reestablishment of the legal parent and child relationship\" means the physical reunification of a child under the guardianship of the commissioner of children, youth, and families and a previously terminated legal parent and restoration of all rights, powers, privileges, immunities, duties, and obligations that were severed and terminated by the court under section 260C.317.\nThe county attorney, a parent whose parental rights were terminated under a previous order of the court, a child who is ten years of age or older, the responsible social services agency, or a guardian ad litem may file a petition for the reestablishment of the legal parent and child relationship. A parent filing a petition under this section shall pay a filing fee in the amount required under section 357.021, subdivision 2, clause (1). The filing fee may be waived pursuant to chapter 563. A petition for the reestablishment of the legal parent and child relationship may be filed when:\n(1) the parent has corrected the conditions that led to an order terminating parental rights;\n(2) the parent is willing and has the capability to provide day-to-day care and maintain the health, safety, and welfare of the child;\n(3) the child has been in foster care for at least 24 months after the court issued the order terminating parental rights;\n(4) the child has not been adopted; and\n(5) the child is not the subject of a written adoption placement agreement between the responsible social services agency and the prospective adoptive parent, as required under Minnesota Rules, part 9560.0060, subpart 2.\n[See Note.]\n(a) A parent's petition for reestablishment of the legal parent and child relationship shall be signed under oath by the petitioner and shall state the following:\n(1) the petitioner's full name, date of birth, address, and all other legal names or aliases by which the petitioner has been known at any time;\n(2) the name and date of birth of each child for whom reunification is sought;\n(3) the petitioner's relationship to each child for whom reunification is sought;\n(4) why reunification is sought and why reunification is in the child's best interest;\n(5) the details of the termination of parental rights for which reunification is sought, including the date and jurisdiction of the order, and the court file number and date of any prior order terminating parental rights;\n(6) what steps the petitioner has taken toward personal rehabilitation since the time of the order terminating parental rights, including treatment, work, or other personal history that demonstrates rehabilitation;\n(7) how the petitioner has corrected the conditions that led to the order terminating parental rights for which reunification is sought;\n(8) reasons why the petitioner is willing and capable to provide day-to-day care and maintain the health, safety, and welfare of the child; and\n(9) all prior requests by the petitioner, whether for the present order terminating parental rights or for any other orders terminating parental rights, whether granted or not.\n(b) Prior to filing a petition for reestablishment under this section, a parent must notify the responsible social services agency of their intent to petition for reestablishment. Notice must be provided 45 days prior to filing using a form created by the commissioner that includes the information listed in paragraph (a). The parent must file a copy of the notice with the petition for reestablishment.\nA petition for the reestablishment of the legal parent and child relationship may not be brought if the parent whose rights are the subject of the petition for reestablishment has:\n(1) previously had parental rights terminated based on a finding in a legal proceeding of either sexual abuse or other conduct that resulted in the death of a minor; or\n(2) has been convicted of any crime enumerated under section 260C.007, subdivision 14.\nMS 2018 [Repealed, 2019 c 14 s 6]\nThe petition must be filed with the court that issued the order for guardianship and legal custody and conducts the reviews required under section 260C.607.\nThe petition for the reestablishment of the legal parent and child relationship and notice of hearing on the petition must be served on:\n(1) the child;\n(2) in cases where the county attorney is the petitioning party, the parent whose rights have been terminated and with whom the legal parent and child relationship is proposed to be reestablished;\n(3) the county attorney;\n(4) the responsible social services agency;\n(5) the child's guardian ad litem; and\n(6) the child's tribe if the child is subject to the Indian Child Welfare Act.\nThe court may grant the petition ordering the reestablishment of the legal parent and child relationship only if it finds by clear and convincing evidence that:\n(1) reestablishment of the legal parent and child relationship is in the child's best interests;\n(2) the child has not been adopted;\n(3) the child is not the subject of a written adoption placement agreement between the responsible social services agency and the prospective adoptive parent, as required under Minnesota Rules, part 9560.0060, subpart 2;\n(4) at least 24 months have elapsed following a final order terminating parental rights and the child remains in foster care;\n(5) the child desires to reside with the parent;\n(6) the parent has corrected the conditions that led to an order terminating parental rights; and\n(7) the parent is willing and has the capability to provide day-to-day care and maintain the health, safety, and welfare of the child.\n[See Note.]\nThe court administrator must serve:\n(1) a copy of the final court order granting or denying the petition for the reestablishment of the legal parent and child relationship on all persons or entities entitled under subdivision 7 to service; and\n(2) a certified copy of any order for the reestablishment of the legal parent and child relationship on the commissioner of children, youth, and families.\nA petition for the reestablishment of the legal parent and child relationship made under this chapter does not provide a right to the appointment of counsel to the parent under section 260C.163, subdivision 3, or the Rules of Juvenile Protection Procedure, rule 25.02, subdivision 2.\n(a) As of the effective date of a court order providing for the reestablishment of the legal parent and child relationship:\n(1) the child is the legal child of the parent;\n(2) the parent whose rights were terminated under a previous order of the court is restored to the status of legal parent of the child and all rights, powers, privileges, immunities, duties, and obligations that were severed and terminated by the court under section 260C.317 are restored;\n(3) the order placing the child under the guardianship of the commissioner of children, youth, and families is dismissed; and\n(4) permanent legal and physical custody of the child is awarded to the parent.\n(b) An order reestablishing the legal parent and child relationship as to one parent of the child has no effect on:\n(1) the legal rights of any other parent whose rights to the child have been terminated by the court; or\n(2) the legal sibling relationship between the child and any other children of the parent.\nIf the court denies a parent's petition under this section after a hearing, the court must make a written order barring the filing of subsequent petitions by the parent. The court must provide the length of the time period the parent is barred from filing a subsequent petition, make written findings in support of the order, and evaluate the best interests of the child.",
	"repealed": false
}