{
	"id": "326.3381",
	"url": "https://www.revisor.mn.gov/statutes/cite/326.3381",
	"title": "326.3381 LICENSES.",
	"text": "No person shall engage in the business of private detective or protective agent, or advertise or indicate in any verbal statement or in written material that the person is so engaged or available to supply those services, without having first obtained a license as provided in sections 326.32 to 326.339.\nA proprietary employer is not required to obtain a license, but must comply with section 326.336, subdivision 1, with respect to the hiring of security guards.\nThe board shall issue a license upon application to any person qualified under sections 326.32 to 326.339 and under the rules of the board to engage in the business of private detective or protective agent. The license shall remain effective for two years as long as the license holder complies with sections 326.32 to 326.339, the laws of Minnesota, and the rules of the board. Upon receipt of an application for private detective or protective agent license, the board shall:\n(1) post notice of the application in its office for a period of 20 days, and notify all persons who have requested notification of applications;\n(2) conduct an investigation as it considers necessary to determine the qualifications of the applicant, qualified representative, Minnesota manager, and if appropriate, a partner or corporate officer; and\n(3) notify the applicant of the date on which the board will conduct a review of the license application.\n(a) No person is qualified to hold a license who has:\n(1) been convicted of (i) a felony by the courts of this or any other state or of the United States; (ii) acts which, if done in Minnesota, would be criminal sexual conduct; assault; theft; larceny; burglary; robbery; carjacking; unlawful entry; extortion; defamation; buying or receiving stolen property; using, possessing, manufacturing, or carrying weapons unlawfully; using, possessing, or carrying burglary tools unlawfully; escape; possession, production, sale, or distribution of narcotics unlawfully; or (iii) in any other country of acts which, if done in Minnesota, would be a felony or would be any of the other offenses provided in this clause and for which a full pardon or similar relief has not been granted;\n(2) made any false statement in an application for a license or any document required to be submitted to the board; or\n(3) failed to demonstrate to the board good character, honesty, and integrity.\n(b) Upon application for a license, the applicant shall submit, as part of the application, a full set of fingerprints and the applicant's written consent that their fingerprints shall be submitted to the Bureau of Criminal Apprehension (BCA) and the Federal Bureau of Investigation (FBI) to determine whether that person has a criminal record. The BCA shall promptly forward the fingerprints to the FBI and request that the FBI conduct a criminal history check of each prospective licensee. The Minnesota Board of Private Detective and Protective Agents Services shall determine if the FBI report indicates that the prospective licensee or licensee was convicted of a disqualifying offense. The submission to the FBI shall be coordinated through the BCA. The results of the criminal record check shall be provided to the board who will determine if the applicant is disqualified from holding a license under this subdivision.\nIf the applicant for a license is a corporation or partnership, one member of that corporation or partnership must meet the licensing requirements in sections 326.32 to 326.339.\nIf an applicant's home office is located outside of Minnesota, and the applicant establishes a Minnesota office, the applicant shall provide a manager for the Minnesota office who meets the licensing requirements in sections 326.32 to 326.339.",
	"repealed": false
}