{
	"id": "524.5-207",
	"url": "https://www.revisor.mn.gov/statutes/cite/524.5-207",
	"title": "524.5-207 POWERS AND DUTIES OF GUARDIAN.",
	"text": "A guardian of a minor has the powers and responsibilities of a parent who has not been deprived of custody of the minor and unemancipated child, except that a guardian is not legally obligated to provide from the guardian's own funds for the person subject to guardianship.\nIn particular, and without qualifying subdivision 1, a guardian has the duties and powers in this subdivision.\n(a) The guardian must take reasonable care of the personal effects of the person subject to guardianship and commence protective proceedings if necessary to protect other property of the person subject to guardianship.\n(b) The guardian may receive money payable for the support of the person subject to guardianship to the parent, guardian, or custodian of the person subject to guardianship under the terms of any statutory benefit or insurance system, or any private contract, devise, trust, conservatorship, or custodianship and also may receive money or property of the person subject to guardianship paid or delivered by virtue of section 524.5-104. Any sums received must be applied to the current needs of the person subject to guardianship for support, care, and education.\nThe guardian must exercise due care to conserve any excess for the future needs of the person subject to guardianship unless a conservator has been appointed for the estate of the person subject to guardianship, in which case the excess must be paid at least annually to the conservator. Money received by the guardian under this paragraph must not be used for compensation for the guardian's services except as approved by court order or as determined by a duly appointed conservator other than the guardian.\nA guardian may institute proceedings to compel the performance by any person of a duty to support the person subject to guardianship or to pay sums for the welfare of the person subject to guardianship.\n(c) The guardian is empowered to facilitate the education, social, or other activities of the person subject to guardianship and to authorize medical or other professional care, treatment, or advice. A person subject to guardianship who is less than 16 years of age may be admitted to a treatment facility as an informal patient according to section 253B.04 but may not be committed to any state institution except pursuant to chapter 253B. No guardian may give consent for psychosurgery, electroshock, sterilization, or experimental treatment of any kind unless the procedure is first approved by the order of the court, after a hearing as prescribed by section 524.5-313, paragraph (c), clause (4). A guardian is not liable by reason of consent for injury to the person subject to guardianship resulting from the negligence or acts of third persons unless it would have been illegal for a parent to have consented, or unless the guardian fails to comply with the requirements of this section which provide that a court order is necessary for commitment and for certain types of medical procedures. A guardian may consent to the marriage or adoption of the person subject to guardianship.\n(d) A guardian must report the condition of the person subject to guardianship and of the estate of the person subject to guardianship which has been subject to the guardian's possession or control, as ordered by the court on its own motion or on petition of any interested person and as required by court rule.\n(e) If there is no acting conservator of the estate for the person subject to guardianship, the guardian has the power to apply on behalf of the person subject to guardianship for any assistance, services, or benefits available to the person subject to guardianship through any unit of government.",
	"repealed": false
}