{
	"id": "412.591",
	"url": "https://www.revisor.mn.gov/statutes/cite/412.591",
	"title": "412.591 DUTIES OF CLERK AND TREASURER; MAY BE COMBINED.",
	"text": "The clerk shall perform all the duties imposed on the clerk in cities generally but shall not be a member of the council, except that when Optional Plan A is first adopted in any city, the incumbent clerk shall continue to be a member of the council until the expiration of the term.\nThe duties of the treasurer if that office exists shall not be affected by adoption of Optional Plan A.\nCities operating under Optional Plan A may, by an ordinance effective after the expiration of the term of the incumbent treasurer at the date of adoption of Optional Plan A, combine the offices of clerk and treasurer in the office of clerk-treasurer and thereafter the duties of the treasurer as prescribed by this chapter shall be performed by the clerk-treasurer. The offices of clerk and treasurer may be reestablished by ordinance.\n(a) If the offices of clerk and treasurer are combined as provided by this section, and the city's annual revenue for all governmental and enterprise funds combined is more than the amount in paragraph (b), the council shall provide for an annual audit of the city's financial affairs by the state auditor or a certified public accountant in accordance with minimum procedures prescribed by the state auditor. If the offices of clerk and treasurer are combined and the city's annual revenue for all governmental and enterprise funds combined is the amount in paragraph (b), or less, the council shall provide for an audit of the city's financial affairs by the state auditor or a certified public accountant in accordance with minimum audit procedures prescribed by the state auditor at least once every five years, which audit shall be for a one-year period to be determined at random by the person conducting the audit.\n(b) For the purposes of paragraph (a), the amount in 2004 is $150,000, and in 2005 and after, $150,000 adjusted for inflation using the annual implicit price deflator for state and local expenditures as published by the United States Department of Commerce.",
	"repealed": false
}