{
	"id": "298.39",
	"url": "https://www.revisor.mn.gov/statutes/cite/298.39",
	"title": "298.39 DISTRIBUTION OF PROCEEDS.",
	"text": "The proceeds of the tax collected under section 298.35 shall be distributed by the commissioner of management and budget, upon certificate of the commissioner of revenue to the general fund of the state and to the various taxing districts in which the lands from which the semitaconite was mined or quarried were located in the following proportions: 22 percent thereof to the city or town; 50 percent thereof to the school district; 22 percent thereof to the county; six percent thereof to the state. If the mining and concentration, or different steps in either thereof are carried on in more than one taxing district, the commissioner shall apportion equitably the proceeds of the part of the tax going to cities or towns among such subdivisions, and the part going to school districts among such districts, and the part going to counties among such counties, upon the basis of attributing 40 percent of the proceeds of the tax to the operation of mining or quarrying the semitaconite, and the remainder to the concentrating plant and to the processes of concentration, and with respect to each thereof giving due consideration to the relative extent of such operations performed in each such taxing district. The commissioner's order making such apportionment shall be subject to review by the Tax Court at the instance of any of the interested taxing districts, in the same manner as other orders of the commissioner. The amount so distributed shall be divided among the various funds of the state, or of the taxing districts in the same proportion as the general ad valorem tax thereof. If in any year the state shall not spread any general ad valorem tax levy against real property, the state's proportion of the tax shall be paid into the general fund. On or before October 10 of each calendar year each producer of semitaconite subject to taxation under section 298.35, hereinafter called \"taxpayer,\" shall file with the commissioner of revenue and with the county auditor of each county in which such taxpayer operates, and with the chief clerical officer of each school district or city which is entitled to participate in the distribution of the tax, an estimate of the amount of tax which would be payable by such taxpayer under said law for such calendar year; provided such estimate shall be in an amount not less than the amount due on the mining and production of concentrates up to September 30 of said year plus the amount becoming due because of probable production between September 30 and December 31 of said year, less any credit allowable as hereinafter provided. Such estimate shall list the taxing districts entitled to participate in the distribution of such tax, and the amount of the estimated tax which would be distributable to each such district in such next ensuing calendar year on the basis of the last percentage distribution certified by the commissioner of revenue. If there be no such prior certification, the taxpayer shall set forth its estimate of the proper distribution of such tax under the law, which estimate may be corrected by the commissioner on deeming it improper, notice of such correction being given by the commissioner to the taxpayer and the public officers receiving such estimate. The officers with whom such report is so filed shall use the amount so indicated as being distributable to each taxing district in computing the permissible tax levy of such city in the year in which such estimate is made, and payable in the next ensuing calendar year. Such taxpayer shall then pay, at the times payments are required to be made pursuant to section 298.36, as the amount of tax payable under section 298.35, the greater of (a) the amount shown by such estimate, or (b) the amount due under said section as finally determined by the commissioner of revenue pursuant to law. If, as a result of the payment of the amount of such estimate, the taxpayer has paid in any calendar year an amount of tax in excess of the amount due in such year under section 298.35, after application of credits for any excess payments made in previous years, all as determined by the commissioner of revenue, the taxpayer shall be given credit for such excess amount against any taxes which, under said section, may become due from the taxpayer in subsequent years. In any calendar year in which a general property tax levy subject to chapter 123A, 123B, or 126C has been made, if the taxes distributable to any such city or school district are greater than the amount estimated to be paid to any such city or school district in such year, the excess of such distribution shall be held in a special fund by the city or school district and shall not be expended until the succeeding calendar year, and shall be included in computing the permissible levies under chapter 123A, 123B, or 126C of such city or school district payable in such year. If the amounts distributable to any such city or school district, after final determination by the commissioner of revenue under this section are less than the amounts indicated by such estimates, such city or school district may issue certificates of indebtedness in the amount of the shortage, and may include in its next tax levy, in excess of the limitations of chapters 123A, 123B, and 126C an amount sufficient to pay such certificates of indebtedness and interest thereon, or, if no certificates were issued, an amount equal to such shortage.\nThere is hereby appropriated to such taxing districts as are stated herein, from any fund or account in the state treasury to which the money was credited, an amount sufficient to make the payment or transfer.",
	"repealed": false
}