{
	"id": "354B.20",
	"url": "https://www.revisor.mn.gov/statutes/cite/354B.20",
	"title": "354B.20 DEFINITIONS.",
	"text": "Unless the content or subject matter indicates otherwise, as used in this chapter the terms in this section have the meanings given them.\n\"Board\" means the Board of Trustees of the Minnesota State Colleges and Universities.\n\"Chancellor\" means the chancellor of the board.\n\"Covered employment\" means employment by an employee in the fiscal year in which the employee first attains eligible employee status, as determined under section 354B.211, subdivision 1, and thereafter all employment by that individual in an eligible unclassified administrative position as defined in subdivision 6 or in an eligible unclassified faculty position as defined in subdivision 6a.\n(a) \"Covered salary\" means the periodic compensation paid to the participant before deductions for deferred compensation, supplemental retirement coverage, or other voluntary salary reduction program.\n(b) \"Covered salary\" does not mean lump-sum sick leave payments, severance payments, payments in lieu of employer-paid group insurance coverage, payments based on differences between single employer-paid group insurance coverage and insurance coverage including dependents, or workers' compensation payment.\n\"Eligible unclassified administrative position\" means the following:\n(1) the chancellor of the board;\n(2) a president of a state college or university;\n(3) an administrator employed in a state university or college, by the board, or by the Minnesota Office of Higher Education; or\n(4) other managers and professionals in academic and academic support programs in the unclassified service employed in a state university or college, by the board, or by the Minnesota Office of Higher Education.\n\"Eligible unclassified faculty position\" means employment by an employing unit in:\n(1) a classification under section 179A.10, subdivision 2, included in the:\n(i) state university instructional unit;\n(ii) state university administrative unit; or\n(iii) state college instructional unit; or\n(2) an employment position that meets the definition of \"teacher\" under section 354.05, subdivision 2, or 354A.011, subdivision 27.\n\"Employing unit,\" if the agency employs any persons covered by the individual retirement account plan under section 354B.211, means:\n(1) the board;\n(2) the Minnesota Office of Higher Education; and\n(3) the Higher Education Facilities Authority.\nMS 2018 [Repealed, 1Sp2019 c 8 art 5 s 15]\n\"First class city teacher retirement fund association\" means a retirement plan, fund, and plan administration established under chapter 354A.\n\"General state employees retirement plan\" means the retirement plan administered by the Minnesota State Retirement System and governed by sections 352.01 to 352.27.\n\"IRAP to TRA transfer account\" means the account established under section 354B.215, subdivision 11.\n\"Board of Trustees of the Minnesota State Colleges and Universities\" means the governing board for the state universities, the community colleges, and the technical colleges established by section 136F.02.\n\"Offset amount\" means the lesser of $10,000 or 25 percent of the cost to purchase the maximum past service credit by an eligible person under section 354B.215, subdivision 6, except that, if the eligible person elects to purchase, under section 354B.215, subdivision 6, paragraph (c), less than the maximum past service credit, the offset amount must not exceed the cost to purchase the amount of past service credit elected.\n\"Participant\" means a person who is employed in covered employment by the board and who elects coverage by the plan under section 354B.211.\n\"Plan\" means the individual retirement account plan established by this chapter.\n\"Plan administrator\" means the board employee or an independent contract agent designated by the board to perform the primary administrative functions relating to the plan.\n\"Sabbatical leave\" means a sabbatical leave as specified in the applicable collective bargaining agreement or personnel policy of the board for its employees.\n\"State unclassified employees retirement program\" means the retirement program established by chapter 352D.\n\"Supplemental plan\" means the retirement program established by chapter 354C.\n\"Teachers Retirement Association\" means the retirement plan established by chapter 354.\n\"Unclaimed plan account amounts\" means the accounts of any plan participant who has terminated employment by the Minnesota State Colleges and Universities System or who has died, or of the surviving spouse, beneficiary, or estate of the participant if the plan administrator is unable to locate the applicable recipient in accordance with Internal Revenue Service due diligence requirements.",
	"repealed": false
}