{
	"id": "197.236",
	"url": "https://www.revisor.mn.gov/statutes/cite/197.236",
	"title": "197.236 STATE VETERANS CEMETERIES.",
	"text": "[Repealed, 1999 c 86 art 2 s 6]\n[Repealed, 1999 c 86 art 2 s 6]\nThe commissioner of veterans affairs shall supervise and control the veterans cemeteries established under this section. The cemeteries are to be maintained and operated in accordance with the operational standards and measures of the National Cemetery Administration. The commissioner may contract for the maintenance of the cemeteries. All personnel, equipment, and support necessary for maintenance and operation of the cemeteries must be included in the department's budget.\n[Repealed, 2004 c 256 art 2 s 5]\nThe commissioner of veterans affairs may adopt rules regarding the operation of the cemeteries. The commissioner shall require that upright granite markers supplied by the United States Department of Veterans Affairs be used to mark all gravesites.\nA veterans cemetery development and maintenance account is established in the special revenue fund of the state treasury. Receipts for burial fees, plot or interment allowance claims, designated appropriations, and any other cemetery receipts must be deposited into this account. The money in the account, including interest earned, is appropriated to the commissioner to be used for the development, operation, maintenance, and improvement of the cemeteries. To the extent practicable, the commissioner of veterans affairs must apply for available federal grants to establish, expand, or improve the cemeteries.\n[Repealed, 2008 c 297 art 2 s 13,30]\nCemeteries must be operated solely for the burial of service members who die on active duty, eligible veterans, and their spouses and dependent children, as defined in United States Code, title 38, section 101, paragraph (2).\n(a) The commissioner of veterans affairs shall establish a fee schedule, which may be adjusted from time to time, for the interment of eligible spouses and dependent children. The fees shall cover as nearly as practicable the actual costs of interment, excluding the value of the plot.\n(b) Upon application, the commissioner may waive or reduce the burial fee for an indigent eligible person. The commissioner shall develop a policy, eligibility standards, and application form for requests to waive or reduce the burial fee to indigent eligible applicants.\n(c) No plot or interment fees may be charged for the burial of service members who die on active duty or eligible veterans, as defined in United States Code, title 38, section 101, paragraph (2).\n[Repealed, 2008 c 297 art 2 s 13,30]\nThe commissioner of veterans affairs must apply to the Veterans Benefits Administration for a plot or interment allowance payable to the state for expenses incurred by the state in the burial of eligible veterans in cemeteries owned and operated by the state if the burial is performed at no cost to the veteran's next of kin.\nNo staff may be hired for any new veterans cemetery without explicit legislative approval.",
	"repealed": false
}