{
	"id": "268.042",
	"url": "https://www.revisor.mn.gov/statutes/cite/268.042",
	"title": "268.042 EMPLOYERS COVERAGE.",
	"text": "(a) Each employer must, upon or before the submission of its first wage detail report under section 268.044, register with the commissioner for a tax account or a reimbursable account, by electronic transmission in a format prescribed by the commissioner. The employer must provide all required information for registration, including the actual physical street and city address of the employer.\n(b) Within 30 calendar days, each employer must notify the commissioner by electronic transmission, in a format prescribed, of a change in legal entity, of the transfer, sale, or acquisition of a business conducted in Minnesota, in whole or in part, if the transaction results in the creation of a new or different employer or affects the establishment of employer accounts, the assignment of tax rates, or the transfer of experience rating history.\n(c) Except as provided in subdivision 3, any person that is or becomes an employer with covered employment within any calendar year is subject to this chapter the entire calendar year.\n(d) Within 30 calendar days of the termination of business, an employer that has been assigned a tax account or reimbursable account must notify the commissioner by electronic transmission, in a format prescribed by the commissioner, if that employer does not intend or expect to pay wages to any employees in covered employment during the current or the next calendar year. Upon notification, the employer is no longer required to file wage detail reports under section 268.044, subdivision 1, paragraph (d), and the employer's account must be terminated.\n(e) An employer that has its account terminated regains its previous tax account under section 268.045, with the experience rating history of that account, if the employer again commences business and again pays wages in covered employment if:\n(1) less than 14 calendar quarters have elapsed in which no wages were paid for covered employment;\n(2) the experience rating history regained contains taxable wages; and\n(3) the experience rating history has not been transferred to a successor under section 268.051, subdivision 4.\n[Repealed, 1998 c 265 s 46]\n(a) Any employer that has employment performed for it that is noncovered employment under section 268.035, subdivision 20, may file with the commissioner, by electronic transmission in a format prescribed by the commissioner, an election that all employees in that class of employment, in one or more distinct establishments or places of business, is considered covered employment for not less than two calendar years. The commissioner has discretion on the approval of any election. Upon the approval of the commissioner, sent by mail or electronic transmission, the employment constitutes covered employment beginning the calendar quarter after the date of approval or beginning a later calendar quarter if requested by the employer. The employment ceases to be considered covered employment as of the first day of January of any calendar year only if at least 30 calendar days before the first day of January the employer has filed with the commissioner, by electronic transmission in a format prescribed by the commissioner, a notice to that effect.\n(b) The commissioner must terminate any election agreement under this subdivision upon 30 calendar days' notice sent by mail or electronic transmission, if the employer is delinquent on any taxes due or reimbursements due the trust fund.\n[Repealed, 1Sp2015 c 1 art 6 s 18]",
	"repealed": false
}