{
	"id": "97C.025",
	"url": "https://www.revisor.mn.gov/statutes/cite/97C.025",
	"title": "97C.025 FISHING AND MOTORBOATS RESTRICTED IN CERTAIN AREAS.",
	"text": "(a) The commissioner may prohibit or restrict the taking of fish or the operation of motorboats by posting waters that:\n(1) are designated as spawning beds or fish preserves;\n(2) are being used by the commissioner for fisheries research or management activities; or\n(3) are licensed by the commissioner as a private fish hatchery or aquatic farm under section 17.4984, subdivision 1, or 97C.211, subdivision 1.\nAn area may be posted under this paragraph if necessary to prevent excessive depletion of fish or interference with fisheries research or management activities or private fish hatchery or aquatic farm operations.\n(b) The commissioner will consider the following criteria in determining if waters licensed under a private fish hatchery or aquatic farm should be posted under paragraph (a):\n(1) the waters contain game fish brood stock or native rough fish brood stock and the brood stock is vital to the private fish hatchery or aquatic farm operation;\n(2) game fish or native rough fish are present in the licensed waters only as a result of aquaculture activities by the licensee; and\n(3) no public access to the waters existed when the waters were first licensed.\n(c) A private fish hatchery or aquatic farm licensee may not take fish or authorize others to take fish in licensed waters that are posted under paragraph (a), except as provided in section 17.4983, subdivision 3, and except that if waters are posted to allow the taking of fish under special restrictions, licensees and others who can legally access the waters may take fish under those special restrictions.\n(d) Before March 1, 2003, riparian landowners adjacent to licensed waters on April 30, 2002, and riparian landowners who own land adjacent to waters licensed after April 30, 2002, on the date the waters become licensed waters, plus their children and grandchildren, may take two daily limits of fish per month under an angling license subject to the other limits and conditions in the game and fish laws.\n(e) Except as provided in paragraphs (c), (d), and (f), a person may not take fish or operate a motorboat if prohibited by posting under paragraph (a).\n(f) An owner of riparian land adjacent to an area posted under paragraph (a) may operate a motorboat through the area by the shortest direct route at a speed of not more than five miles per hour.\n(g) Postings for water bodies designated under paragraph (a), clause (1), or being used for fisheries research or management under paragraph (a), clause (2), are not subject to the rulemaking provisions of chapter 14, and section 14.386 does not apply.",
	"repealed": false
}