{
	"id": "289A.121",
	"url": "https://www.revisor.mn.gov/statutes/cite/289A.121",
	"title": "289A.121 TAX SHELTERS; SPECIAL RULES.",
	"text": "The provisions of this section apply to a tax shelter that:\n(1) is organized in this state;\n(2) is doing business in this state;\n(3) is deriving income from sources in this state; or\n(4) has one or more investors that are Minnesota taxpayers under chapter 290.\n(a) For purposes of this section, the definitions under sections 6111, 6112, and 6707A of the Internal Revenue Code, including the regulations under those sections, apply.\n(b) The term \"tax shelter\" means any reportable transaction as defined under section 6707A(c)(1) of the Internal Revenue Code.\n(a) Any material advisor required to register a tax shelter under section 6111 of the Internal Revenue Code must register the shelter with the commissioner.\n(b) A material advisor subject to this subdivision must send a duplicate of the federal registration information, along with any other information the commissioner requires, to the commissioner not later than the day on which interests in that tax shelter are first offered for sale to Minnesota taxpayers.\n(c) In addition to the requirements under paragraph (b), any listed transaction must be registered with the commissioner by the latest of:\n(1) 60 days after entering into the transaction;\n(2) 60 days after the transaction becomes a listed transaction; or\n(3) October 15, 2005.\n(a) Any person required to register under section 6111 of the Internal Revenue Code who receives a tax registration number from the Secretary of the Treasury must file, within 30 days after requested by the commissioner, a statement of the registration number with the commissioner.\n(b) Any person who sells or otherwise transfers an interest in a tax shelter must, in the same time and manner required under section 6111(b) of the Internal Revenue Code, furnish to each investor who purchases or otherwise acquires an interest in the tax shelter the identification number assigned under federal law to the tax shelter.\n(c) Any person claiming any deduction, credit, or other tax benefit by reason of a tax shelter must include on the return on which the deduction, credit, or other benefit is claimed the identification number assigned under federal law to the tax shelter.\n(a) For each taxable year in which a taxpayer must make a return or a statement under Code of Federal Regulations, title 26, section 1.6011-4, for a reportable transaction, including a listed transaction, in which the taxpayer participated in a taxable year for which a return is required under chapter 290, the taxpayer must file a copy of the disclosure with the commissioner.\n(b) Any taxpayer that is a member of a unitary business group that includes any person that must make a disclosure statement under Code of Federal Regulations, title 26, section 1.6011-4, must file a disclosure under this subdivision.\n(c) Disclosure under this subdivision is required for any transaction entered into after December 31, 2001, that the Internal Revenue Service determines is a listed transaction at any time, and must be made in the manner prescribed by the commissioner. With respect to transactions in which the taxpayer participated for taxable years ending on and after December 31, 2005, disclosure must be made in the time and manner prescribed in Code of Federal Regulations, title 26, section 1.6011-4(e).\n(a) Any person required to maintain a list under section 6112 of the Internal Revenue Code with respect to any reportable transaction must furnish the list to the commissioner no later than when required under federal law. The list required under this subdivision must include the same information required with respect to a reportable transaction under section 6112 of the Internal Revenue Code, and any other information the commissioner requires.\n(b) For transactions entered into on or after December 31, 2001, that become listed transactions at any time, the list must be furnished to the commissioner by the latest of:\n(1) 60 days after entering into the transaction; or\n(2) 60 days after the transaction becomes a listed transaction.",
	"repealed": false
}