{
	"id": "62Q.451",
	"url": "https://www.revisor.mn.gov/statutes/cite/62Q.451",
	"title": "62Q.451 UNRESTRICTED ACCESS TO SERVICES FOR THE DIAGNOSIS, MONITORING, AND TREATMENT OF RARE DISEASES.",
	"text": "(a) For purposes of this section, the following terms have the meanings given.\n(b) \"Rare disease or condition\" means any disease or condition:\n(1) that affects fewer than 200,000 persons in the United States and is chronic, serious, life-altering, or life-threatening;\n(2) that affects more than 200,000 persons in the United States and a drug for treatment has been designated as a drug for a rare disease or condition pursuant to United States Code, title 21, section 360bb;\n(3) that is labeled as a rare disease or condition on the Genetic and Rare Diseases Information Center list created by the National Institutes of Health; or\n(4) for which an enrollee:\n(i) has received two or more clinical consultations from a primary care provider or specialty provider that are specific to the presenting complaint;\n(ii) has documentation in the enrollee's medical record of a developmental delay through standardized assessment, developmental regression, failure to thrive, or progressive multisystemic involvement; and\n(iii) had laboratory or clinical testing that failed to provide a definitive diagnosis or resulted in conflicting diagnoses.\nA rare disease or condition does not include an infectious disease that has widely available and known protocols for diagnosis and treatment and that is commonly treated in a primary care setting, even if it affects less than 200,000 persons in the United States.\n(a) No health plan company may restrict the choice of an enrollee as to where the enrollee receives services from a licensed health care provider related to the diagnosis, monitoring, and treatment of a rare disease or condition, including but not limited to additional restrictions through any prior authorization, preauthorization, prior approval, precertification process, increased fees, or other methods.\n(b) Any services provided by, referred for, or ordered by an out-of-network provider for an enrollee who, before receiving and being notified of a definitive diagnosis, satisfied the requirements in subdivision 1, paragraph (b), clause (4), are governed by paragraph (c), even if the subsequent definitive diagnosis does not meet the definition of rare disease or condition in subdivision 1, paragraph (b), clause (1), (2), or (3). Once the enrollee is definitively diagnosed with a disease or condition that does not meet the definition of rare disease or condition in subdivision 1, paragraph (b), clause (1), (2), or (3), and notification of the diagnosis has been provided to both the health plan and the enrollee, or a parent or guardian of a minor enrollee, any services provided by, referred for, or ordered by an out-of-network provider related to the diagnosis are governed by paragraph (c) for up to 60 days, providing time for care to be transferred to a qualified in-network provider and to schedule needed in-network appointments. After this 60-day period, subsequent services provided by, referred for, or ordered by an out-of-network provider related to the diagnosis are no longer governed by paragraph (c).\n(c) Cost-sharing requirements and benefit or services limitations for the diagnosis and treatment of a rare disease or condition must not place a greater financial burden on the enrollee or be more restrictive than those requirements for in-network medical treatment.\n(d) A health plan company must provide enrollees with written information on the content and application of this section and must train customer service representatives on the content and application of this section.\n(a) Nothing in this section requires a health plan company to provide coverage for a medication, procedure or treatment, or laboratory or clinical testing, that is not covered under the enrollee's health plan.\n(b) Coverage for a service must not be denied solely on the basis that it was provided by, referred for, or ordered by an out-of-network provider.\n(c) Any prior authorization requirements for a service that is provided by, referred for, or ordered by an out-of-network provider must be the same as any prior authorization requirements for a service that is provided by, referred for, or ordered by an in-network provider.\n(d) Subject to the requirements of this section and chapter 62W, a health plan may require use of a specialty pharmacy, as defined in section 62W.02, subdivision 20.\n(a) If a health plan company has an established contractual payment under a health plan in the commercial insurance market with an out-of-network provider for a service provided in Minnesota related to the diagnosis, monitoring, and treatment of a rare disease or condition, across any of the health plan's networks, then the provider shall accept the established contractual payment for that service as payment in full.\n(b) If a health plan company does not have an established contractual payment under a health plan in the commercial insurance market with an out-of-network provider for a service provided in Minnesota related to the diagnosis, monitoring, and treatment of a rare disease or condition, across any of the health plan's networks, then the provider shall accept:\n(1) the provider's established rate for uninsured patients for that service as payment in full; or\n(2) if the provider does not have an established rate for uninsured patients for that service, then the average commercial insurance rate the health plan company has paid for that service in this state over the past 12 months as payment in full.\n(c) If the payment amount is determined under paragraph (b), clause (2), and the health plan company has not paid for that service in this state within the past 12 months, then the health plan company shall pay the lesser of the following:\n(1) the average rate in the commercial insurance market the health plan company paid for that service across all states over the past 12 months; or\n(2) the provider's standard charge.\n(d) This subdivision does not apply to managed care organizations or county-based purchasing plans when the plan provides coverage to public health care program enrollees under chapters 256B or 256L.\n(a) If a health plan company has an established contractual payment under a health plan in the commercial insurance market with an out-of-network provider for a service provided in another state related to the diagnosis, monitoring, and treatment of a rare disease or condition, across any of the health plan's networks in the state where the service is provided, then the health plan company shall pay the established contractual payment for that service.\n(b) If a health plan company does not have an established contractual payment under a health plan in the commercial insurance market with an out-of-network provider for a service provided in another state related to the diagnosis, monitoring, and treatment of a rare disease or condition, across any of the health plan's networks in the state where the service is provided, then the health plan company shall pay:\n(1) the provider's established rate for uninsured patients for that service; or\n(2) if the provider does not have an established rate for uninsured patients for that service, then the average commercial insurance rate the health plan company has paid for that service in the state where the service is provided over the past 12 months.\n(c) If the payment amount is determined under paragraph (b), clause (2), and the health plan company has not paid for that service in the state where the service is provided within the past 12 months, then the health plan company shall pay the lesser of the following:\n(1) the average commercial insurance rate the health plan company has paid for that service across all states over the last 12 months; or\n(2) the provider's standard charge.\n(d) This subdivision does not apply to managed care organizations or county-based purchasing plans when the plan provides coverage to public health care program enrollees under chapter 256B or 256L.\nThis section does not apply to medications obtained from a retail pharmacy as defined in section 62W.02, subdivision 18.",
	"repealed": false
}