{
	"id": "103B.313",
	"url": "https://www.revisor.mn.gov/statutes/cite/103B.313",
	"title": "103B.313 PLAN DEVELOPMENT.",
	"text": "The local water management plan authority shall send a notice to local government units partially or wholly within the planning jurisdiction, adjacent counties, and state review agencies of their intent to revise the local water management plan. The notice of a plan revision must include an invitation for all recipients to submit priority concerns they wish to see the plan address.\nLocal governments and state review agencies must submit the priority concerns they want the plan to address to the plan authority within 45 days of receiving the notice defined in subdivision 1 or within an otherwise agreed-upon time frame.\nBefore submitting the priority concerns scoping document to the board, the plan authority shall publish a legal notice for and conduct a public information meeting.\nThe plan authority shall send the scoping document to all state review agencies for review and comment. State review agencies shall provide comments on the plan outline to the board within 30 days of receipt.\nThe board shall review the scoping document and the comments submitted in accordance with this subdivision. The board shall provide comments to the local plan authority within 60 days of receiving the scoping document, or after the next regularly scheduled board meeting, whichever is later. No local water management plan may be approved pursuant to section 103B.315 without addressing items communicated in the board comments to the plan authority. The plan authority may request that resolution of unresolved issues be addressed pursuant to board policy defined in section 103B.345.\nThe state review agencies shall, upon request from the local government, provide existing plans, reports, and data analysis related to priority concerns to the plan author within 60 days from the date of the request or within an otherwise agreed-upon time frame.",
	"repealed": false
}