{
	"id": "508.23",
	"url": "https://www.revisor.mn.gov/statutes/cite/508.23",
	"title": "508.23 CONTENTS OF DECREE; COPY FILED.",
	"text": "Every decree of registration shall bear the date, hour, and minute of its entry and be signed by one of the judges of the district court. It shall state whether the owner is 18 years of age or older, and whether married, or unmarried, and, if married, the name of the spouse; if the owner of the land is under any legal incapacity, it shall state the nature thereof. It shall contain an accurate description of the land as finally determined by the court, and set forth the estate of the owner and also, in such manner as to show their relative priority, all particular estates, mortgages, easements, liens, attachments, and other encumbrances, including spousal rights, if any, to which the land or the owner's estate is subject, and any other facts properly to be determined by the court. Immediately upon the filing of the decree of registration, the court administrator shall file a certified copy thereof with the registrar.\nIf one or more boundary lines are judicially determined, the land description in the decree of registration shall make reference to that fact and to the location of the judicial landmarks that mark the boundary lines. When any of the boundary lines are registered, the court administrator also shall file with the registrar a certified copy of the plat of the survey which contains a certification by a licensed land surveyor that the boundaries registered have been marked by judicial landmarks set pursuant to the order of the court. The registrar of titles shall enter the certified copy of the plat of the survey as a memorial upon the certificate of title issued for the land registered by the decree. If any of the adjoining lands are registered, the decree of registration shall direct the registrar of titles to show by memorial upon the certificates of title for the adjoining lands which of the boundary lines of these lands have been determined in the district court case.\nWhen a decree of registration is entered for an appurtenant easement only, it shall include the description and certificate of title number of the fee simple estate to which it is appurtenant. The registrar of titles shall not issue a separate certificate of title for the easement, but shall enter the easement as a memorial upon the certificate of title issued for the designated fee simple estate. Upon the issuance of a new certificate of title for such fee simple estate, the registrar of titles shall omit the memorial of the easement and place the easement in the new certificate of title immediately following the description of the fee simple estate to which the easement is appurtenant.",
	"repealed": false
}