{
	"id": "62J.844",
	"url": "https://www.revisor.mn.gov/statutes/cite/62J.844",
	"title": "62J.844 ENFORCEMENT.",
	"text": "(a) The commissioner of health shall notify the manufacturer of a generic or off-patent drug and the attorney general of any price increase that the commissioner believes may violate section 62J.842.\n(b) The commissioner of management and budget and any other state agency that provides or purchases a pharmacy benefit except the Department of Human Services, and any entity under contract with a state agency to provide a pharmacy benefit other than an entity under contract with the Department of Human Services, may notify the manufacturer of a generic or off-patent drug and the attorney general of any price increase that the commissioner or entity believes may violate section 62J.842.\n(a) Within 45 days of receiving a notice under subdivision 1, the manufacturer of the generic or off-patent drug shall submit a drug cost statement to the attorney general. The statement must:\n(1) itemize the cost components related to production of the drug;\n(2) identify the circumstances and timing of any increase in materials or manufacturing costs that caused any increase during the preceding calendar year, or preceding three calendar years as applicable, in the price of the drug; and\n(3) provide any other information that the manufacturer believes to be relevant to a determination of whether a violation of section 62J.842 has occurred.\n(b) The attorney general may investigate whether a violation of section 62J.842 has occurred, in accordance with section 8.31, subdivision 2.\n(a) On petition of the attorney general, a court may issue an order:\n(1) compelling the manufacturer of a generic or off-patent drug to:\n(i) provide the drug cost statement required under subdivision 2, paragraph (a); and\n(ii) answer interrogatories, produce records or documents, or be examined under oath, as required by the attorney general under subdivision 2, paragraph (b);\n(2) restraining or enjoining a violation of sections 62J.841 to 62J.845, including issuing an order requiring that drug prices be restored to levels that comply with section 62J.842;\n(3) requiring the manufacturer to provide an accounting to the attorney general of all revenues resulting from a violation of section 62J.842;\n(4) requiring the manufacturer to repay to all Minnesota consumers, including any third-party payers, any money acquired as a result of a price increase that violates section 62J.842;\n(5) notwithstanding section 16A.151, requiring that all revenues generated from a violation of section 62J.842 be remitted to the state and deposited into a special fund, to be used for initiatives to reduce the cost to consumers of acquiring prescription drugs, if a manufacturer is unable to determine the individual transactions necessary to provide the repayments described in clause (4);\n(6) imposing a civil penalty of up to $10,000 per day for each violation of section 62J.842;\n(7) providing for the attorney general's recovery of costs and disbursements incurred in bringing an action against a manufacturer found in violation of section 62J.842, including the costs of investigation and reasonable attorney's fees; and\n(8) providing any other appropriate relief, including any other equitable relief as determined by the court.\n(b) For purposes of paragraph (a), clause (6), every individual transaction in violation of section 62J.842 is considered a separate violation.\nAny action brought pursuant to section 8.31, subdivision 3a, by a person injured by a violation of section 62J.842 is for the benefit of the public.",
	"repealed": false
}