{
	"id": "442A.15",
	"url": "https://www.revisor.mn.gov/statutes/cite/442A.15",
	"title": "442A.15 BOARD ORGANIZATION AND PROCEDURES.",
	"text": "As soon as practicable after the election of the first board members of a district, the board shall meet at the call of the temporary chair to elect officers and take other appropriate action for organization and administration of the district. Each board shall hold a regular annual meeting at the call of the chair or otherwise as the board prescribes on or as soon as practicable after the first business day in January of each year and such other regular and special meetings as the board prescribes.\nThe officers of each district shall be a chair and a vice-chair, who shall be members of the board, and a secretary and a treasurer, who may but need not be members of the board. The board of a new district at its initial meeting or as soon thereafter as practicable shall elect the officers to serve until the first business day in January next following. Thereafter, the board shall elect the officers at each regular annual meeting for terms expiring on the first business day in January next following. Each officer serves until a successor is elected and has qualified.\nThe board at its initial meeting or as soon thereafter as practicable shall provide for suitable places for board meetings and for offices of the district officers and may change the same thereafter as the board deems advisable. The meeting place and offices may be the same as those of any related governing body, with the approval of the body. The secretary of the board shall notify the secretary of state, the county auditor of each county wherein any part of the district is situated, and the clerk or recorder of each related governing body of the locations and post office addresses of the meeting place and offices and any changes therein.\nAt any time before the proceeds of the first tax levy in a district become available, the district board may prepare a budget comprising an estimate of the expenses of organizing and administering the district until the proceeds are available, with a proposal for apportionment of the estimated amount among the related governmental subdivisions, and may request the governing bodies thereof to advance funds according to the proposal. The governing bodies may authorize advancement of the requested amounts, or such part thereof as they respectively deem proper, from any funds available in their respective treasuries. The board shall include in its first tax levy after receipt of any such advancements a sufficient sum to cover the same and shall cause the same to be repaid, without interest, from the proceeds of taxes as soon as received.",
	"repealed": false
}