{
	"id": "18B.37",
	"url": "https://www.revisor.mn.gov/statutes/cite/18B.37",
	"title": "18B.37 RECORDS; PLANS; INSPECTIONS.",
	"text": "(a) A pesticide dealer must maintain records of all sales of restricted use pesticides as required by the commissioner. Records must be kept at the time of sale on forms supplied by the commissioner or on the pesticide dealer's forms if they are approved by the commissioner.\n(b) Records must be submitted upon request of the commissioner.\n(c) Copies of records required under this subdivision must be maintained by the pesticide dealer for a period of five years after the date of the pesticide sale.\n(a) A commercial or noncommercial applicator or the applicator's authorized agent must maintain a record of pesticides used on each site. Noncommercial applicators must keep records of restricted use pesticides. The record must include the:\n(1) date of the pesticide use;\n(2) time the pesticide application was completed;\n(3) brand name of the pesticide, the United States Environmental Protection Agency registration number, and rate used;\n(4) number of units treated;\n(5) temperature, wind speed, and wind direction;\n(6) location of the site where the pesticide was applied;\n(7) name and address of the customer;\n(8) name of applicator, name of company, license number of applicator, and address of applicator company; and\n(9) any other information required by the commissioner.\n(b) Portions of records not relevant to a specific type of application may be omitted upon approval from the commissioner.\n(c) All information for this record requirement must be contained in a document for each pesticide application, except a map may be attached to identify treated areas. An invoice containing the required information may constitute the required record. The commissioner shall make sample forms available to meet the requirements of this paragraph.\n(d) The record must be completed no later than five days after the application of the pesticide.\n(e) A commercial applicator must give a copy of the record to the customer.\n(f) Records must be retained by the applicator, company, or authorized agent for five years after the date of treatment.\n(g) A record of a commercial or noncommercial applicator must meet or exceed the requirements in Code of Federal Regulations, title 40, part 171.\n(a) A structural pest control applicator must maintain a record of each structural pest control application conducted by that person or by the person's employees. The record must include the:\n(1) date of structural pest control application;\n(2) target pest;\n(3) brand name of the pesticide, United States Environmental Protection Agency registration number, and amount used;\n(4) for fumigation, the temperature and exposure time;\n(5) time the pesticide application was completed;\n(6) name and address of the customer;\n(7) name of structural pest control applicator, name of company and address of applicator or company, and license number of applicator; and\n(8) any other information required by the commissioner.\n(b) All information for this record requirement must be contained in a document for each pesticide application. An invoice containing the required information may constitute the record.\n(c) The record must be completed no later than five days after the application of the pesticide.\n(d) Records must be retained for five years after the date of treatment.\n(e) A copy of the record must be given to a person who ordered the application that is present at the site where the structural pest control application is conducted, placed in a conspicuous location at the site where the structural pest control application is conducted immediately after the application of the pesticides, or delivered to the person who ordered an application or the owner of the site. The commissioner must make sample forms available that meet the requirements of this subdivision.\n(f) A structural applicator must post in a conspicuous place inside a renter's apartment where a pesticide application has occurred a list of postapplication precautions contained on the label of the pesticide that was applied in the apartment and any other information required by the commissioner.\n(g) A record of a structural applicator must meet or exceed the requirements in Code of Federal Regulations, title 40, part 171.\nA pesticide dealer, agricultural pesticide dealer, or a commercial, noncommercial, or structural pest control company or a person who is required to be permitted to store or produce bulk agricultural chemicals must develop and maintain an incident response plan that describes the actions that will be taken to prevent and respond to agricultural chemical incidents. The plan must include information the commissioner deems necessary to respond to an agricultural chemical emergency incident. The commissioner shall make sample incident response plan forms available. The plan must be kept at a principal business site or location within this state and must be submitted to the commissioner upon request. The plan must be:\n(1) updated every three years or whenever information on the form becomes out of date, whichever is earlier;\n(2) reviewed with employees at least once per calendar year and include documentation of training events; and\n(3) made available to local first responders and documented accordingly.\nThe commissioner may enter a commercial, noncommercial, or structural pest control applicator's business and inspect the records required in this section at any reasonable time and may make copies of the records. Unless required for enforcement of this chapter, the information in the records in this section is private or nonpublic.\n(a) A physician licensed to practice in Minnesota, or a Minnesota licensed veterinarian, may submit a request to the commissioner for access to available information on the application of pesticides by a commercial or noncommercial pesticide applicator related to a course of diagnosis, care, or treatment of a patient under the care of the physician or veterinarian.\n(b) A request for pesticide application information under this subdivision must include available details as to the specific location of a known or suspected application that occurred on one or more specified dates and times. The request must also include information on symptoms displayed by the patient that prompted the physician or veterinarian to suspect pesticide exposure. The request must indicate that any information discovered will become part of the confidential patient record and will not be released publicly.\n(c) Upon receipt of a request under paragraph (a), the commissioner, in consultation with the commissioner of health, shall promptly review the information contained in the request and determine if release of information held by the department may be beneficial for the medical diagnosis, care, and treatment of the patient.\n(d) The commissioner may release to the requester available information on the pesticide. The commissioner shall withhold nonessential information such as total acres treated, the specific amount of pesticides applied, and the identity of the applicator or property owner.",
	"repealed": false
}