{
	"id": "79.255",
	"url": "https://www.revisor.mn.gov/statutes/cite/79.255",
	"title": "79.255 WORKERS' COMPENSATION INSURANCE; LESSORS OF EMPLOYEES.",
	"text": "A corporation, partnership, sole proprietorship, or other business entity which provides staff, personnel, or employees to be employed in this state to other businesses pursuant to a lease arrangement or agreement shall, before becoming eligible to be issued a policy of workers' compensation insurance or becoming eligible to secure coverage on a multiple coordinated policies basis, register with the commissioner of commerce. The registration shall:\n(1) identify the name of the lessor;\n(2) identify the address of the principal place of business of the lessor and the address of each office it maintains within this state;\n(3) include the lessor's taxpayer or employer identification number;\n(4) include a list by jurisdiction of each and every name that the lessor has operated under in the preceding five years including any alternative names and names of predecessors and, if known, successor business entities;\n(5) include a list of each person or entity who owns a five percent or greater interest in the employee leasing business at the time of application and a list of each person who formerly owned a five percent or greater interest in the employee leasing company or its predecessors, successors, or alter egos in the preceding five years; and\n(6) include a list of each and every cancellation or nonrenewal of workers' compensation insurance which has been issued to the lessor or any predecessor in the preceding five years. The list shall include the policy or certificate number, name of insurer or other provider of coverage, date of cancellation, and reason for cancellation. If coverage has not been canceled or nonrenewed, the registration shall include a sworn affidavit signed by the chief executive officer of the lessor attesting to that fact.\nAny lessor of employees whose workers' compensation insurance has been terminated within the past five years in any jurisdiction due to a determination that an employee leasing arrangement was being utilized to avoid premium otherwise payable by lessees shall be ineligible to register with the commissioner or to remain registered, if previously registered.\nPersons filing registration statements pursuant to this section shall notify the commissioner as to any changes in any information required to be provided under this section.\nThe commissioner shall maintain a list of those lessors of employees who are registered with the commissioner.\nThe commissioner may prescribe forms necessary to promote the efficient administration of this section.\nNo organization registered under this section shall directly or indirectly reference that registration in any advertisements, marketing material, or publications.\nAny corporation, partnership, sole proprietorship, or other form of business entity and any officer, director, general partner, agent, representative, or employee of theirs who knowingly utilizes or participates in any employee leasing agreement, arrangement, or mechanism for the purpose of depriving one or more insurers of premium otherwise properly payable is guilty of a misdemeanor.\nAny lessor of employees that was doing business in this state prior to April 28, 1992, shall register with the commissioner within 30 days of July 1, 1992.\nA corporation, partnership, sole proprietorship, or other business entity that provides personnel supply arrangements or agreements for the purpose of temporarily supporting or supplementing a client's work force in work situations, such as employee absences, temporary skill shortages, seasonal workloads, and specific functions and projects, may be exempt from the registration requirements of this section, provided that the arrangements or agreements do not involve the lease-back of the client's employees.\nTo qualify for an exemption, an applicant must obtain a certificate of exemption from registration from the commissioner. A certificate of exemption shall be issued upon the applicant's filing of a letter with the commissioner stating that the applicant meets all of the requirements for obtaining an exemption. If a corporation, partnership, sole proprietorship, or other business entity operating under the exemption subsequently fails to meet the requirements for the exemption, the corporation, partnership, sole proprietorship, or other business entity must immediately surrender the exemption certificate and register with the commissioner.\nA registration or exemption certificate fee of $100 shall be paid.",
	"repealed": false
}