{
	"id": "491A.02",
	"url": "https://www.revisor.mn.gov/statutes/cite/491A.02",
	"title": "491A.02 PROCEDURE.",
	"text": "The determination of claims in conciliation court must be without jury trial and by a simple and informal procedure. Conciliation court proceedings must not be reported. By July 1, 1993, the supreme court shall promulgate rules governing pleading, practice, and procedure for conciliation courts, and shall promulgate uniform claim and counterclaim forms. The claim and summons must include a conspicuous notice in at least 10-point bold type regarding the consequences of a failure to appear at a conciliation court hearing. Each conciliation court shall accept a uniform claim or counterclaim that has been properly completed and forwarded to the court together with the entire filing fee, if any.\nUnder the supervision of the conciliation court judges, the court administrator shall explain to litigants the procedure and functions of the conciliation court and shall on request assist them in filling out all forms and pleading necessary for the presentation of their claims or counterclaims to the court. The uniform claim and counterclaim forms must be accepted by any court administrator and shall on request be forwarded together with the entire filing fee, if any, to the court administrator of the appropriate conciliation court. The court administrator shall on request assist judgment creditors and debtors in the preparation of the forms necessary to obtain satisfaction of a final judgment. The performance of duties prescribed in this subdivision do not constitute the practice of law for purposes of section 481.02, subdivision 8.\nThe court administrator shall charge and collect the fee established pursuant to section 357.022, together with applicable law library fees established pursuant to law, from a plaintiff and from a defendant when the first paper for that party is filed in any conciliation court action. The rules promulgated by the supreme court shall provide for commencement of an action without payment of fees when a litigant who is a natural person claims an inability to pay the fees, provided that if the litigant prevails on a claim or counterclaim, the fees must be paid to the administrator out of any money recovered by the litigant.\n(a) A corporation, partnership, limited liability company, sole proprietorship, or association may be represented in conciliation court by an officer, manager, or partner or an agent in the case of a condominium, cooperative, or townhouse association, or may appoint a natural person who is an employee or commercial property manager to appear on its behalf or settle a claim in conciliation court. The state or a political subdivision of the state may be represented in conciliation court by an employee of the pertinent governmental unit without a written authorization. The state also may be represented in conciliation court by an employee of the Division of Risk Management of the Department of Administration without a written authorization. Representation under this subdivision does not constitute the practice of law for purposes of section 481.02, subdivision 8. In the case of an officer, employee, commercial property manager, or agent of a condominium, cooperative, or townhouse association, an authorized power of attorney, corporate authorization resolution, corporate bylaw, or other evidence of authority acceptable to the court must be filed with the claim or presented at the hearing. This subdivision also applies to appearances in district court by a corporation or limited liability company with five or fewer shareholders or members and to any condominium, cooperative, or townhouse association, if the action was removed from conciliation court.\n(b) \"Commercial property manager\" means a corporation, partnership, or limited liability company or its employees who are hired by the owner of commercial real estate to perform a broad range of administrative duties at the property including tenant relations matters, leasing, repairs, maintenance, the negotiation and resolution of tenant disputes, and related matters. In order to appear in conciliation court, a property manager's employees must possess a real estate license under section 82.87 and be authorized by the owner of the property to settle all disputes with tenants and others within the jurisdictional limits of conciliation court.\n(c) A commercial property manager who is appointed to settle a claim in conciliation court may not charge or collect a separate fee for services rendered under paragraph (a).\nA judgment ordered may provide for satisfaction by payments in installments in amounts and at such times, not exceeding one year for the last installment, as the judge determines to be just and reasonable. If any installment is not paid when due, the entire balance of the judgment order becomes immediately due and payable.\nThe rules promulgated by the supreme court must provide for a right of appeal from the decision of the conciliation court by removal to the district court for a trial de novo. The notice of order for judgment must contain a statement that if the removing party does not prevail in district court as provided in subdivision 7, the opposing party may be awarded an additional $50 as costs.\n(a) For the purposes of this subdivision, \"removing party\" means the first party who serves or files a demand for removal. \"Opposing party\" means any party as to whom the removing party seeks a reversal in whole or in part.\n(b) If the removing party prevails in district court, the removing party may recover costs from the opposing party as though the action were commenced in district court. If the removing party does not prevail, the court shall order an additional $50 to be paid to the opposing party as costs. If the removing party is eligible to proceed under section 563.01, the additional $50 costs may be waived if the court, in its discretion, determines that a hardship exists and that the case was removed from conciliation court in good faith.\n(c) For purposes of this section, the removing party prevails in district court if:\n(1) the removing party recovers at least $500 or 50 percent of the amount of value of property that the removing party requested on removal, whichever is less, when the removing party was denied any recovery in conciliation court;\n(2) the opposing party does not recover any amount or any property from the removing party in district court when the opposing party recovered some amount or some property in conciliation court;\n(3) the removing party recovers an amount or value of property in district court that exceeds the amount or value of property that the removing party recovered in conciliation court by at least $500 or 50 percent, whichever is less; or\n(4) the amount or value of property that the opposing party recovers from the removing party in district court is reduced from the amount or value of property that the opposing party recovered in conciliation court by at least $500 or 50 percent, whichever is less.\n(d) Costs or disbursements in conciliation or district court must not be considered in determining whether there was a recovery by either party in either court or in determining the difference in recovery under this section.\nDecisions of the district court on removal from a conciliation court determination on the merits may be appealed to the court of appeals as in other civil actions.\nNotwithstanding any contrary provision in rule 518 of the Conciliation Court Rules, unless the parties have otherwise agreed, if a conciliation court judgment or a judgment of district court on removal from conciliation court has been docketed in district court, the judgment creditor's attorney as an officer of the court may or the district court in the county in which the judgment originated shall, upon request of the judgment creditor, order the judgment debtor to mail to the judgment creditor information as to the nature, amount, identity, and locations of all the debtor's assets, liabilities, and personal earning. The information must be provided on a form prescribed by the supreme court, and the information shall be sufficiently detailed to enable the judgment creditor to obtain satisfaction of the judgment by way of execution on nonexempt assets and earnings of the judgment debtor. The order must contain a notice that failure to complete the form and mail it to the judgment creditor within ten days after service of the order may result in a citation for civil contempt of court. Cash bail posted as a result of being cited for civil contempt of court order under this section may be ordered payable to the creditor to satisfy the judgment, either partially or fully, subject to section 588.04, paragraph (b).",
	"repealed": false
}