{
	"id": "62A.082",
	"url": "https://www.revisor.mn.gov/statutes/cite/62A.082",
	"title": "62A.082 NONDISCRIMINATION IN ACCESS TO TRANSPLANTS.",
	"text": "(a) For the purposes of this section, the following terms have the meanings given unless the context clearly requires otherwise.\n(b) \"Disability\" has the meaning given in section 363A.03, subdivision 12.\n(c) \"Enrollee\" means a natural person covered by a health plan or group health plan and includes an insured, policy holder, subscriber, covered person, member, contract holder, or certificate holder.\n(d) \"Organ transplant\" means the transplantation or transfusion of a part of a human body into the body of another for the purpose of treating or curing a medical condition.\nA health plan or group health plan that provides coverage for anatomical gifts, organ transplants, or related treatment and services shall not:\n(1) deny coverage to an enrollee based on the enrollee's disability;\n(2) deny eligibility, or continued eligibility, to enroll or to renew coverage under the terms of the health plan or group health plan solely for the purpose of avoiding the requirements of this section;\n(3) penalize or otherwise reduce or limit the reimbursement of a health care provider, or provide monetary or nonmonetary incentives to a health care provider, to induce the provider to provide care to a patient in a manner inconsistent with this section; or\n(4) reduce or limit an enrollee's coverage benefits because of the enrollee's disability for medical services and other services related to organ transplantation performed pursuant to this section as determined in consultation with the enrollee's treating health care provider and the enrollee.\nIn the case of a group health plan maintained pursuant to one or more collective bargaining agreements between employee representatives and one or more employers, any plan amendment made pursuant to a collective bargaining agreement relating to the plan which amends the plan solely to conform to any requirement imposed pursuant to this section shall not be treated as a termination of the collective bargaining agreement.\nNothing in this section shall be deemed to require a health plan or group health plan to provide coverage for a medically inappropriate organ transplant.",
	"repealed": false
}