{
	"id": "53B.33",
	"url": "https://www.revisor.mn.gov/statutes/cite/53B.33",
	"title": "53B.33 SUPERVISION.",
	"text": "(a) The commissioner may conduct an examination or investigation of a licensee or authorized delegate or otherwise take independent action authorized by this chapter, or by a rule adopted or order issued under this chapter, as reasonably necessary or appropriate to administer and enforce this chapter, rules implementing this chapter, and other applicable law, including the Bank Secrecy Act and the USA PATRIOT Act, Public Law 107-56. The commissioner may:\n(1) conduct an examination either on site or off site as the commissioner may reasonably require;\n(2) conduct an examination in conjunction with an examination conducted by representatives of other state agencies or agencies of another state or of the federal government;\n(3) accept the examination report of another state agency or an agency of another state or of the federal government, or a report prepared by an independent accounting firm, which on being accepted is considered for all purposes as an official report of the commissioner; and\n(4) summon and examine under oath a key individual or employee of a licensee or authorized delegate and require the person to produce records regarding any matter related to the condition and business of the licensee or authorized delegate.\n(b) A licensee or authorized delegate must provide, and the commissioner has full and complete access to, all records the commissioner may reasonably require to conduct a complete examination. The records must be provided at the location and in the format specified by the commissioner. The commissioner may use multistate record production standards and examination procedures when the standards reasonably achieve the requirements of this paragraph.\n(c) Unless otherwise directed by the commissioner, a licensee must pay all costs reasonably incurred in connection with an examination of the licensee or the licensee's authorized delegates.",
	"repealed": false
}