{
	"id": "306.243",
	"url": "https://www.revisor.mn.gov/statutes/cite/306.243",
	"title": "306.243 MAINTAINING ABANDONED CEMETERIES.",
	"text": "A county board may appropriate the general revenue funds it determines necessary for the improvement and maintenance of the cemetery if there is in the county, whether or not within the corporate limits of a town or statutory city, either of the following:\n(1) a cemetery that has been abandoned or neglected and the association having had charge of the cemetery has disbanded or fails to act; or\n(2) an abandoned or neglected private cemetery containing the remains of pioneers or residents of this state, deceased before 1875 or civil war veterans or veterans of the armed services of the United States of any previous war.\nIf there is an isolated grave or graves located outside the boundaries of a cemetery or outside an abandoned or neglected private cemetery, as described in subdivision 1, the county board of the county where the grave is located may order the disinterment and the reinterment of the body in some cemetery controlled by an organized cemetery association. The county board may appropriate funds for paying perpetual care to that association for the care of the grave or graves.\nThe management and supervision of the maintenance and care of the abandoned cemeteries, and abandoned or neglected private cemeteries, or the removal of bodies as provided in this section must be delegated by the county board to the county highway department or to some existing cemetery association, veterans organization or Boy Scouts of America Area Council, or other charitable institution. That organization is responsible to the county board for its acts.\nIf funds for the care and maintenance of an abandoned or neglected private cemetery described in subdivision 1 are raised by an organization or institution other than an existing cemetery association, the funds may be paid to the county treasurer to be held or disbursed by the county board for the purposes for which the funds are raised.\nA county that has assumed maintenance of an abandoned cemetery under this section for a period of at least one year may transfer the cemetery land and property as provided in section 306.02.\nA county that has accepted responsibility for an abandoned cemetery may prohibit further burials in the abandoned cemetery, and may cease all acceptance of responsibility for new burials.",
	"repealed": false
}