{
	"id": "16D.04",
	"url": "https://www.revisor.mn.gov/statutes/cite/16D.04",
	"title": "16D.04 COLLECTION ACTIVITIES.",
	"text": "The commissioner shall provide services to the state and referring agencies to collect debts referred for collection under this chapter. The commissioner is not a collection agency as defined by section 332.31, subdivision 3, and is not licensed, bonded, or regulated by the commissioner of commerce under sections 332.31 to 332.35 or 332.38 to 332.44. The commissioner is subject to section 332.37, except clause (9), (10), (12), or (19). An audited financial statement may not be required as a condition of debt placement with a private agency if the private agency: (1) has errors and omissions coverage under a professional liability policy in an amount of at least $1,000,000; or (2) has a fidelity bond to cover actions of its employees, in an amount of at least $100,000.\n(a) A referring agency must refer, by electronic means, debts to the commissioner for collection. Decisions with regard to continuing collection and the uncollectibility of referred debts shall be made by the commissioner who shall then notify the commissioner of management and budget and the referring agency. A decision by the commissioner that a referred debt is uncollectible does not prevent the referring agency from taking additional collection action.\n(b) Before a debt becomes 121 days past due, a referring agency may refer the debt to the commissioner for collection at any time after a debt becomes delinquent and uncontested and the debtor has no further administrative appeal of the amount of the debt. When a debt owed to a referring agency becomes 121 days past due, the referring agency must refer the debt to the commissioner for collection. This requirement does not apply if there is a dispute over the amount or validity of the debt, if the debt is the subject of legal action or administrative proceedings, or the agency determines that the debtor is adhering to acceptable payment arrangements. The commissioner may provide that certain types of debt need not be referred to the commissioner for collection under this paragraph. Methods and procedures for referral must follow internal guidelines prepared by the commissioner.\n(c) If the referring agency is a court, the court must furnish a debtor's Social Security number to the commissioner when the court refers the debt.\nThe commissioner shall provide collection services for a state agency, and may provide collection services for referring agencies other than state agencies.\nThe commissioner of revenue may contract with credit bureaus, private collection agencies, and other entities as necessary for the collection of debts. A private collection agency acting under a contract with the commissioner of revenue is subject to sections 332.31 to 332.44, except that the private collection agency may indicate that it is acting under a contract with the state. The commissioner may not delegate the powers provided under section 16D.08 to any nongovernmental entity.",
	"repealed": false
}