{
	"id": "609.594",
	"url": "https://www.revisor.mn.gov/statutes/cite/609.594",
	"title": "609.594 DAMAGE TO PROPERTY OF CRITICAL PUBLIC SERVICE FACILITIES, UTILITIES, AND PIPELINES.",
	"text": "As used in this section:\n(1) \"critical public service facility\" includes railroad yards and stations, bus stations, airports, and other mass transit facilities; oil refineries; storage areas or facilities for hazardous materials, hazardous substances, or hazardous wastes; and bridges;\n(2) \"pipeline\" has the meaning given in section 609.6055, subdivision 1; and\n(3) \"utility\" includes: (i) any organization defined as a utility in section 216C.06, subdivision 18; (ii) any telecommunications carrier or telephone company regulated under chapter 237; and (iii) any local utility or enterprise formed for the purpose of providing electrical or gas heating and power, telephone, water, sewage, wastewater, or other related utility service, which is owned, controlled, or regulated by a town, a statutory or home rule charter city, a county, a port development authority, the Metropolitan Council, a district heating authority, a regional commission or other regional government unit, or a combination of these governmental units.\nWhoever causes damage to the physical property of a critical public service facility, utility, or pipeline with the intent to significantly disrupt the operation of or the provision of services by the facility, utility, or pipeline and without the consent of one authorized to give consent, is guilty of a felony and may be sentenced to imprisonment for not more than ten years or to payment of a fine of not more than $20,000, or both.\nAn employee or other person designated by a critical public service facility, utility, or pipeline to ensure the provision of services by the critical public service facility or the safe operation of the equipment or facility of the utility or pipeline who has reasonable cause to believe that a person is violating this section may detain the person as provided in this subdivision. The person detained must be promptly informed of the purpose of the detention and may not be subjected to unnecessary or unreasonable force or interrogation. The employee or other designated person must notify a peace officer promptly of the detention and may only detain the person for a reasonable period of time. No employee or other designated person is criminally or civilly liable for any detention that the employee or person reasonably believed was authorized by and conducted in conformity with this subdivision.",
	"repealed": false
}