{
	"id": "462.389",
	"url": "https://www.revisor.mn.gov/statutes/cite/462.389",
	"title": "462.389 DEVELOPMENT COMMISSION CHAIR; OFFICERS AND STAFF.",
	"text": "The chair of the commission shall have been a resident of the region for at least one year and shall be a person experienced in the field of government affairs. The chair shall preside at the meetings of the commission and board of directors and be responsible for carrying out all policy decisions of the commission. The chair's expense allowances shall be fixed by the commission. The term of the first chair shall be one year, and the chair shall serve until a successor is selected and qualifies. At the expiration of the term of the first chair, the chair shall be elected from the membership of the commission according to procedures established in its bylaws.\nExcept as provided in subdivision 1, the commission shall elect such officers as it deems necessary for the conduct of its affairs. Times and places of regular and special meetings shall be fixed by the commission and may be provided in the commission bylaws. In the performance of its duties the commission may adopt bylaws, rules governing its operation, establish committees, divisions, departments, and bureaus, and staff the same as necessary to carry out its duties and when specifically authorized by law make appointments to other governmental agencies and districts. All officers and employees shall serve at the pleasure of the commission and in accordance with this section.\nThe commission may appoint an executive director to serve as the chief administrative officer. The director may be chosen from among the citizens of the nation at large, and shall be selected on the basis of training and experience in the field of government affairs.\nThe commission may adopt a personnel system for its officers and employees including terms and conditions for the employment, the fixing of compensation, their classification, benefits, and the filing of performance and fidelity bonds, and such policies of insurance as it may deem advisable, the premiums for which, however, shall be paid for by the commission. Officers and employees are public employees within the meaning of chapter 353. The commission shall make the employer's contributions to pension funds of its employees.\nMS 1996 [Repealed, 1997 c 231 art 12 s 27]\nThe commission may contract for the services of consultants who perform engineering, legal, or other services of a professional nature for peak workloads, continuing advice on program direction, and for specialized and technical services. Such contracts shall not be subject to the requirements of any law relating to public bidding.",
	"repealed": false
}