{
	"id": "13.7909",
	"url": "https://www.revisor.mn.gov/statutes/cite/13.7909",
	"title": "13.7909 PUBLIC EMPLOYMENT RELATIONS BOARD DATA.",
	"text": "For purposes of this section, \"board\" means the Public Employment Relations Board.\n(a) Except as provided in paragraphs (b) and (c), all data maintained by the board about a charge of unfair labor practices and appeals of determinations of the commissioner under section 179A.12, subdivision 11, are classified as protected nonpublic data or confidential data prior to being admitted into evidence at a hearing conducted pursuant to section 179A.13. Data that are admitted into evidence at a hearing conducted pursuant to section 179A.13 are public unless subject to a protective order as determined by the board or a hearing officer.\n(b) Statements by individuals that are provided to the board are private data on individuals, as defined by section 13.02, subdivision 12, prior to being admitted into evidence at a hearing conducted pursuant to section 179A.13, and become public once admitted into evidence.\n(c) The following data are public at all times:\n(1) the filing date of unfair labor practice charges;\n(2) the status of unfair labor practice charges as an original or amended charge;\n(3) the names and job classifications of charging parties and charged parties;\n(4) the provisions of law alleged to have been violated in unfair labor practice charges;\n(5) the complaint issued by the board; and\n(6) unless subject to a protective order:\n(i) the full and complete record of an evidentiary hearing before a hearing officer, including the hearing transcript, exhibits admitted into evidence, and posthearing briefs;\n(ii) recommended decisions and orders of hearing officers pursuant to section 179A.13, subdivision 1, paragraph (i);\n(iii) exceptions to the hearing officer's recommended decision and order filed with the board pursuant to section 179A.13, subdivision 1, paragraph (k);\n(iv) party and nonparty briefs filed with the board; and\n(v) decisions and orders issued by the board.\n(d) The board may make any data classified as private, protected nonpublic, or confidential pursuant to this subdivision accessible to any person or party if the access will aid the implementation of chapters 179 and 179A or ensure due process protection of the parties.",
	"repealed": false
}