{
	"id": "205A.07",
	"url": "https://www.revisor.mn.gov/statutes/cite/205A.07",
	"title": "205A.07 NOTICE.",
	"text": "The clerk of a school district shall give two weeks' published notice and give ten days' posted notice of a school district primary, general, or special election, stating the time of the election, the location of each polling place, the offices to be filled, and all propositions or questions to be voted upon at the primary, general, or special election. The notice shall be posted in the administrative offices of the school district for public inspection.\nFor every school district primary, general, or special election, the school district clerk shall at least four days before the primary, general, or special election, post a sample ballot in the administrative offices of the school district for public inspection, and shall post a sample ballot in each polling place on election day.\nAt least 84 days before every school district election, the school district clerk shall provide a written notice to the county auditor of each county in which the school district is located. The notice must include the date of the election, the offices to be voted on at the election, and the title and language for each ballot question to be voted on at the election. For the purposes of meeting the timelines of this section, in a bond election, a notice, including a proposed question, may be provided to the county auditor before receipt of a review and comment from the commissioner of education and before actual initiation of the election. At least 84 days before every school district election, the school district clerk must provide written notice to the county auditor of any special election canceled under section 205A.05, subdivision 3.\nAt least 74 days before every school district election under section 123B.62, 123B.63, 126C.17, 126C.69, or 475.58, the school district clerk shall provide a written notice to the commissioner of education. The notice must include the date of the election and the title and language for each ballot question to be voted on at the election. At least 74 days before every school district election, the school district clerk must provide a written notice to the commissioner of education of any special election canceled under section 205A.05, subdivision 3. The certified vote totals for each ballot question shall be provided in a written notice to the commissioner in a timely manner.\nAt least 84 days before every school district election for which a notice is provided to the county auditor under subdivision 3, the county auditor shall provide a notice of the election to the secretary of state, in a manner and including information prescribed by the secretary of state.\nA school district is only required to comply with the election posting requirements specified in the Minnesota Election Law and the education code and is not required to comply with additional posting requirements specified in any other law.",
	"repealed": false
}