{
	"id": "142D.24",
	"url": "https://www.revisor.mn.gov/statutes/cite/142D.24",
	"title": "142D.24 FAMILY, FRIEND, AND NEIGHBOR GRANT PROGRAM.",
	"text": "The commissioner of children, youth, and families shall establish a family, friend, and neighbor (FFN) grant program to promote children's social-emotional learning and healthy development, early literacy, and other skills to succeed as learners and to foster community partnerships that will help children thrive when they enter school.\nThe commissioner may award grants under this section to the following entities working with FFN caregivers: community-based organizations, nonprofit organizations, local or regional libraries, local public health agencies, and Indian Tribes and Tribal organizations. Grantees may use grant money received under this section to:\n(1) provide culturally and linguistically appropriate training, support, and resources to FFN caregivers and children's families to improve and promote children's health, safety, nutrition, and learning;\n(2) connect FFN caregivers and children's families with community resources that support the families' physical and mental health and economic and developmental needs;\n(3) connect FFN caregivers and children's families to early childhood screening programs and facilitate referrals to state and local agencies, schools, community organizations, and medical providers, as appropriate;\n(4) provide FFN caregivers and children's families with information about high-quality, community-based early care and learning programs and financial assistance available to the families, including but not limited to child care assistance under this chapter and early learning scholarships under section 142D.25;\n(5) provide FFN caregivers with information about registering as a legal nonlicensed child care provider as defined in section 142E.01, subdivision 19, and establishing a licensed family or group family child care program;\n(6) provide transportation for FFN caregivers and children's families to educational and other early childhood training activities;\n(7) translate materials for FFN caregivers and children's families and provide translation services to FFN caregivers and children's families;\n(8) develop and disseminate social-emotional learning, health and safety, and early learning kits to FFN caregivers; and\n(9) establish play and learning groups for FFN caregivers.\nApplicants must apply for the grants using the forms and according to timelines established by the commissioner.\n(a) Grantees shall provide data and program outcomes to the commissioner in a form and manner specified by the commissioner for the purpose of evaluating the grant program.\n(b) Beginning February 1, 2024, and every two years thereafter, the commissioner shall report to the chairs and ranking minority members of the legislative committees with jurisdiction over child care on program outcomes.",
	"repealed": false
}