{
	"id": "326B.103",
	"url": "https://www.revisor.mn.gov/statutes/cite/326B.103",
	"title": "326B.103 DEFINITIONS.",
	"text": "For the purposes of sections 326B.101 to 326B.194, the terms defined in this section have the meanings given them.\n\"Administrative authority\" means a municipality's governing body or their assigned administrative authority.\n\"Agricultural building\" means a structure that is:\n(1) on agricultural land as determined by the governing assessor for the municipality or county under section 273.13, subdivision 23;\n(2) designed, constructed, and used to house farm implements, livestock, or agricultural products under section 273.13, subdivision 23; and\n(3) used by the owner, lessee, and sublessee of the building and members of their immediate families, their employees, and persons engaged in the pickup or delivery of agricultural products.\n\"City\" means a home rule charter or statutory city.\n\"Code\" means the State Building Code adopted by the commissioner of labor and industry in consultation with each industry board and the Construction Codes Advisory Council in accordance with sections 326B.101 to 326B.194.\n\"Designate\" means the formal designation by a municipality's administrative authority of a certified building official accepting responsibility for code administration.\n\"Electric vehicle capable space\" means a designated automobile parking space that has electrical infrastructure, including but not limited to raceways, cables, electrical capacity, and panelboard or other electrical distribution space necessary for the future installation of an electric vehicle charging station.\n\"Electric vehicle charging station\" means a designated automobile parking space that has a dedicated connection for charging an electric vehicle.\n\"Electric vehicle ready space\" means a designated automobile parking space that has a branch circuit capable of supporting the installation of an electric vehicle charging station.\n\"Equivalent protection\" means a measure other than a code requirement that provides essentially the same protection that would be provided by a code requirement.\n\"Historic building\" means a state-owned building that is on the National Register of Historic Places.\n\"Municipality\" means a city, county, or town, the University of Minnesota, or the state for public buildings and state licensed facilities.\n\"Parking facilities\" includes parking lots, garages, ramps, or decks.\n\"Person with a disability\" or \"persons with disabilities\" includes people who have a vision disability, a hearing disability, a disability of coordination, a disability of aging, or any other disability that significantly reduces mobility, flexibility, coordination, or perceptiveness.\n\"Public building\" means a building and its grounds the cost of which is paid for by the state or a state agency regardless of its cost, and a building project for a school district or charter school the cost of which is $100,000 or more.\n\"Remodeling\" means deliberate reconstruction of an existing public building in whole or in part in order to bring it into conformity with present uses of the structure and to which other rules on the upgrading of health and safety provisions are applicable.\n\"State licensed facility\" means a building and its grounds that are licensed by the state as a hospital, nursing home, supervised living facility, assisted living facility, including assisted living facility with dementia care, free-standing outpatient surgical center, correctional facility, boarding care home, or residential hospice.",
	"repealed": false
}