{
	"id": "253B.097",
	"url": "https://www.revisor.mn.gov/statutes/cite/253B.097",
	"title": "253B.097 COMMUNITY-BASED TREATMENT.",
	"text": "In addition to the findings required under section 253B.09, subdivision 2, an order committing a person to a community-based treatment program must include:\n(1) a written plan for services to the patient;\n(2) a finding that the proposed treatment is available and accessible to the patient and that public or private financial resources are available to pay for the proposed treatment;\n(3) conditions the patient must meet in order to obtain an early release from commitment or to avoid a hearing for further commitment; and\n(4) consequences of the patient's failure to follow the commitment order. Consequences may include commitment to another setting for treatment.\nWhen a court commits a patient with mental illness to a community-based treatment program, the court shall appoint a case manager from the county agency or other entity under contract with the county agency to provide case management services.\nThe case manager shall report to the court at least once every 90 days. The case manager shall immediately report to the court a substantial failure of the patient or provider to comply with the conditions of the commitment.\nAn order for community-based treatment may be modified upon agreement of the parties and approval of the court.\nThe case manager may petition for a reopening of the commitment hearing if a patient or provider fails to comply with the terms of an order for community-based treatment.\nNo treatment facility, community-based treatment program, or person is financially liable, personally or otherwise, for the patient's actions if the facility or person follows accepted community standards of professional practice in the management, supervision, and treatment of the patient. For purposes of this subdivision, \"person\" means official, staff, employee of the treatment facility, community-based treatment program, physician, or other individual who is responsible for a patient's management, supervision, or treatment under this section.",
	"repealed": false
}