{
	"id": "144.1506",
	"url": "https://www.revisor.mn.gov/statutes/cite/144.1506",
	"title": "144.1506 PRIMARY CARE RESIDENCY EXPANSION GRANT PROGRAM.",
	"text": "For purposes of this section, the following definitions apply:\n(1) \"eligible primary care residency program\" means a program that meets the following criteria:\n(i) is located in Minnesota;\n(ii) trains medical residents in the specialties of family medicine, general internal medicine, general pediatrics, psychiatry, geriatrics, or general surgery; and\n(iii) is accredited by the Accreditation Council for Graduate Medical Education or presents a credible plan to obtain accreditation;\n(2) \"eligible project\" means a project to establish a new eligible primary care residency program or create at least one new residency slot in an existing eligible primary care residency program; and\n(3) \"new residency slot\" means the creation of a new residency position and the execution of a contract with a new resident in a residency program.\n(a) The commissioner of health shall award primary care residency expansion grants to eligible primary care residency programs to plan and implement new residency slots. A planning grant shall not exceed $75,000, and a training grant shall not exceed $150,000 per new residency slot for the first year, $100,000 for the second year, and $50,000 for the third year of the new residency slot. For eligible residency programs longer than three years, training grants may be awarded for the duration of the residency, not exceeding an average of $100,000 per residency slot per year.\n(b) Funds may be spent to cover the costs of:\n(1) planning related to establishing an accredited primary care residency program;\n(2) obtaining accreditation by the Accreditation Council for Graduate Medical Education or another national body that accredits residency programs;\n(3) establishing new residency programs or new resident training slots;\n(4) recruitment, training, and retention of new residents and faculty;\n(5) travel and lodging for new residents;\n(6) faculty, new resident, and preceptor salaries related to new residency slots;\n(7) training site improvements, fees, equipment, and supplies required for new primary care resident training slots; and\n(8) supporting clinical education in which trainees are part of a primary care team model.\nEligible primary care residency programs seeking a grant shall apply to the commissioner. Applications must include the number of new primary care residency slots planned or under contract; attestation that funding will be used to support an increase in the number of available residency slots; a description of the training to be received by the new residents, including the location of training; a description of the project, including all costs associated with the project; all sources of funds for the project; detailed uses of all funds for the project; the results expected; and a plan to maintain the new residency slot after the grant period. The applicant must describe achievable objectives, a timetable, and roles and capabilities of responsible individuals in the organization.\nThe commissioner shall review each application to determine whether or not the residency program application is complete and whether the proposed new residency program and any new residency slots are eligible for a grant. The commissioner shall award grants to support up to six family medicine, general internal medicine, or general pediatrics residents; five psychiatry residents; two geriatrics residents; and two general surgery residents. If insufficient applications are received from any eligible specialty, funds may be redistributed to applications from other eligible specialties.\nDuring the grant period, the commissioner may require and collect from grantees any information necessary to evaluate the program. Appropriations made to the program do not cancel and are available until expended.",
	"repealed": false
}