{
	"id": "297I.60",
	"url": "https://www.revisor.mn.gov/statutes/cite/297I.60",
	"title": "297I.60 CLAIMS FOR REFUND.",
	"text": "(a) Subject to the requirements of this section and section 297I.70, if a taxpayer has paid a tax or surcharge in excess of the amount due and files a written claim for refund, the commissioner shall refund or credit the overpayment determined by the commissioner to be erroneously paid.\n(b) The claim must specify the name of the taxpayer, the date when and the period for which the tax or surcharge was paid, the kind of tax or surcharge paid, the amount that the taxpayer claims was erroneously paid, the grounds on which a refund is claimed, and other information relative to the payment. The claim must be in the form required by the commissioner. A return or amended return claiming an overpayment constitutes a claim for refund.\n(c) The commissioner shall determine the amount of refund, if any, that is due, and notify the taxpayer of the determination as soon as practicable after a claim has been filed. Notice must be mailed to the taxpayer at the address stated upon the return or claim for refund.\n(d) If the amount of tax or surcharge paid by the taxpayer exceeds the amount of tax or surcharge imposed on the taxpayer, the amount of excess is considered an overpayment even if in fact there was no liability with respect to which the amount was paid.\n(e) When in the course of an examination and within the time for requesting a refund, the commissioner determines that there has been an overpayment of tax or surcharge, the commissioner shall refund or credit the amount of the overpayment to the taxpayer and no return is necessary.\n(f) Notwithstanding any law to the contrary, the commissioner is not required to refund or credit any overpayment of less than one dollar.\n(g) There is appropriated to the commissioner the amounts necessary to make refunds required by this section. The funds are appropriated from the same fund to which the tax or surcharge being refunded was originally deposited.\n(a) If the taxpayer is notified that the refund claim is denied in whole or in part, the taxpayer may contest the denial by:\n(1) filing an administrative appeal with the commissioner under section 270C.35;\n(2) filing an appeal in Tax Court within 60 days of the notice date of the denial; or\n(3) filing an action in the district court to recover the refund.\n(b) An action in the district court must be brought within 18 months of the notice date of the denial. For purposes of this section, \"notice date\" has the meaning given in section 270C.35, subdivision 3. An action for refund of tax or surcharge must be brought in the district court of the district in which lies the taxpayer's principal place of business or in the District Court for Ramsey County. If a taxpayer files a claim for refund and the commissioner has not issued a denial of the claim, the taxpayer may bring an action in the district court or the Tax Court at any time after the expiration of six months from the time the claim was filed.",
	"repealed": false
}