{
	"id": "149A.02",
	"url": "https://www.revisor.mn.gov/statutes/cite/149A.02",
	"title": "149A.02 DEFINITIONS.",
	"text": "For purposes of this chapter, the terms defined in this section have the meanings given them.\n\"Alkaline hydrolysis\" means the reduction of a dead human body to essential elements through a water-based dissolution process using alkaline chemicals, heat, agitation, and pressure to accelerate natural decomposition; the processing of the hydrolyzed remains after removal from the alkaline hydrolysis vessel; placement of the processed remains in a hydrolyzed remains container; and release of the hydrolyzed remains to an appropriate party. Alkaline hydrolysis is a form of final disposition.\n\"Alkaline hydrolysis container\" means a hydrolyzable or biodegradable closed container or pouch resistant to leakage of bodily fluids that encases the body and into which a dead human body is placed prior to insertion into an alkaline hydrolysis vessel. Alkaline hydrolysis containers may be hydrolyzable or biodegradable alternative containers or caskets.\n\"Alkaline hydrolysis facility\" means a building or structure containing one or more alkaline hydrolysis vessels for the alkaline hydrolysis of dead human bodies.\n\"Alkaline hydrolysis vessel\" means the container in which the alkaline hydrolysis of a dead human body is performed.\n\"Alternative container\" means a nonmetal receptacle or enclosure, without ornamentation or a fixed interior lining, which is designed for the encasement of dead human bodies and is made of hydrolyzable or biodegradable materials, corrugated cardboard, fiberboard, pressed-wood, or other like materials.\n\"Arrangements for disposition\" means any action normally taken by a funeral provider in anticipation of or preparation for the entombment, burial in a cemetery, alkaline hydrolysis, cremation, or, effective July 1, 2025, natural organic reduction of a dead human body.\n\"Burial site goods\" means any goods sold or offered for sale or rental directly to the public for use in connection with the final disposition of a dead human body.\n\"Burial site services\" means any services sold or offered for sale directly to the public for use in connection with the final disposition of a dead human body but does not include services provided under a transportation protection agreement.\n\"Cash advance item\" means any item of service or merchandise described to a purchaser as a \"cash advance,\" \"accommodation,\" \"cash disbursement,\" or similar term. A cash advance item is also any item obtained from a third party and paid for by the funeral provider on the purchaser's behalf. Cash advance items include, but are not limited to, cemetery, alkaline hydrolysis, or crematory services, pallbearers, public transportation, clergy honoraria, flowers, musicians or singers, obituary notices, gratuities, and death records.\n\"Casket\" means a rigid container which is designed for the encasement of a dead human body and is usually constructed of hydrolyzable or biodegradable materials, wood, metal, fiberglass, plastic, or like material, and ornamented and lined with fabric.\n\"Clinical student\" means a person officially registered for a clinical through a program of mortuary science accredited by the American Board of Funeral Service Education.\n\"Commissioner\" means the Minnesota commissioner of health.\n\"Cremated remains\" means the postcremation remains of a dead human body.\n\"Cremated remains container\" means a receptacle in which postcremation remains are placed. For purposes of this chapter, \"cremated remains container\" is interchangeable with \"urn\" or similar keepsake storage jewelry.\n\"Cremation\" means the reduction of a dead human body to essential elements through direct exposure to intense heat and flame and the repositioning or movement of the body during the process to facilitate reduction, the processing of the remains after removal from the cremation chamber, placement of the processed remains in a cremated remains container, and release of the cremated remains to an appropriate party.\n\"Cremation chamber\" means the enclosed space within which the cremation of a dead human body is performed.\n\"Cremation container\" means a combustible, closed container that encases the body and can be made of materials like fiberboard or corrugated cardboard and into which a dead human body is placed prior to insertion into a cremation chamber for cremation. Cremation containers may be combustible \"alternative containers\" or combustible \"caskets.\"\n\"Crematory\" means a building or structure containing one or more cremation chambers or retorts for the cremation of dead human bodies.\n\"Crypt\" means a space in a mausoleum of sufficient size, used or intended to be used to entomb human remains, cremated remains, or hydrolyzed remains.\n\"Direct alkaline hydrolysis\" means a final disposition of a dead human body by alkaline hydrolysis, without formal viewing, visitation, or ceremony with the body present.\n\"Direct cremation\" means a final disposition of a dead human body by cremation, without formal viewing, visitation, or ceremony with the body present.\n\"Direct supervision\" means overseeing the performance of an individual. For the purpose of a clinical, practicum, or internship, direct supervision means that the supervisor is available to observe and correct, as needed, the performance of the trainee. For the purpose of a transfer care specialist, direct supervision means that the supervisor is available by being physically present or by telephone to advise and correct, as needed, the performance of the transfer care specialist. The supervising mortician is accountable for the actions of the clinical student, practicum student, or intern throughout the course of the training. The supervising mortician is accountable for any violations of law or rule, in the performance of their duties, by the clinical student, practicum student, intern, or transfer care specialist.\n\"Disciplinary action\" means any action taken by the regulatory agency against any person subject to regulation under this chapter for the violation of or the threatened violation of any law, rule, order, stipulation agreement, settlement, compliance agreement, license, or permit adopted, issued, or enforced by the regulatory agency.\n\"Embalming\" means the process of disinfecting and preserving a dead human body by chemically treating the body to reduce the presence and growth of organisms, to retard organic decomposition, and to restore an acceptable physical appearance.\n\"Final disposition\" means the acts leading to and the entombment, burial in a cemetery, alkaline hydrolysis, cremation, or, effective July 1, 2025, natural organic reduction of a dead human body.\n\"Funeral association\" means a cooperative association that sells or offers to sell funeral goods or services to its members.\n\"Funeral ceremony\" means a service or rite commemorating the deceased with the body present.\n\"Funeral director\" means any person who, for compensation, arranges, directs, or supervises funerals, memorial services, or graveside services, or engages in the business or practice of preparing dead human bodies for final disposition by means other than embalming.\n\"Funeral establishment\" means any place or premise devoted to or used in the holding, care, or preparation of a dead human body for final disposition or any place used as the office or place of business of any person that provides funeral goods or services to the public.\n\"Funeral goods\" means the goods which are sold or offered for sale directly to the public for use in connection with funeral services.\n\"Funeral provider\" means any person that sells or offers to sell funeral goods, funeral services, burial site goods, or burial site services to the public. \"Funeral provider\" does not include monument builders who sell and install markers and headstones, with or without foundations, at retail to the public, but do not sell any other funeral good, funeral service, burial good, or burial site service.\n(a) \"Funeral services\" means any services which may be used to: (1) care for and prepare dead human bodies for burial, alkaline hydrolysis, cremation, or other final disposition; and (2) arrange, supervise, or conduct the funeral ceremony or the final disposition of dead human bodies.\n(b) Funeral service does not include a transportation protection agreement.\n\"Graveside service\" means a service or rite, conducted at the place of interment, commemorating the deceased with the body present.\n\"Hydrolyzed remains\" means the remains of a dead human body following the alkaline hydrolysis process. Hydrolyzed remains does not include pacemakers, prostheses, or similar foreign materials.\n\"Hydrolyzed remains container\" means a receptacle in which hydrolyzed remains are placed. For purposes of this chapter, a hydrolyzed remains container is interchangeable with \"urn\" or similar keepsake storage jewelry.\n\"Immediate burial\" means a disposition of a dead human body by burial, without formal viewing, visitation, or ceremony with the body present, except for a graveside service.\n\"Intern\" means an individual that has met the educational and testing requirements for a license to practice mortuary science in Minnesota, has registered with the commissioner of health, and is engaged in the practice of mortuary science under the direction and supervision of a currently licensed Minnesota mortuary science practitioner.\n\"Inurnment\" means placing hydrolyzed or cremated remains in a hydrolyzed or cremated remains container suitable for placement, burial, or shipment. Effective July 1, 2025, inurnment also includes placing naturally reduced remains in a naturally reduced remains container suitable for placement, burial, or shipment.\n\"Licensee\" means any person or entity that has been issued a license to practice mortuary science, to operate a funeral establishment, to operate an alkaline hydrolysis facility, to operate a crematory, or, effective July 1, 2025, to operate a natural organic reduction facility by the Minnesota commissioner of health.\n\"Memorial service\" means a ceremony or rite commemorating the deceased without the body present.\n\"Mortician\" means any person who, for compensation, practices the art of embalming and arranges, directs, or supervises funerals, memorial services, or graveside services, or engages in the business or practice of preparing dead human bodies for final disposition.\n\"Mortuary science\" means the study and practice of preparing dead human bodies for final disposition and providing funeral services. Mortuary science includes any conduct or action associated with the removal, preparation, transportation, arrangements for disposition, or final disposition of dead human bodies, including the actions and duties of a mortician or a funeral director.\n\"Niche\" means a space in a columbarium used or intended to be used for the placement of hydrolyzed or cremated remains.\n\"Natural organic reduction\" or \"naturally reduce\" means the contained, accelerated conversion of a dead human body to soil. This subdivision is effective July 1, 2025.\n\"Natural organic reduction facility\" means a structure, room, or other space in a building or real property where natural organic reduction of a dead human body occurs. This subdivision is effective July 1, 2025.\n\"Natural organic reduction vessel\" means the enclosed container in which natural organic reduction takes place. This subdivision is effective July 1, 2025.\n\"Naturally reduced remains\" means the soil remains following the natural organic reduction of a dead human body and the accompanying plant material. This subdivision is effective July 1, 2025.\n\"Naturally reduced remains container\" means a receptacle in which naturally reduced remains are placed. This subdivision is effective July 1, 2025.\n\"Outer burial container\" means any container which is designed for placement in the grave around a casket or alternative container including, but not limited to, containers commonly known as burial vaults, grave boxes, and grave liners.\n\"Person\" means an individual or a firm, corporation, limited liability company, partnership, association, or other legal entity.\n\"Placement\" means the placing of a container holding hydrolyzed or cremated remains in a crypt, vault, or niche.\n\"Practicum student\" means a person officially registered for a practicum through a program of mortuary science accredited by the American Board of Funeral Service Education.\n\"Preneed consumer\" means an individual who arranges for funeral goods, funeral services, burial site goods, or burial site services prior to the death of that individual or another individual, and who funds those goods or services through prepayment to a funeral provider or through purchase of an insurance policy.\n\"Preparation of the body\" means placement of the body into an appropriate cremation or alkaline hydrolysis container, embalming of the body or such items of care as washing, disinfecting, shaving, positioning of features, restorative procedures, application of cosmetics, dressing, and casketing.\n\"Processing\" means the removal of foreign objects, drying or cooling, and the reduction of the hydrolyzed remains, cremated remains, or, effective July 1, 2025, naturally reduced remains by mechanical means including, but not limited to, grinding, crushing, or pulverizing, to a granulated appearance appropriate for final disposition or the final reduction to naturally reduced remains.\n\"Professional services\" means the basic services of the funeral director or mortician and staff that are furnished by the funeral provider in arranging final disposition. The services include, but are not limited to, conducting the arrangement conference; planning visitations and the funeral, memorial service, or graveside service; arranging for final disposition by securing, preparing, and filing necessary permits and documents; and placing obituary notices.\n\"Public transportation\" means all manner of transportation via common carrier available to the general public including airlines, buses, railroads, and ships. For purposes of this chapter, a livery service providing transportation to private funeral establishments, alkaline hydrolysis facilities, or crematories is not public transportation.\n\"Regulatory agency\" means:\n(1) the commissioner of health for provisions related to a funeral provider who is required to be licensed, registered, or issued a permit under this chapter; and\n(2) the commissioner of commerce for provisions related to insurance policies purchased by a preneed consumer to arrange for funeral goods, funeral services, burial site goods, or burial services.\n\"Refrigeration\" means to preserve by keeping cool at a temperature of 40 degrees Fahrenheit or less using mechanical or natural means.\n\"Scattering\" means the authorized dispersal of hydrolyzed remains, cremated remains, or, effective July 1, 2025, naturally reduced remains in a defined area of a dedicated cemetery or in areas where no local prohibition exists provided that the hydrolyzed, cremated, or naturally reduced remains are not distinguishable to the public, are not in a container, and that the person who has control over disposition of the hydrolyzed, cremated, or naturally reduced remains has obtained written permission of the property owner or governing agency to scatter on the property.\n\"Transfer care specialist\" means an individual who is registered with the commissioner in accordance with section 149A.47 and is authorized to perform the removal of a dead human body from the place of death under the direct supervision of a licensed mortician.\n\"Transportation costs\" means all costs associated with the use of the vehicle used for the initial transfer of the deceased, the funeral coach, funeral sedans, the flower car, any service or utility vehicles, and public transportation.\n\"Transportation protection agreement\" means an agreement that is primarily for the purpose of transportation and subsequent transportation of the remains of a dead human body.\n\"Universal precautions\" means the universal blood and body fluid precautions recommended by the United States Public Health Service, Centers for Disease Control, to prevent transmission of blood-borne and body fluid-borne infectious diseases.\n\"Use of facilities\" means the provision of a chapel or room for visitation, provision of a chapel or room for the funeral or memorial service, provision of facilities for parking, or provision of office space for administrative or planning purposes.\n\"Vault\" means a space in a mausoleum of sufficient size, used or intended to be used to entomb human remains, cremated remains, or hydrolyzed remains. Vault may also mean a sealed and lined casket enclosure.",
	"repealed": false
}