{
	"id": "3.737",
	"url": "https://www.revisor.mn.gov/statutes/cite/3.737",
	"title": "3.737 LIVESTOCK OWNERS; COMPENSATION FOR DESTROYED OR CRIPPLED ANIMALS.",
	"text": "(a) Notwithstanding section 3.736, subdivision 3, paragraph (e), or any other law, a livestock owner shall be compensated by the commissioner of agriculture for livestock that is destroyed by a wolf or is so crippled by a wolf that it must be destroyed. Except as provided in this section, the owner is entitled to the fair market value of the destroyed livestock as determined by the commissioner, upon recommendation of the fair market value by a university extension agent. In any fiscal year, a livestock owner may not be compensated for a destroyed animal claim that is less than $100 in value and may be compensated up to $20,000, as determined under this section. In any fiscal year, the commissioner may provide compensation for claims filed under this section up to the amount expressly appropriated for this purpose.\n(b) A university extension agent, a conservation officer, an official from the Animal and Plant Health Inspection Service of the United States Department of Agriculture, a peace officer from the county sheriff's office, or a licensed veterinarian must make a personal inspection of the site and submit a report to the commissioner, including photographs, detailing the results of the investigation. The investigator must take into account factors in addition to a visual identification of a carcass when making a recommendation to the commissioner. The commissioner, upon recommendation of the investigator, shall determine whether the livestock was destroyed by a wolf. The owner shall file a claim on forms provided by the commissioner and available at the university extension agent's office.\nPayments made under this section shall be reduced by amounts received by the owner as proceeds from an insurance policy covering livestock losses, or from any other source for the same purpose including, but not limited to, a federal program.\nThe commissioner shall adopt and may amend rules to carry out this section which shall include: methods of valuation of livestock destroyed; criteria for determination of the cause for livestock loss; notice requirements by the owner of destroyed livestock; and other matters determined necessary by the commissioner to carry out this section.\n(a) If the commissioner finds that the livestock owner has shown that the loss of the livestock was likely caused by a wolf, the commissioner shall pay compensation as provided in this section and in the rules of the department.\n(b) If the commissioner denies compensation claimed by an owner under this section, the commissioner shall issue a written decision based upon the available evidence. It shall include specification of the facts upon which the decision is based and the conclusions on the material issues of the claim. A copy of the decision shall be mailed to the owner.\n(c) A decision to deny compensation claimed under this section is not subject to the contested case review procedures of chapter 14, but may be reviewed upon a trial de novo in a court in the county where the loss occurred. The decision of the court may be appealed as in other civil cases. Review in court may be obtained by filing a petition for review with the administrator of the court within 60 days following receipt of a decision under this section. Upon the filing of a petition, the administrator shall mail a copy to the commissioner and set a time for hearing within 90 days of the filing.\nBy September 1, 1999, the commissioner must develop best management practices to prevent wolf depredation on livestock farms. The commissioner shall periodically update the best management practices when new practices are found by the commissioner to prevent wolf depredation on livestock farms. The commissioner must provide an updated copy of the best management practices for wolf depredation to all livestock owners who are still engaged in livestock farming and have previously submitted livestock claims under this section.\nThe commissioner must pursue federal reimbursement for any compensation payment issued under this section while:\n(1) the United States Fish and Wildlife Service lists the Minnesota population of gray wolves as endangered and threatened wildlife under the federal Endangered Species Act; or\n(2) the federal government otherwise prohibits livestock producers from protecting their livestock from wolf depredation.\nThe commissioner must submit a report to the chairs and ranking minority members of the house of representatives and senate committees and divisions with jurisdiction over agriculture and environment and natural resources by December 15 each year. The report must include:\n(1) all payments made under this section, by county and statewide, in the previous five fiscal years;\n(2) the program's total revenue by funding source including state appropriations; and\n(3) how each revenue source is used in expenditures including administrative costs used to carry out this section.",
	"repealed": false
}