{
	"id": "168.301",
	"url": "https://www.revisor.mn.gov/statutes/cite/168.301",
	"title": "168.301 VEHICLE TRANSFER DEADLINE; FEES; SUSPENSION.",
	"text": "(a) On transferring a motor vehicle, the transferor shall surrender the registration plates and assign the registration tax paid to the credit of the transferee.\n(b) As specified in section 115A.908, the commissioner must impose a $10 fee on each transfer of title within the state, other than transfers for resale purposes, of every motor vehicle weighing more than 1,000 pounds.\nThe transferee's rights to the transferred vehicle's registration plates and credit for taxes paid on the vehicle expire after ten days have elapsed from the date of transfer unless: (1) the transfer has been filed as provided under section 168A.10; or (2) the transferee is a dealer licensed under section 168.27, and is complying with section 168A.11.\nIn addition to any fee or tax otherwise authorized or imposed upon the transfer of title for a motor vehicle, the commissioner of public safety must impose a $2 additional fee for failure to deliver a title transfer within the period specified under section 168A.10, subdivision 2.\nWhen the commissioner has suspended license plates on a vehicle because the transferee has failed to file the title certificate within 30 days, the transferee shall pay a $10 fee before the registration is reinstated.\nA person does not violate this section or section 168.09, subdivision 1, by reason of suspension, if the person provides verification from the registrar that the title transfer with fees and taxes were filed with the registrar prior to being cited for violating this section or the vehicle was purchased from a licensed Minnesota dealer. The verification of compliance must be presented to the appropriate law enforcement agency within seven days after being charged or to the court on or before the date set for appearance.\nThe commissioner of public safety may suspend the registration of any owner who violates this section.",
	"repealed": false
}