{
	"id": "62E.08",
	"url": "https://www.revisor.mn.gov/statutes/cite/62E.08",
	"title": "62E.08 STATE PLAN PREMIUM.",
	"text": "The association shall establish the following maximum premiums to be charged for membership in the comprehensive health insurance plan:\n(a) the premium for the number one qualified plan shall range from a minimum of 101 percent to a maximum of 125 percent of the weighted average of rates charged by those insurers and health maintenance organizations with individuals enrolled in:\n(1) $1,000 annual deductible individual plans of insurance in force in Minnesota;\n(2) individual health maintenance organization contracts of coverage with a $1,000 annual deductible which are in force in Minnesota; and\n(3) other plans of coverage similar to plans offered by the association based on generally accepted actuarial principles;\n(b) the premium for the number two qualified plan shall range from a minimum of 101 percent to a maximum of 125 percent of the weighted average of rates charged by those insurers and health maintenance organizations with individuals enrolled in:\n(1) $500 annual deductible individual plans of insurance in force in Minnesota;\n(2) individual health maintenance organization contracts of coverage with a $500 annual deductible which are in force in Minnesota; and\n(3) other plans of coverage similar to plans offered by the association based on generally accepted actuarial principles;\n(c) the premiums for the plans with a $2,000, $5,000, or $10,000 annual deductible shall range from a minimum of 101 percent to a maximum of 125 percent of the weighted average of rates charged by those insurers and health maintenance organizations with individuals enrolled in:\n(1) $2,000, $5,000, or $10,000 annual deductible individual plans, respectively, in force in Minnesota; and\n(2) individual health maintenance organization contracts of coverage with a $2,000, $5,000, or $10,000 annual deductible, respectively, which are in force in Minnesota; or\n(3) other plans of coverage similar to plans offered by the association based on generally accepted actuarial principles;\n(d) the premium for each type of Medicare supplement plan required to be offered by the association pursuant to section 62E.12 shall be determined by calculating and applying the weighted average of the rate increases approved for the period for which the association premiums are to be effective for the three insurers or health maintenance organizations with the most individuals enrolled in:\n(1) Medicare supplement plans in force in Minnesota;\n(2) health maintenance organization Medicare supplement contracts of coverage which are in force in Minnesota; or\n(3) other plans of coverage similar to plans offered by the association based on generally accepted actuarial principles; and\n(e) the charge for health maintenance organization coverage shall be based on generally accepted actuarial principles.\nThe list of insurers and health maintenance organizations whose rates are used to establish the premium for coverage offered by the association pursuant to paragraphs (a) to (d) shall be established by the commissioner on the basis of information which shall be provided to the association by all insurers and health maintenance organizations annually at the commissioner's request. This information shall include the number of individuals covered by each type of plan or contract specified in paragraphs (a) to (d) that is sold, issued, and renewed by the insurers and health maintenance organizations, including those plans or contracts available only on a renewal basis. The information shall also include the rates charged for each type of plan or contract.\nIn establishing premiums pursuant to this section, the association shall utilize generally accepted actuarial principles, provided that the association shall not discriminate in charging premiums based upon sex. In order to compute a weighted average for each type of plan or contract specified under paragraphs (a) to (d), the association shall, using the information collected pursuant to this subdivision, list insurers and health maintenance organizations in rank order of the total number of individuals covered by each insurer or health maintenance organization. The association shall then compute a weighted average of the rates charged for coverage by all the insurers and health maintenance organizations by:\n(1) multiplying the numbers of individuals covered by each insurer or health maintenance organization by the rates charged for coverage;\n(2) separately summing both the number of individuals covered by all the insurers and health maintenance organizations and all the products computed under clause (1); and\n(3) dividing the total of the products computed under clause (1) by the total number of individuals covered.\nThe association may elect to use a sample of information from the insurers and health maintenance organizations for purposes of computing a weighted average. In no case, however, may a sample used by the association to compute a weighted average include information from fewer than the two insurers or health maintenance organizations highest in rank order.\n(f) Notwithstanding the provisions of this section, in calculating premiums to be effective January 1, 2014, and thereafter, the association may utilize rates for individual plans of insurance, individual health maintenance organization contracts, and other individual plans of coverage that are similar to plans offered by the association based upon generally accepted actuarial principles, so long as such plans and contracts have been filed with the Department of Commerce and are reasonably anticipated to be in force and individuals are reasonably anticipated to be enrolled in them during the period for which the association premiums are to be effective, regardless of whether they are in force in Minnesota or have individuals enrolled in them at the time the association is engaged in the rate-setting process mandated by this section and section 62E.091. For purposes of determining a weighted average under paragraph (e), the association shall use generally accepted actuarial principles to project potential enrollment in plans of coverage for the period for which the association's premiums will be effective and for which no individuals have enrolled at the time the association engages in the premium setting process.\nSubject to subdivision 1, the schedule of premiums for coverage under the comprehensive health insurance plan shall be designed to be self-supporting and based on generally accepted actuarial principles.\nPremium rates under this section must be determined annually. These rates are effective July 1 of each year and must be based on a survey of approved rates of insurers and health maintenance organizations in effect, or to be in effect, on April 1 of the same calendar year. These rates may be trended to the midpoint of the period for which the premium rates will apply in order to reflect economic and inflationary changes. Notwithstanding the provisions of this subdivision, the association may set rates to be effective for the 18-month period July 1, 2012, through December 31, 2013. For calendar years beginning January 1, 2014, and thereafter, premium rates shall be determined annually and effective January 1 of each year. Premium rates shall be prospective and trended forward to the midpoint of the period for which the premium rates apply to ensure that the association's rates are based upon individual market rates for insurers and health maintenance organizations that will be in effect during the period for which the association's rates will be effective.\nThe association may establish smoker and nonsmoker premium rates that are based on generally accepted actuarial principles.",
	"repealed": false
}