{
	"id": "16A.127",
	"url": "https://www.revisor.mn.gov/statutes/cite/16A.127",
	"title": "16A.127 INDIRECT COSTS.",
	"text": "(a) As used in this section, \"statewide indirect costs\" means all general fund expenditures made by any state agency attributable to providing general support services to any other state agency.\n(b) As used in this section, \"agency indirect costs\" means all general support costs within any agency that cannot be directly charged to any agency program.\n(c) For purposes of this section, \"agency\" means any entity receiving general support services.\nThe commissioner shall annually prepare a plan identifying the sources and amounts of each agency's statewide indirect costs for the current fiscal year. The commissioner shall submit the plan to the cognizant federal agency for approval, and provide copies to the governor and the legislature.\n(a) Unless indirect cost recoveries are specifically appropriated in law, agencies are obligated to reimburse the general fund for all statewide indirect costs, and that portion of agency indirect costs attributable to recoveries of general fund expenditures. However, the commissioner may, for reasons of sound financial management, waive the reimbursement under this subdivision for certain nongeneral fund activities.\n(b) The commissioner shall record the reimbursement to the general fund of the statewide and agency indirect costs attributable to an agency's nongeneral fund activities for the fiscal year. All nonfederal agency indirect cost receipts are appropriated to the agency to pay administrative expenses, unless they are determined to be a reimbursement of general fund expenditures.\nThere is annually appropriated from all direct appropriated nongeneral funds an amount sufficient to reimburse the general fund for both statewide indirect costs, and any agency indirect costs attributable to general fund expenditures.\nAgency applications for federal money shall include necessary submissions to recover both statewide and agency indirect costs. An agency indirect cost plan is unnecessary if the commissioner determines that the costs incurred in preparing and maintaining it exceed the benefit received by the state. If less than the entire agency proposal is federally approved, the commissioner may accept reimbursement of less than all of the federal receipts. If no federal funds are approved for indirect costs, the agency must document that fact to the commissioner.\nAgencies shall reimburse the general fund for all federal money received as a recovery of statewide indirect costs. All federal agency indirect cost receipts are appropriated to the agency to pay administrative expenses, unless they are determined to be a reimbursement of general fund expenditures.\nAgencies must supply the information required by the commissioner, as needed, to carry out the provisions of this section.\nThe legislative auditor may recommend waiver, and the Legislative Audit Commission may waive all or part of a fee for an audit. A state audited agency whose funds are not administered by the commissioner of management and budget must transfer to the general fund the amount of the cost of the audit attributable to the agency's nongeneral fund receipts.\n(a) No statewide or agency indirect cost liability shall be accrued to any program, appropriation, or account that is specifically exempted from the liability in federal or state law, or if the commissioner determines the funds to be held in trust, or to be a pass-through, workshop, or seminar account. Accounts receiving proceeds from bond issues and general fund accounts are also exempt from this section.\n(b) Except for the costs of the legislative auditor to conduct financial audits of federal funds, this section does not apply to the Board of Trustees of the Minnesota State Colleges and Universities. Receipts attributable to financial audits conducted by the legislative auditor of federal funds administered by the board shall be deposited in the general fund.\n(a) The Department of Natural Resources is exempt from recovering agency indirect costs except where federal funds are involved.\n(b) The commissioner of natural resources need not bill the federal government, other states, or Canadian provinces for the indirect costs of providing emergency firefighting services, and need not reimburse the general fund for those indirect costs if the waiver is reciprocated.",
	"repealed": false
}