{
	"id": "144.995",
	"url": "https://www.revisor.mn.gov/statutes/cite/144.995",
	"title": "144.995 DEFINITIONS; ENVIRONMENTAL HEALTH TRACKING AND BIOMONITORING.",
	"text": "(a) For purposes of sections 144.995 to 144.998, the terms in this section have the meanings given.\n(b) \"Advisory panel\" means the Environmental Health Tracking and Biomonitoring Advisory Panel established under section 144.998.\n(c) \"Biomonitoring\" means the process by which chemicals and their metabolites are identified and measured within a biospecimen.\n(d) \"Biospecimen\" means a sample of human fluid, serum, or tissue that is reasonably available as a medium to measure the presence and concentration of chemicals or their metabolites in a human body.\n(e) \"Commissioner\" means the commissioner of the Department of Health.\n(f) \"Community\" means geographically or nongeographically based populations that may participate in the biomonitoring program. A \"nongeographical community\" includes, but is not limited to, populations that may share a common chemical exposure through similar occupations, populations experiencing a common health outcome that may be linked to chemical exposures, populations that may experience similar chemical exposures because of comparable consumption, lifestyle, product use, and subpopulations that share ethnicity, age, or gender.\n(g) \"Department\" means the Department of Health.\n(h) \"Designated chemicals\" means those chemicals that are known to, or strongly suspected of, adversely impacting human health or development, based upon scientific, peer-reviewed animal, human, or in vitro studies, and baseline human exposure data, and consists of chemical families or metabolites that are included in the federal Centers for Disease Control and Prevention studies that are known collectively as the National Reports on Human Exposure to Environmental Chemicals Program and any substances specified by the commissioner after receiving recommendations under section 144.998, subdivision 3, clause (6).\n(i) \"Environmental hazard\" means a chemical or other substance for which scientific, peer-reviewed studies of humans, animals, or cells have demonstrated that the chemical is known or reasonably anticipated to adversely impact human health.\n(j) \"Environmental health tracking\" means collection, integration, analysis, and dissemination of data on human exposures to chemicals in the environment and on diseases potentially caused or aggravated by those chemicals.",
	"repealed": false
}