{
	"id": "18B.33",
	"url": "https://www.revisor.mn.gov/statutes/cite/18B.33",
	"title": "18B.33 COMMERCIAL APPLICATOR LICENSE.",
	"text": "(a) A person may not apply a pesticide for hire without a commercial applicator license for the appropriate use categories or a structural pest control license.\n(b) A commercial applicator licensee must have a valid license identification card to purchase a restricted use pesticide or apply pesticides for hire and must display it upon demand by an authorized representative of the commissioner or a law enforcement officer. The commissioner shall prescribe the information required on the license identification card.\n(c) A person licensed under this section is considered qualified and is not required to verify, document, or otherwise prove a particular need prior to use, except as required by the federal label.\n(d) A person who uses a general-use sanitizer or disinfectant for hire in response to COVID-19 is exempt from the commercial applicator license requirements under this section.\n(e) A person licensed under this section must be 18 years of age or older.\nA person required to be licensed under this section who performs pesticide applications for hire or who employs a licensed applicator to perform pesticide application for pro rata compensation is responsible for proper application of the pesticide or device.\nA commercial applicator license:\n(1) expires on December 31 of the year for which it is issued, unless suspended or revoked before that date;\n(2) is not transferable to another person; and\n(3) must be prominently displayed to the public in the commercial applicator's place of business.\n(a) A person must apply to the commissioner for a commercial applicator license on forms and in the manner required by the commissioner. The commissioner must prescribe and administer a closed-book, monitored examination, or equivalent measure to determine if the applicant is eligible for the commercial applicator license.\n(b) Aerial applicators must also fulfill applicable requirements in chapter 360.\n(a) An applicator must apply to the commissioner to renew a commercial applicator license. The commissioner may renew a commercial applicator license accompanied by the application fee, subject to reexamination, attendance at a recertification workshop approved by the commissioner, or other requirements imposed by the commissioner to provide the applicator with information regarding changing technology and to help assure a continuing level of competence and ability to use pesticides safely and properly. A recertification workshop must meet or exceed the competency standards in Code of Federal Regulations, title 40, part 171. Competency standards for a recertification workshop must be published on the Department of Agriculture website. Upon the receipt of an applicator's renewal application, the commissioner may require the applicator to attend a recertification workshop. Depending on the application category, the commissioner may require an applicator to complete a recertification workshop once per year, once every two years, or once every three years. If the commissioner requires an applicator to attend a recertification workshop and the applicator fails to attend the workshop, the commissioner may require the applicator to pass a reexamination. An applicator may renew a commercial applicator license within 12 months after expiration of the license without having to meet initial testing requirements. The commissioner may require an additional demonstration of applicator qualification if the applicator has had a license suspended or revoked or has had a history of violations of this chapter.\n(b) An applicator that meets renewal requirements by reexamination instead of attending a recertification workshop must pay the equivalent workshop fee for the reexamination as determined by the commissioner.\n(a) The commissioner may suspend or revoke an applicator's commercial applicator license if the applicator fails to provide proof of financial responsibility upon the commissioner's request. Financial responsibility may be demonstrated by: (1) proof of net assets equal to or greater than $50,000; or (2) by a performance bond or insurance of the kind and in an amount determined by the commissioner.\n(b) The bond or insurance must cover a period of time at least equal to the term of the applicator's license. The commissioner must immediately suspend the license of an applicator who fails to maintain the required bond or insurance. The performance bond or insurance policy must contain a provision requiring the insurance or bonding company to notify the commissioner by ten days before the effective date of cancellation, termination, or any other change of the bond or insurance. If there is recovery against the bond or insurance, additional coverage must be secured by the applicator to maintain financial responsibility equal to the original amount required.\n(c) An employee of a licensed applicator is not required to maintain an insurance policy or bond during the time the employer is maintaining the required insurance or bond.\n(d) Applications for reinstatement of a license suspended under the provisions of this section must be accompanied by proof of satisfaction of judgments previously rendered.\n(a) A person initially applying for or renewing a commercial applicator license must pay a nonrefundable application fee of $50.\n(b) A license renewal application received after March 1 in the year for which the license is to be issued is subject to a penalty fee of 50 percent of the application fee. The penalty fee must be paid before the renewal license may be issued.\n(c) An application for a duplicate commercial applicator license must be accompanied by a nonrefundable application fee of $10.",
	"repealed": false
}