{
	"id": "332.71",
	"url": "https://www.revisor.mn.gov/statutes/cite/332.71",
	"title": "332.71 DEFINITIONS.",
	"text": "For the purposes of sections 332.71 to 332.75, the definitions in this section have the meanings given them.\n(a) \"Coerced debt\" means all or a portion of debt in a debtor's name that has been incurred as a result of:\n(1) the use of the debtor's personal information without the debtor's knowledge, authorization, or consent;\n(2) the use or threat of force, intimidation, undue influence, fraud, deception, coercion, or other similar means against the debtor; or\n(3) economic abuse perpetrated against the debtor.\n(b) Coerced debt does not include secured debt.\n\"Creditor\" means a person, or the person's successor, assignee, or agent, claiming to own or have the right to collect a debt owed by the debtor.\n\"Debtor\" means a person who (1) is a victim of domestic abuse, economic abuse, or sex or labor trafficking, and (2) owes coerced debt.\n\"Documentation\" means:\n(1) a police report;\n(2) a Federal Trade Commission identity theft report;\n(3) an order in a dissolution proceeding under chapter 518 that declares that one or more debts are coerced; or\n(4) a sworn written certification.\n\"Domestic abuse\" has the meaning given in section 518B.01, subdivision 2.\n\"Economic abuse\" means behavior in the context of a domestic relationship that controls, restrains, restricts, impairs, or interferes with the ability of a debtor to acquire, use, or maintain economic resources, including but not limited to:\n(1) withholding or restricting access to, or the acquisition of, money, assets, credit, or financial information;\n(2) interfering with the victim's ability to work and earn wages; or\n(3) exerting undue influence over a person's financial and economic behavior or decisions.\nMS 2023 Supp [Repealed, 2024 c 114 art 3 s 104]\n\"Labor trafficking\" has the meaning given in section 609.281, subdivision 5.\n\"Qualified third-party professional\" means:\n(1) a domestic abuse advocate, as defined under section 595.02, subdivision 1, paragraph (l);\n(2) a sexual assault counselor, as defined under section 595.02, subdivision 1, paragraph (k);\n(3) a licensed health care provider, mental health care provider, social worker, or marriage and family therapist; or\n(4) a nonprofit organization in Minnesota that provides direct assistance to victims of domestic abuse, sexual assault, or sex or labor trafficking.\n\"Sex trafficking\" has the meaning given in section 609.321, subdivision 7a.\n\"Sworn written certification\" means a statement by a qualified third-party professional in the following form:\n\"CERTIFICATION OF QUALIFIED THIRD-PARTY PROFESSIONAL\nI, .................... (name of qualified third-party professional), do hereby certify under penalty of perjury as follows:\n1. I am a licensed health care provider, mental health care provider, social worker, marriage and family therapist, domestic abuse advocate, as that term is defined in Minnesota Statutes, section 595.02, subdivision 1, paragraph (l), or sexual assault counselor, as that term is defined in Minnesota Statutes, section 595.02, subdivision 1, paragraph (k), or a staff member of a nonprofit organization that provides direct assistance to victims of domestic abuse, sexual assault, or sex or labor trafficking, who has had in-person contact or face-to-face contact through an electronic medium with .................... (name of debtor).\n2. Based on my professional interactions with the debtor and information presented to me in my professional capacity, I have a reasonable basis to believe .................... (name of debtor) is a victim of domestic abuse, harassment, sex trafficking, or labor trafficking, and has incurred all or a portion of debt that is coerced debt, as that term is defined in Minnesota Statutes, section 332.71, subdivision 2.\n3. Based on my professional interactions with the debtor and on information presented to me, I have reason to believe that the circumstances under which the coerced debt was incurred are as follows:\n4. The following debts or portions of the debts have been identified to me as coerced:\nI attest that the foregoing is true and correct.\n(Printed name of qualified third party)\n(Signature of qualified third party)\n(Business address and business telephone)\n(Date)\"",
	"repealed": false
}