{
	"id": "93.514",
	"url": "https://www.revisor.mn.gov/statutes/cite/93.514",
	"title": "93.514 GAS AND OIL PRODUCTION RULEMAKING.",
	"text": "(a) The following agencies may adopt rules governing gas and oil exploration or production, as applicable:\n(1) the commissioner of the Pollution Control Agency may adopt or amend rules regulating air emissions; water discharges, including stormwater management; and storage tanks as they pertain to gas and oil production;\n(2) the commissioner of health may adopt or amend rules on groundwater and surface water protection, exploratory boring construction, drilling registration and licensure, and inspections as they pertain to the exploration and appraisal of gas and oil resources;\n(3) the Environmental Quality Board may adopt or amend rules to establish mandatory categories for environmental review as they pertain to gas and oil production;\n(4) the commissioner of natural resources must adopt or amend rules pertaining to the conversion of an exploratory boring to a production well, pooling, spacing, unitization, well abandonment, siting, financial assurance, and reclamation for the production of gas and oil; and\n(5) the commissioner of labor and industry may adopt or amend rules to protect workers from exposure and other potential hazards from gas and oil production.\n(b) An agency adopting rules under this section must use the expedited procedure in section 14.389. Rules adopted or amended under this authority are exempt from the 18-month time limit under section 14.125. The agency must publish notice of intent to adopt expedited rules within 24 months of May 22, 2024.\n(c) For purposes of this section, \"gas\" includes both hydrocarbon and nonhydrocarbon gases. \"Production\" includes extraction and beneficiation of gas or oil from consolidated or unconsolidated formations in the state.\n(d) Any grant of rulemaking authority in this section is in addition to existing rulemaking authority and does not replace, impair, or interfere with any existing rulemaking authority.",
	"repealed": false
}