{
	"id": "14.16",
	"url": "https://www.revisor.mn.gov/statutes/cite/14.16",
	"title": "14.16 ADOPTION OF RULE; CHIEF ADMINISTRATIVE LAW JUDGE; FILING OF RULE.",
	"text": "If the report of the administrative law judge finds no defects, the agency may proceed to adopt the rule. After receipt of the administrative law judge's report, if the agency makes any modifications to the rule, it must return the rule, approved as to form by the revisor, to the chief administrative law judge for a review of legality, including the issue of whether the rule as modified is substantially different, as determined under section 14.05, subdivision 2, from the rule as originally proposed. If the chief administrative law judge determines that the modified rule is substantially different from the rule that was originally proposed, the chief administrative law judge shall advise the agency of actions that will correct the defects. The agency may not adopt the modified rule until the chief administrative law judge determines that the defects have been corrected or, if applicable, that the agency has satisfied the rule requirements for the adoption of a substantially different rule.\nThe agency shall give notice to all persons who requested to be informed that the rule has been adopted and filed with the secretary of state. This notice must be given on the same day that the rule is filed.\nIf the chief administrative law judge approves the administrative law judge's finding of a defect and advises the agency of actions which will correct the defect pursuant to subdivision 3 of section 14.15, the agency must either withdraw the rule or make the modifications required. The agency shall then resubmit the rule to the chief administrative law judge for a determination as to whether the defects have been corrected.\nAfter the agency has provided the chief administrative law judge with a signed order adopting the rule, the chief administrative law judge shall promptly file an electronic copy of the adopted rule in the Office of the Secretary of State. The secretary of state shall forward one copy of each rule filed to the agency, to the revisor of statutes, and to the governor.",
	"repealed": false
}