{
	"id": "84D.02",
	"url": "https://www.revisor.mn.gov/statutes/cite/84D.02",
	"title": "84D.02 INVASIVE SPECIES MANAGEMENT PROGRAM FOR AQUATIC PLANTS AND WILD ANIMALS.",
	"text": "The commissioner shall establish a statewide program to prevent and curb the spread of invasive species of aquatic plants and wild animals. The program must provide for coordination among governmental entities and private organizations to the extent practicable. The commissioner shall seek available federal funding and grants for the program.\n(a) The program required in subdivision 1 must include specific programs to curb the spread and manage the growth of purple loosestrife, curly-leaf pondweed, and Eurasian watermilfoil. These programs must include:\n(1) compiling inventories and monitoring the growth of purple loosestrife and Eurasian watermilfoil in the state, for which the commissioner may use volunteers;\n(2) publication and distribution of informational materials to boaters and lakeshore owners;\n(3) cooperative research with the University of Minnesota and other public and private research facilities to study the use of nonchemical control methods, including biological control methods; and\n(4) managing the growth of Eurasian watermilfoil, curly-leaf pondweed, and purple loosestrife in coordination with appropriate local units of government, special purpose districts, and lakeshore associations, to include providing requested technical assistance.\n(b) The commissioners of agriculture and transportation shall cooperate with the commissioner to establish, implement, and enforce the purple loosestrife program.\nBy December 31, 2023, and every five years thereafter, the commissioner shall prepare a long-term plan, which may include specific plans for individual species and actions, for the statewide management of invasive species of aquatic plants and wild animals. The plan must address:\n(1) coordinated detection and prevention of accidental introductions;\n(2) coordinated dissemination of information about invasive species of aquatic plants and wild animals among resource management agencies and organizations;\n(3) a coordinated public education and awareness campaign;\n(4) coordinated control of selected invasive species of aquatic plants and wild animals on lands and public waters;\n(5) participation by lake associations, local citizen groups, and local units of government in the development and implementation of local management efforts;\n(6) a reasonable and workable inspection requirement for watercraft and equipment including those participating in organized events on the waters of the state;\n(7) the closing of points of access to infested waters, if the commissioner determines it is necessary, for a total of not more than seven days during the open water season for control or eradication purposes;\n(8) maintaining public accesses on infested waters to be reasonably free of aquatic macrophytes;\n(9) notice to travelers of the penalties for violation of laws relating to invasive species of aquatic plants and wild animals; and\n(10) the impacts of climate change on invasive species management.\n[Repealed, 2011 c 107 s 108]\nThe commissioner shall seek cooperation with other states and Canadian provinces for the purposes of management and control of invasive species of aquatic plants and wild animals.\nBy January 15 each year, the commissioner shall submit a report on invasive species of aquatic plants and wild animals to the legislative committees having jurisdiction over environmental and natural resource issues. The report must include:\n(1) detailed information on expenditures for administration, education, management, inspections, and research;\n(2) an analysis of the effectiveness of management activities conducted in the state, including chemical control, harvesting, educational efforts, and inspections;\n(3) information on the participation of other state agencies, local government units, and interest groups in control efforts;\n(4) information on the progress made in the management of each species; and\n(5) an assessment of future management needs and additional measures to protect the state's water resources from human transport and introduction of invasive species.\nThe commissioner may contract for or accept the services of any persons whose aid is available, temporarily or otherwise, in emergency invasive species prevention work, either gratuitously or for compensation not in excess of the limits provided by law with respect to the employment of labor by the commissioner. The commissioner may issue a commission, or other written evidence of authority, to any person whose services are so arranged for and may thereby empower the person to act, temporarily or otherwise, in any other capacity, with powers and duties as may be specified in the commission or other written evidence of authority, but not in excess of the powers conferred by law. The commissioner of agriculture, under authority provided by law, shall cooperate with the commissioner in emergency control of invasive species prevention.",
	"repealed": false
}