{
	"id": "161.32",
	"url": "https://www.revisor.mn.gov/statutes/cite/161.32",
	"title": "161.32 CONTRACTING FOR WORK ON TRUNK HIGHWAY.",
	"text": "The commissioner may conduct the work or any part of the work incidental to the construction and maintenance of the trunk highways by labor employed to do the work or by contract. In cases of construction work, the commissioner shall first advertise for bids for contracts, and if no satisfactory bids are received, may either reject all bids and readvertise, or do the work by labor employed to do the work. Except as provided in subdivision 3 or 4, when work is to be done under contract, the commissioner shall advertise for bids once each week for three successive weeks prior to the date the bids are to be received. The advertisement for bids must be published on the Internet. The plans and specifications for the proposed work must be on file in the commissioner's office prior to the first call for bids.\nContracts under this section must be based on specifications prescribed by the commissioner. Each bidder for a contract shall furnish security approved by the commissioner to ensure completion of the contract. The commissioner may require that bid, performance, or payment bonds, or other security, be furnished electronically.\nBidders may submit bids electronically in a form and manner required by the commissioner; however, the commissioner may require that all bids for trunk highway contracts must be submitted electronically. Notwithstanding section 13.591, subdivision 3, or any other law or rule to the contrary, bids are not required to be opened and read in public if the commissioner publishes the public data specified by section 13.591, subdivision 3, on a state website immediately after the deadline for receipt of bids has passed. Bids for federal-aid highway projects must be conducted in accordance with Code of Federal Regulations, title 23, part 635. Trunk highway construction contracts, including design-build contracts, must be awarded to the lowest responsible bidder, taking into consideration conformity with the specifications, the purpose for which the contract or purchase is intended, the status and capability of the vendor, and other considerations imposed in the call for bids. The commissioner may decide which is the lowest responsible bidder for all contracts and may use the principles of life-cycle costing, when appropriate, in determining the lowest overall bid. Any or all bids may be rejected. When competitive bids are required and all bids are rejected, new bids, if solicited, must be called for as in the first instance, unless otherwise provided by law.\nA bid containing an alteration or erasure of any price contained in the bid which is used in determining the lowest responsible bid must be rejected unless the alteration or erasure is corrected pursuant to this subdivision. An alteration or erasure may be crossed out and the correction printed in ink or typewritten adjacent to it and initialed in ink by the person signing the bid.\nThe commissioner may reject the bid of any bidder who has failed to perform a previous contract with the state. In the case of identical low bids from two or more bidders, the commissioner may use negotiated procurement methods with the tied low bidders for that particular transaction, so long as the price paid does not exceed the low tied bid price. The commissioner may award contracts to more than one bidder in accordance with subdivision 1b, if doing so does not decrease the service level or diminish the effect of competition.\nA record must be kept of all bids, including names of bidders, amounts of bids, and each successful bid. After the contract is awarded, this record is open to public inspection and may be posted on the Internet.\nAs an alternative to the procurement method described in subdivisions 1a to 1e, the commissioner may issue a request for proposals and award the contract to the vendor or contractor offering the best value as described in section 16C.28, subdivision 1, paragraph (a), clause (2), and paragraph (c).\nIn cases where the estimated cost of construction work or maintenance work does not exceed $250,000, the commissioner may enter into a contract for the work by direct negotiation by obtaining two or more quotations for the work and without advertising for bids or otherwise complying with the requirements of competitive bidding if the total contractual obligation of the state for the directly negotiated contract or contracts on any single project does not exceed $250,000. All quotations obtained shall be kept on file for a period of at least one year after receipt of the quotation. For purposes of this subdivision only, \"construction work or maintenance work\" includes work on department-owned buildings or property.\nIn the case of emergency, contracts may be let without advertising for bids. Emergency is defined as a condition on a trunk highway that necessitates immediate work in order to keep such highway open for travel. No such contract shall be let without advertising for bids except upon the written authority of the commissioner or the commissioner's deputy.\nContracts may be let for the repair and restoration of trunk highways damaged by spring breakup, the effects of the freeze-thaw cycle, floods, other sudden natural phenomenon, or man-made disasters, or to prevent damage from flooding or other natural phenomenon, upon advertisement for bids for a period of one week prior to the date such bids are to be received.\nIn cases where work is being done under contract and the commissioner finds that the contractor has failed to comply within the period specified in the contract from the date of receipt of a written demand to make arrangements, satisfactory to the commissioner, to correct specified delays, neglect, or default, within the control of the contractor, the commissioner may negotiate with others, with the approval of the defaulting contractor's surety, for the completion of the contract according to the terms and provisions of the contract.\nWhen goods or services are provided to the commissioner by a landscape contractor for the landscaping of a trunk highway, the commissioner shall agree in the contract to pay the landscape contractor 100 percent of the value of the contract upon completion of the contracted work. The commissioner may require the contractor, as part of the contract, to post a bond for a sum not exceeding 125 percent of the value of the contract, payable to the commissioner, and conditioned upon the work's compliance with the contract terms, for a period of one year beyond the work completion date.\nNotwithstanding any law to the contrary, when goods or services are provided to the commissioner under an agreement supplemental to a contract for work on a trunk highway, the commissioner or designee may approve the work. Payment of valid state obligations must be made within 30 days of approval of the work or submission by the contractor of an invoice indicating completion of work, whichever occurs later.",
	"repealed": false
}