{
	"id": "270.12",
	"url": "https://www.revisor.mn.gov/statutes/cite/270.12",
	"title": "270.12 STATE BOARD OF EQUALIZATION; DUTIES.",
	"text": "The commissioner of revenue shall constitute the State Board of Equalization. The board may adjourn from day to day and employ necessary clerical assistance.\nThe board shall meet annually between April 15 and June 30 at the office of the commissioner of revenue and examine and compare the returns of the assessment of the property in the several counties, and equalize the same so that all the taxable property in the state shall be assessed at its market value, subject to the following rules:\n(1) The board shall add to or deduct from the aggregate valuation of the real property of every county, which the board believes to be valued below or above its market value in money, such percent as will bring the same to its market value;\n(2) If the board believes the valuation for a part of a class determined by a range of market value under clause (6) or otherwise, a class, or classes of the real property of any town or district in any county, or the valuation for a part of a class, a class, or classes of the real property of any county not in towns or cities, should be raised or reduced, without raising or reducing the other real property of such county, or without raising or reducing it in the same ratio, the board may add to, or take from, the valuation of a part of a class, a class, or classes in any one or more of such towns or cities, or of the property not in towns or cities, such percent as the board believes will raise or reduce the same to its market value;\n(3) The board shall add to or take from the aggregate valuation of any part of a class, a class, or classes of personal property of any county, town, or city, which the board believes to be valued below or above the market value thereof, such percent as will raise the same to its market value;\n(4) The board shall not reduce the aggregate valuation of all the property of the state, as returned by the several county auditors, more than one percent on the whole valuation thereof;\n(5) When it would be of assistance in equalizing values the board may require any county auditor to furnish statements showing assessments of real and personal property of any individuals, firms, or corporations within the county. The board shall consider and equalize such assessments and may increase the assessment of individuals, firms, or corporations above the amount returned by the county board of equalization when it shall appear to be undervalued, first giving notice to such persons of the intention of the board so to do, which notice shall fix a time and place of hearing. The board shall not decrease any such assessment below the valuation placed by the county board of equalization;\n(6) In equalizing values pursuant to this section, the board shall utilize a 12-month assessment/sales ratio study conducted by the Department of Revenue containing only sales that are filed in the county auditor's office under section 272.115, by November 1 of the previous year and that occurred between October 1 of the year immediately preceding the previous year and September 30 of the previous year.\nThe assessment/sales ratio study may separate the values of residential property into market value categories. The board may adjust the market value categories and the number of categories as necessary to create an adequate sample size for each market value category. The board may determine the adequate sample size. To the extent practicable, the methodology used in preparing the assessment/sales ratio study must be consistent with the most recent Standard on Assessment Sales Ratio Studies published by the Assessment Standards Committee of the International Association of Assessing Officers. The board may determine the geographic area used in preparing the study to accurately equalize values. A sales ratio study separating residential property into market value categories may not be used as the basis for a petition under chapter 278.\nThe sales prices used in the study must be discounted for terms of financing. The board shall use the median ratio as the statistical measure of the level of assessment for any particular category of property; and\n(7) The board shall receive from each county the estimated market values on the assessment date falling within the study period for all parcels by a medium as prescribed by the commissioner of revenue.\nWhen a taxing jurisdiction lies in two or more counties, if the sales ratio studies prepared by the Department of Revenue show that the average levels of assessment in the several portions of the taxing jurisdictions in the different counties differ by more than five percent, the board may order the apportionment of the levy. When the sales ratio studies prepared by the Department of Revenue show that the average levels of assessment in the several portions of the taxing jurisdictions in the different counties differ by more than ten percent, the board shall order the apportionment of the levy unless (a) the proportion of total adjusted tax capacity in one of the counties is less than ten percent of the total adjusted tax capacity in the taxing jurisdiction and the average level of assessment in that portion of the taxing jurisdiction is the level which differs by more than five percent from the assessment level in any one of the other portions of the taxing jurisdiction; (b) significant changes have been made in the level of assessment in the taxing jurisdiction which have not been reflected in the sales ratio study, and those changes alter the assessment levels in the portions of the taxing jurisdiction so that the assessment level now differs by five percent or less; or (c) commercial, industrial, mineral, or public utility property predominates in one county within the taxing jurisdiction and another class of property predominates in another county within that same taxing jurisdiction. If one or more of these factors are present, the board may order the apportionment of the levy.\nNotwithstanding any other provision, the levy for the Metropolitan Mosquito Control District, Metropolitan Council, metropolitan transit district, and metropolitan transit area must be apportioned without regard to the percentage difference.\nIf, pursuant to this subdivision, the board apportions the levy, then that levy apportionment among the portions in the different counties shall be made in the same proportion as the adjusted tax capacity as determined by the commissioner in each portion is to the total adjusted tax capacity of the taxing jurisdiction.\nFor the purposes of this section, the average level of assessment in a taxing jurisdiction or portion thereof shall be the aggregate assessment sales ratio. Tax capacities as determined by the commissioner shall be the tax capacities as determined for the year preceding the year in which the levy to be apportioned is levied.\nActions pursuant to this subdivision shall be commenced subsequent to the annual meeting on April 15 of the State Board of Equalization, but notice of the action shall be given to the affected jurisdiction and the appropriate county auditors by the following June 30.\nApportionment of a levy pursuant to this subdivision shall be considered as a remedy to be taken after equalization pursuant to subdivision 2, and when equalization within the jurisdiction would disturb equalization within other jurisdictions of which the several portions of the jurisdiction in question are a part.\nFor purposes of equalization only, public utility personal property shall be treated as a separate class of property.\nThe Board of Equalization may, pursuant to its responsibilities under subdivisions 2 and 3, issue orders to ensure that the results of local and county boards of equalization are consistent with the objective of state equalization. The board may issue, at its discretion, a supplemental order to amend, supersede, or correct a prior order of the board or an order of a local or county board. The supplemental order must be issued within 60 days of the order to be changed. The board may issue to a local or county board of equalization, within ten business days of the receipt of minutes of a local or county board of equalization, an order explaining the action that the state board believes will be necessary to effect the objective of state equalization.\nIf the State Board of Equalization determines that a considerable amount of property has been undervalued or overvalued compared to like property such that the assessment is grossly unfair or inequitable, the State Board of Equalization may, pursuant to its responsibilities under subdivisions 2 and 3, issue orders to the county assessor to reassess all parcels or an identified set of parcels in a county.",
	"repealed": false
}