{
	"id": "611.56",
	"url": "https://www.revisor.mn.gov/statutes/cite/611.56",
	"title": "611.56 MINNESOTA COMPETENCY ATTAINMENT BOARD.",
	"text": "(a) The Minnesota Competency Attainment Board is established in the judicial branch. The board is not subject to the administrative control of the judiciary. The board shall consist of seven members, including:\n(1) three members appointed by the supreme court, at least one of whom must be a defense attorney, one a county attorney, and one public member; and\n(2) four members appointed by the governor, at least one of whom must be a mental health professional with experience in competency attainment.\n(b) The appointing authorities may not appoint an active judge to be a member of the board, but may appoint a retired judge.\n(c) All members must demonstrate an interest in maintaining a high quality, independent forensic navigator program and a thorough process for certification of competency attainment programs. Members shall be familiar with the Minnesota Rules of Criminal Procedure, particularly rule 20; chapter 253B; and sections 611.40 to 611.59. Following the initial terms of appointment, at least one member appointed by the supreme court must have previous experience working as a forensic navigator. At least three members of the board shall live outside the First, Second, Fourth, and Tenth Judicial Districts. The terms, compensation, and removal of members shall be as provided in section 15.0575. The members shall elect the chair from among the membership for a term of two years.\n(a) The board shall create and administer a statewide, independent competency attainment system that certifies competency attainment programs and uses forensic navigators to promote prevention and diversion of people with mental illnesses and cognitive impairments from entering the legal system, support defendants with mental illness and cognitive impairments, support defendants in the competency process, and assist courts and partners in coordinating competency attainment services.\n(b) The board shall:\n(1) approve and recommend to the legislature a budget for the board and the forensic navigator program;\n(2) establish procedures for distribution of funding under this section to the forensic navigator program;\n(3) establish forensic navigator standards, administrative policies, procedures, and rules consistent with statute, rules of court, and laws that affect a forensic navigator's work;\n(4) establish certification requirements for competency attainment programs; and\n(5) carry out the programs under sections 611.57, 611.58, and 611.59.\n(c) The board may:\n(1) adopt standards, policies, or procedures necessary to ensure quality assistance for defendants found incompetent to stand trial and charged with a felony, gross misdemeanor, or targeted misdemeanor, or for defendants found incompetent to stand trial who have recurring incidents;\n(2) establish district forensic navigator offices as provided in subdivision 4; and\n(3) propose statutory changes to the legislature and rule changes to the supreme court that would facilitate the effective operation of the forensic navigator program.\nThe board shall appoint a program administrator who serves at the pleasure of the board. The program administrator shall attend all meetings of the board and the Certification Advisory Committee, but may not vote, and shall:\n(1) carry out all administrative functions necessary for the efficient and effective operation of the board and the program, including but not limited to hiring, supervising, and disciplining program staff and forensic navigators;\n(2) implement, as necessary, resolutions, standards, rules, regulations, and policies of the board;\n(3) keep the board fully advised as to its financial condition, and prepare and submit to the board the annual program and budget and other financial information as requested by the board;\n(4) recommend to the board the adoption of rules and regulations necessary for the efficient operation of the board and the program; and\n(5) perform other duties prescribed by the board.\nThe board may establish district forensic navigator offices in counties, judicial districts, or other areas where the number of defendants receiving competency attainment services requires more than one full-time forensic navigator and establishment of an office is fiscally responsible and in the best interest of defendants found to be incompetent.\nThe board may contract with the Office of State Court Administrator for administrative support services for the fiscal years following fiscal year 2022.\nSections 15.039 and 15.471 to 15.474 apply to the Minnesota Competency Attainment Board.\nAccess to records of the board is subject to the Rules of Public Access for Records of the Judicial Branch. The board may propose amendments for supreme court consideration.",
	"repealed": false
}