{
	"id": "135A.144",
	"url": "https://www.revisor.mn.gov/statutes/cite/135A.144",
	"title": "135A.144 TRANSCRIPT ACCESS.",
	"text": "(a) The terms defined in this subdivision apply to this section.\n(b) \"Debt\" means any money, obligation, claim, or sum, due or owed, or alleged to be due or owed, from a student. Debt does not include the fee, if any, charged to all students for the actual costs of providing the transcripts.\n(c) \"School\" means a public institution governed by the Board of Trustees of the Minnesota State Colleges and Universities, private postsecondary educational institution as defined under section 136A.62 or 136A.821, or public or private entity that is responsible for providing transcripts to current or former students of an educational institution. Institutions governed by the Board of Regents of the University of Minnesota are requested to comply with this section.\n(d) \"Transcript\" means the statement of an individual's academic record, including official transcripts or the certified statement of an individual's academic record provided by a school, and unofficial transcripts or the uncertified statement of an individual's academic record provided by a school.\n(a) A school must not refuse to provide a transcript for a current or former student because the student owes a debt to the school if:\n(1) the debt owed is less than $1,000;\n(2) the student has entered into and, as determined by the institution, is in compliance with a payment plan with the school;\n(3) the transcript request is made by a prospective employer for the student;\n(4) the school has sent the debt for repayment to the Department of Revenue or to a collection agency, as defined in section 332.31, subdivision 3, external to the institution and the debt has not been returned to the institution unpaid; or\n(5) the person is incarcerated at a Minnesota correctional facility.\n(b) A school must not charge an additional or higher fee for obtaining a transcript or provide less favorable treatment of a transcript request because a student owes a debt to the originating school.\n(a) A school that uses transcript issuance as a tool for debt collection must have a policy accessible to students that outlines how the school collects on debts owed to the school.\n(b) A school shall seek to use transcript issuance as a tool for debt collection for the fewest number of cases possible and in a manner that allows for the quickest possible resolution of the debt benefiting the student's educational progress.",
	"repealed": false
}