{
	"id": "103G.2241",
	"url": "https://www.revisor.mn.gov/statutes/cite/103G.2241",
	"title": "103G.2241 EXEMPTIONS.",
	"text": "A replacement plan for wetlands is not required for:\n(1) impacts to wetlands on agricultural land labeled prior-converted cropland and impacts to wetlands resulting from drainage maintenance activities authorized by the United States Department of Agriculture, Natural Resources Conservation Service, on areas labeled farmed wetland, farmed-wetland pasture, and wetland. The prior-converted cropland, farmed wetland, farmed-wetland pasture, or wetland must be labeled on a valid final certified wetland determination issued by the Natural Resources Conservation Service in accordance with Code of Federal Regulations, title 7, part 12, as amended. It is the responsibility of the owner or operator of the land to provide a copy of the final certified wetland determination to, and allow the Natural Resources Conservation Service to share related information with, the local government unit and the board for purposes of verification;\n(2) activities in a wetland conducted as part of normal farming practices. For purposes of this clause, \"normal farming practices\" means farming, silvicultural, grazing, and ranching activities such as plowing, seeding, cultivating, and harvesting for the production of feed, food, and fiber products, but does not include activities that result in the draining of wetlands;\n(3) soil and water conservation practices approved by the soil and water conservation district, after review by the Technical Evaluation Panel;\n(4) wetland impacts resulting from aquaculture activities, including pond excavation and construction and maintenance of associated access roads and dikes, authorized under and conducted in accordance with a permit issued by the United States Army Corps of Engineers under section 404 of the federal Clean Water Act, United States Code, title 33, section 1344, but not including construction or expansion of buildings;\n(5) wetland impacts resulting from wild rice production activities, including necessary diking and other activities, authorized under and conducted in accordance with a permit issued by the United States Army Corps of Engineers under section 404 of the federal Clean Water Act, United States Code, title 33, section 1344; or\n(6) agricultural activities on agricultural land that is subject to the swampbuster provisions of the federal farm program restrictions consistent with a memorandum of understanding and related agreements between the board and the United States Department of Agriculture, Natural Resources Conservation Service.\n(a) A replacement plan is not required for draining or filling of wetlands, except for draining wetlands that have been in existence for more than 25 years, resulting from maintenance and repair of existing drainage systems, including public drainage systems.\n(b) A public drainage authority may, as part of the repair of a public drainage system, as defined in section 103E.005, subdivision 12, install control structures, realign the ditch, construct dikes along the ditch, or make other modifications as necessary to prevent the drainage of wetlands.\nA replacement plan for wetlands is not required for activities authorized under the federal Clean Water Act, section 404, or the Rivers and Harbors Act, section 10, regulations that meet minimum state standards under this chapter and sections 103A.202 and 103B.3355 and that have been approved by the Board of Water and Soil Resources, the commissioners of natural resources and agriculture, and the Pollution Control Agency.\nA replacement plan for wetlands is not required for:\n(1) activities in a wetland restored or created for conservation purposes under a contract or easement providing the landowner with the right to drain the restored or created wetland; or\n(2) activities in a wetland restored or created by a landowner without any assistance or financing from public agencies or private entities other than the landowner and the wetland has not been used for wetland replacement or deposited in the state wetland bank.\nA replacement plan for wetlands is not required for activities in a wetland created solely as a result of:\n(1) beaver dam construction;\n(2) blockage of culverts through roadways maintained by a public or private entity;\n(3) actions by public or private entities that were taken for a purpose other than creating the wetland; or\n(4) any combination of clauses (1) to (3).\n(a) A replacement plan for wetlands is not required for wetland impacts resulting from:\n(1) new placement or maintenance, repair, enhancement, realignment, or replacement of existing utility or utility-type service, including pipelines, when wetland impacts are authorized under and conducted in accordance with a permit issued by the United States Army Corps of Engineers under section 404 of the federal Clean Water Act, United States Code, title 33, section 1344, and the direct and indirect impacts of the proposed project have been avoided and minimized to the extent possible;\n(2) activities associated with operation, routine maintenance, or emergency repair of existing utilities and public work structures, including pipelines, provided the activities do not result in additional wetland intrusion or additional draining or filling of a wetland either wholly or partially; or\n(3) repair and updating of existing subsurface sewage treatment systems necessary to comply with local, state, and federal regulations.\n(b) Work of an emergency nature may proceed as necessary, and any drain or fill activities must be addressed with the local government unit after the emergency work has been completed.\nA replacement plan for wetlands is not required for:\n(1) temporarily crossing or entering a wetland to perform silvicultural activities, including timber harvest as part of a forest management activity, so long as the activity limits the impact on the hydrologic and biologic characteristics of the wetland; the activities do not result in the construction of dikes, drainage ditches, tile lines, or buildings; and the timber harvesting and other silvicultural practices do not result in the drainage of the wetland or public waters; or\n(2) permanent access for forest roads across wetlands so long as the activity limits the impact on the hydrologic and biologic characteristics of the wetland; the construction activities do not result in the access becoming a dike, drainage ditch, or tile line; filling is avoided wherever possible; and there is no drainage of the wetland or public waters.\n[Repealed, 2007 c 57 art 1 s 170]\n(a) Except as provided in paragraphs (d), (e), (f), (g), (h), and (i), a replacement plan for wetlands is not required for impacts to the following amounts of wetlands, excluding the permanently and semipermanently flooded areas of wetlands, as part of a project outside of the shoreland wetland protection zone:\n(1) one-quarter acre of wetland in a greater than 80 percent area;\n(2) one-tenth acre of wetland in a 50 to 80 percent area; or\n(3) one-twentieth acre of wetland in a less than 50 percent area.\n(b) Except as provided in paragraphs (e), (f), (g), (h), and (i), a replacement plan for wetlands is not required for up to 100 square feet of impacts to wetlands as part of a project within the shoreland wetland protection zone beyond the shoreland building setback zone.\n(c) Except as provided in paragraphs (e), (f), (g), (h), and (i), a replacement plan for wetlands is not required for up to 20 square feet of impacts to wetlands as part of a project within the shoreland building setback zone, as defined in the local shoreland management ordinance. The amount in this paragraph may be increased to 100 square feet if permanent water runoff retention or infiltration measures are established in proximity as approved by the shoreland management authority.\n(d) Except as provided in paragraphs (c), (e), (f), (g), (h), and (i), a replacement plan is not required for up to 400 square feet of impacts to the permanently and semipermanently flooded areas of wetlands as part of a project.\n(e) The amounts listed in paragraphs (a), (b), (c), and (d) may not be combined on a project.\n(f) When the total area of impacts to wetlands as part of a project exceeds the applicable amount in this subdivision, a replacement plan is required for the entire amount.\n(g) This exemption may not be combined with another exemption in this section on a project.\n(h) Property may not be divided to increase the amounts listed in paragraph (a), (b), (c), or (d).\n(i) If a local ordinance or similar local control is more restrictive than this subdivision, the local standard applies.\nA replacement plan for wetlands is not required for:\n(1) deposition of spoil resulting from excavation within a wetland for a wildlife habitat improvement project, if:\n(i) the area of deposition does not exceed five percent of the wetland area or one-half acre, whichever is less, and the spoil is stabilized and permanently seeded to prevent erosion;\n(ii) the project does not have an adverse impact on any species designated as endangered or threatened under state or federal law; and\n(iii) the project will provide wildlife habitat improvement as certified by the soil and water conservation district; or\n(2) duck blinds.\n(a) A person conducting an activity in a wetland under an exemption in subdivisions 1 to 10 shall ensure that:\n(1) appropriate erosion control measures are taken to prevent sedimentation of the water;\n(2) the activity does not block fish passage in a watercourse; and\n(3) the activity is conducted in compliance with all other applicable federal, state, and local requirements, including best management practices and water resource protection requirements established under chapter 103H.\n(b) An activity is exempt if it qualifies for any one of the exemptions, even though it may be indicated as not exempt under another exemption.\n(c) Persons proposing to conduct an exempt activity are encouraged to contact the local government unit or the local government unit's designee for advice on minimizing wetland impacts.\n(d) The board shall develop rules that address the application and implementation of exemptions and that provide for estimates and reporting of exempt wetland impacts, including those in section 103G.2241, subdivisions 2, 6, and 9.",
	"repealed": false
}