{
	"id": "62N.28",
	"url": "https://www.revisor.mn.gov/statutes/cite/62N.28",
	"title": "62N.28 NET WORTH REQUIREMENT.",
	"text": "Except as otherwise permitted by this chapter, each community network must maintain a minimum net worth equal to the greater of:\n(1) $1,000,000;\n(2) two percent of the first $150,000,000 of annual premium revenue plus one percent of annual premium revenue in excess of $150,000,000;\n(3) eight percent of the annual health services costs, except those paid on a capitated or managed hospital payment basis, plus four percent of the annual capitation and managed hospital payment costs; or\n(4) four months uncovered health services costs.\nFor purposes of this section, the following terms have the meanings given:\n(1) \"capitated basis\" means fixed per member per month payment or percentage of premium paid to a provider that assumes the full risk of the cost of contracted services without regard to the type, value, or frequency of services provided. For purposes of this definition, capitated basis includes the cost associated with operating staff model facilities;\n(2) \"managed hospital payment basis\" means agreements in which the financial risk is primarily related to the degree of utilization rather than to the cost of services; and\n(3) \"uncovered health services costs\" means the cost to the community network of health services covered by the community network for which the enrollee would also be liable in the event of the community network's insolvency, and that are not guaranteed, insured, or assumed by a person other than the community network.\nA community network may use the subtraction for premiums paid for insurance permitted under section 62D.042, subdivision 4.\nA community network may choose to comply with the net worth requirement on a phase-in basis according to the following schedule:\n(1) 50 percent of the amount required under subdivisions 1 to 3 at the time that the community network begins enrolling enrollees;\n(2) 75 percent of the amount required under subdivisions 1 to 3 at the end of the first full calendar year of operation;\n(3) 87.5 percent of the amount required under subdivisions 1 to 3 at the end of the second full calendar year of operation; and\n(4) 100 percent of the amount required under subdivisions 1 to 3 at the end of the third full calendar year of operation.\nA community network shall not maintain net worth that exceeds three times the amount required of the community network under subdivision 1. Subdivision 4 is not relevant for purposes of this subdivision.\nIf a community network has contracts with accredited capitated providers, and only for so long as those contracts or successor contracts remain in force, the net worth requirement of subdivision 1 shall be reduced by the percentage of risk ceded, but in no event shall the net worth requirements be reduced by this subdivision to less than $1,000,000. The phase-in requirements of subdivision 4 shall not be affected by this reduction.",
	"repealed": false
}