{
	"id": "245F.16",
	"url": "https://www.revisor.mn.gov/statutes/cite/245F.16",
	"title": "245F.16 PERSONNEL POLICIES AND PROCEDURES.",
	"text": "A license holder must have written personnel policies and must make them available to staff members at all times. The personnel policies must:\n(1) ensure that a staff member's retention, promotion, job assignment, or pay are not affected by a good-faith communication between the staff member and the Department of Human Services, Department of Health, Ombudsman for Mental Health and Developmental Disabilities, law enforcement, or local agencies that investigate complaints regarding patient rights, health, or safety;\n(2) include a job description for each position that specifies job responsibilities, degree of authority to execute job responsibilities, standards of job performance related to specified job responsibilities, and qualifications;\n(3) provide for written job performance evaluations for staff members of the license holder at least annually;\n(4) describe the process for disciplinary action, suspension, or dismissal of a staff person for violating the drug and alcohol policy described in section 245A.04, subdivision 1, paragraph (c);\n(5) include policies prohibiting personal involvement with patients and policies prohibiting patient maltreatment as specified under sections 245A.65, 626.557, and 626.5572 and chapters 260E and 604;\n(6) include a chart or description of organizational structure indicating the lines of authority and responsibilities;\n(7) include a written plan for new staff member orientation that, at a minimum, includes training related to the specific job functions for which the staff member was hired, program policies and procedures, patient needs, and the areas identified in subdivision 2, paragraphs (b) to (e); and\n(8) include a policy on the confidentiality of patient information.\n(a) A license holder must ensure that each staff member receives orientation training before providing direct patient care and at least 30 hours of continuing education every two years. A written record must be kept to demonstrate completion of training requirements.\n(b) Within 72 hours of beginning employment, all staff having direct patient contact must be provided orientation on the following:\n(1) specific license holder and staff responsibilities for patient confidentiality;\n(2) standards governing the use of protective procedures;\n(3) patient ethical boundaries and patient rights, including the rights of patients admitted under chapter 253B;\n(4) infection control procedures;\n(5) mandatory reporting under sections 245A.65 and 626.557 and chapter 260E, including specific training covering the facility's policies concerning obtaining patient releases of information;\n(6) HIV minimum standards as required in section 245A.19;\n(7) motivational counseling techniques and identifying stages of change; and\n(8) eight hours of training on the program's protective procedures policy required in section 245F.09, including:\n(i) approved therapeutic holds;\n(ii) protective procedures used to prevent patients from imminent danger of harming self or others;\n(iii) the emergency conditions under which the protective procedures may be used, if any;\n(iv) documentation standards for using protective procedures;\n(v) how to monitor and respond to patient distress; and\n(vi) person-centered planning and trauma-informed care.\n(c) All staff having direct patient contact must be provided annual training on the following:\n(1) infection control procedures;\n(2) mandatory reporting under sections 245A.65 and 626.557 and chapter 260E, including specific training covering the facility's policies concerning obtaining patient releases of information;\n(3) HIV minimum standards as required in section 245A.19; and\n(4) motivational counseling techniques and identifying stages of change.\n(d) All staff having direct patient contact must be provided training every two years on the following:\n(1) specific license holder and staff responsibilities for patient confidentiality;\n(2) standards governing use of protective procedures, including:\n(i) approved therapeutic holds;\n(ii) protective procedures used to prevent patients from imminent danger of harming self or others;\n(iii) the emergency conditions under which the protective procedures may be used, if any;\n(iv) documentation standards for using protective procedures;\n(v) how to monitor and respond to patient distress; and\n(vi) person-centered planning and trauma-informed care; and\n(3) patient ethical boundaries and patient rights, including the rights of patients admitted under chapter 253B.\n(e) Continuing education that is completed in areas outside of the required topics must provide information to the staff person that is useful to the performance of the individual staff person's duties.",
	"repealed": false
}