{
	"id": "268A.16",
	"url": "https://www.revisor.mn.gov/statutes/cite/268A.16",
	"title": "268A.16 EMPLOYMENT SERVICES FOR PERSONS WHO ARE DEAF, DEAFBLIND, OR HARD-OF-HEARING.",
	"text": "(a) The commissioner shall develop and implement a specialized statewide grant program to provide long-term supported employment services for persons who are deaf, deafblind, and hard-of-hearing. Programs and services eligible for grants under this section must:\n(1) assist persons who are deaf, deafblind, and hard-of-hearing in retaining and advancing in employment;\n(2) provide services with staff who must possess fluency in all forms of manual communication, including American Sign Language; knowledge of hearing loss and psychosocial implications; sensitivity to cultural issues; familiarity with community services and communication strategies for people who are hard-of-hearing and do not sign; and awareness of adaptive technology options;\n(3) provide specialized employment support services for individuals who have a combined hearing and vision loss that address the individual's unique ongoing visual and auditory communication needs; and\n(4) involve clients in the planning, development, oversight, and delivery of long-term ongoing support services.\n(b) Priority for funding shall be given to organizations with experience in developing innovative employment support services for persons who are deaf, deafblind, and hard-of-hearing. Each applicant for funds under this section shall submit an evaluation protocol as part of the grant application.\n(a) The commissioner shall develop statewide or regional grant programs to provide school-based communication, access, and employment services for youth who are deaf, deafblind, and hard-of-hearing. Services must include staff who have the skills addressed in subdivision 1, clauses (2) and (3), and expertise in serving transition-aged youth.\n(b) Priority for funding shall be given to organizations with experience in providing innovative employment support services and readiness for postsecondary training for transition-aged youths who are deaf, deafblind, and hard-of-hearing. Each applicant for funds under this section shall submit an evaluation protocol as part of the grant application.\nUp to five percent of the biennial appropriation for the purpose of this section is available to the commissioner for administration of the program.",
	"repealed": false
}