{
	"id": "302A.161",
	"url": "https://www.revisor.mn.gov/statutes/cite/302A.161",
	"title": "302A.161 POWERS.",
	"text": "A corporation has the powers set forth in this section, subject to any limitations provided in any other statute of this state or in its articles.\nA corporation has perpetual duration.\nA corporation may sue and be sued, complain and defend and participate as a party or otherwise in any legal, administrative, or arbitration proceeding, in its corporate name.\nA corporation may purchase, lease, or otherwise acquire, own, hold, improve, use, and otherwise deal in and with, real or personal property, or any interest therein, wherever situated.\nA corporation may sell, convey, mortgage, create a security interest in, lease, exchange, transfer, or otherwise dispose of all or any part of its real or personal property, or any interest therein, wherever situated.\nA corporation may purchase, subscribe for, or otherwise acquire, own, hold, vote, use, employ, sell, exchange, mortgage, lend, create a security interest in, or otherwise dispose of and otherwise use and deal in and with, securities or other interests in, or obligations of, a person or direct or indirect obligations of any domestic or foreign government or instrumentality thereof.\nA corporation may make contracts and incur liabilities, borrow money, issue its securities, and secure any of its obligations by mortgage of or creation of a security interest in all or any of its property, franchises and income.\nA corporation may invest and reinvest its funds.\nA corporation may take and hold real and personal property, whether or not of a kind sold or otherwise dealt in by the corporation, as security for the payment of money loaned, advanced, or invested.\nA corporation may conduct its business, carry on its operations, have offices, and exercise the powers granted by this chapter anywhere in the universe.\nA corporation may make donations, irrespective of corporate benefit, for the public welfare; for social, community, charitable, religious, educational, scientific, civic, literary, and testing for public safety purposes, and for similar or related purposes; for the purpose of fostering national or international amateur sports competition; and for the prevention of cruelty to children and animals.\nA corporation may pay pensions, retirement allowances, and compensation for past services to and for the benefit of, and establish, maintain, continue, and carry out, wholly or partially at the expense of the corporation, employee or incentive benefit plans, trusts, and provisions to or for the benefit of, any or all of its and its related organizations' officers, managers, directors, governors, employees, and agents and, in the case of a related organization that is a limited liability company, members who provide services to the limited liability company, and the families, dependents, and beneficiaries of any of them. It may indemnify and purchase and maintain insurance for and on behalf of a fiduciary of any of these employee benefit and incentive plans, trusts, and provisions.\nA corporation may participate in any capacity in the promotion, organization, ownership, management, and operation of any organization or in any transaction, undertaking, or arrangement that the participating corporation would have power to conduct by itself, whether or not the participation involves sharing or delegation of control with or to others.\nA corporation may provide for its benefit life insurance and other insurance with respect to the services of any or all of its officers, directors, employees, and agents, or on the life of a shareholder for the purpose of acquiring at the death of the shareholder any or all shares in the corporation owned by the shareholder.\nA corporation may have, alter at pleasure, and use a corporate seal as provided in section 302A.163.\nA corporation may adopt, amend, and repeal bylaws relating to the management of the business or the regulation of the affairs of the corporation as provided in section 302A.181.\nA corporation may establish committees of the board of directors, elect or appoint persons to the committees, and define their duties as provided in section 302A.241 and fix their compensation.\nA corporation may elect or appoint officers, employees, and agents of the corporation, and define their duties as provided in sections 302A.301 to 302A.361 and fix their compensation.\nA corporation may issue securities and rights to purchase securities as provided in sections 302A.401 to 302A.425.\nA corporation may lend money to, guarantee an obligation of, become a surety for, or otherwise financially assist persons as provided in section 302A.501.\nA corporation may make advances to its directors, officers, and employees and those of its subsidiaries as provided in section 302A.505.\nA corporation shall indemnify those persons identified in section 302A.521 against certain expenses and liabilities only as provided in section 302A.521 and may indemnify other persons.\nA corporation may conduct all or part of its business under one or more assumed names as provided in sections 333.001 to 333.06.\nA corporation may have and exercise all other powers necessary or convenient to effect any or all of the business purposes for which the corporation is incorporated.",
	"repealed": false
}