{
	"id": "174.50",
	"url": "https://www.revisor.mn.gov/statutes/cite/174.50",
	"title": "174.50 MINNESOTA STATE TRANSPORTATION FUND.",
	"text": "State assistance is needed to supplement local effort and the highway user tax distribution fund in financing capital improvements to preserve and develop a balanced transportation system throughout the state. Such a system is a proper function and concern of state government and necessary to protect the safety and personal and economic welfare of all citizens. It requires capital expenditures for public facilities, improvements, and equipment that are complementary, additional, and alternate to highways and are a proper object for contracting public debt and engaging in works of internal improvements under article XI, section 5, clause (a), of the constitution. These expenditures are needed to harmonize state and local highway systems with the requirements of the federal interstate highway system, to avoid harmful environmental impact of arterial highways on urban, scenic, and recreational areas, and to provide auxiliary facilities for the convenience and safety of persons crossing highways and persons living and working adjacent to them. Capital expenditures of this nature exceed requirements for basic highway systems and should be funded from sources other than the taxes and bonds authorized in article XIV of the constitution. However, the improvements tend to reduce the cost of maintenance of highways to the minimum required for accommodation of traffic, and the cost may and shall continue to be paid from taxes authorized in article XIV of the constitution. Immediate improvement needs are reconstruction and replacement of key bridges and approaches to remove obstructions to the flow of traffic on state and county highways, municipal streets, and town roads and expedited completion of the interstate highway system in Minnesota by paying the state share of interstate highway segments, and a portion of the local share of interstate highway substitution projects when those interstate substitution projects are approved in accordance with state and federal law.\nAn additional need of the state transportation system is the acquisition and betterment of rail lines and right-of-way for preservation in the state rail bank as provided in section 222.63.\nA Minnesota state transportation fund is created as a separate bookkeeping account in the general books of account of the state, to record receipts and disbursements of money appropriated from the fund to agencies and subdivisions of the state for the acquisition and betterment of public land, buildings, and capital improvements needed for the development of the state transportation system.\nThe commissioner of management and budget shall deposit in the fund as received all proceeds of Minnesota state transportation bonds, except accrued interest and premiums; all other money appropriated by law for the purposes of the fund; and all money granted to the state for these purposes by the federal government or any agency thereof. All such receipts are annually appropriated for the permanent construction and improvement purposes of the fund and shall be and remain available for expenditure in accordance with this section and applicable federal laws until the purposes for which the appropriations were made have been accomplished or abandoned. Upon certification to the commissioner of management and budget by the agency or subdivision to which any appropriation of bond proceeds has been made that the purpose thereof has been accomplished or abandoned, any unexpended balance of the appropriation, unless reappropriated by law, shall be transferred to the state bond fund and is appropriated to reduce the amount of tax otherwise required by the constitution to be levied for that fund. No money shall be transferred to the state transportation fund from the highway user tax distribution fund or any other fund created by article XIV of the constitution.\n[Repealed, 2004 c 180 s 1]\nBefore disbursement of an appropriation made from the fund to the commissioner of transportation for grants to subdivisions of the state, the commissioner must certify that:\n(1) the project conforms to the program authorized by the appropriation law and rules adopted by the Department of Transportation consistent therewith; and\n(2) the financing of any estimated cost of the project in excess of the amount of the grant is assured by the appropriation of the proceeds of bonds or other funds of the subdivision, or by a grant from an agency of the federal government, within the amount of funds then appropriated to that agency and allocated by it to projects within the state, and by an irrevocable undertaking, in a resolution of the governing body of the subdivision, to use all funds so made available exclusively for the project, and to pay any additional amount by which the cost exceeds the estimate through appropriation to the construction fund of additional funds or the proceeds of additional bonds to be issued by the subdivision.\nThe commissioner of transportation shall adopt rules consistent with this section that establish criteria for determining priorities and amounts of grants, which must be based on consideration of:\n(1) effectiveness of the project in eliminating a deficiency in the transportation system;\n(2) number of persons affected by the deficiency;\n(3) economic feasibility;\n(4) effect on optimum land use and other concerns of state and regional planning;\n(5) availability of other financing capability; and\n(6) adequacy of provision for proper operation and maintenance after construction.\n[Repealed, 2014 c 227 art 1 s 23]\n(a) The commissioner may make grants from the state transportation fund to a home rule or statutory city with a population of 5,000 or less for design, engineering, and construction of bridges on city streets.\n(b) Grants may be used for:\n(1) 100 percent of the design and engineering costs that are in excess of $10,000;\n(2) 100 percent of the bridge approach work costs that are in excess of $10,000; and\n(3) 100 percent of the bridge construction work costs.\nThe commissioner may make a grant to any political subdivision for replacement or rehabilitation of a fracture-critical bridge. To be eligible for a grant under this subdivision, the project must produce a bridge structure:\n(1) that is no longer classified as fracture critical, by having alternate load paths; and\n(2) whose failure of a main component will not result in the collapse of the bridge.\n(a) The commissioner may make grants pursuant to this subdivision only if an enacted appropriation specifically references this specific subdivision. The commissioner must not make grants pursuant to this subdivision if an enacted appropriation references this section generally.\n(b) When authorized as provided in paragraph (a), the commissioner may make a grant to any political subdivision for replacement or rehabilitation of a major local bridge with a total bridge cost estimate of $7,000,000 or more. If in any year money appropriated for local bridge replacement and rehabilitation projects under this subdivision remains available after all identified and eligible projects under this subdivision have been funded, the commissioner may use remaining funds to make grants under this section for replacement or rehabilitation projects with a total bridge cost estimate of less than $7,000,000.\n(a) The commissioner of transportation shall develop rules, procedures for application for grants, conditions of grant administration, standards, and criteria as provided under subdivision 6, including bridge specifications, in cooperation with road authorities of political subdivisions, for use in the administration of funds appropriated to the commissioner and for the administration of grants to subdivisions. The commissioner must publish all rules, procedures, conditions, standards, and criteria on the department's website. Grants under this section are subject to the procedures and criteria established in this subdivision and in subdivisions 5 and 6.\n(b) The maximum use of standardized bridges is encouraged. Regardless of the size of the existing bridge, a bridge or replacement bridge is eligible for assistance from the state transportation fund if a hydrological survey indicates that the bridge or replacement bridge must be ten feet or more in length.\n(c) As part of the standards or rules, the commissioner shall, in consultation with local road authorities, establish a minimum distance between any two bridges that cross over the same river, stream, or waterway, so that only one of the bridges is eligible for a grant under this section. As appropriate, the commissioner may establish exceptions from the minimum distance requirement or procedures for obtaining a variance.\n(d) Political subdivisions may use grants made under this section to rehabilitate, construct, or reconstruct bridges, including but not limited to:\n(1) matching federal aid grants to construct or reconstruct key bridges;\n(2) paying the costs to abandon an existing bridge that is deficient and in need of replacement but where no replacement will be made;\n(3) paying the costs to construct a road or street to facilitate the abandonment of an existing bridge if the commissioner determines that the bridge is deficient, and that construction of the road or street is more economical than replacement of the existing bridge; and\n(4) paying the costs of acquiring and rehabilitating and reconstructing historic bridges, including the costs of: (i) acquiring salvageable components from historic bridges and the disassembly, repurposing, restoring, and transportation to a new location of the salvageable components for the construction, rehabilitation, or reconstruction of a bridge; and (ii) related environmental documentation, preliminary design, and final design associated with the reconstruction of historic bridges.\n(e) Funds appropriated to the commissioner from the Minnesota state transportation fund shall be segregated from the highway tax user distribution fund and other funds created by article XIV of the Minnesota Constitution.\n(f) The commissioner must maintain a local bridge project list that includes every local bridge replacement or rehabilitation project which has approved plans. The list must include the total bridge cost estimate for each project. The commissioner must update this list annually. The commissioner must publish the list on the department's website.\n(g) The commissioner is prohibited from awarding a grant of $7,000,000 or more under this section for a local bridge replacement or rehabilitation project, except:\n(1) for major local bridges as provided in subdivision 6d; or\n(2) if every other local bridge replacement or rehabilitation project with a total bridge cost estimate of $7,000,000 or less on the local bridge project list required by paragraph (f) has been fully funded.\n(h) The commissioner must publish on the department's website a list of all projects that were considered for funding. The list must identify the projects that were selected and the projects that were not selected. For each project that was not selected, the commissioner must include the reason it was not selected. This paragraph does not apply when there is no funding from any source for the program in a fiscal year.\n(i) Notwithstanding subdivision 1, grants for costs under paragraph (d), clause (2), are limited to general fund appropriations that must be segregated from all funds authorized under articles XI and XIV of the Minnesota Constitution.\nFor purposes of this section, a \"total bridge cost estimate\" includes the costs for the work directly relating only to the bridge itself.",
	"repealed": false
}