{
	"id": "260.761",
	"url": "https://www.revisor.mn.gov/statutes/cite/260.761",
	"title": "260.761 INQUIRY OF TRIBAL LINEAGE; NOTICE TO TRIBES, PARENTS, AND INDIAN CUSTODIANS; ACCESS TO FILES.",
	"text": "(a) The child-placing agency or petitioner shall inquire of the child, the child's parents and custodians, and other appropriate persons whether there is any reason to believe that a child brought to the agency's attention may have lineage to an Indian Tribe. This inquiry shall occur at the time the child comes to the attention of the child-placing agency or petitioner and shall continue throughout the involvement of the child-placing agency or petitioner.\n(b) In any child placement proceeding, the court shall inquire of the child, the child's parents, custodian, and any person participating in the proceedings whether the child has any American Indian heritage or lineage to an Indian Tribe. The inquiry shall be made at the commencement of the proceeding and all responses must be on the record. The court must instruct the parties to inform the court if they subsequently receive information that provides reason to believe the child is an Indian child.\n(c) If there is reason to believe the child is an Indian child, but the court does not have sufficient evidence to determine whether the child is an Indian child, the court shall:\n(1) confirm with a report, declaration, or testimony in the record that the child-placing agency or petitioner used due diligence to identify and work with all of the Tribes for which there is reason to believe the child may be a member of or eligible for membership to verify whether the child is an Indian child; and\n(2) proceed with the case as if the child is an Indian child until it is determined on the record that the child does not meet the definition of Indian child.\n(a) When a child-placing agency or petitioner has information that a family assessment, investigation, or noncaregiver human trafficking assessment being conducted may involve an Indian child, the child-placing agency or petitioner shall notify the Indian child's Tribe of the family assessment, investigation, or noncaregiver human trafficking assessment according to section 260E.18. The child-placing agency or petitioner shall provide initial notice by telephone and by email or facsimile and shall include the child's full name and date of birth; the full names and dates of birth of the child's biological parents; and if known the full names and dates of birth of the child's grandparents and of the child's Indian custodian. If information regarding the child's grandparents or Indian custodian is not immediately available, the child-placing agency or petitioner shall continue to request this information and shall notify the Tribe when it is received. Notice shall be provided to all Tribes to which the child may have any Tribal lineage. The child-placing agency or petitioner shall request that the Tribe or a designated Tribal representative participate in evaluating the family circumstances, identifying family and Tribal community resources, and developing case plans. The child-placing agency or petitioner shall continue to include the Tribe in service planning and updates as to the progress of the case.\n(b) When a child-placing agency or petitioner has information that a child receiving services may be an Indian child, the child-placing agency or petitioner shall notify the Tribe by telephone and by email or facsimile of the child's full name and date of birth, the full names and dates of birth of the child's biological parents, and, if known, the full names and dates of birth of the child's grandparents and of the child's Indian custodian. This notification must be provided for the Tribe to determine if the child is a member or eligible for Tribal membership, and the child-placing agency or petitioner must provide this notification to the Tribe within seven days of receiving information that the child may be an Indian child. If information regarding the child's grandparents or Indian custodian is not available within the seven-day period, the child-placing agency or petitioner shall continue to request this information and shall notify the Tribe when it is received. Notice shall be provided to all Tribes to which the child may have any Tribal lineage.\n(c) In all child placement proceedings, when a court has reason to believe that a child placed in emergency protective care is an Indian child, the court administrator or a designee shall, as soon as possible and before a hearing takes place, notify the Tribal social services agency by telephone and by email or facsimile of the date, time, and location of the emergency protective care or other initial hearing. The court shall allow appearances by telephone, video conference, or other electronic medium for Tribal representatives, the Indian child's parents, or the Indian custodian.\n(d) In all child placement proceedings, except for adoptive or preadoptive placement proceedings, when a court has reason to believe the child is an Indian child, the child-placing agency or petitioner shall provide notice of the proceedings and a copy of any petition to the Indian child's parents, Indian custodian, and the Indian child's Tribe and shall effect service of any notice and petition governed by sections 260.751 to 260.835 upon the parent, Indian custodian, and the Indian child's Tribe by certified mail or registered mail, return receipt requested. If the identity or location of the Indian child's parents or Indian custodian or Tribe cannot be determined, the child-placing agency or petitioner shall provide the notice required in this paragraph to the United States Secretary of the Interior, Bureau of Indian Affairs by certified or registered mail, return receipt requested. Where service is only accomplished through the United States Secretary of the Interior, Bureau of Indian Affairs, the initial hearing shall not be held until 20 days after notice upon the Tribe or the Secretary of the Interior.\n(e) Notice under this subdivision must be in clear and understandable language and include the following:\n(1) the child's name, date of birth, and birth place;\n(2) all names known for the parents and Indian custodian, including maiden, married, former names, and aliases, correctly spelled;\n(3) the dates of birth, birth place, and Tribal enrollment numbers of the Indian child, the Indian child's parents, and the Indian custodian, if known;\n(4) the full names, dates of birth, birth places, and Tribal enrollment or affiliation information of direct lineal ancestors of the child, other extended family members, and custodians of the child, if known;\n(5) the name of any and all Indian Tribes in which the child is or may be a member or eligible for membership in; and\n(6) statements setting out:\n(i) the name of the petitioner and name and address of the petitioner's attorney;\n(ii) the right of any parent or Indian custodian of the Indian child, to intervene in the child placement proceedings, if not already a party;\n(iii) the right of the Indian child's Tribe to intervene in the proceedings at any time;\n(iv) the right of the Indian child, the Indian child's parent, and the Indian custodian to court-appointed counsel if they meet the requirements in section 611.17;\n(v) the right to be granted, upon request, up to 20 additional days to prepare for the child-placement proceedings;\n(vi) the right of the Indian child's parent, the Indian custodian, and the Indian child's Tribe to petition the court for transfer of the proceedings to Tribal court;\n(vii) the mailing addresses and telephone numbers of the court and information related to all parental and custodial rights of the parent or Indian custodian; and\n(viii) that all parties must maintain confidentiality of all information contained in the notice and must not provide the information to anyone other than their attorney.\n(f) A Tribe, the Indian child's parents, or the Indian custodian may request up to 20 additional days to prepare for the initial hearing. The court shall allow appearances by telephone, video conference, or other electronic medium for Tribal representatives, the Indian child's parents, or the Indian custodian.\n(g) A child-placing agency or petitioner must provide the notices required under this subdivision at the earliest possible time to facilitate involvement of the Indian child's Tribe. Nothing in this subdivision is intended to hinder the ability of the child-placing agency, petitioner, and the court to respond to an emergency situation. Lack of participation by a Tribe shall not prevent the Tribe from intervening in services and proceedings at a later date. A Tribe may participate in a case at any time. At any stage of the child-placing agency's or petitioner's involvement with an Indian child, the child-placing agency or petitioner shall provide full cooperation to the Tribal social services agency, including disclosure of all data concerning the Indian child. Nothing in this subdivision relieves the child-placing agency or petitioner of satisfying the notice requirements in state or federal law.\n(h) The court shall allow appearances by telephone, video conference, or other electronic means for Tribal representatives at all hearings and trials. The court shall allow appearances by telephone, video conference, or other electronic means for the Indian child's parents or Indian custodian for all hearings, except that the court may require an in-person appearance for trials or other evidentiary or contested hearings.\n[See Note.]\nIn any adoptive or preadoptive placement proceeding, including voluntary proceedings, where any party or participant has reason to believe that a child who is the subject of an adoptive or preadoptive placement proceeding is or may be an \"Indian child,\" as defined in section 260.755, subdivision 8, and United States Code, title 25, section 1903(4), the child-placing agency or petitioner shall notify the Indian child's Tribe by registered mail or certified mail with return receipt requested of the pending proceeding and of the right of intervention under subdivision 6. If the identity or location of the Indian child's Tribe cannot be determined, the notice must be given to the United States Secretary of Interior in like manner. No preadoptive or adoptive placement proceeding may be held until at least 20 days after receipt of the notice by the Tribe or the secretary. Upon request, the Tribe must be granted up to 20 additional days to prepare for the proceeding. The child-placing agency or petitioner shall include in the notice the identity of the birth parents and Indian child absent written objection by the birth parents. The child-placing agency or petitioner shall inform the birth parents of the Indian child of any services available to the Indian child through the child's Tribal social services agency, including child placement services, and shall additionally provide the birth parents of the Indian child with all information sent from the Tribal social services agency in response to the notice.\nIf the child-placing agency, petitioner, the court, or any party has reason to believe that a child who is the subject of a child placement proceeding is or may be an Indian child but the father of the child is unknown and has not registered with the fathers' adoption registry pursuant to section 259.52, the child-placing agency or petitioner shall provide to the Tribe believed to be the Indian child's Tribe information sufficient to enable the Tribe to determine the child's eligibility for membership in the Tribe, including, but not limited to, the legal and maiden name of the birth mother, her date of birth, the names and dates of birth of her parents and grandparents, and, if available, information pertaining to the possible identity, Tribal affiliation, or location of the birth father. If the identity or location of the Indian child's Tribe cannot be determined, the notice must be given to the United States Secretary of Interior in like manner.\nIn cases where a child-placing agency or party to an adoptive placement knows or has reason to believe that a child is or may be an Indian child, proof of service upon the Indian child's Tribe or the secretary of interior must be filed with the adoption petition.\nIn any child placement proceeding under sections 260.751 to 260.835, the Indian child's Tribe shall have a right to intervene at any point in the proceeding.\nAt any stage of the child-placing agency or petitioner's involvement with an Indian child, the child-placing agency or petitioner shall, upon request, give the Tribal social services agency full cooperation including access to all files concerning the Indian child. If the files contain confidential or private data, the child-placing agency or petitioner may require execution of an agreement with the Tribal social services agency to maintain the data according to statutory provisions applicable to the data.\nMS 2022 [Repealed by amendment, 2023 c 16 s 16]\nA child-placing agency or individual petitioner shall notify an Indian child's Tribe or Tribes by telephone and by email or facsimile immediately but no later than 24 hours after receiving information on a missing child as defined under section 260C.212, subdivision 13, paragraph (a).",
	"repealed": false
}