{
	"id": "62D.07",
	"url": "https://www.revisor.mn.gov/statutes/cite/62D.07",
	"title": "62D.07 EVIDENCE OF COVERAGE; REQUIRED TERMS.",
	"text": "Every health maintenance organization enrollee residing in this state is entitled to evidence of coverage or contract. The health maintenance organization or its designated representative shall issue the evidence of coverage or contract.\nNo evidence of coverage or contract, or amendment thereto shall be issued or delivered to any person in this state until a copy of the form of the evidence of coverage or contract or amendment thereto has been filed with the commissioner of health pursuant to section 62D.03 or 62D.08.\nContracts and evidences of coverage shall contain:\n(1) no provisions or statements which are unjust, unfair, inequitable, misleading, deceptive, or which are untrue, misleading, or deceptive as defined in section 62D.12, subdivision 1;\n(2) a clear, concise and complete statement of:\n(i) the health care services and the insurance or other benefits, if any, to which the enrollee is entitled under the health maintenance contract;\n(ii) any exclusions or limitations on the services, kind of services, benefits, or kind of benefits, to be provided, including any deductible or co-payment feature and requirements for referrals, prior authorizations, and second opinions;\n(iii) where and in what manner information is available as to how services, including emergency and out of area services, may be obtained;\n(iv) the total amount of payment and co-payment, if any, for health care services and the indemnity or service benefits, if any, which the enrollee is obligated to pay with respect to individual contracts, or an indication whether the plan is contributory or noncontributory with respect to group certificates; and\n(v) a description of the health maintenance organization's method for resolving enrollee complaints and a statement identifying the commissioner as an external source with whom complaints may be registered; and\n(3) on the cover page of the evidence of coverage and contract, a clear and complete statement of enrollees' rights. The statement must be in bold print and captioned \"Important Enrollee Information and Enrollee Bill of Rights\" and must include but not be limited to the following provisions in the following language or in substantially similar language approved in advance by the commissioner, except that paragraph (8) does not apply to prepaid health plans providing coverage for programs administered by the commissioner of human services:\nENROLLEE INFORMATION\n(1) COVERED SERVICES: Services provided by (name of health maintenance organization) will be covered only if services are provided by participating (name of health maintenance organization) providers or authorized by (name of health maintenance organization). Your contract fully defines what services are covered and describes procedures you must follow to obtain coverage.\n(2) PROVIDERS: Enrolling in (name of health maintenance organization) does not guarantee services by a particular provider on the list of providers. When a provider is no longer part of (name of health maintenance organization), you must choose among remaining (name of the health maintenance organization) providers.\n(3) REFERRALS: Certain services are covered only upon referral. See section (section number) of your contract for referral requirements. All referrals to non-(name of health maintenance organization) providers and certain types of health care providers must be authorized by (name of health maintenance organization).\n(4) EMERGENCY SERVICES: Emergency services from providers who are not affiliated with (name of health maintenance organization) will be covered. Your contract explains the procedures and benefits associated with emergency care from (name of health maintenance organization) and non-(name of health maintenance organization) providers.\n(5) EXCLUSIONS: Certain services or medical supplies are not covered. You should read the contract for a detailed explanation of all exclusions.\n(6) CONTINUATION: You may convert to an individual health maintenance organization contract or continue coverage under certain circumstances. These continuation and conversion rights are explained fully in your contract.\n(7) CANCELLATION: Your coverage may be canceled by you or (name of health maintenance organization) only under certain conditions. Your contract describes all reasons for cancellation of coverage.\n(8) NEWBORN COVERAGE: If your health plan provides for dependent coverage, a newborn infant is covered from birth, but only if services are provided by participating (name of health maintenance organization) providers or authorized by (name of health maintenance organization). Certain services are covered only upon referral. (Name of health maintenance organization) will not automatically know of the infant's birth or that you would like coverage under your plan. You should notify (name of health maintenance organization) of the infant's birth and that you would like coverage. If your contract requires an additional premium for each dependent, (name of health maintenance organization) is entitled to all premiums due from the time of the infant's birth until the time you notify (name of health maintenance organization) of the birth. (Name of health maintenance organization) may withhold payment of any health benefits for the newborn infant until any premiums you owe are paid.\n(9) PRESCRIPTION DRUGS AND MEDICAL EQUIPMENT: Enrolling in (name of health maintenance organization) does not guarantee that any particular prescription drug will be available nor that any particular piece of medical equipment will be available, even if the drug or equipment is available at the start of the contract year.\nENROLLEE BILL OF RIGHTS\n(1) Enrollees have the right to available and accessible services including emergency services, as defined in your contract, 24 hours a day and seven days a week.\n(2) Enrollees have the right to be informed of health problems, and to receive information regarding treatment alternatives and risks which is sufficient to assure informed choice.\n(3) Enrollees have the right to refuse treatment, and the right to privacy of medical and financial records maintained by the health maintenance organization and its health care providers, in accordance with existing law.\n(4) Enrollees have the right to file a complaint with the health maintenance organization and the commissioner of health and the right to initiate a legal proceeding when experiencing a problem with the health maintenance organization or its health care providers.\n(5) Enrollees have the right to a grace period of 31 days for the payment of each premium for an individual health maintenance contract falling due after the first premium during which period the contract shall continue in force.\n(6) Medicare enrollees have the right to voluntarily disenroll from the health maintenance organization and the right not to be requested or encouraged to disenroll except in circumstances specified in federal law.\n(7) Medicare enrollees have the right to a clear description of nursing home and home care benefits covered by the health maintenance organization.\nA grace period of 31 days shall be granted for payment of each premium for an individual health maintenance contract falling due after the first premium, during which period the contract shall continue in force. Individual health maintenance organization contracts shall clearly state the existence of the grace period.\nIndividual health maintenance contracts shall state that any person may cancel the contract within ten days of its receipt and have the premium paid refunded if, after examination of the contract, the individual is not satisfied with it for any reason. The individual is responsible for repaying the health maintenance organization for any services rendered or claims paid by the health maintenance organization during the ten days.\nThe contract and evidence of coverage shall clearly explain the conditions upon which a health maintenance organization may terminate coverage.\nThe contract and evidence of coverage shall clearly explain continuation and conversion rights afforded to enrollees.\nIndividual and group contract holders shall be given 30 days' advance, written notice of any change in subscriber fees or benefits.\nIndividual health maintenance organization contracts shall be delivered to enrollees no later than the date coverage is effective. For enrollees with group contracts, an evidence of coverage shall be delivered or issued for delivery not more than 15 days from the date the health maintenance organization is notified of the enrollment or the effective date of coverage, whichever is later.\nAn individual health maintenance organization contract and an evidence of coverage must contain a Department of Health telephone number that the enrollee can call to register a complaint about a health maintenance organization.",
	"repealed": false
}