{
	"id": "549.211",
	"url": "https://www.revisor.mn.gov/statutes/cite/549.211",
	"title": "549.211 SANCTIONS IN CIVIL ACTIONS.",
	"text": "The parties by their attorneys in a civil action shall attach to and make a part of the pleading, written motions, and papers served on the opposite party or parties a signed acknowledgment stating that the parties acknowledge that sanctions may be imposed under this section.\nBy presenting to the court, whether by signing, filing, submitting, or later advocating, a pleading, written motion, or other paper, an attorney or unrepresented party is certifying that to the best of the person's knowledge, information, and belief, formed after an inquiry reasonable under the circumstances:\n(1) it is not being presented for any improper purpose, such as to harass or to cause unnecessary delay or needless increase in the cost of litigation;\n(2) the claims, defenses, and other legal contentions are warranted by existing law or by a nonfrivolous argument for the extension, modification, or reversal of existing law or the establishment of new law;\n(3) the allegations and other factual contentions have evidentiary support or, if specifically so identified, are likely to have evidentiary support after a reasonable opportunity for further investigation or discovery; and\n(4) the denials of factual contentions are warranted on the evidence or, if specifically so identified, are reasonably based on a lack of information or belief.\nIf, after notice and a reasonable opportunity to respond, the court determines that subdivision 2 has been violated, the court may, subject to the conditions in this section, impose an appropriate sanction upon the attorneys, law firms, or parties that have violated subdivision 2 or are responsible for the violation.\n(a) A motion for sanctions under this section must be made separately from other motions or requests and describe the specific conduct alleged to violate subdivision 2. It must be served as provided under the Rules of Civil Procedure, but may not be filed with or presented to the court unless, within 21 days after service of the motion, or another period as the court may prescribe, the challenged paper, claim, defense, contention, allegation, or denial is not withdrawn or appropriately corrected. If warranted, the court may award to the party prevailing on the motion the reasonable expenses and attorney fees incurred in presenting or opposing the motion. Absent exceptional circumstances, a law firm is jointly responsible for violations committed by its partners, associates, and employees.\n(b) On its own initiative, the court may enter an order describing the specific conduct that appears to violate subdivision 2 and directing an attorney, law firm, or party to show cause why it has not violated subdivision 2 with respect to that conduct.\n(a) A sanction imposed for violation of this section must be limited to what is sufficient to deter repetition of the conduct or comparable conduct by others similarly situated. Subject to the limitations in paragraph (b), the sanction may consist of, or include, directives of a nonmonetary nature, an order to pay a penalty into court, or, if imposed on motion and warranted for effective deterrence, an order directing payment to the movant of some or all of the reasonable attorney fees and other expenses incurred as a direct result of the violation.\n(b) Monetary sanctions may not be awarded against a represented party for a violation of subdivision 2, clause (2). Monetary sanctions may not be awarded on the court's initiative unless the court issues its order to show cause before a voluntary dismissal or settlement of the claims made by or against the party which is, or whose attorneys are, to be sanctioned.\n(c) When imposing sanctions, the court shall describe the conduct determined to constitute a violation of this section and explain the basis for the sanction imposed.\n(a) This section does not apply to disclosures and discovery requests, responses, objections, and motions that are subject to discovery provisions and remedies of the Rules of Civil Procedure.\n(b) An order or award of sanctions under this section is without prejudice and an alternative to sanctions that may be asserted under the Rules of Civil Procedure.",
	"repealed": false
}