{
	"id": "41A.04",
	"url": "https://www.revisor.mn.gov/statutes/cite/41A.04",
	"title": "41A.04 APPLICATION AND APPROVAL.",
	"text": "(a) Any applicant may file a written application with the state commissioner of employment and economic development on behalf of the board, to be considered by the board, for a guaranty by the state of a portion of a loan or for issuance of bonds for an agricultural resource project. In general, the application must provide information similar to that required by an investment banking or other financial institution considering such a project for debt financing. Specifically, each application must include in brief but precise form the following information, as supplied by the applicant, the borrower, or the lender:\n(1) a description of the scope, nature, extent, and location of the proposed project, including the identity of the borrower and a preliminary or conceptual design of the project;\n(2) a description of the technology to be used in the project and the prior construction and operating experience of the borrower with such projects;\n(3) a detailed estimate of the items comprising the total cost of the project, including escalation and contingencies, with explanation of the assumptions underlying the estimate;\n(4) a general description of the financial plan for the project, including the mortgage and security interests to be granted for the security of the guaranteed loan or the bonds, and all sources of equity, grants, or contributions or of borrowing the repayment of which is not to be secured by the mortgage and security interests, or, if so secured, is expressly subordinated to the guaranteed loan;\n(5) an environmental report analyzing potential environmental effects of the project, any necessary or proposed mitigation measures, and other relevant data available to the applicant to enable the board to make an environmental assessment;\n(6) a list of applications to be filed and estimated dates of approvals of permits required by federal, state, and local government agencies as conditions for construction and commencement of operation of the project;\n(7) an estimated construction schedule;\n(8) an analysis of the estimated cost of production of and market for the product, including economic factors justifying the analysis and proposed and actual marketing contracts, letters of intent, and contracts for the supply of feedstock;\n(9) a description of the management experience of the borrower in organizing and undertaking similar projects;\n(10) pro forma cash flow statements for the first five years of project operation including income statements and balance sheets;\n(11) a description of the borrower's organization and, where applicable, a copy of its articles of incorporation or partnership agreement and bylaws;\n(12) the estimated amount of the loan or bonds and percentage of the guaranty requested, the proposed repayment schedule, and other terms and conditions and security provisions of the loan;\n(13) an estimate of the amounts and times of receipt of guaranty fees, sales and use taxes, property tax increments, and any other governmental charges which may be available for the support of the agricultural development fund as a result of the construction of the project, with an analysis of the assumptions on which the estimate is based;\n(14) a copy of any lending commitment issued by a lender to the borrower;\n(15) a statement from the lender, if identified, as to its general experience in financing and servicing debt incurred for projects of the size and general type of the project, and its proposed servicing and monitoring plan; and\n(16) additional information required by the board.\n(b) If the application is made by an applicant other than the county or rural development finance authority and tax increment financing is to be used for the project, the application must include a copy of a resolution adopted by the governing body of the county or rural development finance authority in which the project is located. The resolution must authorize the use of tax increment financing for the project as required by section 41A.06, subdivision 5.\nNotwithstanding any other law or rule, no environmental impact statement must be completed prior to the approval of an application and the issuance of a conditional commitment for the guaranty of a loan for an agricultural resource project, or the taking of any other action permitted by sections 41A.01 to 41A.09, including the issuance of bonds, which is considered necessary or desirable by the board to prepare for a final commitment and to make it effective. Environmental review, to the extent required by law, shall be made in conjunction with the issuance by state agencies of environmental permits for the project. Permits may be applied for prior to the issuance of a conditional commitment. Action shall be taken as expeditiously as possible on environmental review and all permits required. Environmental review shall be completed within 180 days after the initial filing of an application to the Pollution Control Agency for the first permit. Final action shall be taken on permits within 90 days after completion of environmental review or, as to any permit requiring a public hearing, within 90 days after the receipt of the administrative law judge's report.\nThe commissioner of employment and economic development on behalf of the board shall determine as to each project for which an application is submitted whether it appears in the commissioner's judgment to conform to the requirements of this chapter. The board may waive any of the application requirements in subdivision 1 if it determines in its sole discretion that the waiver of the requirements is necessary or appropriate to carry out the purposes of this chapter. The board may not waive the requirements of subdivision 1, paragraph (c). In evaluating applications the board shall consider the extent to which the public subsidies sought by the applicant under the program would provide the project with an unfair advantage in competing with other products produced or processed in Minnesota. It may but need not adopt rules setting forth criteria for evaluating applications for loan guaranties. Upon determination by the board that a project conforms to the requirements of this chapter, it may by resolution make on behalf of the state a conditional commitment to guarantee a portion of the proposed loan or to issue bonds as it determines, not exceeding the limitations set forth in section 41A.03. No action is allowable under section 116B.03, subdivision 1, with respect to acts of any person authorized or required in order to execute the resolution. The commitment is not binding upon the state unless the board has executed on behalf of the state a final loan guaranty instrument in conformity with section 41A.03 or has issued bonds.\nIn order to effectuate the purposes of sections 41A.01 to 41A.09, the board shall adopt rules which are subject to the provisions of chapter 14.",
	"repealed": false
}