{
	"id": "136A.126",
	"url": "https://www.revisor.mn.gov/statutes/cite/136A.126",
	"title": "136A.126 INDIAN SCHOLARSHIPS.",
	"text": "The commissioner shall establish procedures for the distribution of scholarships to a Minnesota resident student as defined under section 136A.101, subdivision 8, who:\n(1) is of one-fourth or more Indian ancestry or is an enrolled member or citizen of a federally recognized American Indian or Canadian First Nations tribe;\n(2) has applied for other existing state and federal scholarship and grant programs;\n(3) is meeting satisfactory academic progress as defined under section 136A.101, subdivision 10;\n(4) is not in default, as defined by the office, of a federal or state student educational loan;\n(5) if enrolled in an undergraduate program, is eligible or would be eligible to receive a federal Pell Grant or a state grant based on the federal needs analysis and is enrolled for nine semester credits per term or more, or the equivalent; and\n(6) if enrolled in a graduate program, demonstrates a remaining financial need in the award amount calculation and is enrolled, per term, on a half-time basis or more as defined by the postsecondary institution.\nScholarships must be for enrollment at an eligible institution that is accredited. Scholarships may also be given to students attending eligible institutions that are in candidacy status for obtaining full accreditation, and are eligible for and receiving federal financial aid programs. Students are also eligible for scholarships when enrolled in eligible institutions that have joint programs with other accredited higher education institutions.\nThe total cost of attendance shall include tuition and required fees charged by the institution and the campus-based budget used for federal financial aid for food, housing, books, supplies, transportation, and miscellaneous expenses.\n(a) Each student shall be awarded a scholarship based on the federal need analysis. Applicants are encouraged to apply for all other sources of financial aid. The amount of the award must not exceed the applicant's cost of attendance, as defined in subdivision 3, after accounting for:\n(1) the results of the federal need analysis;\n(2) the amount of a federal Pell Grant award for which the applicant is eligible;\n(3) the amount of the state grant;\n(4) the federal Supplemental Educational Opportunity Grant;\n(5) the sum of all institutional grants, scholarships, tuition waivers, and tuition remission amounts;\n(6) the sum of all Tribal scholarships;\n(7) the amount of any other state and federal gift aid; and\n(8) the amount of any private grants or scholarships.\n(b) The award shall be paid directly to the postsecondary institution where the student receives federal financial aid.\n(c) Awards are limited as follows:\n(1) the maximum award for an undergraduate is $4,000 per academic year;\n(2) the maximum award for a graduate student is $6,000 per academic year; and\n(3) the minimum award for all students is $100 per academic year.\n(d) Scholarships may not be given to any Indian student for more than three years of study for a two-year degree, certificate, or diploma program or five years of study for a four-year degree program at the undergraduate level and for more than five years at the graduate level. Students may acquire only one degree per level and one terminal graduate degree. Scholarships may not be given to any student for more than ten years including five years of undergraduate study and five years of graduate study.\n(e) Scholarships may be given to an eligible student for four quarters, three semesters, or the equivalent during the course of a single fiscal year. In calculating the award amount, the office must use the same calculation it would for any other term.\n(a) Awards must be made on a first-come, first-served basis in the order complete applications are received. If there are multiple applications with identical completion dates, those applications are further sorted by application receipt date.\n(b) Awards are made to eligible students until the appropriation is expended.\n(c) Applicants not receiving a grant and for whom the office has received a completed application are placed on a waiting list in order of application completion date.",
	"repealed": false
}