{
	"id": "237.662",
	"url": "https://www.revisor.mn.gov/statutes/cite/237.662",
	"title": "237.662 NOTICE AND DISCLOSURE REQUIREMENTS OF LONG-DISTANCE PROVIDERS.",
	"text": "When contacted by a customer regarding the purchase of long-distance telecommunications services, or when soliciting customers via mail or telephone, a provider of long-distance services shall provide the customer with the following information, if the service is being offered to the customer, about the service offering either orally or in writing:\n(1) the price or range of prices of interstate message toll service accessed by dialing \"1+\" or \"10-xxx\", including any difference in prices for evening, night, or weekend calls;\n(2) the price or range of prices of intrastate interLATA message toll service accessed by dialing \"1+\" or \"10-xxx\", including any difference in prices for evening, night, or weekend calls;\n(3) the price or range of prices of intrastate intraLATA message toll service accessed by dialing \"1+\" or \"10-xxx\", including any difference in prices for evening, night, or weekend;\n(4) any minimum volume requirements, fixed flat fees, service charges, surcharges, termination charges or other non-service-specific charges, including the fact that the provider of local service may charge a onetime fee for changing carriers; and\n(5) any special promotional rate or promotional offering related to the services or prices described in clauses (1) to (4) above, including any limitations or restrictions on the promotional rates or offerings.\nIf a customer agrees to purchase telecommunications services from the provider of long-distance services on a presubscription basis, the provider shall send the customer written information regarding services subscribed to, containing:\n(1) the information regarding prices and charges described in subdivision 1, clauses (1) to (5);\n(2) the price for calls placed with a calling card issued to the customer by the provider and any surcharge for placing calls with a calling card;\n(3) the price for calls charged to the customer when a personal \"1-800\" number for long-distance services issued to the customer by the provider is used; and\n(4) the price of directory assistance calls.\nThis written information must be sent to the customer within seven business days from the date of the verification of the customer's authorization, unless federal law or regulation requires notice to be sent by an earlier date.\nThat a telecommunications carrier has intrastate tariffs or price lists for the services listed in subdivisions 1 and 2 on file with the Public Utilities Commission or Department of Commerce is not a defense to any action brought for failure to disclose intrastate prices for which disclosure is required under this section.",
	"repealed": false
}