{
	"id": "221.0251",
	"url": "https://www.revisor.mn.gov/statutes/cite/221.0251",
	"title": "221.0251 MOTOR CARRIER OF PROPERTY; REGISTRATION.",
	"text": "(a) A person who wishes to operate as a motor carrier of property shall file a complete and accurate registration statement with the commissioner.\n(b) A registration statement must be on a form provided by the commissioner and include:\n(1) the registrant's name, including an assumed or fictitious name used by the registrant in doing business;\n(2) the registrant's mailing address and business telephone number;\n(3) the registrant's federal employer identification number and Minnesota business identification number and the identification numbers, if any, assigned to the registrant by the United States Department of Transportation, the former Interstate Commerce Commission, or the Environmental Protection Agency;\n(4) the name, title, and telephone number of the individual who is principally responsible for the operation of the registrant's transportation business;\n(5) the principal location from which the registrant conducts its transportation business and where the records required by this chapter will be kept;\n(6) if different from clause (5), the location in Minnesota where the records required by this chapter will be available for inspection and copying by the commissioner;\n(7) whether the registrant transports hazardous materials or hazardous waste;\n(8) whether the registrant's business is a corporation, partnership, limited liability partnership, limited liability company, or sole proprietorship; and\n(9) if the registrant is a foreign corporation authorized to transact business in Minnesota, the state of incorporation and the name and address of its registered agent.\nA registration statement may be signed only by a corporate officer, general partner, limited liability company board member, or sole proprietor. A signature must be notarized.\n(a) The commissioner shall issue a certificate of registration to a registrant who has filed a registration statement that complies with subdivisions 1 and 2 and paid the required fee, has a satisfactory safety rating and, if applicable, has complied with the financial responsibility requirements in section 221.141. The commissioner may not issue a certificate of registration to a registrant who has an unsatisfactory safety rating.\n(b) A certificate of registration must be numbered and bear an effective date.\n(c) A certificate of registration must be kept at the registrant's principal place of business.\nA certificate of registration is not assignable or transferable and is valid until it is suspended, revoked, or canceled.\nA registrant shall notify the commissioner in writing of any change in the information described in subdivision 1.",
	"repealed": false
}