{
	"id": "169.862",
	"url": "https://www.revisor.mn.gov/statutes/cite/169.862",
	"title": "169.862 PERMIT FOR BALED FARM PRODUCT TO EXCEED HEIGHT OR WIDTH.",
	"text": "The commissioner of transportation with respect to highways under the commissioner's jurisdiction, and local authorities with respect to highways under their jurisdiction, may issue an annual permit to enable a vehicle carrying bales of hay, straw, or cornstalks, with a total outside width of the vehicle or the load not exceeding 12 feet, and a total height of the loaded vehicle not exceeding 15 feet, to be operated on public streets and highways. Loaded vehicles operating on interstate highways within the seven-county metropolitan area may not exceed a total height of 14-1/2 feet.\nPermits issued under this section are governed by the applicable provisions of section 169.86 except as otherwise provided herein and, in addition, carry the following restrictions:\n(a) The vehicles may not be operated between sunset and sunrise, when visibility is impaired by weather, fog, or other conditions rendering persons and vehicles not clearly visible at a distance of 500 feet, or on Sunday from noon until sunset, or on the days the following holidays are observed: New Year's Day, Memorial Day, Independence Day, Labor Day, Thanksgiving Day, and Christmas Day.\n(b) The vehicles may not be operated on a trunk highway with a pavement less than 24 feet wide.\n(c) A vehicle operated under the permit must be equipped with a retractable or removable mirror on the left side so located that it will reflect to the driver a clear view of the highway for a distance of at least 200 feet to the rear of the vehicle.\n(d) A vehicle operated under the permit must display red, orange, or yellow flags, 18 inches square, as markers at the front and rear and on both sides of the load. The load must be securely bound to the transporting vehicle.\n(e) Farm vehicles not for hire carrying baled hay, straw, or cornstalks less than 20 miles are exempt from the requirement to obtain a permit. All other requirements of this section apply to vehicles transporting baled hay, straw, or cornstalks.",
	"repealed": false
}