{
	"id": "145.9575",
	"url": "https://www.revisor.mn.gov/statutes/cite/145.9575",
	"title": "145.9575 DEVELOPMENTAL AND SOCIAL-EMOTIONAL SCREENING WITH FOLLOW-UP.",
	"text": "The goal of the developmental and social-emotional screening is to identify young children at risk for developmental and behavioral concerns and provide follow-up services to connect families and young children to appropriate community-based resources and programs. The commissioner of health must work with the commissioners of human services and education to implement this section and promote interagency coordination with other early childhood programs including those that provide screening and assessment.\nThe commissioner must:\n(1) increase the awareness of developmental and social-emotional screening with follow-up in coordination with community and state partners;\n(2) expand existing electronic screening systems to administer developmental and social-emotional screening to children from birth to kindergarten entrance;\n(3) provide screening for developmental and social-emotional delays based on current recommended best practices;\n(4) review and share the results of the screening with the parent or guardian and support families in their role as caregivers by providing anticipatory guidance around typical growth and development;\n(5) refer and connect children and families with appropriate community-based services and resources when any developmental or social-emotional concerns are identified through screening; and\n(6) establish performance measures and collect, analyze, and share program data regarding population-level outcomes of developmental and social-emotional screening, referrals to community-based services, and follow-up services.\nThe commissioner must award grants to support follow-up services for children with developmental or social-emotional concerns identified through screening in order to link children and their families to appropriate community-based services and resources. Grants may also be awarded to train and utilize cultural liaisons to help families navigate the screening and follow-up process in a culturally and linguistically responsive manner. Eligible grantees include community-based organizations, community health boards, and Tribal Nations. The commissioner must provide technical assistance, content expertise, and training to grant recipients to ensure that follow-up services are effectively provided.",
	"repealed": false
}