{
	"id": "62D.05",
	"url": "https://www.revisor.mn.gov/statutes/cite/62D.05",
	"title": "62D.05 POWERS OF HEALTH MAINTENANCE ORGANIZATIONS.",
	"text": "Any corporation or local governmental unit may, upon obtaining a certificate of authority as required in sections 62D.01 to 62D.30, operate as a health maintenance organization.\nA health maintenance organization may enter into health maintenance contracts in this state and engage in any other activities consistent with sections 62D.01 to 62D.30 which are necessary to the performance of its obligations under such contracts or authorize its representatives to do so.\nA health maintenance organization may contract with providers of health care services to render the services the health maintenance organization has promised to provide under the terms of its health maintenance contracts, may, subject to section 62D.12, subdivision 11, enter into separate prepaid dental contracts, or other separate health service contracts, may, subject to the limitations of section 62D.04, subdivision 1, clause (f), contract with insurance companies, including nonprofit health service plan corporations or other health maintenance organizations, for insurance, indemnity or reimbursement of its cost of providing health care services for enrollees or against the risks incurred by the health maintenance organization, may contract with insurance companies and nonprofit health service plan corporations for insolvency insurance coverage, and may contract with insurance companies and nonprofit health service plan corporations to insure or cover the enrollees' costs and expenses in the health maintenance organization, including the customary prepayment amount and any co-payment obligations, and may contract to provide reinsurance or insolvency insurance coverage to health insurers or nonprofit health service plan corporations.\nA health maintenance organization may contract with other persons for the provision of services, including, but not limited to, managerial and administration, marketing and enrolling, data processing, actuarial analysis, and billing services. If contracts are made with insurance companies or nonprofit health service plan corporations, such companies or corporations must be authorized to transact business in this state.\nEach health maintenance organization authorized to operate under sections 62D.01 to 62D.30, or its representative, may accept from governmental agencies, private agencies, corporations, associations, groups, individuals, or other persons payments covering all or part of the cost of health care services provided to enrollees. Any recipient of medical assistance, pursuant to chapter 256B, may make application to join a health maintenance organization which has been approved for medical assistance by the commissioner of human services.\n(a) A health maintenance organization may, as a supplemental benefit, provide coverage to its enrollees for health care services and supplies received from providers who are not employed by, under contract with, or otherwise affiliated with the health maintenance organization. Supplemental benefits may be provided if the following conditions are met:\n(1) a health maintenance organization desiring to offer supplemental benefits must at all times comply with the requirements of sections 62D.041 and 62D.042;\n(2) a health maintenance organization offering supplemental benefits must maintain an additional surplus in the first year supplemental benefits are offered equal to the lesser of $500,000 or 33 percent of the supplemental benefit expenses. At the end of the second year supplemental benefits are offered, the health maintenance organization must maintain an additional surplus equal to the lesser of $1,000,000 or 33 percent of the supplemental benefit expenses. At the end of the third year benefits are offered and every year after that, the health maintenance organization must maintain an additional surplus equal to the greater of $1,000,000 or 33 percent of the supplemental benefit expenses. When in the judgment of the commissioner the health maintenance organization's surplus is inadequate, the commissioner may require the health maintenance organization to maintain additional surplus;\n(3) claims relating to supplemental benefits must be processed in accordance with the requirements of section 72A.201; and\n(4) in marketing supplemental benefits, the health maintenance organization shall fully disclose and describe to enrollees and potential enrollees the nature and extent of the supplemental coverage, and any claims filing and other administrative responsibilities in regard to supplemental benefits.\n(b) The commissioner may, pursuant to chapter 14, adopt, enforce, and administer rules relating to this subdivision, including: rules insuring that these benefits are supplementary and not substitutes for comprehensive health maintenance services by addressing percentage of out-of-plan coverage; rules relating to the establishment of necessary financial reserves; rules relating to marketing practices; and other rules necessary for the effective and efficient administration of this subdivision. The commissioner, in adopting rules, shall give consideration to existing laws and rules administered and enforced by the Department of Commerce relating to health insurance plans.",
	"repealed": false
}