{
	"id": "353.33",
	"url": "https://www.revisor.mn.gov/statutes/cite/353.33",
	"title": "353.33 TOTAL AND PERMANENT DISABILITY BENEFITS.",
	"text": "(a) A coordinated or basic member who is vested under section 353.01, subdivision 47, and who becomes totally and permanently disabled before normal retirement age, upon application as defined under section 353.031, is entitled to a disability benefit in an amount determined under subdivision 3.\n(b) If the disabled person's public service has terminated at any time, at least two of the years of allowable service required to be vested under section 353.01, subdivision 47, must have been rendered after last becoming an active member.\nNo person is entitled to receive disability benefits and a retirement annuity at the same time.\n(a) This benefit begins to accrue when the applicant is no longer receiving any form of compensation, whether salary or paid leave; 90 days preceding the filing of the application, or, if annual or sick leave or any other employer-paid salary continuation plan is paid for more than the 90-day period, from the date salary ceased, whichever is later. No member is entitled to receive a disability benefit payment when there remains to the member's credit any unused annual leave, sick leave, or any other employer-paid salary continuation plan, or under any other circumstances when, during the period of disability, there has been no impairment of the person's salary.\n(b) Payment must not accrue beyond the end of the month in which entitlement has terminated. If the disabilitant dies prior to negotiating the check for the month in which death occurs, payment is made to the surviving spouse, or if none, to the designated beneficiary, or if none, to the estate.\n(a) This disability benefit is an amount equal to the normal annuity payable to a member who has reached normal retirement age with the same number of years of allowable service and the same average salary, as provided in section 353.01, subdivision 17a, and section 353.29, subdivision 3.\n(b) A basic member shall receive a supplementary monthly benefit of $25 to age 65 or the five-year anniversary of the effective date of the disability benefit, whichever is later.\n(c) If the disability benefits under this subdivision exceed the average salary as defined in section 353.01, subdivision 17a, the disability benefits must be reduced to an amount equal to the average salary.\n[Repealed, 1999 c 222 art 2 s 20]\nA disabled member may elect to receive the normal disability benefit or an optional annuity under section 353.30, subdivision 3. The election of an optional annuity must be made prior to the commencement of payment of the disability benefit. The optional annuity must begin to accrue on the same date as provided for the disability benefit.\n(1) If a person who is not the spouse of a member is named as beneficiary of the joint and survivor optional annuity, the person is eligible to receive the annuity only if the spouse, on the disability application form prescribed by the executive director, permanently waives the surviving spouse benefits under sections 353.31, subdivision 1, and 353.32, subdivision 1a. If the spouse of the member refuses to permanently waive the surviving spouse coverage, the selection of a person other than the spouse of the member as a joint annuitant is invalid.\n(2) If the spouse of the member permanently waives survivor coverage, the dependent children, if any, continue to be eligible for survivor benefits under section 353.31, subdivision 1, including the minimum benefit in section 353.31, subdivision 1a. The designated optional annuity beneficiary may draw the monthly benefit; however, the amount payable to the dependent child or children and joint annuitant must not exceed the 70 percent maximum family benefit under section 353.31, subdivision 1a. If the maximum is exceeded, the benefit of the joint annuitant must be reduced to the amount necessary so that the total family benefit does not exceed the 70 percent maximum family benefit amount.\n(3) If the spouse is named as the beneficiary of the joint and survivor optional annuity, the spouse may draw the monthly benefits; however, the amount payable to the dependent child or children and the joint annuitant must not exceed the 70 percent maximum family benefit under section 353.31, subdivision 1a. If the maximum is exceeded, each dependent child will receive ten percent of the member's specified average monthly salary, and the benefit to the joint annuitant must be reduced to the amount necessary so that the total family benefit does not exceed the 70 percent maximum family benefit amount. The joint and survivor optional annuity must be restored to the surviving spouse, plus applicable postretirement adjustments under Minnesota Statutes 2008, section 356.41 or section 356.415, as the dependent child or children become no longer dependent under section 353.01, subdivision 15.\n(a) Eligibility for disability benefits must be determined following the procedures defined in section 353.031.\n(b) If, after following the procedures for determining eligibility for benefits under section 353.031, and upon consideration of the medical evidence received and the recommendations of the medical adviser, it is determined by the executive director that the applicant is totally and permanently disabled within the meaning of the law, the association shall grant the person a disability benefit.\nMS 2022 [Repealed, 2024 c 102 art 4 s 18]\n[See Note.]\n[Repealed, 1991 c 341 s 51]\n[Repealed, 2004 c 267 art 8 s 41]\nDisability benefits are contingent upon a disabled person's participation in a vocational assessment if the executive director determines that the disabled person may be able to return to a gainful occupation. If, after a review by the executive director under section 353.031, subdivision 8, a member is found to be no longer totally and permanently disabled, payments must cease the first of the month following the expiration of a 30-day period after the member receives a certified letter notifying the member that payments will cease.\n[Repealed, 2007 c 134 art 4 s 36]\n[Repealed, 2007 c 134 art 4 s 36]\n(a) If, following a work or non-work-related injury or illness, a member who remains totally and permanently disabled as defined in section 353.01, subdivision 19, has earnings from employment that is not substantial gainful activity, the amount of the member's disability benefit must be reduced as described in paragraph (b) if the total of the disability benefit and earnings exceeds the greater of:\n(1) the base monthly salary rate the member had been receiving at the date of disability; or\n(2) the base monthly salary rate currently paid by the employing governmental subdivision for similar positions.\n(b) If paragraph (a) applies, the member's disability benefit must be reduced until the disability benefit plus the monthly earnings from employment do not exceed the greater of the salaries described in paragraph (a), clause (1) or (2).\n(a) This subdivision applies only to the Public Employees Retirement Association general employees retirement plan.\n(b) If, following a work or non-work-related injury or illness, a member receiving disability benefits attempts to return to work for the member's previous public employer or attempts to return to a similar position with another public employer, on a full-time or less than full-time basis, the association must continue paying the disability benefit for a period not to exceed six months. The disability benefit must continue in an amount that, when added to the subsequent employment earnings, does not exceed the base monthly salary the member had been receiving at the date of disability or the base monthly salary rate currently paid for similar positions, whichever is higher.\n(c) No deductions for the general employees retirement plan may be taken from the salary of a disabled person who is attempting to return to work under this provision unless the member waives further disability benefits.\n(d) A member only may return to employment and continue disability benefit payments once while receiving disability benefits from the general employees retirement plan.\n[Repealed, 2007 c 134 art 4 s 36]\n(a) Any person receiving a disability benefit under this section who is restored to employment not covered by subdivision 7 or 7a must have the disability benefit discontinued on the first day of the month following the return to employment.\n(b) If the person is employed by a governmental subdivision as defined under section 353.01, subdivision 6, deductions must be taken for the retirement fund and, upon subsequent retirement, the person is entitled to a retirement annuity payable based upon all allowable service including the allowable service upon which the disability benefits were based.\n(c) If the employment is not through public service covered under this chapter, the account may be placed on a deferred status and the subsequent retirement annuity must be calculated as provided in section 353.34, subdivision 3, if the person meets the length of allowable service requirement stated in that subdivision; or the person may request a refund of any remaining employee deductions. The refund must be in an amount equal to the accumulated employee deductions plus six percent interest compounded annually and must be reduced by the sum of the disability benefits paid to the member.\n[Repealed, 1973 c 753 s 85]\nThe disability benefits paid to a coordinated member must terminate when the person reaches normal retirement age. If the coordinated member is still totally and permanently disabled upon attaining normal retirement age, the coordinated member is deemed to be on retirement status. If an optional annuity is elected under subdivision 3a, the coordinated member shall receive an annuity under the terms of the optional annuity previously elected, or, if an optional annuity is not elected under subdivision 3a, the coordinated member may elect to receive a normal retirement annuity under section 353.29 or an annuity equal to the disability benefit paid before the coordinated member reaches normal retirement age, whichever amount is greater, or elect to receive an optional annuity under section 353.30, subdivision 3. The annuity of a disabled coordinated member who attains normal retirement age must be computed under the law in effect upon attainment of normal retirement age. Election of an optional annuity must be made before the coordinated member attains normal retirement age. If an optional annuity is elected, the election is effective on the date on which the person attains normal retirement age and the optional annuity begins to accrue on the first day of the month next following the month in which the person attains that age.\n(a) If a basic member who is receiving a disability benefit under subdivision 3 dies before attaining age 65 or within five years of the effective date of the disability, whichever is later, the surviving spouse is entitled to receive a survivor benefit under section 353.31, and any dependent child or children are entitled to dependent child benefits under section 353.31, subdivision 1b, paragraph (b). If there are no dependent children, in lieu of the survivor benefit specified under section 353.31, the surviving spouse may elect to receive a refund under section 353.32, subdivision 1.\n(b) If a basic member who is receiving a disability benefit under subdivision 3 is living at age 65 or five years after the effective date of the disability, whichever is later, the basic member may receive a normal retirement annuity equal to the disability benefit previously received, adjusted for the amount no longer payable under subdivision 3, paragraph (b), or the person may elect a joint and survivor optional annuity under section 353.31, subdivision 1b. The election of the joint and survivor optional annuity must occur within 90 days of attaining age 65 or of reaching the five-year anniversary of the effective date of the disability benefit, whichever is later. The optional annuity takes effect on the first day of the month following the month in which the person attains age 65 or reaches the five-year anniversary of the effective date of the disability benefit, whichever is later.\n(a) A disability benefit under this section is eligible for postretirement adjustments under section 356.415.\n(b) When a disability benefit terminates under subdivision 11, the retirement annuity elected by the individual must include all prior adjustments provided under Minnesota Statutes 2008, section 11A.18, through January 1, 2009, and thereafter as provided in section 356.415.",
	"repealed": false
}