{
	"id": "363A.06",
	"url": "https://www.revisor.mn.gov/statutes/cite/363A.06",
	"title": "363A.06 POWERS AND DUTIES OF COMMISSIONER.",
	"text": "(a) The commissioner shall formulate policies to effectuate the purposes of this chapter and shall do the following:\n(1) exercise leadership under the direction of the governor in the development of human rights policies and programs, and make recommendations to the governor and the legislature for their consideration and implementation;\n(2) establish and maintain a principal office in St. Paul, and any other necessary branch offices at any location within the state;\n(3) meet and function at any place within the state;\n(4) employ attorneys, clerks, and other employees and agents as the commissioner may deem necessary and prescribe their duties;\n(5) to the extent permitted by federal law and regulation, utilize the records of the Department of Employment and Economic Development of the state when necessary to effectuate the purposes of this chapter;\n(6) obtain upon request and utilize the services of all state governmental departments and agencies;\n(7) adopt suitable rules for effectuating the purposes of this chapter;\n(8) issue complaints, receive and investigate charges alleging unfair discriminatory practices, and determine whether or not probable cause exists for hearing;\n(9) subpoena witnesses, administer oaths, take testimony, and require the production for examination of any books or papers relative to any matter under investigation or in question as the commissioner deems appropriate to carry out the purposes of this chapter;\n(10) attempt, by means of education, conference, conciliation, and persuasion to eliminate unfair discriminatory practices as being contrary to the public policy of the state;\n(11) develop and conduct programs of formal and informal education designed to eliminate discrimination and intergroup conflict by use of educational techniques and programs the commissioner deems necessary;\n(12) make a written report of the activities of the commissioner to the governor each year;\n(13) accept gifts, bequests, grants, or other payments public and private to help finance the activities of the department;\n(14) create such local and statewide advisory committees as will in the commissioner's judgment aid in effectuating the purposes of the Department of Human Rights;\n(15) develop such programs as will aid in determining the compliance throughout the state with the provisions of this chapter, and in the furtherance of such duties, conduct research and study discriminatory practices based upon race, color, creed, religion, national origin, sex, gender identity, age, disability, marital status, status with regard to public assistance, familial status, sexual orientation, or other factors and develop accurate data on the nature and extent of discrimination and other matters as they may affect housing, employment, public accommodations, schools, and other areas of public life;\n(16) develop and disseminate technical assistance to persons subject to the provisions of this chapter, and to agencies and officers of governmental and private agencies;\n(17) provide staff services to such advisory committees as may be created in aid of the functions of the Department of Human Rights;\n(18) make grants in aid to the extent that appropriations are made available for that purpose in aid of carrying out duties and responsibilities;\n(19) cooperate and consult with the commissioner of labor and industry regarding the investigation of violations of, and resolution of complaints regarding section 363A.08, subdivision 7; and\n(20) analyze civil rights trends pursuant to this chapter, including information compiled from community organizations that work directly with historically marginalized communities, and prepare a report each biennium that recommends policy and system changes to reduce and prevent further civil rights incidents across Minnesota. The report shall be provided to the chairs and ranking minority members of the house of representatives and senate committees with jurisdiction over the Department of Human Rights. This report must also be posted on the Department of Human Rights' public website and shared with community organizations that work with historically marginalized communities.\nIn performing these duties, the commissioner shall give priority to those duties in clauses (8), (9), and (10) and to the duties in section 363A.36.\n(b) All gifts, bequests, grants, or other payments, public and private, accepted under paragraph (a), clause (13), must be deposited in the state treasury and credited to a special account. Money in the account is appropriated to the commissioner of human rights to help finance activities of the department.\n(a) Disobedience of a subpoena issued by the commissioner pursuant to subdivision 1 shall be punishable in like manner as a contempt of the district court in proceedings instituted upon application of the commissioner made to the district court of the county where the alleged unfair discriminatory practice in connection with a charge made by a charging party or a complaint filed by the commissioner has occurred or where the respondent resides or has a principal place of business.\n(b) It is not a violation of rights conferred by chapter 13 or any other statute related to the confidentiality of government data for a state agency, statewide system, or political subdivision, as defined in section 13.02, subdivision 11, to provide data or information under a subpoena issued by the commissioner under this section.\n(c) A subpoena issued under subdivision 1 must be served personally or by mailing a copy of the subpoena, by first class mail, postage prepaid, to the person to be served. The subpoena must include two copies of a notice and acknowledgment of service on a form to be provided by the commissioner, and a return envelope, postage prepaid, addressed to the sender. If acknowledgment of service is not received by the commissioner within 20 days, service is not effective. Unless good cause is shown for not doing so, a court or administrative law judge shall order the payment of the costs of personal service by the person served if the person does not complete and return the notice and acknowledgment of receipt of the subpoena within the time allowed.\nIt is part of the department's mission that within the department's resources the commissioner shall endeavor to:\n(1) prevent the waste or unnecessary spending of public money;\n(2) use innovative fiscal and human resource practices to manage the state's resources and operate the department as efficiently as possible;\n(3) coordinate the department's activities wherever appropriate with the activities of other governmental agencies;\n(4) use technology where appropriate to increase agency productivity, improve customer service, increase public access to information about government, and increase public participation in the business of government;\n(5) utilize constructive and cooperative labor-management practices to the extent otherwise required by chapters 43A and 179A;\n(6) report to the legislature on the performance of agency operations and the accomplishment of agency goals in the agency's biennial budget according to section 16A.10, subdivision 1; and\n(7) recommend to the legislature appropriate changes in law necessary to carry out the mission and improve the performance of the department.\nThe commissioner may publish an account of a case in which the complaint has been dismissed or the terms of settlement of a case that has been voluntarily resolved with the Department of Human Rights.",
	"repealed": false
}