{
	"id": "151.40",
	"url": "https://www.revisor.mn.gov/statutes/cite/151.40",
	"title": "151.40 POSSESSION AND SALE OF HYPODERMIC SYRINGES AND NEEDLES.",
	"text": "It is unlawful for any person to manufacture or sell hypodermic syringes or needles or any instrument or implement which can be adapted for subcutaneous injections, except for:\n(1) the following persons when acting in the course of their practice or employment:\n(i) licensed practitioners and their employees, agents, or delegates;\n(ii) licensed pharmacies and their employees or agents;\n(iii) licensed pharmacists;\n(iv) registered nurses and licensed practical nurses;\n(v) registered medical technologists;\n(vi) medical interns and residents;\n(vii) licensed drug wholesalers and their employees or agents;\n(viii) licensed hospitals;\n(ix) bona fide hospitals in which animals are treated;\n(x) licensed nursing homes;\n(xi) licensed morticians;\n(xii) syringe and needle manufacturers and their dealers and agents;\n(xiii) persons engaged in animal husbandry;\n(xiv) clinical laboratories and their employees;\n(xv) persons engaged in bona fide research or education or industrial use of hypodermic syringes and needles provided such persons cannot use hypodermic syringes and needles for the administration of drugs to human beings unless such drugs are prescribed, dispensed, and administered by a person lawfully authorized to do so;\n(xvi) persons who administer drugs pursuant to an order or direction of a licensed practitioner; and\n(xvii) syringe services providers and their employees and agents;\n(2) a person who self-administers drugs pursuant to either the prescription or the direction of a practitioner, or a family member, caregiver, or other individual who is designated by such person to assist the person in obtaining and using needles and syringes for the administration of such drugs;\n(3) a person who is disposing of hypodermic syringes and needles through an activity or program developed under section 325F.785;\n(4) a person who sells or handles hypodermic syringes and needles pursuant to subdivision 2; or\n(5) a participant receiving services from a syringe services provider, who accesses or receives new syringes or needles from a syringe services provider or returns used syringes or needles to a syringe services provider.\n(a) A registered pharmacy or a licensed pharmacist may sell, without the prescription or direction of a practitioner, unused hypodermic needles and syringes provided the pharmacy or pharmacist complies with all of the requirements of this subdivision.\n(b) At any location where hypodermic needles and syringes are kept for retail sale under this subdivision, the needles and syringes shall be stored in a manner that makes them available only to authorized personnel and not openly available to customers.\n(c) A registered pharmacy or licensed pharmacist that sells hypodermic needles or syringes under this subdivision may give the purchaser the materials developed by the commissioner of health under section 325F.785.\n(d) A registered pharmacy or licensed pharmacist that sells hypodermic needles or syringes under this subdivision must certify to the commissioner of health participation in an activity, including but not limited to those developed under section 325F.785, that supports proper disposal of used hypodermic needles or syringes.",
	"repealed": false
}