{
	"id": "268.196",
	"url": "https://www.revisor.mn.gov/statutes/cite/268.196",
	"title": "268.196 ADMINISTRATION ACCOUNT.",
	"text": "(a) There is created in the state treasury a special account to be known as the administration account. All money deposited into this account is continuously available to the commissioner for administering the Minnesota unemployment insurance program, and does not lapse at any time. The administration account consists of all money:\n(1) received from the federal government to:\n(i) administer the Minnesota unemployment insurance program;\n(ii) administer any federal unemployment insurance program; and\n(iii) assist any other state in administering that state's unemployment insurance program;\n(2) received for services or facilities supplied to the federal government or any other state;\n(3) credited to this account under this chapter;\n(4) received for losses sustained by this account or by reason of damage to equipment or supplies; and\n(5) received from the sale of any equipment or supplies that are no longer necessary for the administration of the Minnesota unemployment insurance program.\n(b) All money in this account must be deposited, administered, and disbursed in the same manner and under the same conditions and requirements as are provided by law for the other special accounts in the state treasury. The commissioner of management and budget, as treasurer and custodian of this account, is liable for the faithful performance of duties in connection with this account.\n(c) All money in this account may only be spent for the administration of the Minnesota unemployment insurance program.\nIf any money received under United States Code, title 42, section 501 of the Social Security Act is found by the United States Secretary of Labor to have been spent for purposes other than for the proper administration of the Minnesota unemployment insurance program, the commissioner must, at the earliest opportunity, submit to the legislature a request for the appropriation of that amount.\nMS 2006 [Renumbered 268.199]\nMS 2006 [Renumbered 268.211]",
	"repealed": false
}