{
	"id": "84.63",
	"url": "https://www.revisor.mn.gov/statutes/cite/84.63",
	"title": "84.63 CONVEYING INTERESTS IN LANDS TO STATE, FEDERAL, AND TRIBAL GOVERNMENTS.",
	"text": "(a) Notwithstanding any existing law to the contrary, the commissioner of natural resources is hereby authorized on behalf of the state to convey to the United States, to a federally recognized Indian Tribe, or to the state of Minnesota or any of its subdivisions, upon state-owned lands under the administration of the commissioner of natural resources, permanent or temporary easements for specified periods or otherwise for trails, highways, roads including limitation of right of access from the lands to adjacent highways and roads, flowage for development of fish and game resources, stream protection, flood control, and necessary appurtenances thereto, such conveyances to be made upon such terms and conditions including provision for reversion in the event of non-user as the commissioner of natural resources may determine.\n(b) In addition to the fee for the market value of the easement, the commissioner of natural resources shall assess the applicant the following fees:\n(1) an application fee of $2,000 to cover reasonable costs for reviewing the application and preparing the easement; and\n(2) a monitoring fee to cover the projected reasonable costs for monitoring the construction of the improvement for which the easement was conveyed and preparing special terms and conditions for the easement. The commissioner must give the applicant an estimate of the monitoring fee before the applicant submits the fee.\n(c) The applicant shall pay these fees to the commissioner of natural resources. The commissioner shall not issue the easement until the applicant has paid in full the application fee, the monitoring fee, and the market value payment for the easement.\n(d) Upon completion of construction of the improvement for which the easement was conveyed, the commissioner shall refund the unobligated balance from the monitoring fee revenue. The commissioner shall not return the application fee, even if the application is withdrawn or denied.\n(e) Money received under paragraph (b) must be deposited in the land management account in the natural resources fund and is appropriated to the commissioner of natural resources to cover the reasonable costs incurred for issuing and monitoring easements.\n(f) A county or joint county regional railroad authority is exempt from all fees specified under this section for trail easements on state-owned land.\n(g) In addition to fees specified in this section, the applicant must reimburse the state for costs incurred for cultural resources review, monitoring, or other services provided by the Minnesota Historical Society under contract with the commissioner of natural resources or the State Historic Preservation Office of the Department of Administration in connection with the easement application, preparing the easement terms, or constructing the trail, highway, road, or other improvements.\n(h) Notwithstanding paragraphs (a) to (g), the commissioner of natural resources may elect to assume the application fee under paragraph (b), clause (1), and waive or assume some or all of the remaining fees and costs imposed under this section if the commissioner determines that issuing the easement will benefit the state's land management interests.",
	"repealed": false
}