{
	"id": "192.502",
	"url": "https://www.revisor.mn.gov/statutes/cite/192.502",
	"title": "192.502 PROTECTIONS.",
	"text": "(a) As used in this subdivision, the terms \"qualified person\" and \"qualified student\" have the same meaning and include:\n(1) any student at a postsecondary educational institution who is ordered into active military service, as defined in section 190.05, subdivision 5; and\n(2) a veteran, as defined in section 197.447, who has a service-connected disability as certified by the United States Department of Veterans Affairs, who is a student at a postsecondary educational institution, and whose service-connected medical condition or medical treatment requirements reasonably prevent the person's attendance at or progress in part or all of the person's higher educational training or studies at any given time. The terms \"medical condition\" and \"medical treatment requirements\" must be broadly construed and without regard for whether or not they relate directly to the person's service-connected disability.\n(b) A qualified person or qualified student has the following rights:\n(1) with regard to courses in which the person is enrolled, the person may:\n(i) withdraw from one or more courses for which tuition and fees have been paid that are attributable to the courses. The tuition and fees must be credited to the person's account at the postsecondary institution. Any refunds are subject to the requirements of the state or federal financial aid programs of origination. In such a case, the student must not receive credit for the courses and must not receive a failing grade, an incomplete, or other negative annotation on the student's record, and the student's grade point average must not be altered or affected in any manner because of action under this item;\n(ii) be given a grade of incomplete and be allowed to complete the course upon release from active service, upon completion of medical treatment, or upon sufficient medical recovery under the postsecondary institution's standard practice for completion of incompletes; or\n(iii) continue and complete the course for full credit. Class sessions the student misses due to performance of active military service or due to the person's medical treatment or medical condition must be counted as excused absences and must not be used in any way to adversely impact the student's grade or standing in the class. Any student who selects this option is not, however, automatically excused from completing assignments due during the period the student is performing active military service or receiving medical treatment or recovering from a medical condition. A letter grade or a grade of pass must be awarded only if, in the opinion of the faculty member teaching the course, the student has completed sufficient work and has demonstrated sufficient progress toward meeting course requirements to justify the grade;\n(2) to receive a refund of amounts paid for room, board, and fees attributable to the time period during which the student was serving in active military service or receiving medical treatment or dealing with the person's medical condition and did not use the facilities or services for which the amounts were paid. Any refund of room, board, and fees is subject to the requirements of the state or federal financial aid programs of origination; and\n(3) if the student chooses to withdraw, the student has the right to be readmitted and reenrolled as a student at the postsecondary education institution, without penalty or redetermination of admission eligibility, within two years following release from the state or federal active military service or following completion of medical treatment or sufficient recovery from the person's medical condition.\n(c) The protections in this section may be invoked as follows:\n(1) the qualified person or qualified student, or an appropriate officer from the military organization in which the person will be serving, or an appropriate medical authority or the person's authorized caregiver or family member, must give advance verbal or written notice that the person is being ordered to active military service or will be undertaking medical treatment or a period of recovery for a medical condition;\n(2) advance notice is not required if the giving of notice is precluded by military or medical necessity or, under all the relevant circumstances, the giving of notice is impossible or unreasonable; and\n(3) upon written request from the postsecondary institution, the person must provide written verification of the order to active service or of the existence of the medical condition or medical treatment.\n(d) This section provides minimum protections for qualified students. Nothing in this section prevents postsecondary institutions from providing additional options or protections to students who are ordered to active military service or are undertaking medical treatment or a period of recovery from a medical condition.\n(a) The renewal of a license or certificate of registration for a person who has been ordered to active military service and who is required by law to be licensed or registered in order to carry on or practice a trade, employment, occupation, or profession in the state is governed under sections 326.55 and 326.56.\n(b) The renewal of a driver's license for a person who has been ordered to active military service is governed under section 171.27.\n(c) The renewal and payment of the motor vehicle registration tax for a vehicle of a person who has been ordered to active military service is governed under section 168.031.\nEmployees are entitled to unpaid leave, as required by section 181.948, to attend the send-off or homecoming ceremony of an immediate family member who, as a member of the United States armed forces, has been mobilized for active military service in support of a war or other national emergency.\nEmployees are entitled to unpaid leave, as required by section 181.947, when an immediate family member, as a member of the United States armed forces, has been injured or killed while engaged in active service.",
	"repealed": false
}