{
	"id": "62A.3099",
	"url": "https://www.revisor.mn.gov/statutes/cite/62A.3099",
	"title": "62A.3099 DEFINITIONS.",
	"text": "The definitions provided in this section apply to sections 62A.3099 to 62A.44.\n\"Accident,\" \"accidental injury,\" or \"accidental means\" means to employ \"result\" language and does not include words that establish an accidental means test or use words such as \"external,\" \"violent,\" \"visible wounds,\" or similar words of description or characterization.\n(1) The definition shall not be more restrictive than the following: \"Injury or injuries for which benefits are provided means accidental bodily injury sustained by the insured person which is the direct result of an accident, independent of disease or bodily infirmity or any other cause, and occurs while insurance coverage is in force.\"\n(2) The definition may provide that injuries shall not include injuries for which benefits are provided or available under a workers' compensation, employer's liability or similar law, or motor vehicle no-fault plan, unless prohibited by law.\n\"Applicant\" means:\n(1) in the case of an individual Medicare supplement policy or certificate, the person who seeks to contract for insurance benefits; and\n(2) in the case of a group Medicare supplement policy or certificate, the proposed certificate holder.\n\"Bankruptcy\" means a situation in which a Medicare Advantage organization that is not an issuer has filed, or has had filed against it, a petition for declaration of bankruptcy and has ceased doing business in the state.\n\"Benefit period\" or \"Medicare benefit period\" shall not be defined more restrictively than as defined in the Medicare program.\n\"Certificate\" means a certificate delivered or issued for delivery in this state or offered to a resident of this state under a group Medicare supplement policy or certificate.\n\"Certificate form\" means the form on which the certificate is delivered or issued for delivery by the issuer.\n\"Convalescent nursing home,\" \"extended care facility,\" or \"skilled nursing facility\" shall not be defined more restrictively than as defined in the Medicare program.\n\"Employee welfare benefit plan\" means a plan, fund, or program of employee benefits as defined in United States Code, title 29, section 1002 (Employee Retirement Income Security Act).\n\"Health care expenses\" means, for purposes of section 62A.36, expenses of health maintenance organizations associated with the delivery of health care services which are analogous to incurred losses of insurers. The expenses shall not include:\n(1) home office and overhead costs;\n(2) advertising costs;\n(3) commissions and other acquisition costs;\n(4) taxes;\n(5) capital costs;\n(6) administrative costs; and\n(7) claims processing costs.\n\"Hospital\" may be defined in relation to its status, facilities, and available services or to reflect its accreditation by the Joint Commission on Accreditation of Hospitals, but not more restrictively than as defined in the Medicare program.\n\"Insolvency\" means a situation in which an issuer, licensed to transact the business of insurance in this state, including the right to transact business as any type of issuer, has had a final order of liquidation entered against it with a finding of insolvency by a court of competent jurisdiction in the issuer's state of domicile.\n\"Issuer\" includes insurance companies, fraternal benefit societies, health service plan corporations, health maintenance organizations, and any other entity delivering or issuing for delivery Medicare supplement policies or certificates in this state or offering these policies or certificates to residents of this state.\n\"Medicare\" shall be defined in the policy and certificate. Medicare may be defined as the Health Insurance for the Aged Act, title XVIII of the Social Security Amendments of 1965, as amended, or title I, part I, of Public Law 89-97, as enacted by the 89th Congress of the United States of America and popularly known as the Health Insurance for the Aged Act, as amended.\n\"Medicare Advantage plan\" means a plan of coverage for health benefits under Medicare Part C as defined in section 1859 of the federal Social Security Act, United States Code, title 42, section 1395w-28, and includes:\n(1) coordinated care plans which provide health care services, including, but not limited to, health maintenance organization plans, with or without a point-of-service option, plans offered by provider-sponsored organizations, and preferred provider organization plans;\n(2) medical savings account plans coupled with a contribution into a Medicare Advantage medical savings account; and\n(3) Medicare Advantage private fee-for-service plans.\n\"Medicare eligible expenses\" means health care expenses covered by Medicare Part A or B, to the extent recognized as reasonable and medically necessary by Medicare.\n\"Medicare-related coverage\" means a policy, contract, or certificate issued as a supplement to Medicare, regulated under sections 62A.3099 to 62A.44, including Medicare select coverage; policies, contracts, or certificates that supplement Medicare issued by health maintenance organizations; or policies, contracts, or certificates governed by section 1833 (known as \"HCPP\" contracts) or 1876 (known as \"Cost\" contracts) of the federal Social Security Act, United States Code, title 42, section 1395, et seq., as amended; or Section 4001 of the Balanced Budget Act of 1997 (BBA)(Public Law 105-33), Sections 1851 to 1859 of the Social Security Act establishing Part C of the Medicare program, known as the \"Medicare Advantage program.\"\n\"Medicare supplement policy or certificate\" means a group or individual policy of accident and sickness insurance or a subscriber contract of hospital and medical service associations or health maintenance organizations, other than those policies or certificates covered by section 1876 of the federal Social Security Act, United States Code, title 42, section 1395, et seq., or an issued policy under a demonstration project specified under amendments to the federal Social Security Act, which is advertised, marketed, or designed primarily as a supplement to reimbursements under Medicare for the hospital, medical, or surgical expenses of persons eligible for Medicare or as a supplement to Medicare Advantage plans established under Medicare Part C. \"Medicare supplement policy\" does not include Medicare Advantage plans established under Medicare Part C, outpatient prescription drug plans established under Medicare Part D, any health care prepayment plan that provides benefits under an agreement under section 1833(a)(1)(A) of the Social Security Act, or any policy issued to an employer or employers or to the trustee of a fund established by an employer where only employees or retirees, and dependents of employees or retirees, are eligible for coverage, or any policy issued to a labor union or similar employee organization.\n\"Newly eligible individual\" means an individual who is eligible for Medicare on or after January 1, 2020, because the individual:\n(1) has attained age 65 on or after January 2020; or\n(2) although under age 65, is entitled to or deemed eligible for benefits under Medicare Part A by reason of disability or otherwise.\n\"Open enrollment period\" means the time period described in Code of Federal Regulations, title 42, section 422.62, paragraph (a), clauses (2) to (4), as amended.\n[See Note.]\n\"Outpatient prescription drug\" means a prescription drug prescribed or administered under circumstances that qualify for coverage under Medicare Part D and not under Medicare Part A or Part B.\n\"Physician\" shall not be defined more restrictively than as defined in the Medicare program or section 62A.04, subdivision 1, or 62A.15, subdivision 3a.\n\"Policy form\" means the form on which the policy is delivered or issued for delivery by the issuer.\n\"Secretary\" means the Secretary of the United States Department of Health and Human Services.\n\"Sickness\" shall not be defined more restrictively than the following:\n\"Sickness means illness or disease of an insured person which first manifests itself after the effective date of insurance and while the insurance is in force.\"\nThe definition may be further modified to exclude sicknesses or diseases for which benefits are provided under a workers' compensation, occupational disease, employer's liability, or similar law.",
	"repealed": false
}