{
	"id": "41B.01",
	"url": "https://www.revisor.mn.gov/statutes/cite/41B.01",
	"title": "41B.01 CITATION; PURPOSE.",
	"text": "Sections 41B.01 to 41B.23 shall be known as and may be cited as the \"Minnesota Rural Finance Authority Act of 1986.\"\nSections 41B.01 to 41B.23 create and establish the Minnesota Rural Finance Authority and establish a program under which state bonds are authorized to be issued and proceeds of their sale are appropriated under the authority of article XI, section 5, clause (h) of the Minnesota Constitution, to develop the state's agricultural resources by extending credit on real estate security. The purpose of the Rural Finance Authority's programs and of the bonds issued to finance or provide security for the programs is to purchase participation interests in loans, including seller-sponsored loans to be made available by agricultural lenders to farmers on terms and conditions not otherwise available from other credit sources. It is hereby found and declared that there presently exist in the state economic conditions which have severely adversely affected the economic viability of farms to the detriment of the rural economy and to the detriment of the economy of the state of Minnesota as a whole. It is further found and declared that as a result of public agricultural policies, agricultural market conditions, and other causes, the condition of the farm economy of the state of Minnesota is such as to jeopardize the continued existence and successful operation of farms in this state, necessitating the establishment of the programs in sections 41B.01 to 41B.23 to provide new sources of credit on favorable terms and conditions. It is further found and declared that providing credit for farmers on favorable terms and conditions will serve and promote the public welfare by assuring the viability of farm operations, by preventing erosion of the tax base in rural areas, by reducing foreclosures on farm property, and by enhancing the financial stability of farmers and of the businesses which depend on farmers as customers. It is further found and declared that in establishing a Minnesota Rural Finance Authority and in authorizing the programs in sections 41B.01 to 41B.23, the legislature is acting in all respects for the benefit of the people of the state of Minnesota to serve the public purpose of improving and otherwise promoting their health, welfare, and prosperity and that the Minnesota Rural Finance Authority, as created and established, is empowered to act on behalf of the people of the state of Minnesota in serving this public purpose for the benefit of the general public.",
	"repealed": false
}