{
	"id": "244.053",
	"url": "https://www.revisor.mn.gov/statutes/cite/244.053",
	"title": "244.053 NOTICE OF RELEASE OF CERTAIN OFFENDERS.",
	"text": "At least 60 days before the release of any inmate convicted of an offense requiring registration under section 243.166, the commissioner of corrections shall send written notice of the impending release to the sheriff of the county and the police chief of the city in which the inmate will reside or in which placement will be made in a work release program. The sheriff of the county where the offender was convicted also shall be notified of the inmate's impending release.\nThe same notice shall be sent to the following persons concerning a specific inmate convicted of an offense requiring registration under section 243.166:\n(1) the victim of the crime for which the inmate was convicted or a deceased victim's next of kin if the victim or deceased victim's next of kin requests the notice in writing;\n(2) any witnesses who testified against the inmate in any court proceedings involving the offense, if the witness requests the notice in writing; and\n(3) any person specified in writing by the prosecuting attorney.\nThe notice sent to victims under clause (1) must inform the person that the person has the right to request and receive information about the offender authorized for disclosure under the community notification provisions of section 244.052.\nIf the victim or witness is under the age of 16, the notice required by this section shall be sent to the parents or legal guardian of the child. The commissioner shall send the notices required by this provision to the last address provided to the commissioner by the requesting party. The requesting party shall furnish the commissioner with a current address. Information regarding witnesses requesting the notice, information regarding any other person specified in writing by the prosecuting attorney to receive the notice, and the notice are private data on individuals, as defined in section 13.02, subdivision 12, and are not available to the inmate.\nThe notice to victims provided under this subdivision does not limit the victim's right to request notice of release under section 611A.06.\nThe existence of the notice requirements contained in this section shall in no event require an extension of the release date.",
	"repealed": false
}