{
	"id": "144.1492",
	"url": "https://www.revisor.mn.gov/statutes/cite/144.1492",
	"title": "144.1492 STATE RURAL HEALTH NETWORK REFORM INITIATIVE.",
	"text": "The commissioner of health shall apply for federal grant funding under the State Rural Health Network Reform Initiative, a Health Care Financing Administration program to provide grant funds to states to encourage innovations in rural health financing and delivery systems. The commissioner may use state funds appropriated to the Department of Health for the provision of technical assistance for community integrated service network development as matching funds for the federal grant.\nIf the Department of Health receives federal funding under the State Rural Health Network Reform Initiative, the department shall use these funds to implement a program to provide technical assistance and grants to rural communities to establish health care networks and to develop and test a rural health network reform model.\n(a) Funding which the department receives to award grants to rural communities to establish health care networks shall be awarded through a request for proposals process. Planning grant funds may be used for community facilitation and initial network development activities including incorporation as a nonprofit organization or cooperative, assessment of network models, and determination of the best fit for the community. Implementation grant funds can be used to enable incorporated nonprofit organizations and cooperatives to purchase technical services needed for further network development such as legal, actuarial, financial, marketing, and administrative services.\n(b) In order to be eligible to apply for a planning or implementation grant under the federally funded health care network reform program, an organization must be located in a rural area of Minnesota excluding the seven-county Twin Cities metropolitan area and the census-defined urbanized areas of Duluth, Rochester, St. Cloud, and Moorhead. The proposed network organization must also meet or plan to meet the criteria for a community integrated service network.\n(c) In determining which organizations will receive grants, the commissioner may consider the following factors:\n(1) the applicant's description of their plans for health care network development, their need for technical assistance, and other technical assistance resources available to the applicant. The applicant must clearly describe the service area to be served by the network, how the grant funds will be used, what will be accomplished, and the expected results. The applicant should describe achievable objectives, a timetable, and roles and capabilities of responsible individuals and organizations;\n(2) the extent of community support for the applicant and the health care network. The applicant should demonstrate support from private and public health care providers in the service area and local community and government leaders. Evidence of such support may include a commitment of financial support, in-kind services, or cash, for development of the network;\n(3) the size and demographic characteristics of the population in the service area for the proposed network and the distance of the service area from the nearest metropolitan area; and\n(4) the technical assistance resources available to the applicant from nonstate sources and the financial ability of the applicant to purchase technical assistance services with nonstate funds.",
	"repealed": false
}