{
	"id": "469.1771",
	"url": "https://www.revisor.mn.gov/statutes/cite/469.1771",
	"title": "469.1771 VIOLATIONS.",
	"text": "(a) The owner of taxable property located in the city, town, school district, or county in which the tax increment financing district is located may bring suit for equitable relief or for damages, as provided in subdivisions 2, 3, and 4, arising out of a failure of a municipality or authority to comply with the provisions of sections 469.174 to 469.1794, or related provisions of this chapter. The prevailing party in a suit filed under the preceding sentence is entitled to costs, including reasonable attorney fees.\n(b) The state auditor may examine and audit political subdivisions' use of tax increment financing. Without previous notice, the state auditor may examine or audit accounts and records on a random basis as the auditor deems to be in the public interest. If the state auditor finds evidence that an authority or municipality has violated a provision of the law for which a remedy is provided under this section, the state auditor shall forward the relevant information to the county attorney. The county attorney may bring an action to enforce the provisions of sections 469.174 to 469.1794 or related provisions of this chapter, for matters referred by the state auditor or on behalf of the county. If the county attorney determines not to bring an action or if the county attorney has not brought an action within 12 months after receipt of the initial notification by the state auditor of the violation, the county attorney shall notify the state auditor in writing.\n(c) If the state auditor finds an authority is not in compliance with sections 469.174 to 469.1794 or related provisions of law, the auditor shall notify the governing body of the municipality that approved the tax increment financing district of its findings. The governing body of the municipality must respond in writing to the state auditor within 60 days after receiving the notification. Its written response must state whether the municipality accepts, in whole or part, the auditor's findings. If the municipality does not accept the findings, the statement must indicate the basis for its disagreement. The state auditor shall annually summarize the responses it receives under this section and send the summary and copies of the responses to the chairs of the committees of the legislature with jurisdiction over tax increment financing.\n(d) The state auditor shall notify the attorney general in writing and provide supporting materials for a violation found by the auditor, if the:\n(1) auditor receives notification from the county attorney under paragraph (b) or receives no notification for a 12-month period after initially notifying the county attorney and the state auditor confirms with the county attorney or the municipality that no action has been brought regarding the matter; and\n(2) municipality or development authority have not eliminated or resolved the violation to the satisfaction of the state auditor.\nThe auditor shall provide the municipality and development authority a copy of the notification sent to the attorney general.\nIf an authority includes or retains a parcel of property in a tax increment financing district that does not qualify for inclusion or retention within the district, the authority must pay to the county auditor an amount of money equal to the increment collected from the property for the year or years. The property must be eliminated from the original and captured tax capacity of the district effective for the current property tax assessment year.\n(a) If an authority fails to make a disclosure or to submit a report containing the information required by section 469.175, subdivisions 5 and 6, regarding a tax increment financing district within the time provided in section 469.175, subdivisions 5 and 6, the state auditor shall mail to the authority a written notice that it or the municipality has failed to make the required disclosure or to submit a required report with respect to a particular district. The state auditor shall mail the notice on or before the third Tuesday of August of the year in which the disclosure or report was required to be made or submitted. The notice must describe the consequences of failing to disclose or submit a report as provided in paragraph (b). If the state auditor has not received a copy of a disclosure or a report described in this paragraph on or before the first day of October of the year in which the disclosure or report was required to be made or submitted, the state auditor shall mail a written notice to the county auditor to hold the distribution of tax increment from a particular district.\n(b) Upon receiving written notice from the state auditor to hold the distribution of tax increment, the county auditor shall hold all tax increment that otherwise would be distributed after receipt of the notice, until further notified under paragraph (c).\n(c) Upon receiving the copy of the disclosure and all of the reports described in paragraph (a) with respect to a district regarding which the state auditor has mailed to the county auditor a written notice to hold distribution of tax increment, the state auditor shall mail to the county auditor a written notice lifting the hold and authorizing the county auditor to distribute to the authority or municipality any tax increment that the county auditor had held pursuant to paragraph (b). The state auditor shall mail the written notice required by this paragraph within five working days after receiving the last outstanding item. The county auditor shall distribute the tax increment to the authority or municipality within 15 working days after receiving the written notice required by this paragraph.\n(d) Notwithstanding any law to the contrary, any interest that accrues on tax increment while it is being held by the county auditor pursuant to paragraph (b) is not tax increment and may be retained by the county.\n(e) For purposes of sections 469.176, subdivisions 1a to 1g, and 469.177, subdivision 11, tax increment being held by the county auditor pursuant to paragraph (b) is considered distributed to or received by the authority or municipality as of the time that it would have been distributed or received but for paragraph (b).\n(a) Upon receipt of a notification from the state auditor under subdivision 1, paragraph (d), the attorney general shall review the materials submitted by the auditor and any materials submitted by the municipality and development authority. If the attorney general finds that the municipality or development authority violated a provision of the law enumerated in subdivision 1 and that the violation was substantial, the attorney general shall file a petition in the Tax Court to suspend the authority of the municipality and development authority to exercise tax increment financing powers.\n(b) Before filing a petition under this subdivision, the attorney shall attempt to resolve the matter using appropriate alternative dispute resolution procedures, such as those under sections 572.31 to 572.40.\n(c) If the Tax Court finds that the municipality or development authority failed to comply with the law and that the noncompliance was substantial, the court shall suspend the authority of the municipality or development to exercise tax increment financing powers. The court shall set the period of the suspension for a period not to exceed five years. In determining the length of the suspension, the court may consider:\n(1) the substantiality of the violation or violations;\n(2) the dollar amount of the violation or violations;\n(3) the sophistication of the municipality or development authority;\n(4) the extent to which the municipality or development authority violated a clear and unambiguous requirement of the law;\n(5) whether the municipality or development authority continued to violate the law after receiving notification from the state auditor that it was not in compliance with the law;\n(6) the extent to which the municipality or development authority engaged in a pattern of violations; and\n(7) any other factors the court determines are relevant to whether the municipality or development authority's authority to exercise tax increment financing powers should be suspended.\n(d) For purposes of this subdivision, the exercise of tax increment financing powers means:\n(1) the authority to request certification of a new tax increment financing district or the addition of area to an existing tax increment financing district;\n(2) the authority to issue bonds under section 469.178;\n(3) the authority to amend a tax increment financing plan to authorize new activities or expenditures.\nIf an authority expends revenues derived from tax increments, including the proceeds of tax increment bonds, (1) for a purpose that is not a permitted project under sections 469.174 to 469.1794, (2) for a purpose that is not permitted under sections 469.174 to 469.1794 for the district from which the increment was received, or (3) on activities outside of the geographic area in which the revenues may be expended under this chapter, the authority must pay to the county auditor an amount equal to the expenditures made in violation of the law.\n(a) If the increments are pledged to repay bonds that were issued before the lawsuit was filed under this section, the damages under this section may not exceed the greater of (1) ten percent of the expenditures or revenues derived from increment, or (2) the amount of available revenues after paying debt services due on the bonds.\n(b) The court may abate all or part of the amount if it determines the unauthorized action or failure to perform the required action was taken in good faith and the payment would work an undue hardship on the authority or municipality.\n(a) This subdivision applies to payments made by the county auditor as tax increments that:\n(1) were received by the authority before July 1, 2000, for a tax increment financing district after the maximum duration limit for the district; and\n(2) were not permitted to be made under section 469.176, subdivision 1f, or any other provision of law as tax increments after the duration limit for the district.\n(b) The authority or the municipality may enter an agreement with the county to repay these amounts in installments, without interest, over a period not to exceed three years.\n(c) If a repayment agreement is entered or the authority or municipality otherwise voluntarily repays these amounts, then distributions of these repayments under subdivision 5 must be made to each of the taxing jurisdictions, including the municipality.\nIf the authority does not have sufficient increments or other available money to make a payment required by this section, the municipality that approved the district must use any available money to make the payment including the levying of property taxes. Money received by the county auditor under this section must be distributed as excess increments under section 469.176, subdivision 2, paragraph (c), clause (4), except that if the county auditor receives the payment after (1) 60 days from a municipality's receipt of the state auditor's notification under subdivision 1, paragraph (c), of noncompliance requiring the payment, or (2) the commencement of an action by the county attorney to compel the payment, then no distributions may be made to the municipality that approved the tax increment financing district.\nThis section applies to increments collected from tax increment financing districts and projects for which certification was requested before, on, and after August 1, 1979.\nAn action under subdivision 1, paragraph (a), contesting the validity of a determination by an authority under section 469.175, subdivision 3, must be commenced within the later of:\n(1) 180 days after the municipality's approval under section 469.175, subdivision 3; or\n(2) 90 days after the request for certification of the district is filed with the county auditor under section 469.177, subdivision 1.",
	"repealed": false
}