{
	"id": "268A.03",
	"url": "https://www.revisor.mn.gov/statutes/cite/268A.03",
	"title": "268A.03 POWERS AND DUTIES.",
	"text": "The commissioner shall:\n(1) certify the community rehabilitation providers to offer extended employment programs, grant funds to the extended employment programs, and perform the duties as specified in section 268A.15;\n(2) provide vocational rehabilitation services to persons with disabilities in accordance with the federal Rehabilitation Act of 1973, Public Law 93-112, as amended. Persons with a disability are entitled to free choice of vendor for any medical, dental, prosthetic, or orthotic services provided under this paragraph;\n(3) expend funds and provide technical assistance for the establishment, improvement, maintenance, or extension of public and other nonprofit rehabilitation facilities or centers;\n(4) maintain a contractual or regulatory relationship with the United States as authorized by the Social Security Act, as amended. Under this relationship, the state will undertake to make determinations referred to in those public laws with respect to all individuals in Minnesota, or with respect to a class or classes of individuals in this state that is designated in the agreement at the state's request. It is the purpose of this relationship to permit the citizens of this state to obtain all benefits available under federal law;\n(5) provide an in-service training program for rehabilitation services employees by paying for its direct costs with state and federal funds;\n(6) conduct research and demonstration projects; provide training and instruction, including establishment and maintenance of research fellowships and traineeships, along with all necessary stipends and allowances; disseminate information to persons with a disability and the general public; and provide technical assistance relating to vocational rehabilitation and independent living;\n(7) receive and disburse pursuant to law money and gifts available from governmental and private sources including, but not limited to, the federal Department of Education and the Social Security Administration, for the purpose of vocational rehabilitation or independent living;\n(8) design all state plans for vocational rehabilitation or independent living services required as a condition to the receipt and disbursement of any money available from the federal government;\n(9) cooperate with other public or private agencies or organizations for the purpose of vocational rehabilitation or independent living. Money received from school districts, governmental subdivisions, mental health centers or boards, and private nonprofit organizations is appropriated to the commissioner for conducting joint or cooperative vocational rehabilitation or independent living programs;\n(10) enter into contractual arrangements with instrumentalities of federal, state, or local government and with private individuals, organizations, agencies, or facilities with respect to providing vocational rehabilitation or independent living services;\n(11) take other actions required by state and federal legislation relating to vocational rehabilitation, independent living, and disability determination programs;\n(12) hire staff and arrange services and facilities necessary to perform the duties and powers specified in this section; and\n(13) adopt, amend, suspend, or repeal rules necessary to implement or make specific programs that the commissioner by sections 268A.01 to 268A.15 is empowered to administer.",
	"repealed": false
}