{
	"id": "97A.411",
	"url": "https://www.revisor.mn.gov/statutes/cite/97A.411",
	"title": "97A.411 VALIDITY OF LICENSES.",
	"text": "(a) Except as provided in paragraphs (b), (d), (e), and (f), a license is valid during the lawful time within the license year that the licensed activity may be performed. Except as provided in paragraphs (c) and (f), a license year begins on the first day of March and ends on the last day of February.\n(b) A short-term license issued under section 97A.475 that is limited by the number of days or hours under section 97A.475, is valid for the full license period even if this period extends into the next license year, provided that the license period selected by the licensee begins at the time of issuance.\n(c) The license year for resident fish house, resident dark house, and nonresident fish house begins on March 1 and ends on April 30 of the following year.\n(d) A lifetime license issued under section 97A.473 or 97A.474 is valid during the lawful time within the license year that the licensed activity may be performed for the lifetime of the licensee.\n(e) A three-year fish house or dark house license is valid during the license year that it is purchased and the two succeeding license years.\n(f) A three-year individual angling license is valid during the license year in which it is purchased and the two succeeding license years.\n[Repealed, 2008 c 368 art 2 s 82]\n(a) Except as provided in paragraphs (b) and (c), a license to take deer by archery, firearms, or muzzleloader issued after the opening of the related archery, firearms, or muzzleloader deer season, respectively, is not valid unless it was issued prior to legal shooting hours on the day of its first use.\n(b) The commissioner may issue a license to take additional deer under section 97B.301, subdivision 4, that is not valid unless it was issued prior to legal shooting hours on the day the license is first used.\n(c) Paragraph (a) does not apply to deer licenses for discharged military personnel under section 97A.465, subdivision 4.\nA license to take wild animals that was lawfully obtained continues to be valid for the balance of the license period if the licensee's age, residency, or student qualification status changes.",
	"repealed": false
}