{
	"id": "61A.24",
	"url": "https://www.revisor.mn.gov/statutes/cite/61A.24",
	"title": "61A.24 STANDARD NONFORFEITURE LAW FOR LIFE INSURANCE.",
	"text": "This section shall be known as the \"Standard Nonforfeiture Law for Life Insurance.\"\n\"Operative date of the valuation manual\" means January 1 of the first calendar year that the valuation manual, as defined in section 61A.25, subdivision 1a, is effective.\nNo policy of life insurance, except as stated in subdivision 14, shall be delivered or issued for delivery in this state unless it contains in substance the following provisions, or corresponding provisions which in the opinion of the commissioner are at least as favorable to the defaulting or surrendering policyholder as are the minimum requirements specified below and are essentially in compliance with subdivision 15:\n(1) That, in the event of default in a premium payment, the company will grant, upon proper request not later than 60 days after the date of the premium in default, a paid-up nonforfeiture benefit on a plan stipulated in the policy, effective as of the due date, of the amount as may be hereinafter specified. In lieu of the stipulated paid-up nonforfeiture benefit, the company may substitute, upon proper request not later than 60 days after the due date of the premium in default, an actuarially equivalent alternative paid-up nonforfeiture benefit which provides a greater amount or longer period of death benefits or, if applicable, a greater amount or earlier payment of endowment benefits.\n(2) That, upon surrender of the policy within 60 days after the due date of a premium payment in default after premiums have been paid for at least three full years in the case of ordinary insurance or five full years in the case of industrial insurance, the company will pay, in lieu of a paid-up nonforfeiture benefit, a cash surrender value of an amount as may be hereinafter specified.\n(3) That a specified paid-up nonforfeiture benefit shall become effective as specified in the policy unless the person entitled to make the election elects another available option not later than 60 days after the due date of the premium in default.\n(4) That, if the policy becomes paid-up by completion of all premium payments or if it is continued under a paid-up nonforfeiture benefit which became effective on or after the third policy anniversary in the case of ordinary insurance or the fifth policy anniversary in the case of industrial insurance, the company will pay, upon surrender of the policy within 30 days after any policy anniversary, a cash surrender value of an amount as may be hereinafter specified.\n(5) In the case of a policy which causes, on a basis guaranteed in the policy, unscheduled changes in benefits or premiums, or which provides an option for changes in benefits or premiums other than a change to a new policy, a statement of the mortality table, interest rate, and method used in calculating cash surrender values and the paid-up nonforfeiture benefits available under the policy. In the case of any other policy, a statement of the mortality table and interest rate used in calculating the cash surrender values and the paid-up nonforfeiture benefits available under the policy, and a table showing the cash surrender value, if any, and paid-up nonforfeiture benefit, if any, available under the policy on each policy anniversary either during the first 20 policy years or during the term of the policy, whichever is shorter, the values and benefits to be calculated upon the assumption that there are no dividends or paid-up additions credited to the policy and that there is no indebtedness to the company on the policy.\n(6) A statement that the cash surrender values and the paid-up nonforfeiture benefits available under the policy are not less than the minimum values and benefits required by or pursuant to the insurance laws of the state in which the policy is delivered; an explanation of the manner in which the cash surrender values and the paid-up nonforfeiture benefits are altered by the existence of any paid-up additions credited to the policy or any indebtedness to the company on the policy; if a detailed statement of the method of computation of the values and benefits shown in the policy is not stated therein, a statement that the method of computation has been filed with the insurance supervisory official of the state in which the policy is delivered; and a statement of the method to be used in calculating the cash surrender value and paid-up nonforfeiture benefit available under the policy on any policy anniversary beyond the last anniversary for which the values and benefits are consecutively shown in the policy.\nAny provision or portion of subdivision 2 not applicable by reason of the plan of insurance may be omitted from the policy. The company shall reserve the right to defer the payment of any cash surrender value for a period of six months after demand therefor with surrender of the policy.\n(a) Except as otherwise provided by paragraphs (b) and (c), the cash surrender value available under the policy in the event of default in a premium payment due on a policy anniversary, whether or not required by subdivisions 2 and 3, shall be an amount not less than the excess of the present value on the anniversary of the future guaranteed benefits which would have been provided for by the policy, including any existing paid-up additions, if there had been no default, over the sum of (1) the then present value of the adjusted premiums as prescribed in subdivisions 6 to 12, corresponding to premiums which would have fallen due on and after the anniversary, and (2) the amount of any indebtedness to the company on the policy.\n(b) For a policy issued on or after the operative date of subdivision 12 which provides supplemental life insurance or annuity benefits at the option of the insured and for an identifiable additional premium by rider or supplemental policy provision, the cash surrender value referred to in paragraph (a) shall be an amount not less than the sum of the cash surrender value as defined in that paragraph for an otherwise similar policy issued at the same age without the rider or supplemental policy provision and the cash surrender value as defined in that paragraph for a policy which provides only the benefits otherwise provided by the rider or supplemental policy provision.\n(c) For a family policy issued on or after the operative date of subdivision 12 which defines a primary insured and provides term insurance on the life of the spouse of the primary insured expiring before the spouse becomes 71 years old, the cash surrender value referred to in paragraph (a) shall be an amount not less than the sum of the cash surrender value as defined in that paragraph for an otherwise similar policy issued at the same age without the term insurance on the life of the spouse and the cash surrender value as defined in that paragraph for a policy which provides only the benefits otherwise provided by the term insurance on the life of the spouse.\nThe cash surrender value available within 30 days after a policy anniversary under a policy paid-up by completion of all premium payments or a policy continued under a paid-up nonforfeiture benefit, whether or not required by subdivisions 2 and 3, shall be an amount not less than the present value on the anniversary of the future guaranteed benefits provided for by the policy, including any existing paid-up additions, decreased by any indebtedness to the company on the policy.\nAny paid-up nonforfeiture benefit available under the policy in the event of default in a premium payment due on any policy anniversary shall be such that its present value as of such anniversary shall be at least equal to the cash surrender value then provided for by the policy or, if none is provided for, that cash surrender value which would have been required by this section in the absence of the condition that premiums shall have been paid for at least a specified period.\nExcept as provided in subdivision 8, the adjusted premiums for a policy shall be calculated on an annual basis and shall be the uniform percentage of the respective premiums specified in the policy for each policy year, excluding extra premiums on a substandard policy. The present value, at the date of issue of the policy, of all adjusted premiums shall be equal to the sum of (1) the then present value of the future guaranteed benefits provided for by the policy; (2) two percent of the amount of insurance, if the insurance is uniform in amount, or of the equivalent uniform amount, as hereinafter defined, if the amount of insurance varies with duration of the policy; (3) 40 percent of the adjusted premium for the first policy year; (4) 25 percent of either the adjusted premium for the first policy year or the adjusted premium for a whole life policy of the same uniform or equivalent uniform amount with uniform premiums for the whole of life issued at the same age for the same amount of insurance, whichever is less. In applying the percentages specified in clauses (3) and (4), no adjusted premiums shall be deemed to exceed four percent of the amount of insurance or uniform amount equivalent thereto. The date of issue of a policy for the purpose of this section is the date as of which the rated age of the insured is determined.\nThis subdivision does not apply to policies issued on or after the operative date of subdivision 12.\nIn the case of a policy providing an amount of insurance varying with duration of the policy, the equivalent uniform amount thereof for the purpose of subdivisions 6 to 11 is the uniform amount of insurance provided by an otherwise similar policy containing the same endowment benefit or benefits issued at the same age and for the same term, the amount of which does not vary with duration and the benefits under which have the same present value at the date of issue as the benefits under the policy; provided, however, that in the case of a policy providing a varying amount of insurance issued on the life of a child under age ten, the equivalent uniform amount may be computed as though the amount of insurance provided by the policy prior to the attainment of age ten were the amount provided by such policy at age ten.\nThe adjusted premiums for any policy providing term insurance benefits by rider or supplemental policy provision shall be equal to (a) the adjusted premiums for an otherwise similar policy issued at the same age without such term insurance benefits, increased, during the period for which premiums for such term insurance benefits are payable, by (b) the adjusted premiums for such term insurance, the foregoing items (a) and (b) being calculated separately and as specified in subdivisions 6 and 7 except that, for the purposes of (2), (3) and (4) of subdivision 6, the amount of insurance or equivalent uniform amount of insurance used in the calculation of the adjusted premiums referred to in (b) shall be equal to the excess of the corresponding amount determined for the entire policy over the amount used in the calculation of the adjusted premiums in (a).\nIn the case of ordinary policies hereafter issued all adjusted premiums and present values referred to in this section shall be calculated on the basis of the Commissioners 1958 Standard Ordinary Mortality Table and the rate of interest specified in the policy for calculating cash surrender values and paid-up nonforfeiture benefits. The rate of interest shall not exceed 3-1/2 percent per annum for policies issued prior to April 11, 1974. A rate of interest not exceeding 4 percent per annum may be used for policies issued on or after April 11, 1974 and prior to August 1, 1978. A rate of interest not exceeding 5-1/2 percent per annum may be used for policies issued on or after August 1, 1978, except that for any single premium whole life or endowment insurance policy a rate of interest not exceeding 6-1/2 percent per annum may be used. For any category of ordinary insurance issued on female risks, adjusted premiums and present values may be calculated according to an age not more than six years younger than the actual age of the insured. However, in calculating the present value of any paid-up term insurance with the accompanying pure endowment, if any, offered as a nonforfeiture benefit, the rates of mortality assumed may be not more than those shown in the Commissioners 1958 Extended Term Insurance Table. Provided, further, that for insurance issued on a substandard basis, the calculation of adjusted premiums and present values may be based on any other table of mortality specified by the company and approved by the commissioner.\nThis subdivision does not apply to ordinary policies issued on or after the operative date of subdivision 12.\nExcept as otherwise provided in subdivisions 11 and 11a, all adjusted premiums and present values referred to in this section shall for all policies of industrial insurance be calculated on the basis of the 1941 Standard Industrial Mortality Table. All calculations shall be made on the basis of the rate of interest, not exceeding 3-1/2 percent per annum, specified in the policy for calculating cash surrender values and paid-up nonforfeiture benefits. In calculating the present value of paid-up term insurance with accompanying pure endowment, if any, offered as a nonforfeiture benefit, the rates of mortality assumed may be not more than 130 percent of the rates of mortality according to the applicable table. For insurance issued on a substandard basis, the calculation of adjusted premiums and present values may be based on any table of mortality specified by the company and approved by the commissioner.\nIn the case of industrial policies issued on or after the operative date of this subdivision as defined in subdivision 11a, all adjusted premiums and present values referred to in this section shall be calculated on the basis of the Commissioners 1961 Standard Industrial Mortality Table and the rate of interest specified in the policy for calculating cash surrender values and paid-up nonforfeiture benefits. The rate of interest shall not exceed 3-1/2 percent per annum for policies issued prior to April 11, 1974. A rate of interest not exceeding four percent per annum may be used for policies issued on or after April 11, 1974 and prior to August 1, 1978. A rate of interest not exceeding 5-1/2 percent per annum may be used for policies issued on or after August 1, 1978, except that for any single premium whole life or endowment insurance policy a rate of interest not exceeding 6-1/2 percent per annum may be used. In calculating the present value of any paid-up term insurance with accompanying pure endowment, if any, offered as a nonforfeiture benefit, the rates of mortality assumed may be not more than those shown in the Commissioners 1961 Industrial Extended Term Insurance Table. For insurance issued on a substandard basis, the calculations of adjusted premiums and present values may be based on any other table of mortality specified by the company and approved by the commissioner.\nThis subdivision shall not apply to industrial policies issued on or after the operative date of subdivision 12.\nAfter April 9, 1963, a company may file with the commissioner a written notice of its election to comply with the provisions of subdivision 11 after a specified date before January 1, 1968. After the filing of the notice, then upon the specified date, which shall be the operative date of subdivision 11 for the company, subdivision 11 shall become operative with respect to the industrial policies thereafter issued by the company. If a company makes no election, the operative date of subdivision 11 for the company shall be January 1, 1968.\n(a) This subdivision applies to all policies issued on or after its operative date. Except as provided in paragraph (g), the adjusted premiums for a policy shall be calculated on an annual basis and shall be the uniform percentage of the respective premiums specified in the policy for each policy year, excluding amounts payable as extra premiums to cover impairments or special hazards and also excluding any uniform annual contract charge or policy fee specified in the policy in a statement of the method to be used in calculating the cash surrender values and paid-up nonforfeiture benefits, that the present value, at the date of issue of the policy, of all adjusted premiums shall be equal to the sum of (1) the then present value of the future guaranteed benefits provided for by the policy; (2) one percent of either the amount of insurance, if the insurance is uniform in amount, or the average amount of insurance at the beginning of each of the first ten policy years; and (3) 125 percent of the nonforfeiture net level premium as hereinafter defined. In applying the percentage specified in clause (3), no nonforfeiture net level premium shall be deemed to exceed four percent of either the amount of insurance, if the insurance is uniform in amount, or the average amount of insurance at the beginning of each of the first ten policy years. The date of issue of a policy for the purpose of this section is the date as of which the rated age of the insured is determined.\n(b) The nonforfeiture net level premium shall be equal to the present value, at the date of issue of the policy, of the guaranteed benefits provided for by the policy divided by the present value, at the date of issue of the policy, of an annuity of one per annum payable on the date of issue of the policy and on each anniversary of the policy on which a premium falls due.\n(c) In the case of a policy which causes, on a basis guaranteed in the policy, unscheduled changes in benefits or premiums, or which provides an option for changes in benefits or premiums other than a change to a new policy, the adjusted premiums and present values shall initially be calculated on the assumption that future benefits and premiums do not change from those stipulated at the date of issue of the policy. At the time of the change in the benefits or premiums the future adjusted premiums, nonforfeiture net level premiums, and present values shall be recalculated on the assumption that future benefits and premiums do not change from those stipulated by the policy immediately after the change.\n(d) Except as otherwise provided in paragraph (g), the recalculated future adjusted premiums for a policy shall be the uniform percentage of the respective future premiums specified in the policy for each policy year, excluding amounts payable as extra premiums to cover impairments and special hazards, and also excluding any uniform annual contract charge or policy fee specified in the policy in a statement of the method to be used in calculating the cash surrender values and paid-up nonforfeiture benefits, that the present value, at the time of change to the newly defined benefits or premiums, of all future adjusted premiums shall be equal to the excess of: (1) the sum of the then present value of the then future guaranteed benefits provided for by the policy, and the additional expense allowance, if any, over; (2) the then cash surrender value, if any, or present value of any paid-up nonforfeiture benefit under the policy.\n(e) The additional expense allowance, at the time of the change to the newly defined benefits or premiums, shall be the sum of: (1) one percent of the excess, if positive, of the average amount of insurance at the beginning of each of the first ten policy years subsequent to the change over the average amount of insurance prior to the change at the beginning of each of the first ten policy years subsequent to the time of the most recent previous change, or, if there has been no previous change, the date of issue of the policy; and (2) 125 percent of the increase, if positive, in the nonforfeiture net level premium.\n(f) The recalculated nonforfeiture net level premium shall be equal to the result obtained by dividing clause (1) by clause (2) where clause (1) equals the sum of the nonforfeiture net level premium applicable prior to the change times the present value of an annuity of one per annum payable on each anniversary of the policy on or subsequent to the date of the change on which a premium would have fallen due had the change not occurred, and the present value of the increase in future guaranteed benefits provided for by the policy; and clause (2) equals the present value of an annuity of one per annum payable on each anniversary of the policy on or subsequent to the date of change on which a premium falls due.\n(g) Notwithstanding any other provisions of this subdivision to the contrary, in the case of a policy issued on a substandard basis which provides reduced graded amounts of insurance so that, in each policy year, the policy has the same tabular mortality cost as an otherwise similar policy issued on the standard basis which provides higher uniform amounts of insurance, adjusted premiums and present values for the substandard policy may be calculated as if it were issued to provide the higher uniform amounts of insurance on the standard basis.\n(h) All adjusted premiums and present values referred to in this subdivision shall: for all policies of ordinary insurance be calculated on the basis of the Commissioners 1980 Standard Ordinary Mortality Table, or at the election of the company for any one or more specified plans of life insurance, the Commissioners 1980 Standard Ordinary Mortality Table with Ten-Year Select Mortality Factors; for all policies of industrial insurance be calculated on the basis of the Commissioners 1961 Standard Industrial Mortality Table; and for all policies issued in a particular calendar year be calculated on the basis of a rate of interest not exceeding the nonforfeiture interest rate as defined in this section for policies issued in that calendar year. However:\n(1) at the option of the company, calculations for all policies issued in a particular calendar year may be made on the basis of a rate of interest not exceeding the nonforfeiture interest rate, as defined in this subdivision, for policies issued in the immediately preceding calendar year;\n(2) under a paid-up nonforfeiture benefit, including any paid-up dividend additions, any cash surrender value available, whether or not required by subdivision 2, shall be calculated on the basis of the mortality table and rate of interest used in determining the amount of the paid-up nonforfeiture benefit and paid-up dividend additions, if any;\n(3) a company may calculate the amount of a guaranteed paid-up nonforfeiture benefit including any paid-up additions under the policy on the basis of an interest rate no lower than that specified in the policy for calculating cash surrender values;\n(4) in calculating the present value of paid-up term insurance with accompanying pure endowment, if any, offered as a nonforfeiture benefit, the rates of mortality assumed may be not more than those shown in the commissioners 1980 Extended Term Insurance Table for policies of ordinary insurance and not more than the Commissioners 1961 Industrial Extended Term Insurance Table for policies of industrial insurance;\n(5) for insurance issued on a substandard basis, the calculation of any adjusted premiums and present values may be based on appropriate modifications of these tables;\n(6)(i) for policies issued prior to the operative date of the valuation manual, any commissioner's standard ordinary mortality tables, including any adopted after 1980 by the National Association of Insurance Commissioners, that are approved by rule adopted by the commissioner for use in determining the minimum nonforfeiture standard may be substituted for the Commissioners 1980 Standard Ordinary Mortality Table with or without Ten-Year Select Mortality Factors or for the Commissioners 1980 Extended Term Insurance Table; and\n(ii) for policies issued on or after the operative date of the valuation manual, the valuation manual shall provide the commissioner's standard mortality table for use in determining the minimum nonforfeiture standard that may be substituted for the Commissioners 1980 Standard Ordinary Mortality Table with or without Ten-Year Select Mortality Factors or for the Commissioners 1980 Extended Term Insurance Table. If the commissioner approves by rule any commissioner's standard ordinary mortality table adopted by the National Association of Insurance Commissioners for use in determining the minimum nonforfeiture standard for policies issued on or after the operative date of the valuation manual, then that minimum nonforfeiture standard supersedes the minimum nonforfeiture standard provided by the valuation manual;\n(7)(i) for policies issued prior to the operative date of the valuation manual, any commissioner's standard industrial mortality tables, including any adopted after 1980 by the National Association of Insurance Commissioners, that are approved by rule adopted by the commissioner for use in determining the minimum nonforfeiture standard may be substituted for the Commissioners 1961 Standard Industrial Mortality Table or the Commissioners 1961 Industrial Extended Term Insurance Table; and\n(ii) for policies issued on or after the operative date of the valuation manual, the valuation manual shall provide the commissioner's standard mortality table for use in determining the minimum nonforfeiture standard that may be substituted for the Commissioners 1961 Standard Industrial Mortality Table or the Commissioners 1961 Industrial Extended Term Insurance Table. If the commissioner approves by rule any commissioner's standard industrial mortality table adopted by the National Association of Insurance Commissioners for use in determining the minimum nonforfeiture standard for policies issued on or after the operative date of the valuation manual, then that minimum nonforfeiture standard supersedes the minimum nonforfeiture standard provided by the valuation manual.\n(i) The nonforfeiture interest rate is defined in clauses (1) and (2):\n(1) for policies issued prior to the operative date of the valuation manual, the nonforfeiture interest rate per annum for a policy issued in a particular calendar year shall be equal to 125 percent of the calendar year statutory valuation interest rate for the policy as defined in section 61A.25, rounded to the nearer one-quarter of one percent provided, however, that the nonforfeiture interest rate shall not be less than four percent; and\n(2) for policies issued on and after the operative date of the valuation manual, the nonforfeiture interest rate per annum for any policy issued in a particular calendar year shall be provided by the valuation manual.\n(j) Notwithstanding any other provision in this chapter to the contrary, a refiling of nonforfeiture values or their methods of computation for any previously approved policy form which involves only a change in the interest rate or mortality table used to compute nonforfeiture values shall not require refiling of any other provisions of that policy form.\n(k) After August 1, 1982, a company may file with the commissioner a written notice of its election to comply with the provision of this section after a specified date before January 1, 1989, which shall be the operative date of this subdivision for the company. If a company makes no election, the operative date of this subdivision for the company shall be January 1, 1989.\nIn the case of a plan of life insurance which is of a nature that minimum values cannot be determined by the methods described in subdivisions 2 to 12:\n(a) the commissioner must be satisfied that the benefits provided under the plan are substantially as favorable to policyholders and insureds as the minimum benefits otherwise required by subdivisions 2 to 12;\n(b) the commissioner must be satisfied that the benefits and the pattern of premiums of that plan are not likely to mislead prospective policyholders or insureds; and\n(c) the cash surrender values and paid-up nonforfeiture benefits provided by the plan must not be less than the minimum values and benefits required for the plan computed by a method consistent with the principles of this section, as determined by rules adopted by the commissioner.\nNotwithstanding subdivisions 12, 12a, or any other law to the contrary, a company may use the Commissioners 2017 Standard Ordinary Mortality Table in determining the minimum nonforfeiture standard for policies issued on or after January 1, 2017.\nA cash surrender value and a paid-up nonforfeiture benefit, available under the policy in the event of default in a premium payment due at a time other than on the policy anniversary, shall be calculated with allowance for the lapse of time and the payment of fractional premiums beyond the last preceding policy anniversary. All values referred to in subdivisions 4 to 12 may be calculated upon the assumption that any death benefit is payable at the end of the policy year of death. The net value of any paid-up additions, other than paid-up term additions, shall be not less than the amounts used to provide the additions. Notwithstanding the provisions of subdivision 4, additional benefits payable (1) in the event of death or dismemberment by accident or accidental means, (2) in the event of total and permanent disability, (3) as reversionary annuity or deferred reversionary annuity benefits, (4) as term insurance benefits provided by a rider or supplemental policy provisions to which, if issued as a separate policy, this section would not apply, (5) as term insurance on the life of a child or on the lives of children provided in a policy on the life of a parent of the child, if the term insurance expires before the child's age is 26, is uniform in amount after the child's age is one, and has not become paid-up by reason of the death of a parent of the child, and (6) as other policy benefits additional to life insurance and endowment benefits, and premiums for all additional benefits, shall be disregarded in ascertaining cash surrender values and nonforfeiture benefits required by this section, and no additional benefits shall be required to be included in paid-up nonforfeiture benefits.\nSubdivisions 1 to 13 do not apply to any of the following:\n(a) reinsurance;\n(b) group insurance;\n(c) a pure endowment;\n(d) an annuity or reversionary annuity contract;\n(e) a term policy of uniform amount, which provides no guaranteed nonforfeiture or endowment benefits, or renewal thereof, of 20 years or less expiring before age 71, for which uniform premiums are payable during the entire term of the policy;\n(f) a term policy of decreasing amount, which provides no guaranteed nonforfeiture or endowment benefits, on which each adjusted premium, calculated as specified in subdivisions 6 to 12, is less than the adjusted premium so calculated, on a term policy of uniform amount, or renewal thereof, which provides no guaranteed nonforfeiture or endowment benefits, issued at the same age and for the same initial amount of insurance and for a term of 20 years or less expiring before age 71, for which uniform premiums are payable during the entire term of the policy;\n(g) a policy, which provides no guaranteed nonforfeiture or endowment benefits, for which no cash surrender value, if any, or present value of any paid-up nonforfeiture benefit, at the beginning of any policy year, calculated as specified in subdivisions 4 to 12, exceeds 2-1/2 percent of the amount of insurance at the beginning of the same policy year; or\n(h) a policy delivered outside this state through an agent or other representative of the company issuing the policy.\nFor purposes of determining the applicability of this section, the age at expiry for a joint term life insurance policy shall be the age at expiry of the oldest life.\n(a) This subdivision, in addition to all other applicable subdivisions of this section, applies to all policies issued on or after January 1, 1985. Any cash surrender value available under the policy in the event of default in a premium payment due on a policy anniversary shall be in an amount which does not differ by more than two-tenths of one percent of either the amount of insurance, if the insurance is uniform in amount, or the average amount of insurance at the beginning of each of the first ten policy years, from the sum of (1) the greater of zero and the basic cash value hereinafter specified, and (2) the present value of any existing paid-up additions less the amount of any indebtedness to the company under the policy.\n(b) The basic cash value shall be equal to the present value, on the anniversary, of the future guaranteed benefits which would have been provided for by the policy, excluding any existing paid-up additions and before deduction of any indebtedness to the company, if there had been no default, less the then present value of the nonforfeiture factors, as hereinafter defined, corresponding to premiums which would have fallen due on and after the anniversary; provided, however, that the effects on the basic cash value of supplemental life insurance or annuity benefits or of family coverage, as described in subdivision 4 or 6, whichever is applicable, shall be the same as are the effects specified in subdivision 4 or 6, whichever is applicable, on the cash surrender values defined in those subdivisions.\n(c) The nonforfeiture factor for each policy year shall be an amount equal to a percentage of the adjusted premium for the policy year, as defined in subdivision 6 or 12, whichever is applicable. Except as is required by paragraph (d), the percentage:\n(1) must be the same percentage for each policy year between the second policy anniversary and the later of the fifth policy anniversary or the first policy anniversary at which there is available under the policy a cash surrender value in an amount, before including any paid-up additions and before deducting any indebtedness, of at least two-tenths of one percent of either the amount of insurance, if the insurance be uniform in amount, or the average amount of insurance at the beginning of each of the first ten policy years; and\n(2) must be such that no percentage after the later of the two policy anniversaries specified in clause (1) may apply to fewer than five consecutive policy years.\n(d) No basic cash value may be less than the value which would be obtained if the adjusted premiums for the policy, as defined in subdivision 6 or 12, whichever is applicable, were substituted for the nonforfeiture factors in the calculation of the basic cash value.\n(e) All adjusted premiums and present values referred to in this subdivision shall for a particular policy be calculated on the same mortality and interest bases as are used in demonstrating the policy's compliance with the other subdivisions of this section. The cash surrender values referred to in this subdivision shall include any endowment benefits provided for by the policy.\n(f) The cash surrender value available other than in the event of default in a premium payment due on a policy anniversary, and the amount of a paid-up nonforfeiture benefit available under the policy in the event of default in a premium payment shall be determined in manners consistent with the manners specified for determining the analogous minimum amounts in subdivisions 2, 3, 4, 5, 12 and 13. The amounts of cash surrender values and of paid-up nonforfeiture benefits granted in connection with additional benefits such as those listed in subdivision 13, clauses (1) to (6), shall conform with the principles of this subdivision.",
	"repealed": false
}