{
	"id": "144A.37",
	"url": "https://www.revisor.mn.gov/statutes/cite/144A.37",
	"title": "144A.37 ALTERNATIVE NURSING HOME SURVEY PROCESS.",
	"text": "(a) The commissioner of health shall implement alternative procedures for the nursing home survey process as authorized under this section.\n(b) These alternative survey process procedures seek to: (1) use department resources more effectively and efficiently to target problem areas; (2) use other existing or new mechanisms to provide objective assessments of quality and to measure quality improvement; (3) provide for frequent collaborative interaction of facility staff and surveyors rather than a punitive approach; and (4) reward a nursing home that has performed very well by extending intervals between full surveys.\n(c) The commissioner shall pursue changes in federal law necessary to accomplish this process and shall apply for any necessary federal waivers or approval. If a federal waiver is approved, the commissioner shall promptly submit, to the house of representatives and senate committees with jurisdiction over health and human services policy and finance, fiscal estimates for implementing the alternative survey process waiver. The commissioner shall also pursue any necessary federal law changes during the 107th Congress.\n(d) The alternative nursing home survey schedule and related educational activities shall not be implemented until funding is appropriated by the legislature.\nThe commissioner of health must extend the time period between standard surveys up to 30 months based on the criteria established in subdivision 4. In using the alternative survey schedule, the requirement for the statewide average to not exceed 12 months does not apply.\nThe commissioner shall develop a process for identifying the survey cycles for skilled nursing facilities based upon the compliance history of the facility. This process can use a range of months for survey intervals. At a minimum, the process must be based on information from the last two survey cycles and shall take into consideration any deficiencies issued as the result of a survey or a complaint investigation during the interval. A skilled nursing facility with a finding of substandard quality of care or a finding of immediate jeopardy is not entitled to a survey interval greater than 12 months. The commissioner shall alter the survey cycle for a specific skilled nursing facility based on findings identified through the completion of a survey, a monitoring visit, or a complaint investigation. The commissioner must also take into consideration information other than the facility's compliance history.\n(a) The commissioner shall provide public notice of the classification process and shall identify the selected survey cycles for each skilled nursing facility. The classification system must be based on an analysis of the findings made during the past two standard survey intervals, but it only takes one survey or complaint finding to modify the interval.\n(b) The commissioner shall also take into consideration information obtained from residents and family members in each skilled nursing facility and from other sources such as employees and ombudsmen in determining the appropriate survey intervals for facilities.\n(a) The commissioner shall conduct at least one monitoring visit on an annual basis for every skilled nursing facility which has been selected for a survey cycle greater than 12 months. The commissioner shall develop protocols for the monitoring visits which shall be less extensive than the requirements for a standard survey. The commissioner shall use the criteria in paragraph (b) to determine whether additional monitoring visits to a facility will be required.\n(b) The criteria shall include, but not be limited to, the following:\n(1) changes in ownership, administration of the facility, or direction of the facility's nursing service;\n(2) changes in the facility's quality indicators which might evidence a decline in the facility's quality of care;\n(3) reductions in staffing or an increase in the utilization of temporary nursing personnel; and\n(4) complaint information or other information that identifies potential concerns for the quality of the care and services provided in the skilled nursing facility.\nThe commissioner shall establish a process for surveying and monitoring of facilities which require a survey interval of less than 15 months. This information shall identify the steps that the commissioner must take to monitor the facility in addition to the standard survey.\nThe implementation of an alternative survey process for the state must not result in any reduction of funding that would have been provided to the state survey agency for survey and enforcement activity based upon the completion of full standard surveys for each skilled nursing facility in the state.\nThe commissioner shall expand the state survey agency's ability to conduct training and educational efforts for skilled nursing facilities, residents and family members, residents and family councils, long-term care ombudsman programs, and the general public.\nThe commissioner shall develop a process for the evaluation of the effectiveness of an alternative survey process conducted under this section.",
	"repealed": false
}