{
	"id": "446A.077",
	"url": "https://www.revisor.mn.gov/statutes/cite/446A.077",
	"title": "446A.077 LEAD SERVICE LINE REPLACEMENT; GRANT PROGRAM.",
	"text": "(a) For the purposes of this section, the following terms have the meanings given.\n(b) \"Lead service line\" means a water supply connection that is made of or lined with a material consisting of lead and that connects a water main to a building. A lead pigtail, lead gooseneck, or other lead fitting is considered a lead service line, regardless of the composition of the service line or other portions of piping to which the piece is attached. A galvanized service line is considered a lead service line.\n(c) \"Service line\" means any piping, tubing, or fitting connecting a water main to a building. Service line includes the property owner side and the system side of a service line.\nThe authority must establish a program to replace lead drinking water service lines in the state and must provide grants to entities for this purpose. The program must be structured to maximize use of federal funds available for the purposes described in subdivision 4.\n(a) The following are eligible recipients of grants under this section:\n(1) community public water suppliers of a community water system as defined in Code of Federal Regulations, title 40, section 141.2, as amended;\n(2) municipalities;\n(3) suppliers of other residential drinking water systems; and\n(4) any applicant eligible for loans and grants under the federal Safe Drinking Water Act.\n(b) All eligible recipients as part of the grant application process must apply to be listed on the Department of Health project priority list.\n(a) An eligible recipient may use a grant provided under this program for:\n(1) removing and replacing lead drinking water service lines;\n(2) repaying debt incurred for the purposes described in clauses (1), (3), and (4);\n(3) providing information to residents on the benefits of removing lead service lines; or\n(4) performing necessary construction activities required for and associated with removing and replacing lead service lines.\n(b) Grant money used for removing and replacing lead drinking water service lines under paragraph (a), clause (1), must pay for 100 percent of the cost of replacing the privately owned portions of those lines.\n(c) Grant money used for removing and replacing lead drinking water service lines under paragraph (a), clause (1), may pay for not more than 50 percent of the cost of replacing the publicly owned portions of those lines.\n(a) Each applicant must submit a plan to the Department of Health for replacement of all lead service lines in the service area that describes how the recipient will prioritize the expenditure of grant money received under this section, including:\n(1) removing lead service lines that are an imminent threat to public health and safety;\n(2) targeting areas with children with elevated blood lead levels;\n(3) targeting areas with children under the age of five;\n(4) how the recipient will target the removal and replacement of lead service lines that provide drinking water to schools, licensed child care facilities, or other properties known to the recipient to be used by disproportionately large numbers of children;\n(5) targeting areas with lower-income residents and other disadvantaged communities;\n(6) coordinating the replacement of publicly owned and privately owned portions of lead service lines; and\n(7) coordinating the replacement of lead service lines with water main replacement projects for the most efficient use of money.\n(b) The authority must use available money received for the program under this section first for grants to repay debt incurred under subdivision 4, paragraph (a), clause (2).\nApplicants who serve 15,000 service connections or more must submit a workforce plan as part of their application. The workforce plan must include a description of how the applicant will maximize the use of registered apprentices, along with populations under-represented in the construction industry in the lead removal and replacement work.\nBy September 15 each year, the authority must report to the chairs and ranking minority members of the legislative committees and divisions with jurisdiction over environment and natural resources policy and finance, health policy and finance, and economic development finance and policy, on the operation of the program during the previous fiscal year. The report must also include:\n(1) an estimate of the total cost to remove and replace all lead service lines in public drinking water systems in Minnesota, an estimate of the total cost to remove and replace all privately owned lead drinking water service lines in Minnesota, and a computation of the amount the estimates changed since the program was created. If either of the cost estimates changed since the most recent previous report was submitted, the report must include an explanation of the reasons the estimate changed;\n(2) the number of elementary schools, middle schools, or secondary schools as those terms are defined in section 120A.05, within a municipal community public water supply service area served by lead service lines;\n(3) the number of licensed child care settings that are served by lead service lines;\n(4) any amounts appropriated for the grant program that remain unspent;\n(5) a list of the eligible recipients that submitted a plan to the commissioner of health; and\n(6) a list of the eligible recipients that received a grant under this section in order of priority as determined by the authority.\nLaborers and mechanics performing work on a project funded by a grant under this section, including removing and replacing lead drinking water service lines and installing replacement drinking water service lines, must be paid the prevailing wage rate for the work as defined in section 177.42, subdivision 6. The project is subject to the requirements and enforcement provisions of sections 177.27, 177.30, 177.32, 177.41 to 177.435, and 177.45.\nThe authority may spend up to ten percent of the amounts appropriated for the grant program for costs related to mapping and inventory activities that will be used in identifying lead service lines for replacement under this section. The authority may enter into interagency agreements with the Department of Health, including agreements to transfer funds, for the Department of Health to provide technical assistance to community public water suppliers, as defined in the federal Safe Drinking Water Act, for producing an inventory of publicly and privately owned lead service lines and associated replacement plans within their jurisdiction. Any amounts not spent on mapping and inventory work must be used by the authority for replacement of lead service lines under this section.",
	"repealed": false
}