{
	"id": "60C.21",
	"url": "https://www.revisor.mn.gov/statutes/cite/60C.21",
	"title": "60C.21 INSOLVENCY; NOTICE OF GUARANTY FUND PROTECTION.",
	"text": "No person, including an insurer, agent, or affiliate of an insurer or agent shall sell, or offer for sale, a covered property and casualty insurance policy, unless the notice, in the form specified in subdivision 2, is given or obtained with or as a part of the application for that policy.\nFor telephonic sales, the notice may be given or obtained either with or as part of the application for, or at the time of delivery of, that policy, and the person offering the policy shall document the fact that the notice was given. This section does not apply to renewals, unless the renewal increases the dollar amount of a coverage by more than 100 percent. The notice must be given or obtained in writing or in the same medium as the application for insurance.\nThe notice required under subdivision 1 must be in the following form:\n\"NOTICE CONCERNING POLICYHOLDER RIGHTS IN AN\nINSOLVENCY UNDER THE MINNESOTA INSURANCE\nGUARANTY ASSOCIATION LAW\nThe financial strength of your insurer is one of the most important things for you to consider when determining from whom to purchase a property or liability insurance policy. It is your best assurance that you will receive the protection for which you purchased the policy. If your insurer becomes insolvent, you may have protection from the Minnesota Insurance Guaranty Association as described below but to the extent that your policy is not protected by the Minnesota Insurance Guaranty Association or if it exceeds the guaranty association's limits, you will only have the assets, if any, of the insolvent insurer to satisfy your claim.\nResidents of Minnesota who purchase property and casualty or liability insurance from insurance companies licensed to do business in Minnesota are protected, SUBJECT TO LIMITS AND EXCLUSIONS, in the event the insurer becomes insolvent. This protection is provided by the Minnesota Insurance Guaranty Association.\nMinnesota Insurance Guaranty Association\n(insert current address)\nThe maximum amount that the Minnesota Insurance Guaranty Association will pay in regard to a claim under all policies issued by the same insurer is limited to $300,000. This limit does not apply to workers' compensation insurance. Protection by the guaranty association is subject to other substantial limitations and exclusions. If your claim exceeds the guaranty association's limits, you may still recover a part or all of that amount from the proceeds from the liquidation of the insolvent insurer, if any exist. Funds to pay claims may not be immediately available. The guaranty association assesses insurers licensed to sell property and casualty or liability insurance in Minnesota after the insolvency occurs. Claims are paid from the assessment.\nTHE PROTECTION PROVIDED BY THE GUARANTY ASSOCIATION IS NOT A SUBSTITUTE FOR USING CARE IN SELECTING INSURANCE COMPANIES THAT ARE WELL MANAGED AND FINANCIALLY STABLE. IN SELECTING AN INSURANCE COMPANY OR POLICY, YOU SHOULD NOT RELY ON PROTECTION BY THE GUARANTY ASSOCIATION.\nTHIS NOTICE IS REQUIRED BY MINNESOTA STATE LAW TO ADVISE POLICYHOLDERS OF PROPERTY AND CASUALTY INSURANCE POLICIES OF THEIR RIGHTS IN THE EVENT THEIR INSURANCE CARRIER BECOMES INSOLVENT. THIS NOTICE IN NO WAY IMPLIES THAT THE COMPANY CURRENTLY HAS ANY TYPE OF FINANCIAL PROBLEMS. ALL PROPERTY AND CASUALTY INSURANCE POLICIES ARE REQUIRED TO PROVIDE THIS NOTICE.\"\nAdditional language may be added to the notice if approved by the commissioner prior to its use in the form.\nThe distribution, delivery, contents, or interpretation of the notice required by this section shall not mean that the policy would be covered in the event of the insolvency of a member insurer if coverage is not otherwise provided by this chapter. Failure to receive the notice does not give the policyholder, certificate holder, or any other interested party any greater rights than those provided by this chapter.\nThis section does not apply to fraternal benefit societies regulated under chapter 64B or to fidelity or surety bonds, policies, or contracts.",
	"repealed": false
}