{
	"id": "18B.31",
	"url": "https://www.revisor.mn.gov/statutes/cite/18B.31",
	"title": "18B.31 PESTICIDE DEALER LICENSE.",
	"text": "(a) Except as provided in paragraph (b), no fixed location may offer for sale or sell a restricted use or bulk pesticide to a pesticide end user without a pesticide dealer license.\n(b) A pesticide dealer license is not required for:\n(1) a licensed commercial applicator, noncommercial applicator, or structural pest control applicator who uses restricted use pesticides only as an integral part of a pesticide application service;\n(2) a federal, state, county, or municipal agency using restricted use pesticides for its own programs;\n(3) a licensed pharmacist, physician, dentist, or veterinarian when administering or dispensing a restricted use pesticide for use in the pharmacist's, physician's, dentist's, or veterinarian's practice; or\n(4) a person at a fixed location that is not used to offer for sale or sell restricted use or bulk pesticides including, but not limited to, warehouses or other storage sites.\n(c) A licensed pesticide dealer may sell restricted use pesticides only to an applicator licensed or certified by the commissioner, unless a sale is allowed by rule.\n(d) A pesticide dealer license is required for an individual not located in Minnesota who offers for sale or sells a restricted use or bulk pesticide to a pesticide end user located in Minnesota.\n(e) Only one pesticide dealer license is required per fixed location from which a restricted use or bulk pesticide is offered for sale or sold to a pesticide end user.\nA pesticide dealer is responsible for the acts of a person who assists the dealer in the solicitation and sale of restricted use pesticides.\nA pesticide dealer license:\n(1) is issued by the commissioner upon receipt and review of a complete initial or renewal application;\n(2) is valid for one year and expires on January 31 of each year unless it is suspended or revoked before that date;\n(3) is not transferable to another location; and\n(4) must be prominently displayed to the public in the pesticide dealer's place of business.\n(a) A person must apply to the commissioner for a pesticide dealer license on the forms and in the manner required by the commissioner.\n(b) The commissioner may require an additional demonstration of dealer qualification if the dealer has had a license suspended or revoked, or has otherwise had a history of violations of this chapter.\n(c) An application for renewal of a pesticide dealer license is not complete until the commissioner receives the report and applicable fees required under section 18B.316, subdivision 8.\n(a) An application for a pesticide dealer license must be accompanied by a nonrefundable application fee of $150.\n(b) If an application for renewal of a pesticide dealer license is not filed before the license expires, an additional fee of 50 percent of the application fee must be paid by the applicant before the commissioner may issue the license.",
	"repealed": false
}