{
	"id": "325E.11",
	"url": "https://www.revisor.mn.gov/statutes/cite/325E.11",
	"title": "325E.11 COLLECTION FACILITIES; NOTICE.",
	"text": "(a) Any person selling at retail or offering motor oil or motor oil filters for retail sale in this state shall:\n(1) post a notice indicating the nearest location where used motor oil and used motor oil filters may be returned at no cost for recycling or reuse, post a toll-free telephone number that may be called by the public to determine a convenient location, or post a listing of locations where used motor oil and used motor oil filters may be returned at no cost for recycling or reuse; or\n(2) if the person is subject to section 325E.112, subdivision 1, paragraph (b), post a notice informing customers purchasing motor oil or motor oil filters of the location of the used motor oil and used motor oil filter collection site established by the retailer in accordance with section 325E.112, subdivision 1, paragraph (b), where used motor oil and used motor oil filters may be returned at no cost.\n(b) A notice under paragraph (a) shall be posted on or adjacent to the motor oil and motor oil filter displays, be at least 8-1/2 inches by 11 inches in size, contain the universal recycling symbol with the following language:\n(1) \"It is illegal to put used oil and used motor oil filters in the garbage.\";\n(2) \"Recycle your used oil and used motor oil filters.\"; and\n(3)(i) \"There is a free collection site here for your used oil and used motor oil filters.\";\n(ii) \"There is a free collection site for used oil and used motor oil filters located at (name of business and street address).\";\n(iii) \"For the location of a free collection site for used oil and used motor oil filters call (toll-free phone number).\"; or\n(iv) \"Here is a list of free collection sites for used oil and used motor oil filters.\"\n(c) The Pollution Control Agency shall enforce compliance with this section under sections 115.071 and 116.072 in coordination with the Division of Weights and Measures.",
	"repealed": false
}