{
	"id": "168.27",
	"url": "https://www.revisor.mn.gov/statutes/cite/168.27",
	"title": "168.27 MOTOR VEHICLE DEALERS; VIOLATIONS, PENALTIES.",
	"text": "(a) For the purposes of this section, the terms in paragraphs (b) to (o) have the meanings given them.\n(b) \"Auctioning motor vehicles\" means arranging for and handling the sale of motor vehicles, not the property of the auctioneer, to the highest bidder.\n(c) \"Brokering motor vehicles\" means arranging sales or leases between buyers and sellers, or lessees and lessors, of motor vehicles and receiving a fee for those services.\n(d) \"Commercial building\" means a permanent, enclosed building that is on a permanent foundation and connected to local sewer and water facilities or otherwise complying with local sanitary codes, is adapted to commercial use, and conforms to local government zoning requirements. \"Commercial building\" may include strip office malls or garages if a separate entrance and a separate address are maintained and the dealership is clearly identified as a separate business.\n(e) \"Commercial office space\" means office space occupying all or part of a commercial building.\n(f) \"Dealer\" includes licensed new motor vehicle dealers, used motor vehicle dealers, motor vehicle brokers, wholesalers, auctioneers, lessors of new or used motor vehicles, scrap metal processors, used vehicle parts dealers, and salvage pools.\n(g) \"Horse trailer\" is a trailer designed and used to carry horses and other livestock, which has not more than three axles and a maximum gross weight capacity of not more than 24,000 pounds.\n(h) \"Junked vehicle\" means a vehicle that is declared unrepairable under section 168A.151.\n(i) \"Leasing motor vehicles\" means furnishing a motor vehicle for a fee under a bailor-bailee relationship where no incidences of ownership are intended to be transferred other than the right to use the vehicle for a stated period of time.\n(j) \"Motor vehicle\" has the meaning given it in section 168.002, subdivision 18, and also includes a park trailer as defined in section 168.002, subdivision 23.\n(k) \"Motor vehicle broker\" means a person who arranges the sale of a motor vehicle between a buyer and a seller, or the lease of a motor vehicle between a lessee and a lessor, for which service the broker receives a fee.\n(l) \"New motor vehicle\" means a motor vehicle other than described in paragraph (n).\n(m) \"Registration year\" means the 12-month period for which a dealer license is issued.\n(n) \"Used motor vehicle\" means a motor vehicle for which title has been transferred from the person who first acquired it from the manufacturer, distributor, or dealer. A new motor vehicle will not be considered a used motor vehicle until it has been placed in actual operation and not held for resale by an owner who has been granted a certificate of title on the motor vehicle and has registered the motor vehicle in accordance with this chapter and chapters 168A and 297B, or the laws of the residence of the owner.\n(o) \"Wholesaling motor vehicles\" means selling new or used motor vehicles to dealers for resale to the public.\n(a) No person shall engage in the business of selling new motor vehicles or shall offer to sell, solicit, deliver, or advertise the sale of new motor vehicles without first acquiring a new motor vehicle dealer license.\n(b) No person shall engage in the business of selling used motor vehicles or shall offer to sell, solicit, deliver, or advertise the sale of used motor vehicles without first acquiring a used motor vehicle dealer license.\n(c) No person shall engage in the business of buying or otherwise acquiring vehicles; or offering to buy or otherwise acquire, or soliciting or advertising the buying or acquiring of, vehicles for processing and selling the metal for remelting without first acquiring a scrap metal processor license.\n(d) No person shall be primarily engaged in the business of buying or otherwise acquiring vehicles for the purpose of dismantling the vehicles and selling used parts and the remaining scrap metals without first acquiring a used vehicle parts dealer license.\n(e) No person shall engage in the business of storing and displaying, offering to store or display, or soliciting or advertising the storing or displaying, for sale, of damaged or junked vehicles as an agent or escrow agent of an insurance company without first acquiring a vehicle salvage pool license.\n(f) No person shall engage in the business of leasing motor vehicles or shall offer to lease, solicit or advertise to lease motor vehicles without first acquiring a motor vehicle lessor license.\n(g) No person shall engage in the business of wholesaling motor vehicles to dealers for resale or shall offer to sell, solicit or advertise the sale of motor vehicles to dealers for resale without first acquiring a motor vehicle wholesaler license.\n(h) No person shall engage in the business of auctioning motor vehicles for more than one owner at an auction or shall offer to sell, solicit or advertise the sale of motor vehicles at auction without first acquiring a motor vehicle auctioneer license.\n(i) No person shall engage in the business of brokering motor vehicles without first acquiring a motor vehicle broker's license.\n(a) A new motor vehicle dealer licensee may sell, broker, wholesale, or auction and solicit and advertise the sale, brokerage, wholesale, or auction of new motor vehicles covered by the franchise and any used motor vehicles, and may lease and solicit and advertise the lease of new motor vehicles and any used motor vehicles. New motor vehicle dealer sales or leases may be either for consumer use at retail or for resale to a dealer. A new motor vehicle dealer may engage in the business of buying or otherwise acquiring vehicles for dismantling the vehicles and selling used parts and remaining scrap materials under chapter 168A, except that a new motor vehicle dealer may not purchase a junked vehicle from a salvage pool, insurance company, or its agent unless the dealer is also licensed as a used vehicle parts dealer or licensed as a scrap metal processor. Nothing in this subdivision requires an applicant for a dealer license who proposes to deal in: (1) new and unused motor vehicle bodies; or (2) type A, B, or C motor homes as defined in section 168.002, subdivision 27, to have a bona fide contract or franchise in effect with either the first-stage manufacturer of the motor home or the manufacturer or distributor of any motor vehicle chassis upon which the new and unused motor vehicle body is mounted. The modification or conversion of a new van-type vehicle into a multipurpose passenger vehicle which is not a motor home does not constitute dealing in new or unused motor vehicle bodies, and a person engaged in the business of selling these van-type vehicles must have a bona fide contract or franchise with the appropriate manufacturer under subdivision 10. A van converter or modifier who owns these modified or converted van-type vehicles may sell them at wholesale to new motor vehicle dealers having a bona fide contract or franchise with the first-stage manufacturer of the vehicles.\n(b) The requirements pertaining to franchises do not apply to persons who remodel or convert motor vehicles for medical purposes. For purposes of this subdivision, \"medical purpose\" means certification by a licensed physician that remodeling or conversion of a motor vehicle is necessary to enable a disabled person to use the vehicle.\n(c) A new motor vehicle dealer shall not deliver a manufacturer's or importer's certificate of origin for a passenger automobile, pickup truck, or van requiring a certificate of title according to chapter 168A to any person in conjunction with the sale of a vehicle except to the department, another new motor vehicle dealer licensed to sell the same line or make, or a person whose primary business is picking up and delivering motor vehicle title documents.\n(d) If a new motor vehicle dealer agrees to sell or lease a new motor vehicle using the services of a motor vehicle broker, the new motor vehicle dealer may not refuse to deliver possession of the vehicle to the buyer or lessee. This paragraph does not require delivery unless all arrangements have been properly completed for payment, insurance required by law, titling, transfer, and registration of the new vehicle and any trade-in vehicle. Delivery may take place at or away from the dealership.\n(a) A new motor vehicle dealer licensed under this chapter that operates under an agreement or franchise from a manufacturer and sells electric vehicles must maintain at least one employee who is certified as having completed a training course offered by a Minnesota motor vehicle dealership association that addresses at least the following elements:\n(1) fundamentals of electric vehicles;\n(2) electric vehicle charging options and costs;\n(3) publicly available electric vehicle incentives;\n(4) projected maintenance and fueling costs for electric vehicles;\n(5) reduced tailpipe emissions, including greenhouse gas emissions, produced by electric vehicles;\n(6) the impacts of Minnesota's cold climate on electric vehicle operation; and\n(7) best practices to sell electric vehicles.\n(b) For the purposes of this section, \"electric vehicle\" has the meaning given in section 169.011, subdivision 26a, paragraphs (a) and (b), clause (3).\nA used motor vehicle dealer licensee may sell, lease, broker, wholesale, or auction and solicit and advertise the sale, lease, brokerage, wholesale, or auction of any used motor vehicles for consumer use at retail or for resale to a dealer. A used motor vehicle dealer may engage in the business of buying or otherwise acquiring vehicles for dismantling the vehicles and selling used parts and remaining scrap materials under chapter 168A, except that a used motor vehicle dealer may not acquire a junked vehicle from a salvage pool, insurance company, or its agent, unless the dealer is also licensed as a used vehicle parts dealer or licensed as a scrap metal processor.\nA scrap metal processor licensee may buy or otherwise acquire vehicles and solicit and advertise the buying or acquiring of vehicles for processing and selling the metal for remelting. A scrap metal processor licensee may not acquire a junked vehicle for the purpose of dismantling and selling used vehicle parts and remaining scrap materials unless the scrap metal processor is also licensed as a used vehicle parts dealer.\nMS 2000 [Repealed by amendment, 2002 c 371 art 1 s 9]\nA vehicle salvage pool licensee may store and display and may solicit and advertise the storing and displaying, for sale, of damaged or junked vehicles as an agent or escrow agent of an insurance company. A vehicle salvage pool licensee shall not sell junked vehicles to any party other than a licensed used parts dealer or a licensed scrap metal processor.\nA used vehicle parts dealer licensee may sell, solicit, or advertise the sale of used parts and the remaining scrap metals, but is prohibited from selling any new or used motor vehicles for use at retail or for resale to a dealer.\nA motor vehicle lessor licensee may lease or rent either by the hour, day, or longer period for a fee and may solicit and advertise the lease or rental of motor vehicles. A motor vehicle lessor having leased motor vehicles, may sell the vehicles upon their return to the lessor after termination or expiration of the lease without obtaining a used motor vehicle dealer license.\n(a) A limited used vehicle license shall be provided to a nonprofit charitable organization that qualifies for tax exemption under section 501(c)(3) of the Internal Revenue Code whose primary business in the transfer of vehicles is to raise funds for the corporation, who acquires vehicles for sale through donation, and who uses a licensed motor vehicle auctioneer to sell vehicles to individuals, or who sells and reassigns vehicles to a licensed motor vehicle dealer. This license does not apply to educational institutions whose primary purpose is to train students in the repair, maintenance, and sale of motor vehicles. A limited used vehicle license allows the organization to accept assignment of vehicles without the requirement to transfer title as provided in section 168A.10 until sold or donated to an individual or licensed motor vehicle dealer. Limited used vehicle license holders are not entitled to dealer plates, and shall report all vehicles held for resale to the Department of Public Safety in a manner and time prescribed by the department.\n(b) A nonprofit charitable organization with a limited used vehicle license shall, within 90 days after a vehicle donation, send a donor a receipt for the donated vehicle which states its model; age; level of use, including, but not limited to, the mileage; its condition, and whether a visual inspection disclosed any readily apparent defects that would materially reduce the value of the property. The receipt must include the date of the donation and must state whether the vehicle was operable or inoperable at the time of the donation.\nMS 1961 [Repealed, 1965 c 681 s 4]\nMS 1982 [Repealed, 1984 c 549 s 34; 1984 c 654 art 3 s 153]\nNo person may solicit, accept, offer for sale, or sell motor vehicles for consignment sale unless licensed as a new or used motor vehicle dealer, a motor vehicle wholesaler, or a motor vehicle auctioneer. This requirement does not apply to a licensed auctioneer selling motor vehicles at an auction if, in the ordinary course of the auctioneer's business, the sale of motor vehicles is incidental to the sale of other real or personal property. Incidental means up to a total of ten but no more than ten percent of the items in the posted auction bill are motor vehicles.\nA motor vehicle wholesaler licensee may sell, solicit or advertise the sale of motor vehicles at wholesale for resale; provided that a wholesaler may sell, solicit, or advertise the sale of new motor vehicles only to dealers duly licensed to sell the same make of motor vehicles.\nA motor vehicle auctioneer licensee may sell, solicit and advertise the sale of used motor vehicles belonging to others at auction.\n(a) A motor vehicle broker shall provide each buyer or lessee with a written disclosure stating whether the motor vehicle broker receives a fee from the dealers with whom the broker does business. The new or used motor vehicle dealer is the seller of record in all such transactions. The motor vehicle dealer may pay the motor vehicle broker a fee for brokering services rendered. A motor vehicle broker may:\n(1) advertise and solicit the brokering of new motor vehicles. A motor vehicle broker shall not advertise or make any representations which state, imply, or suggest that the motor vehicle broker itself sells vehicles, is authorized to sell vehicles, or obtains vehicles directly from the motor vehicle manufacturer. All advertising or other solicitations by a motor vehicle broker shall disclose that sales of new motor vehicles are arranged through franchised motor vehicle dealers;\n(2) negotiate or quote the sale price or lease terms of motor vehicles;\n(3) prepare and deliver documents necessary to the transaction;\n(4) accept a down payment not to exceed $500, but otherwise may not accept payment in full or in part for a motor vehicle unless the payment is in the form of a negotiable instrument payable to the vehicle dealer;\n(5) accompany a motor vehicle purchaser or lessee at the time of delivery by the selling dealer of a new motor vehicle; and\n(6) be present when warranties and safety features are described by the selling dealer in conjunction with the delivery of a new motor vehicle.\n(b) A motor vehicle broker shall not:\n(1) engage in the business of selling new or used motor vehicles as described in subdivisions 2 and 3;\n(2) execute contracts or official documents for the sale or lease of a new motor vehicle;\n(3) describe a new vehicle's warranties or safety features in conjunction with the delivery of a new motor vehicle;\n(4) display motor vehicles available for sale or lease; or\n(5) perform any dealer preparation of new motor vehicles.\nAll dealer preparation shall be performed only by a licensed new motor vehicle dealer.\n(c) This subdivision does not apply to licensed motor vehicle lessors and shall not be construed to restrict licensed motor vehicle lessors from brokering motor vehicle leases or otherwise engaging in the leasing of motor vehicles in accordance with subdivisions 1 and 4.\n(a) Salespeople and other employees of licensed dealers under this section are not required to obtain individual licenses.\n(b) Isolated or occasional sales or leases of new or used motor vehicles are exempt from this section. A person who makes only isolated or occasional sales or leases is not required to be licensed under this section, is not considered to be in the business of selling or leasing motor vehicles, and does not qualify to receive dealer plates under subdivision 16. \"Isolated or occasional sales or leases\" means: (1) the sale or lease of a motor vehicle with an actual cash value of $1,000 or less made by a charitable organization; (2) the sale, purchase, or lease of not more than five motor vehicles in a 12-month period, other than pioneer or classic motor vehicles as defined in section 168.10, subdivisions 1a and 1b, or (3) sales by a licensed auctioneer selling motor vehicles at an auction if, in the ordinary course of the auctioneer's business, the sale of motor vehicles is incidental to the sale of other real or personal property. For purposes of this subdivision, charitable organization means a nonprofit charitable organization that qualifies for tax exemption under section 501(c)(3) of the Internal Revenue Code.\n(c) A person whose sales of new and used motor vehicles consist solely of sales to political subdivisions and their agencies of vehicles used solely as firefighting equipment is not required to obtain a license under this section. The person may apply for and receive in-transit plates under subdivision 17 in the same manner as licensed motor vehicle dealers for the purpose of allowing firefighting equipment to be transported from the dealer's source of supply or other place of storage to the dealer's place of business, to another place of storage, or directly to the purchaser.\nAll license applications under this section and all license renewals must be made to the registrar of motor vehicles and duly verified by oath. The applicant shall submit such information as the registrar may require to administer this section in a manner and format prescribed by the registrar.\n(a) All licensees under this section shall have an established place of business which shall include as a minimum:\n(1) For a new motor vehicle dealer, the following:\n(i) a commercial building owned or under lease by the licensee. The lease must be for a minimum term of one year. The building must contain office space where the books, records, and files necessary to conduct the business are kept and maintained with personnel available during normal business hours. Dealership business hours must be conspicuously posted on the place of doing business and readily viewable by the public;\n(ii) a bona fide contract or franchise (A) in effect with a manufacturer or distributor of the new motor vehicles the dealer proposes to sell, broker, wholesale, or auction, or (B) in effect with the first-stage manufacturer or distributor of new motor vehicles purchased from a van converter or modifier which the dealer proposes to sell, broker, wholesale, or auction, or (C) in effect with the final-stage manufacturer of the new type A, B, or C motor homes which the dealer proposes to sell, broker, wholesale, or auction;\n(iii) a facility for the repair and servicing of motor vehicles and the storage of parts and accessories, not to exceed ten miles distance from the principal place of business. The service may be provided through contract with bona fide operators actually engaged in the services;\n(iv) an area either indoors or outdoors to display motor vehicles that is owned or under lease by the licensee; and\n(v) a sign readily viewable by the public that clearly identifies the dealership by name.\n(2) For a used motor vehicle dealer, the following:\n(i) a commercial building owned or under lease by the licensee. The lease must be for a minimum term of one year. The building must contain office space where the books, records, and files necessary to conduct the business are kept and maintained with personnel available during normal business hours or automatic telephone answering service during normal business hours. Dealership business hours must be conspicuously posted on the place of doing business and readily viewable by the public;\n(ii) an area either indoors or outdoors to display motor vehicles which is owned or under lease by the licensee; and\n(iii) a sign readily viewable by the public that clearly identifies the dealership by name.\n(3) For a motor vehicle lessor, the following: a commercial office space where the books, records, and files necessary to conduct the business are kept and maintained with personnel available during normal business hours or an automatic telephone answering service during normal business hours. Business hours must be conspicuously posted on the place of doing business and readily viewable by the public. The office space must be owned or under lease for a minimum term of one year by the licensee.\n(4) For a motor vehicle wholesaler, the following: a commercial office space where the books, records, and files necessary to conduct the business are kept and maintained with personnel available during normal business hours or an automatic telephone answering service during normal business hours. The office space must be owned or under lease for a minimum term of one year by the licensee.\n(5) For a motor vehicle auctioneer, the following: a permanent enclosed commercial building, within or without the state, on a permanent foundation, owned or under lease by the licensee. The lease must be for a minimum term of one year. The building must contain office space where the books, records, and files necessary to conduct the business are kept and maintained with personnel available during normal business hours or an automatic telephone answering service during normal business hours.\n(6) For a motor vehicle broker, the following: a commercial office space where books, records, and files necessary to conduct business are kept and maintained with personnel available during normal business hours, or an automatic telephone answering service available during normal business hours. A sign, clearly identifying the motor vehicle broker by name and listing the broker's business hours, must be posted in a location and manner readily viewable by a member of the public visiting the office space. The office space must be owned or under lease for a minimum term of one year by the licensee.\n(7) For a limited used vehicle license holder, the following: a commercial office space where books, records, and files necessary to conduct nonprofit charitable activities are kept and maintained with personnel available during normal business hours, or an automatic telephonic answering service available during normal business hours. The office space must be owned or under lease for a minimum term of one year by the licensee.\n(b) If a new or used motor vehicle dealer maintains more than one place of doing business in a county, the separate places must be listed on the application. If additional places of business are maintained outside of one county, separate licenses must be obtained for each county.\n(c) If a motor vehicle lessor, wholesaler, auctioneer, or motor vehicle broker maintains more than one permanent place of doing business, either in one or more counties, the separate places must be listed in the application, but only one license is required. If a lessor proposes to sell previously leased or rented vehicles or if a broker proposes to establish an office at a location outside the seven-county metropolitan area, as defined in section 473.121, subdivision 2, other than cities of the first class, the lessor or broker must obtain a license for each nonmetropolitan area county in which the lessor's sales are to take place or where the broker proposes to locate an office.\n(d) If a motor vehicle dealer, lessor, wholesaler, or motor vehicle broker does not have direct access to a public road or street, any privately owned roadway providing access to a public road or street must be clearly identified and adequately maintained.\n(e) A new or used motor vehicle dealer may establish a temporary place of business outside the county where it maintains its licensed location to sell horse trailers exclusively without obtaining an additional license.\n(f) A new or used motor vehicle dealer may establish a temporary place of business outside the county where it maintains its licensed location to sell recreational vehicles exclusively without obtaining an additional license if:\n(1) the dealer establishes a temporary place of business for the sale of recreational vehicles not more than four times during any calendar year;\n(2) each temporary place of business other than an official county fair or the Minnesota State Fair within the seven-county metropolitan area, as defined in section 473.121, subdivision 2, is established jointly with at least four other recreational vehicle dealers;\n(3) each temporary place of business other than an official county fair outside the seven-county metropolitan area, as defined in section 473.121, subdivision 2, is established jointly with at least one other recreational vehicle dealer;\n(4) each establishment of a temporary place of business for the sale of recreational vehicles is for no more than 12 consecutive days; and\n(5) the dealer notifies the registrar of motor vehicles of each temporary place of business for the sale of recreational vehicles.\n(a) Application for a dealer's license or notification of a change of location of the place of business on a dealer's license must include a street address, not a post office box, and is subject to the commissioner's approval.\n(b) Upon the filing of an application for a dealer's license and the proper fee, unless the application on its face appears to be invalid, the commissioner shall grant a 90-day temporary license. During the 90-day period following issuance of the temporary license, the commissioner shall inspect the place of business site and insure compliance with this section and rules adopted under this section.\n(c) The commissioner may extend the temporary license 30 days to allow the temporarily licensed dealer to come into full compliance with this section and rules adopted under this section.\n(d) In no more than 180 days following issuance of the temporary license, the dealer license must either be granted or denied.\n(e) A license must be denied under the following conditions:\n(1) if within the previous ten years the applicant was enjoined due to a violation of section 325F.69 or convicted of violating section 325E.14, 325E.15, 325E.16, or 325F.69, or convicted under section 609.53 of receiving or selling stolen vehicles, or convicted of violating United States Code, title 49, sections 32701 to 32711 or pleaded guilty, entered a plea of nolo contendere or no contest, or has been found guilty in a court of competent jurisdiction of any charge of failure to pay state or federal income or sales taxes or felony charge of forgery, embezzlement, obtaining money under false pretenses, theft by swindle, extortion, conspiracy to defraud, or bribery; or\n(2) if the applicant has had a dealer license revoked within the previous ten years.\n(f) A license may be denied if a dealer is not in compliance with location requirements under subdivision 10 or has intentionally misrepresented any information on the dealer license application that would be grounds for suspension or revocation under subdivision 12.\n(g) If the application is approved, the commissioner shall license the applicant as a dealer for one year from the date the temporary license is granted and issue a certificate of license that must include a distinguishing number of identification of the dealer. The license must be displayed in a prominent place in the dealer's licensed place of business.\n(h) Each initial application for a license must be accompanied by a fee of $100 in addition to the annual fee. The annual fee is $150. The initial fees and annual fees must be paid into the state treasury and credited to the general fund except that $50 of each initial and annual fee must be paid into the driver and vehicle services operating account under section 299A.705.\n(a) A license may be suspended or revoked by the registrar of motor vehicles upon proof satisfactory to the registrar of any of the following:\n(1) violations of any of the provisions of this chapter or chapter 168A, 297B, 325E, or 325F;\n(2) violation of or refusal to comply with the requests and order of the registrar;\n(3) failure to make or provide to the registrar all listings, notices, and reports required by the registrar;\n(4) failure to pay to the registrar all taxes, fees, and arrears due from and by such dealer;\n(5) failure to duly apply for renewal of license provided for in this section;\n(6) revocation of previous license, of which the records of the registrar relating to the revocation are prima facie evidence of the previous revocation;\n(7) failure of continued occupancy of an established place of business;\n(8) sale of a new and unused current model motor vehicle other than the make of motor vehicle described in the franchise or contract filed with the original application or renewal thereof, without permission from the registrar;\n(9) sale of a new and unused current model motor vehicle to anyone except for consumer use, or to a dealer duly licensed to sell the same make of motor vehicle;\n(10) material misstatement or misrepresentation in application for license or renewal;\n(11) having advertised, printed, displayed, published, distributed, broadcast, or televised or caused or permitted to be advertised, printed, displayed, published, distributed, broadcast, or televised in any manner whatsoever, or having made orally any statement or representation with regard to the sale, lease, or financing of motor vehicles that is false, deceptive, or misleading;\n(12) having been convicted of violating section 325F.69, or having been enjoined due to a violation of section 325F.69;\n(13) having been convicted of violating the Minnesota Odometer Law, section 325E.14, 325E.15, or 325E.16, or the federal odometer law, United States Code, title 49, sections 32701 to 32711;\n(14) having been convicted of violating the sale of motor vehicles on Sunday law, section 168.275;\n(15) having been convicted under section 609.53 of receiving or selling stolen vehicles; or\n(16) having pleaded guilty, entered a plea of nolo contendere or no contest, or having been found guilty in a court of competent jurisdiction of any charge of failure to pay state or federal income or sales taxes or felony charge of forgery, embezzlement, obtaining money under false pretenses, theft by swindle, extortion, conspiracy to defraud, or bribery.\n(b) With respect to paragraph (a), clauses (12), (13), (15), and (16), the registrar may suspend or revoke a license immediately upon receiving certification of conviction or permanent injunction. A hearing is required under subdivision 13 within 30 days following a summary suspension or revocation under this paragraph, if a hearing is requested by the licensee.\n(a) A license may be canceled by the registrar after notice to the dealer, upon satisfactory proof that the dealer (1) has failed to provide or maintain the required surety bond, (2) has failed to provide or maintain the insurance required under chapter 65B, or (3) is no longer operating at the dealer's licensed location.\n(b) Surety companies and insurers providing required coverages shall promptly notify the registrar upon canceling any surety bond or required insurance. The registrar shall notify the dealer of the reason or reasons for cancellation before the cancellation occurs.\n(a) The registrar of motor vehicles, upon the registrar's own motion or upon the complaint of another, shall prepare and cause to be served upon the licensee complained of, a written notice or complaint setting forth, in substance, the violations charged, a statement of the deficiencies which exist and any corrective action deemed appropriate. The notice must include a statement that in the event corrective action is deemed appropriate and corrective action is not taken, the dealer's license may be suspended or revoked. The notice must require the licensee to appear at the time and place fixed in the notice before the registrar, and show cause why the license should not be suspended or revoked.\n(b) The registrar shall, at the time and place fixed in the notice, proceed to hear and determine the matter on its merits. All hearings must be conducted according to chapter 14, except that the provisions of section 14.50, do not apply. The registrar may subpoena witnesses and administer oaths. If the registrar finds the existence of any of the causes for suspension or revocation as set forth in subdivision 12 and determines that corrective action has not been taken or that corrective action will not prevent repetition of the violations charged or that the public interest will not be served by corrective action and the licensee's license should be suspended or revoked, the registrar shall issue a written order setting out the decision. A copy of the order must be served upon the licensee in the manner provided by law for the service of summons in a civil action. On finding that the dealer has violated any of the provisions of this section but that the nature of the violation or the circumstances are such that a suspension of the license would be adequate, the registrar may, instead of revoking the license suspend it for a period not exceeding 90 days. On finding that the violation does not justify a suspension only, the registrar shall revoke the license. Upon a suspension or revocation of the license of a new or used motor vehicle dealer, the licensee shall immediately return to the registrar all number plates, including any \"in-transit\" plates and temporary permits, in its possession and its dealer's license certificate.\nAny party or person aggrieved by an order of suspension, revocation or imposition of a penalty may seek judicial review according to chapter 14.\nThe registrar shall enforce this section and may appoint at least seven of the registrar's employees as inspectors and investigators. The inspectors and investigators have full authority to enforce this section throughout the state. The registrar, the registrar's inspectors or investigators, when traveling or otherwise pursuing their duties outside the office of the registrar, shall be paid for their actual expenses incurred out of the same funds as other employees of the registrar of motor vehicles. The inspectors shall assist licensees in compliance with laws governing licensees.\n(a) The registrar shall issue to every motor vehicle dealer, upon a request from the motor vehicle dealer licensed as provided in subdivision 2 or 3, one or more plates displaying a general distinguishing number. This subdivision does not apply to a scrap metal processor, a used vehicle parts dealer, or a vehicle salvage pool. The fee for each of the first four plates is $75 per registration year, of which $60 must be paid to the registrar and the remaining $15 is payable as sales tax on motor vehicles under section 297B.035. For each additional plate, the dealer shall pay the registrar a fee of $25 and a sales tax on motor vehicles of $15 per registration year. The registrar shall deposit the tax in the state treasury to be credited as provided in section 297B.09. Replacement plates are subject to the fees in section 168.12. Motor vehicles, new or used, owned by the motor vehicle dealership and bearing the number plate, except vehicles leased to the user who is not an employee of the dealer during the term of the lease, held for hire, or used by the dealer as a tow truck, service truck, or parts vehicle, may be driven upon the streets and highways of this state:\n(1) by the motor vehicle dealer or dealer's spouse, or any full-time employee of the motor vehicle dealer for either private or business purposes;\n(2) by a part-time employee when the use is directly related to a particular business transaction of the dealer;\n(3) for demonstration purposes by any prospective buyer for a period of 48 hours or in the case of a truck, truck-tractor, or semitrailer, for a period of seven days; or\n(4) in a promotional event that lasts no longer than four days in which at least three motor vehicles are involved.\n(b) A new or used motor vehicle sold by the motor vehicle dealer and bearing the motor vehicle dealer's number plate may be driven upon the public streets and highways for a period of 72 hours by the buyer for either of the following purposes: (1) removing the vehicle from this state for registration in another state, or (2) permitting the buyer to use the motor vehicle before the buyer receives number plates pursuant to registration. Use of a motor vehicle by the buyer under clause (2) before the buyer receives number plates pursuant to registration constitutes a use of the public streets or highways for the purpose of the time requirements for registration of motor vehicles.\nEvery licensed dealer in motor vehicles may make application upon a blank provided by the registrar for that purpose for dealer in-transit license plates for use upon all new or used motor vehicles being transported from the dealer's source of supply, or other place of storage, to the dealer's place of business, or to another place of storage, or from one dealer to another. The registrar shall then issue to the dealer the number of plates as the dealer may request, upon the payment by the dealer to the registrar of the sum of $5 per plate per registration year. The registrar may issue in-transit plates, upon the payment of the sum of $5 to the registrar, to dealers duly licensed in other states or provinces upon information furnished in the manner as the registrar may prescribe, and which satisfies the registrar that persons or companies applying for the plates are duly licensed dealers under the laws of the states or provinces.\nThe registrar may issue subpoenas requiring the attendance of witnesses before the registrar, production of books, papers, and other documents, articles, or instruments, and compel the disclosure by witnesses of all facts known to them relative to the matter under investigation, and may administer oaths and to take testimony. All parties disobeying the orders of subpoenas of the registrar are guilty of contempt, as in proceedings in district courts of the state and may be punished in like manner.\nAny person, copartnership, or corporation, domestic or foreign, and any officer, or director, or employee of a corporation, domestic or foreign, who violates this section is guilty of a misdemeanor.\n(a) The commissioner in the name of the state or a county attorney in the name of a county may institute a civil action in district court for an injunction prohibiting a violation of, and for civil penalties not to exceed $1,000 for each violation of, subdivision 2, 3, 3a, 4, 5a, 6, 7, or 7a, or section 168A.1501, 168A.153, or 325E.21. Filing fees for bringing an action under this section are waived.\n(b) Upon a finding that a preponderance of evidence demonstrates that the defendant has violated subdivision 2, 3, 3a, 4, 5a, 6, 7, or 7a, or section 168A.1501, 168A.153, or 325E.21, the court may enjoin future violations and may award civil penalties as authorized by this subdivision. It is not a defense to an action that the plaintiff may have adequate remedies at law or that the plaintiff has not shown irreparable harm. Service of process must be as in any other civil suit, except that where a defendant in the action is a natural person or firm residing outside the state, or is a foreign corporation, service of process may also be made by personal service outside the state; in the manner provided by section 5.25; or as the court may direct. Process is valid if it satisfies the requirements of due process of law, whether or not the defendant is doing business in Minnesota regularly or habitually.\n(c) In determining the civil penalty amount and whether to order injunctive relief under paragraph (b), the court shall consider:\n(1) the number of current violations;\n(2) the gravity of the current violations, including but not limited to the harm caused by the violations;\n(3) the culpability of the defendant as established by evidence of intent, willfulness, or negligence;\n(4) the economic benefit, if any, gained by the person allowing or committing the current violations;\n(5) the history of past violations, including the similarity of previous violations and the current violation, the time elapsed since previous violations, the number of previous violations, and the response of the person to previous violations; and\n(6) any other factors as justice may require.\n(d) If a court grants injunctive relief under paragraph (b), the court shall consider the factors in paragraph (c) in determining the requirements to include in an injunction. A court issuing an injunction under this section shall have the discretion to fashion an injunction that is reasonably intended to prevent a violator from committing future violations. Such authority shall include, but is not limited to, issuing an order for a period of 12 months which:\n(1) requires a defendant to wait up to 15 days before scrapping, dismantling, selling, or otherwise disposing of any vehicle that the defendant has acquired without first having received proof of ownership in compliance with section 168A.1501, subdivision 7, 8, or 9; or\n(2) prohibits a defendant from acquiring, scrapping, dismantling, selling, or otherwise disposing of any vehicle without first having received proof of ownership in compliance with section 168A.1501, subdivision 7, 8, or 9.\n(e) A court issuing an injunction under this section shall not require the posting of any bond or other security.\n(f) In an action brought under this section by a county attorney, all civil penalties collected under this section shall be deposited into the general fund of the county. In an action brought under this section by the attorney general or the commissioner, all civil penalties collected shall be deposited into the general fund of the state.\n(g) Nothing in this subdivision limits the rights or remedies which are otherwise available to a person under common law or other statutes of this state.\n(a) This section does not apply:\n(1) to any person, copartnership, or corporation engaged in the business of selling vehicles designed to operate exclusively over snow, motor scooters, motorized wheelchairs, utility trailers, farm wagons, farm trailers, or farm tractors or other farm implements, whether self-propelled or not and even though a vehicle listed in this clause may be equipped with a trailer hitch; or\n(2) to any person licensed as a real estate broker or salesperson pursuant to chapter 82, who engages in the business of selling, who offers to sell, or who solicits or advertises the sale of manufactured homes affixed to land.\n(b) However, this section does apply to a person, copartnership, or corporation described in paragraph (a) who is also engaged in the business of selling other motor vehicles or manufactured homes within the provisions of this section.\n(c) As used in this subdivision, \"utility trailer\" means a motorless vehicle, other than a boat trailer or snowmobile trailer, equipped with one or two wheels, having a gross vehicle weight of 4,000 pounds or less, and used for carrying property on its own structure while being drawn by a motor vehicle.\nMS 1980 [Repealed, 1981 c 59 s 20]\nAny person, copartnership, or corporation having a permanent enclosed commercial building or structure either owned in fee or leased and engaged in the business, either exclusively or in addition to any other occupation, of selling motorized bicycles, boat trailers, horse trailers, or snowmobile trailers, may apply to the registrar for a dealer's license. Upon payment of a $10 fee the registrar shall license the applicant as a dealer for the remainder of the calendar year in which the application was received. The license may be renewed on or before the second day of January of each succeeding year by payment of a fee of $10. The registrar shall issue to each dealer, upon request of the dealer, dealer plates as provided in subdivision 16 upon payment of $5 for each plate, and the plates may be used in the same manner and for the same purposes as is provided in subdivision 16. Except for motorized bicycle dealers, the registrar shall also issue to the dealer, upon request of the dealer, \"in-transit\" plates as provided in subdivision 17 upon payment of a fee of $5 for each plate. This subdivision does not abrogate any of the provisions of this section relating to the duties, responsibilities, and requirements of persons, copartnerships, or corporations engaged in the business, either exclusively or in addition to other occupations, of selling motor vehicles or manufactured homes, except that a seller of boat trailers, utility trailers, or snowmobile trailers who is licensed under this subdivision is not required to have a contract or franchise with a manufacturer or distributor of new boat trailers, utility trailers, or new snowmobile trailers the seller proposes to sell, broker, wholesale, or auction. This section does not require a manufacturer of snowmobile trailers whose manufacturing facility is located outside of the metropolitan area as defined in section 473.121 to have a dealer's license to transport the snowmobile trailers to dealers or retail outlets in the state.\nThe city or county attorney may file charges against any person who violates any of the provisions of this section or section 168A.1501 or 325E.21, including but not limited to, the grounds for suspension or revocation set out in subdivision 12.\n(a) Except as otherwise provided in this subdivision, all persons licensed according to this section shall keep in full force and effect a bond with a corporate surety to be approved by the registrar of motor vehicles in the following amounts; in the case of boat trailer, snowmobile trailer, horse trailer or motorized bicycle dealers, or dealers in trailers with a manufacturer's rated carrying capacity under 15,000 pounds designed to transport small construction or farm equipment, in the amount of $5,000; and as to all other persons in the amount of $50,000. The bond must be conditioned on the faithful performance by the licensee of the obligations imposed on persons engaged in motor vehicle transactions by the laws of this state, including the conduct required of a licensee by this section and other sections governing the sale or transfer of motor vehicles, and the payment of all taxes, license fees, and penalties. The bond must be for the benefit of the state of Minnesota and any transferor, seller, or purchaser of a motor vehicle for any monetary loss caused by failure of the licensee to meet the obligations enumerated above. Proceedings on the forfeiture of the bonds must be commenced in the district court of the county wherein the business of the licensed person was carried on, or if in more than one county, the county in which the offense occurred. This subdivision does not apply to a used vehicle parts dealer or a scrap metal processor.\n(b) This subdivision does not apply to:\n(1) a dealer in new trailers designed to transport small construction or farm equipment in any year following a year in which the dealer had less than $500,000 in gross receipts from the sale of such trailers; or\n(2) a dealer in new trailers designed to transport small construction or farm equipment who has been a dealer in such trailers for less than one year and who the department reasonably determines will have gross receipts of less than $500,000 during the first year of business.\nSubdivision 24 establishes a uniform statewide system of bonding motor vehicle dealers. This subdivision supersedes and preempts all bonding requirements imposed by any local government unit.\nAll advertising by a motor vehicle dealer must disclose that the vehicle is being offered for sale by a dealer through use of the dealership name, the term \"dealer,\" or the abbreviation \"DLR.\" Unless the dealer's true name or properly filed commercial assumed name as provided in chapter 333, is included, a classified advertisement in a print medium must also include the dealer's license number.\nThe registrar may adopt rules under chapter 14 to govern the issuance and regulation of dealer licenses and dealer plates.\nThe commissioner may distribute registration plates and stickers to be held and issued by new and used motor vehicle dealers. A dealer may issue registration plates and stickers only in conjunction with the sale of a vehicle by the dealer. A dealer permitted to hold and issue registration plates and stickers must be equipped with electronic transmission technology and trained in its use. Before receiving registration plates and stickers under this subdivision, a dealer must adopt and implement security and record-keeping requirements satisfactory to the commissioner. The commissioner may revoke the authority granted under this subdivision for any violation of law or rule governing the issuance of registration plates and stickers, any violation of the dealer's security and record-keeping plan, or any other action that in the commissioner's opinion adversely affects the registration system. The dealer is financially responsible for the cost and tax value of any unaccounted inventory.\nAt the time a dealer delivers a new flexible fuel vehicle, the dealer must provide written notice to the consumer that the vehicle is capable of using alternative fuels, including E85 fuel.\nA new motor vehicle dealer, used motor vehicle dealer, or motor vehicle lessor may not sell or lease a motor vehicle at retail for registration in Minnesota that does not meet the glazing material requirements under section 169.71, subdivision 4.\n(a) A motor vehicle dealer may not charge a documentary fee or document administration fee in excess of the amounts provided under paragraph (b) for services actually rendered to, for, or on behalf of the retail buyer or lessee to prepare, handle, and process documents for the closing of a motor vehicle retail sale or lease of a vehicle being registered in the state of Minnesota. The fee must be separately stated on the sales agreement maintained under Minnesota Rules, part 7400.5200, and may be excluded from the dealer's advertised price.\n(b) For motor vehicle sales or leases made on or after July 1, 2023, through June 30, 2024, the maximum fee is the lesser of $200 or an amount equal to ten percent of the value of the sale or lease. For motor vehicle sales or leases made on or after July 1, 2024, through June 30, 2025, the maximum fee is the lesser of $275 or an amount equal to ten percent of the value of the sale or lease. For motor vehicle sales or leases made on or after July 1, 2025, the maximum fee is the lesser of $350 or an amount equal to ten percent of the value of the sale or lease.\n(c) \"Documentary fee\" and \"document administration fee\" do not include an optional electronic transfer fee as defined under section 53C.01, subdivision 14.\nIf a single legal entity holds more than one new or used vehicle dealer license, new and used vehicles owned by the entity may be held and offered for sale at any of the licensed dealership locations without assigning vehicle ownership or title from one licensee to another. This subdivision does not authorize the sale or offering for sale of new vehicles by a licensee that is not authorized by the manufacturer to sell that make of new vehicles.\nThe registrar must designate by name and provide contact information for one or more registrar employees as needed to (1) promptly and effectively respond to questions from licensed dealers, and (2) troubleshoot dealer issues related to vehicle titling and registration.",
	"repealed": false
}