{
	"id": "268B.21",
	"url": "https://www.revisor.mn.gov/statutes/cite/268B.21",
	"title": "268B.21 RECORDS; AUDITS.",
	"text": "(a) Each employer must keep true and accurate records on individuals performing services for the employer, containing the information the commissioner may require under this chapter. The records must be kept for a period of not less than four years in addition to the current calendar year.\n(b) For the purpose of administering this chapter, the commissioner has the power to audit, examine, or cause to be supplied or copied, any books, correspondence, papers, records, or memoranda that are the property of, or in the possession of, an employer or any other person at any reasonable time and as often as may be necessary. Subpoenas may be issued under section 268B.22 as necessary for an audit.\n(c) An employer or other person that refuses to allow an audit of its records by the department or that fails to make all necessary records available for audit in the state upon request of the commissioner may be assessed an administrative penalty of $500. The penalty collected is credited to the family and medical benefit insurance account.\n(d) An employer, or other person, that fails to provide a weekly breakdown of money earned by an applicant upon request of the commissioner, information necessary for the detection of applicant misrepresentation under section 268B.185, subdivision 2, may be assessed an administrative penalty of $100. Any notice requesting a weekly breakdown must clearly state that a $100 penalty may be assessed for failure to provide the information. The penalty collected is credited to the family and medical benefit insurance account.\n(a) The commissioner may make summaries, compilations, duplications, or reproductions of any records pertaining to this chapter that the commissioner considers advisable for the preservation of the information.\n(b) Regardless of any law to the contrary, the commissioner may destroy any records that are no longer necessary for the administration of this chapter. In addition, the commissioner may destroy any record from which the information has been electronically captured and stored.",
	"repealed": false
}