{
	"id": "243.23",
	"url": "https://www.revisor.mn.gov/statutes/cite/243.23",
	"title": "243.23 COMPENSATION PAID TO INMATES.",
	"text": "Notwithstanding any law to the contrary, the commissioner of corrections may provide for the payment to inmates of correctional facilities under the commissioner's management and control any pecuniary compensation the commissioner deems proper, the amount of compensation to depend upon the quality and character of the work performed as determined by the commissioner of corrections and the chief executive officer. Inmates who because of illness or physical disability cannot work may be paid a minimal amount per day as determined by the commissioner. These earnings shall be paid out of the fund provided for the carrying on of the work in which the inmate is engaged when employed on state account, or from the current expense fund of the facility as the commissioner of corrections determines.\nThe commissioner may promulgate rules requiring the inmates of adult correctional facilities under the commissioner's control to pay all or a part of the cost of their board, room, clothing, medical, dental and other correctional services. These costs are payable from any earnings of the inmate, including earnings from private industry established at state correctional facilities pursuant to section 243.88. All sums of money received pursuant to the payments made for correctional services as authorized in this subdivision are available for use by the commissioner during the current and subsequent fiscal year, and are appropriated to the commissioner of corrections for the purposes of the fund from which the earnings were paid.\nNotwithstanding sections 241.26, subdivision 5, and 243.24, subdivision 1, the commissioner may make deductions from funds earned under subdivision 1, or other funds in an inmate account, and section 243.88, subdivision 2. The commissioner shall make deductions for the following expenses in the following order of priority:\n(1) federal and state taxes;\n(2) repayment of advances;\n(3) gate money as provided in section 243.24;\n(4) support of families and dependent relatives of the respective inmates;\n(5) payment of court-ordered restitution;\n(6) room and board or other costs of confinement;\n(7) medical expenses incurred under section 243.212;\n(8) payment of fees and costs in a civil action commenced by an inmate;\n(9) payment of fines, surcharges, or other fees assessed or ordered by a court;\n(10) contribution to the Crime Victims Reparations Board created under section 611A.55, provided that the contribution shall not be more than 20 percent of an inmate's gross wages;\n(11) the payment of restitution to the commissioner ordered by prison disciplinary hearing officers for damage to property caused by an inmate's conduct;\n(12) restitution to staff ordered by a prison disciplinary hearing officer for damage to property caused by an inmate's conduct;\n(13) restitution to another inmate ordered by a prison disciplinary hearing officer for personal injury to another caused by an inmate's conduct; and\n(14) discharge of any legal obligations arising out of litigation under this subdivision.\nThe commissioner may authorize the payment of court-ordered restitution from an inmate's wages when the restitution was ordered by the court as a sanction for the conviction of an offense which is not the offense of commitment, including offenses which occurred prior to the offense for which the inmate was committed to the commissioner. An inmate of an adult correctional facility under the control of the commissioner is subject to actions for the enforcement of support obligations and reimbursement of any public assistance rendered the dependent family and relatives. The commissioner may conditionally release an inmate who is a party to an action under this subdivision and provide for the inmate's detention in a local detention facility convenient to the place of the hearing when the inmate is not engaged in preparation and defense.",
	"repealed": false
}