{
	"id": "473H.16",
	"url": "https://www.revisor.mn.gov/statutes/cite/473H.16",
	"title": "473H.16 CONSERVATION.",
	"text": "Land within an agricultural preserve shall be farmed and otherwise managed according to sound soil and water conservation management practices. Management practices which are not sound shall be any use of the land resulting in wind or water erosion in excess of the soil loss tolerance for each soil type as found in the United States Natural Resources Conservation Service, Minnesota Technical Guide.\nThe authority shall be responsible for enforcing this section. Upon receipt of a written complaint stating the conditions or land management practices which are believed to be in violation of this section, the authority shall consult with the county soil and water conservation district. The district shall determine the average soil loss in tons per acre per year for each field cited in the complaint according to the universal soil loss equation and the wind erosion equation, and shall return to the authority a report showing the average soil loss in tons per acre per year for each field and a list of alternative practices that the landowner can use to reduce the soil loss to the limit allowed in subdivision 1. After consultation, and if in the judgment of the authority the land is not being managed properly as required by this section, the authority shall adopt a resolution to this effect and shall seek corrective measures from the owner. At the request of the landowner, the district shall assist in the planning, design and application of the practices selected to reduce the soil loss to an acceptable level and shall give such landowners a high priority for providing technical and cost share assistance.\nAny owner who fails to implement corrective measures to the satisfaction of the authority within one year of notice from the authority shall be subject to a civil penalty of not more than $1,000. The authority may recover the penalty by a civil action in a court of competent jurisdiction.\nCosts incurred by the authority in the enforcement of this section may be charged to the property owner. Charges not timely paid may be placed on the tax rolls and collected as a special assessment against the property.",
	"repealed": false
}