{
	"id": "469.033",
	"url": "https://www.revisor.mn.gov/statutes/cite/469.033",
	"title": "469.033 PUBLIC REDEVELOPMENT COST; PROCEEDS; FINANCING.",
	"text": "The entire cost of a project as defined in section 469.002, subdivision 12, including administrative expense of the authority allocable to the project and debt charges and all other costs authorized to be incurred by the authority in sections 469.001 to 469.047, shall be known as the public redevelopment cost. The proceeds from the sale or lease of property in a project shall be known as the capital proceeds. The capital proceeds from land sold may pay back only a portion of the public redevelopment cost. An authority may finance the projects in any one or by any combination of the following methods.\nThe authority may accept grants or other financial assistance from the federal government as provided in sections 469.001 to 469.047. Before it uses other financial methods authorized by this section, the authority shall use all federal funds for which the project qualifies.\nAn authority may issue its bonds or other obligations as provided in sections 469.001 to 469.047.\nThe authority may provide that all revenues received from its redevelopment areas be placed in a pool for the payment of interest and principal on all bonds issued for any redevelopment project, and the revenue from all such areas shall be paid into the pool until all outstanding bonds have been fully paid.\nIf the authority issues bonds to finance a redevelopment project, it may, with the consent of the governing body obtained at the time of the approval of the redevelopment plan as required in section 469.028, notify the county treasurer to set aside in a special fund, for the retirement of the bonds and interest on them, all or part of the real estate tax revenues derived from the real property in the redevelopment area which is in excess of the tax revenue derived therefrom in the tax year immediately preceding the acquisition of the property by the authority. The county treasurer shall do so. This setting aside of funds shall continue until the bonds have been retired. This subdivision applies only to property that the governing body has by resolution designated for inclusion in a project prior to August 1, 1979.\nAll of the territory included within the area of operation of any authority shall constitute a taxing district for the purpose of levying and collecting special benefit taxes as provided in this subdivision. All of the taxable property, both real and personal, within that taxing district shall be deemed to be benefited by projects to the extent of the special taxes levied under this subdivision. Subject to the consent by resolution of the governing body of the city in and for which it was created, an authority may levy a tax upon all taxable property within that taxing district. The tax shall be extended, spread, and included with and as a part of the general taxes for state, county, and municipal purposes by the county auditor, to be collected and enforced therewith, together with the penalty, interest, and costs. As the tax, including any penalties, interest, and costs, is collected by the county treasurer it shall be accumulated and kept in a separate fund to be known as the \"housing and redevelopment project fund.\" The money in the fund shall be turned over to the authority at the same time and in the same manner that the tax collections for the city are turned over to the city, and shall be expended only for the purposes of sections 469.001 to 469.047. It shall be paid out upon vouchers signed by the chair of the authority or an authorized representative. The amount of the levy shall be an amount approved by the governing body of the city, but shall not exceed 0.0185 percent of estimated market value. The authority shall each year formulate and file a budget in accordance with the budget procedure of the city in the same manner as required of executive departments of the city or, if no budgets are required to be filed, by August 1. The amount of the tax levy for the following year shall be based on that budget. The requirements of section 275.067 apply to a housing and redevelopment authority that has not previously certified a levy.\nThe authority may transfer to the city in and for which it was created all property, assets, cash or other funds held or used by the authority. Upon any such transfer, an authority shall not thereafter levy the tax or exercise the redevelopment powers of sections 469.001 to 469.047. All cash or other funds transferred to the city shall be used exclusively for permanent improvements in the city or the retirement of debts or bonds incurred for permanent improvements in the city. An authority which transfers its property, assets, cash, or other funds shall be dissolved as provided in this subdivision. After a public hearing after ten days' published notice thereof in a newspaper of general circulation in the city, the governing body of a city in and for which an authority has been created may dissolve the authority if the authority has not entered into any contract with the federal government or any agency or instrumentality thereof for a loan or a grant with respect to any urban redevelopment or low-rent public housing project that remains in effect. The resolution or ordinance dissolving the authority shall be published in the same manner in which ordinances are published in the city and the authority shall be dissolved when the resolution or ordinance becomes finally effective. The clerk of the governing body of the municipality shall furnish to the commissioner of employment and economic development a certified copy of the resolution or ordinance of the governing body dissolving the authority. All property, records, assets, cash, or other funds held or used by an authority shall be transferred to and become the property of the municipality and cash or other funds shall be used as herein provided. Upon dissolution of an authority, all rights of an authority against any person, firm, or corporation shall accrue to and be enforced by the municipality.",
	"repealed": false
}