{
	"id": "245I.10",
	"url": "https://www.revisor.mn.gov/statutes/cite/245I.10",
	"title": "245I.10 ASSESSMENT AND TREATMENT PLANNING.",
	"text": "(a) \"Diagnostic formulation\" means a written analysis and explanation of a client's clinical assessment to develop a hypothesis about the cause and nature of a client's presenting problems and to identify the most suitable approach for treating the client.\n(b) \"Responsivity factors\" means the factors other than the diagnostic formulation that may modify a client's treatment needs. This includes a client's learning style, abilities, cognitive functioning, cultural background, and personal circumstances. When documenting a client's responsivity factors a mental health professional or clinical trainee must include an analysis of how a client's strengths are reflected in the license holder's plan to deliver services to the client.\n(a) A license holder must use a client's diagnostic assessment or crisis assessment to determine a client's eligibility for mental health services, except as provided in this section.\n(b) Prior to completing a client's initial diagnostic assessment, a license holder may provide a client with the following services:\n(1) an explanation of findings;\n(2) neuropsychological testing, neuropsychological assessment, and psychological testing;\n(3) any combination of psychotherapy sessions, family psychotherapy sessions, and family psychoeducation sessions not to exceed three sessions;\n(4) crisis assessment services according to section 256B.0624; and\n(5) ten days of intensive residential treatment services according to the assessment and treatment planning standards in section 245I.23, subdivision 7.\n(c) Based on the client's needs that a crisis assessment identifies under section 256B.0624, a license holder may provide a client with the following services:\n(1) crisis intervention and stabilization services under section 245I.23 or 256B.0624; and\n(2) any combination of psychotherapy sessions, group psychotherapy sessions, family psychotherapy sessions, and family psychoeducation sessions not to exceed ten sessions within a 12-month period without prior authorization.\n(d) Based on the client's needs in the client's brief diagnostic assessment, a license holder may provide a client with any combination of psychotherapy sessions, group psychotherapy sessions, family psychotherapy sessions, and family psychoeducation sessions not to exceed ten sessions within a 12-month period without prior authorization for any new client or for an existing client who the license holder projects will need fewer than ten sessions during the next 12 months.\n(e) Based on the client's needs that a hospital's medical history and presentation examination identifies, a license holder may provide a client with:\n(1) any combination of psychotherapy sessions, group psychotherapy sessions, family psychotherapy sessions, and family psychoeducation sessions not to exceed ten sessions within a 12-month period without prior authorization for any new client or for an existing client who the license holder projects will need fewer than ten sessions during the next 12 months; and\n(2) up to five days of day treatment services or partial hospitalization.\n(f) A license holder must complete a new standard diagnostic assessment of a client or an update to an assessment as permitted under paragraph (g):\n(1) when the client requires services of a greater number or intensity than the services that paragraphs (b) to (e) describe;\n(2) if the client needs additional mental health services and the client does not meet the criteria for a brief assessment;\n(3) when the client's mental health condition has changed markedly since the client's most recent diagnostic assessment;\n(4) when the client's current mental health condition does not meet the criteria of the client's current diagnosis; or\n(5) upon the client's request.\n(g) For a client who is already engaged in services and has a prior assessment, the license holder must complete a written update containing all significant new or changed information about the client, removal of outdated or inaccurate information, and an update regarding what information has not significantly changed, including a discussion with the client about changes in the client's life situation, functioning, presenting problems, and progress with achieving treatment goals since the client's last diagnostic assessment was completed.\nMS 2022 [Expired, 2021 c 30 art 15 s 11]\nA client's diagnostic assessment must: (1) identify at least one mental health diagnosis for which the client meets the diagnostic criteria and recommend mental health services to develop the client's mental health services and treatment plan; or (2) include a finding that the client does not meet the criteria for a mental health disorder.\n(a) Only a mental health professional or clinical trainee may complete a brief diagnostic assessment of a client.\n(b) When conducting a brief diagnostic assessment of a client, the assessor must complete a face-to-face interview with the client and a written evaluation of the client. The assessor must gather and document initial components of the client's standard diagnostic assessment, including the client's:\n(1) age;\n(2) description of symptoms, including the reason for the client's referral;\n(3) history of mental health treatment;\n(4) cultural influences on the client; and\n(5) mental status examination.\n(c) Based on the initial components of the assessment, the assessor must develop a provisional diagnostic formulation about the client. The assessor may use the client's provisional diagnostic formulation to address the client's immediate needs and presenting problems.\n(d) A mental health professional or clinical trainee may use treatment sessions with the client authorized by a brief diagnostic assessment to gather additional information about the client to complete the client's standard diagnostic assessment if the number of sessions will exceed the coverage limits in subdivision 2.\n(a) Only a mental health professional or a clinical trainee may complete a standard diagnostic assessment of a client. A standard diagnostic assessment of a client must include a face-to-face interview with a client and a written evaluation of the client. The assessor must complete a client's standard diagnostic assessment within the client's cultural context. An alcohol and drug counselor may gather and document the information in paragraphs (b) and (c) when completing a comprehensive assessment according to section 245G.05.\n(b) When completing a standard diagnostic assessment of a client, the assessor must gather and document information about the client's current life situation, including the following information:\n(1) the client's age;\n(2) the client's current living situation, including the client's housing status and household members;\n(3) the status of the client's basic needs;\n(4) the client's education level and employment status;\n(5) the client's current medications;\n(6) any immediate risks to the client's health and safety, including withdrawal symptoms, medical conditions, and behavioral and emotional symptoms;\n(7) the client's perceptions of the client's condition;\n(8) the client's description of the client's symptoms, including the reason for the client's referral;\n(9) the client's history of mental health and substance use disorder treatment;\n(10) cultural influences on the client; and\n(11) substance use history, if applicable, including:\n(i) amounts and types of substances, frequency and duration, route of administration, periods of abstinence, and circumstances of relapse; and\n(ii) the impact to functioning when under the influence of substances, including legal interventions.\n(c) If the assessor cannot obtain the information that this paragraph requires without retraumatizing the client or harming the client's willingness to engage in treatment, the assessor must identify which topics will require further assessment during the course of the client's treatment. The assessor must gather and document information related to the following topics:\n(1) the client's relationship with the client's family and other significant personal relationships, including the client's evaluation of the quality of each relationship;\n(2) the client's strengths and resources, including the extent and quality of the client's social networks;\n(3) important developmental incidents in the client's life;\n(4) maltreatment, trauma, potential brain injuries, and abuse that the client has suffered;\n(5) the client's history of or exposure to alcohol and drug usage and treatment; and\n(6) the client's health history and the client's family health history, including the client's physical, chemical, and mental health history.\n(d) When completing a standard diagnostic assessment of a client, an assessor must use a recognized diagnostic framework.\n(1) When completing a standard diagnostic assessment of a client who is five years of age or younger, the assessor must use the current edition of the DC: 0-5 Diagnostic Classification of Mental Health and Development Disorders of Infancy and Early Childhood published by Zero to Three.\n(2) When completing a standard diagnostic assessment of a client who is six years of age or older, the assessor must use the current edition of the Diagnostic and Statistical Manual of Mental Disorders published by the American Psychiatric Association.\n(3) When completing a standard diagnostic assessment of a client who is 18 years of age or older, an assessor must use either (i) the CAGE-AID Questionnaire or (ii) the criteria in the most recent edition of the Diagnostic and Statistical Manual of Mental Disorders published by the American Psychiatric Association to screen and assess the client for a substance use disorder.\n(e) When completing a standard diagnostic assessment of a client, the assessor must include and document the following components of the assessment:\n(1) the client's mental status examination;\n(2) the client's baseline measurements; symptoms; behavior; skills; abilities; resources; vulnerabilities; safety needs, including client information that supports the assessor's findings after applying a recognized diagnostic framework from paragraph (d); and any differential diagnosis of the client; and\n(3) an explanation of: (i) how the assessor diagnosed the client using the information from the client's interview, assessment, psychological testing, and collateral information about the client; (ii) the client's needs; (iii) the client's risk factors; (iv) the client's strengths; and (v) the client's responsivity factors.\n(f) When completing a standard diagnostic assessment of a client, the assessor must consult the client and the client's family about which services that the client and the family prefer to treat the client. The assessor must make referrals for the client as to services required by law.\n(g) Information from other providers and prior assessments may be used to complete the diagnostic assessment if the source of the information is documented in the diagnostic assessment.\nA license holder must follow each client's written individual treatment plan when providing services to the client with the following exceptions:\n(1) services that do not require that a license holder completes a standard diagnostic assessment of a client before providing services to the client;\n(2) when developing a treatment or service plan; and\n(3) when a client re-engages in services under subdivision 8, paragraph (b).\n(a) After completing a client's diagnostic assessment or reviewing a client's diagnostic assessment received from a different provider and before providing services to the client beyond those permitted under subdivision 7, the license holder must complete the client's individual treatment plan. The license holder must:\n(1) base the client's individual treatment plan on the client's diagnostic assessment and baseline measurements;\n(2) for a child client, use a child-centered, family-driven, and culturally appropriate planning process that allows the child's parents and guardians to observe and participate in the child's individual and family treatment services, assessments, and treatment planning;\n(3) for an adult client, use a person-centered, culturally appropriate planning process that allows the client's family and other natural supports to observe and participate in the client's treatment services, assessments, and treatment planning;\n(4) identify the client's treatment goals, measureable treatment objectives, a schedule for accomplishing the client's treatment goals and objectives, a treatment strategy, and the individuals responsible for providing treatment services and supports to the client. The license holder must have a treatment strategy to engage the client in treatment if the client:\n(i) has a history of not engaging in treatment; and\n(ii) is ordered by a court to participate in treatment services or to take neuroleptic medications;\n(5) identify the participants involved in the client's treatment planning. The client must be a participant in the client's treatment planning. If applicable, the license holder must document the reasons that the license holder did not involve the client's family or other natural supports in the client's treatment planning;\n(6) review the client's individual treatment plan every 180 days and update the client's individual treatment plan with the client's treatment progress, new treatment objectives and goals or, if the client has not made treatment progress, changes in the license holder's approach to treatment; and\n(7) ensure that the client approves of the client's individual treatment plan unless a court orders the client's treatment plan under chapter 253B.\n(b) If the client disagrees with the client's treatment plan, the license holder must document in the client file the reasons why the client does not agree with the treatment plan. If the license holder cannot obtain the client's approval of the treatment plan, a mental health professional must make efforts to obtain approval from a person who is authorized to consent on the client's behalf within 30 days after the client's previous individual treatment plan expired. A license holder may not deny a client service during this time period solely because the license holder could not obtain the client's approval of the client's individual treatment plan. A license holder may continue to bill for the client's otherwise eligible services when the client re-engages in services.\n(a) When a license holder is completing a functional assessment for an adult client, the license holder must:\n(1) complete a functional assessment of the client after completing the client's diagnostic assessment;\n(2) use a collaborative process that allows the client and the client's family and other natural supports, the client's referral sources, and the client's providers to provide information about how the client's symptoms of mental illness impact the client's functioning;\n(3) if applicable, document the reasons that the license holder did not contact the client's family and other natural supports;\n(4) assess and document how the client's symptoms of mental illness impact the client's functioning in the following areas:\n(i) the client's mental health symptoms;\n(ii) the client's mental health service needs;\n(iii) the client's substance use;\n(iv) the client's vocational and educational functioning;\n(v) the client's social functioning, including the use of leisure time;\n(vi) the client's interpersonal functioning, including relationships with the client's family and other natural supports;\n(vii) the client's ability to provide self-care and live independently;\n(viii) the client's medical and dental health;\n(ix) the client's financial assistance needs; and\n(x) the client's housing and transportation needs;\n(5) complete the client's functional assessment before the client's initial individual treatment plan unless a service specifies otherwise; and\n(6) update the client's functional assessment with the client's current functioning whenever there is a significant change in the client's functioning or at least every 365 days, unless a service specifies otherwise.\n(b) A license holder may use any available, validated measurement tool, including but not limited to the Daily Living Activities-20, when completing the required elements of a functional assessment under this subdivision.",
	"repealed": false
}