{
	"id": "84.793",
	"url": "https://www.revisor.mn.gov/statutes/cite/84.793",
	"title": "84.793 YOUTHFUL OPERATORS; PROHIBITIONS.",
	"text": "(a) A person six years or older but less than 16 years of age operating an off-highway motorcycle on public lands or waters must possess a valid off-highway motorcycle safety certificate issued by the commissioner.\n(b) Except for operation on public road rights-of-way that is permitted under section 84.795, subdivision 1, a driver's license issued by the state or another state is required to operate an off-highway motorcycle along or on a public road right-of-way.\n(c) A person under 12 years of age may not:\n(1) make a direct crossing of a public road right-of-way;\n(2) operate an off-highway motorcycle on a public road right-of-way in the state; or\n(3) operate an off-highway motorcycle on public lands or waters unless accompanied by a person 18 years of age or older or participating in an event for which the commissioner has issued a special use permit.\n(d) Except for public road rights-of-way of interstate highways, a person less than 16 years of age may make a direct crossing of a public road right-of-way of a trunk, county state-aid, or county highway only if that person is accompanied by a person 18 years of age or older who holds a valid driver's license.\n(e) A person less than 16 years of age may operate an off-highway motorcycle on public road rights-of-way in accordance with section 84.795, subdivision 1, paragraph (a), only if that person is accompanied by a person 18 years of age or older who holds a valid driver's license.\n(f) Notwithstanding paragraph (a), a nonresident less than 16 years of age may operate an off-highway motorcycle on public lands or waters if the nonresident youth has in possession evidence of completing an off-road safety course offered by the Motorcycle Safety Foundation or another state as provided in section 84.791, subdivision 4.\nA person less than 18 years of age may not operate an off-highway motorcycle on public land, public waters, or on a public road right-of-way unless wearing a safety helmet approved by the commissioner of public safety.\nAn owner of an off-highway motorcycle may not knowingly allow it to be operated contrary to this section.\nA person may not operate an off-highway motorcycle without an eye-protective device.",
	"repealed": false
}