{
	"id": "514.971",
	"url": "https://www.revisor.mn.gov/statutes/cite/514.971",
	"title": "514.971 DEFINITIONS.",
	"text": "For the purposes of sections 514.970 to 514.979, the terms defined in this section have the meanings given them.\n(a) \"Self-service storage facility\" or \"storage facility\" means real property designed and used for the purpose of renting or leasing individual storage space to occupants who are to have access for the purpose of storing and removing personal property. The term does not include:\n(1) property of a financial institution that contains vaults, safe deposit boxes, or other receptacles for the uses, purposes, and benefits of the financial institution's customers;\n(2) a warehouse that issues a warehouse receipt, bill of lading, or other document of title for the property; or\n(3) a commercial parking garage or parking lot that provides short-term motor vehicle parking.\n(b) An occupant must not use a self-service storage facility for residential purposes.\n\"Owner\" means one or more persons, jointly or severally, who are either the owner, operator, lessor, or sublessor of a self-service storage facility, or an agent, or any other person authorized by the owner to manage the facility or to receive rent from an occupant under a rental agreement entered into with the occupant.\n\"Occupant\" means a person who rents storage space at a self-service storage facility under a rental agreement entered into with the owner.\n\"Rental agreement\" means a written agreement that is entered into by the owner and the occupant and that establishes or modifies the terms and conditions of the occupant's use of storage space at a self-service storage facility.\n\"Personal property\" means money and every inanimate tangible thing that is the subject of ownership. The term does not include anything forming part of a parcel of real estate and agricultural commodities.\n\"Default\" means failure of the occupant to pay the rent and other charges becoming due under the rental agreement within 15 days after the rents and other charges become due under the terms of the rental agreement.\n\"Storage space\" means the storage space or spaces at the storage facility that are rented to an occupant pursuant to a rental agreement.\n\"Security deposit\" means any deposit of money with the owner used to secure performance under the rental agreement.\n\"Verified mail\" means any method of mailing that is offered by the United States Postal Service or private delivery service that provides evidence of mailing.",
	"repealed": false
}