{
	"id": "181A.13",
	"url": "https://www.revisor.mn.gov/statutes/cite/181A.13",
	"title": "181A.13 COMPENSATION FOR INTERNET CONTENT CREATION.",
	"text": "(a) Except as otherwise provided in this section, a minor is considered engaged in the work of content creation when the following criteria are met at any time during the previous 12-month period:\n(1) at least 30 percent of the content creator's compensated video content produced within a 30-day period included the likeness, name, or photograph of any minor. Content percentage is measured by the percentage of time the likeness, name, or photograph of a minor or if more than one minor regularly appears in the creator's content, any of the minors, visually appears or is the subject of an oral narrative in a video segment as compared to the total length of the segment; and\n(2) the number of views received per video segment on any online platform met the online platform's threshold for generating compensation or the content creator received actual compensation for video content equal to or greater than $0.01 per view.\n(b) A minor under the age of 14 is prohibited from engaging in the work of content creation as provided in paragraph (a). If a minor under the age of 14 is featured by a content creator, the minor shall receive 100 percent of the proceeds of the creator's compensation for the content they have appeared in, less any amount owed to another minor.\n(c) A minor who is under the age of 18 and over the age of 13 may produce, create, and publish their own content and is entitled to all compensation for their own content creation. A minor engaged in the work of content creation as the producer, creator, and publisher of content must also follow the requirements in paragraph (b).\n(d) A minor who appears incidentally in a video that depicts a public event that a reasonable person would know to be broadcast, including a concert, competition, or sporting event, and is published by a content creator is not considered a violation of this section.\n(a) All video content creators whose content features a minor engaged in the work of content creation shall maintain the following records and retain the records until the minor reaches the age of 21:\n(1) the name and documentary proof of the age of the minor engaged in the work of content creation;\n(2) the amount of content creation that generated compensation as described in subdivision 1 during the reporting period;\n(3) the total number of minutes of content creation for which the content creator received compensation during the reporting period;\n(4) the total number of minutes a minor was featured in content creation during the reporting period;\n(5) the total compensation generated from content creation featuring a minor during the reporting period; and\n(6) the amount deposited into the trust account for the benefit of the minor engaged in the work of content creation as required by subdivision 3.\n(b) The records required by this subdivision must be readily accessible to the minor for review. The content creator shall provide notice to the minor of the existence of the records.\n(a) A minor who is engaged in the work of content creation consistent with this section must be compensated by the content creator. The content creator must set aside gross earnings on the video content that includes the likeness, name, or photograph of the minor in a trust account to be preserved for the benefit of the minor until the minor reaches the age of majority, according to the following distribution:\n(1) if only one minor meets the content threshold described in subdivision 1, the percentage of total gross earnings on any video segment, including the likeness, name, or photograph of the minor that is equal to or greater than half of the content percentage that includes the minor as described in subdivision 1; or\n(2) if more than one minor meets the content threshold described in subdivision 1 and a video segment includes more than one of those minors, the percentage described in clause (1) for all minors in any segment must be equally divided between the minors regardless of differences in percentage of content provided by the individual minors.\n(b) A trust account required under this section must, at a minimum, provide that:\n(1) the money in the account is available only to the minor engaged in the work of content creation;\n(2) the account is held by a bank, corporate fiduciary, or trust company, as those terms are defined in chapter 48A;\n(3) the money in the account becomes available to the minor engaged in the work of content creation upon the minor attaining the age of 18 years or upon a declaration that the minor is emancipated; and\n(4) that the account meets the requirements of chapter 527, the Uniform Transfers to Minors Act.\n(c) If a content creator knowingly or recklessly violates this section, a minor satisfying the criteria described in subdivision 1 may commence a civil action to enforce the provisions of this section regarding the trust account. In any action brought in accordance with this section, the court may award the following damages:\n(1) actual damages including any compensation owed under this section;\n(2) punitive damages; and\n(3) the costs of the action, including attorney fees and litigation costs.\n(d) This section does not affect a right or remedy available under any other law of the state.\n(e) Nothing in this section shall be interpreted to have any effect on a party that is neither the content creator nor the minor who engaged in the work of content creation.\n(a) Along with the civil action provided in subdivision 3, paragraph (c), the minor may commence a civil action against the content creator for damages, injunctive relief, and any other relief the court finds just and equitable to enforce this section.\n(b) The attorney general may enforce subdivision 1, pursuant to section 8.31, and may recover costs and fees.\nContent containing the likeness of a child must be deleted and removed from any online platform by the individual who posted the content, the account owner, or another person who has control over the account when the request is made by a minor age 13 or older whose likeness appears in the content, or by an adult who was under the age of 18 when their likeness was used in the content.\nA minor age 14 or over compensated under this section is exempt from the minimum age provisions of section 181A.04, subdivision 1.",
	"repealed": false
}