{
	"id": "103D.401",
	"url": "https://www.revisor.mn.gov/statutes/cite/103D.401",
	"title": "103D.401 WATERSHED MANAGEMENT PLAN.",
	"text": "(a) The managers must adopt and maintain a watershed management plan to exercise the powers of a watershed district and fulfill the purposes for which a watershed district may be established. The watershed management plan must give a narrative description of existing water and water-related problems within the watershed district, possible solutions to the problems, and the general objectives of the watershed district. The watershed management plan must also conform closely with watershed management plan guidelines as adopted and amended from time to time by the Board of Water and Soil Resources. The authority to adopt and maintain a watershed management plan under this section is retained notwithstanding a watershed district's participation in a comprehensive watershed management planning program under section 103B.801.\n(b) The watershed management plan may include a separate section on proposed projects.\nThe managers must send a copy of the proposed watershed management plan for a 60-day review and comment period to the county auditor of each county affected by the watershed district, the board, the director, the governing body of each municipality affected by the watershed district, and soil and water conservation districts affected by the watershed district. At least ten days before the public hearing, the watershed district must respond in writing to all comments by the reviewing parties.\nMS 2022 [Repealed by amendment, 2024 c 90 art 3 s 42]\n(a) The managers must give notice and hold a hearing on the proposed watershed management plan no later than 60 days after the close of the 60-day review and comment period.\n(b) The managers must give notice of the hearing by publication in a legal newspaper that is published in counties affected by the watershed district. The last publication must occur at least ten days before the hearing.\n(c) The managers must give notice of the hearing by mail to the auditors of counties and to the chief executive officials of municipalities affected by the watershed district.\n(d) The notice must include:\n(1) a statement that a copy of the proposed watershed management plan has been filed with the board, the auditors of counties affected by the proposed watershed district, the commissioner, the director, the governing body of each municipality affected by the watershed district, and the soil and water conservation districts affected by the watershed district;\n(2) a general description of the purpose of the watershed district;\n(3) a general description of the property included in the watershed district;\n(4) a general description of the proposed watershed management plan;\n(5) the date, time, and location of the hearing; and\n(6) a statement that all persons affected or interested in the watershed district may attend and give statements at the hearing.\n(a) After the watershed management plan hearing, the managers must submit the draft plan, any amendments to the draft plan, all written comments received on the draft plan, a record of the public hearing, and a summary of changes incorporated as a result of the review process to the board for final review. The board must review the plan for conformance with this chapter.\n(b) The board must not prescribe a plan but may disapprove all or parts of a plan that the board finds does not conform with this chapter. The board must complete its review within 90 days and, by order, approve, disapprove, or approve with conditions a watershed management plan for the watershed district.\n(c) A watershed district may seek reconsideration of a decision of the board concerning its plan or capital improvement program within 60 days of receiving the decision by filing an appeal to the board's dispute resolution committee established under section 103B.101, subdivision 10. The dispute resolution committee must complete its reconsideration and make a recommendation to the board, which must issue a final decision within 90 days of the appeal.\nWithin 120 days of the board's order, the managers must adopt a plan in compliance with the board's order. The managers must send a copy of the order and approved watershed management plan to the board, the county board of each county affected by the watershed district, the commissioner, the director, the governing body of each municipality affected by the watershed district, and soil and water conservation districts affected by the watershed district. The watershed management plan approved by the board and adopted by the managers is the watershed management plan for the watershed district.\n(a) To the extent and in the manner required by the adopted plan, all amendments to the adopted plan must be submitted to the towns, cities, counties, and state review agencies and to the board for review according to subdivisions 2 to 5, except when the proposed amendments are determined to be minor amendments according to the following requirements:\n(1) the board has either agreed that the amendments are minor or failed to act within five working days of the end of the comment period specified in clause (2), unless an extension is mutually agreed upon with the watershed district;\n(2) the watershed district has sent copies of the amendments to the plan review authorities for review and comment, allowing at least 30 days for receipt of comments; has indicated that the minor amendment procedure is being followed; and has directed that comments be sent to the watershed district and the board;\n(3) no county board has filed an objection to the amendments with the watershed district and the board within the comment period specified in clause (2), unless an extension is mutually agreed upon by the county and the watershed district; and\n(4) the watershed district has held a public meeting to explain the amendments and published a legal notice of the meeting twice, at least seven days and 14 days before the date of the meeting.\n(b) The following changes to a plan do not require an amendment, but must be distributed to agencies and local units of government receiving an adopted plan under subdivision 6:\n(1) formatting or reorganizing the plan;\n(2) revising a procedure meant to streamline administration of the plan;\n(3) clarifying existing plan goals or policies;\n(4) including additional data not requiring interpretation;\n(5) expanding a public process; or\n(6) adjusting how a watershed district carries out program activities within the district's discretion.",
	"repealed": false
}