{
	"id": "204B.10",
	"url": "https://www.revisor.mn.gov/statutes/cite/204B.10",
	"title": "204B.10 AFFIDAVITS OF CANDIDACY; NOMINATING PETITIONS; DUTIES.",
	"text": "The official with whom affidavits of candidacy are filed shall number them in the order received.\nOn the day a nominating petition is filed, the election official shall deliver or mail an acknowledgment of the petition to the individual who files it and to the candidate who is to be nominated. The election official shall also number the petitions in the order received. The petitions shall be retained as provided in section 204B.40, and shall be available for public inspection during that period.\nThe official with whom nominating petitions are filed shall inspect the petitions in the order filed to verify that there are a sufficient number of signatures of individuals whose residence address as shown on the petition is in the district where the candidate is to be nominated.\nThe secretary of state shall certify to the county auditor of each county the names of all candidates nominated by petitions filed with the secretary of state. Certification shall be made at the same time as the secretary of state certifies the names of candidates who are nominated at the primary.\nIf the filing officer determines that use on the ballot of the candidate's name as written on the affidavit of candidacy would violate section 204B.35, subdivision 2, the filing officer shall immediately notify the candidate and shall certify for the ballot the candidate's true name instead of the name as written on the affidavit.\nUpon receipt of a certified copy of a final judgment or order of a court of competent jurisdiction that a person who has filed an affidavit of candidacy or who has been nominated by petition:\n(1) has been convicted of treason or a felony and the person's civil rights have not been restored;\n(2) is under guardianship in which the court order revokes the ward's right to vote; or\n(3) has been found by a court of law to be legally incompetent;\nthe filing officer shall notify the person by certified mail at the address shown on the affidavit or petition, and, for offices other than President of the United States, Vice President of the United States, United States Senator, and United States Representative in Congress, shall not certify the person's name to be placed on the ballot. The actions of a filing officer under this subdivision are subject to judicial review under section 204B.44.",
	"repealed": false
}