{
	"id": "298.223",
	"url": "https://www.revisor.mn.gov/statutes/cite/298.223",
	"title": "298.223 TACONITE AREA ENVIRONMENTAL PROTECTION FUND.",
	"text": "A fund called the taconite environmental protection fund is created for the purpose of reclaiming, restoring and enhancing those areas of northeast Minnesota located within the taconite assistance area defined in section 273.1341, that are adversely affected by the environmentally damaging operations involved in mining taconite and iron ore and producing iron ore concentrate and for the purpose of promoting the economic development of northeast Minnesota. The taconite environmental protection fund shall be used for the following purposes:\n(1) to initiate investigations into matters the commissioner of Iron Range resources and rehabilitation determines are in need of study and which will determine the environmental problems requiring remedial action;\n(2) reclamation, restoration, or reforestation of mine lands not otherwise provided for by state law;\n(3) local economic development projects and public works, including construction of sewer and water systems located within the taconite assistance area defined in section 273.1341;\n(4) monitoring of mineral industry related health problems among mining employees; and\n(5) local public works projects under section 298.227, paragraph (c).\nThe taconite area environmental protection fund shall be administered by the commissioner, who must consult with the advisory board before expending any funds.\nThere is annually appropriated to the commissioner of Iron Range resources and rehabilitation taconite area environmental protection funds necessary to carry out approved projects and programs and the funds necessary for administration of this section. Annual administrative costs, not including detailed engineering expenses for the projects, shall not exceed five percent of the amount annually expended from the fund.\nFunds for the purposes of this section are provided by section 298.28, subdivision 11, relating to the taconite area environmental protection fund.",
	"repealed": false
}