{
	"id": "38.36",
	"url": "https://www.revisor.mn.gov/statutes/cite/38.36",
	"title": "38.36 COUNTY EXTENSION COMMITTEE.",
	"text": "A county must have an extension committee. The committee must have nine members. Two members must be county commissioners appointed by the county board. The county auditor or the auditor's designee must be a member. If the county has no office of auditor, the county board shall appoint a member from the county administration. Six members must be appointed at large by the county board as provided in this section. The county board at its annual meeting shall appoint for a term of three years the number of members required to fill the memberships on that committee expiring at that time.\nIn cooperation with the director of extension, or the director's designee, the county extension committee, each year, in accordance with county budgetary deadlines, shall prepare a budget showing the total funds available and needed and shall recommend to the county board the amount of county funds necessary to maintain, support, and pay the expenses of county extension work during the following year. A copy of the budget must be presented to the county board.\nThe county board shall consider the recommended county share of money necessary to maintain, support, and pay the expenses of county extension work during the following year. For these purposes, the county board may appropriate money annually from its general revenue fund and may include the amount of the county's share in the annual levy of county taxes or may make a special levy for county extension purposes or both. The money set aside and appropriated by the county board for these purposes is the county extension fund. Money from the fund may be paid out by orders of the director of extension, or the director's designee, to pay a part of the compensation of the agents employed, to pay directly the compensation of county support employees, and to pay other expenses incident to county extension work. An order to pay money from the fund must not be issued until the expenditure has been audited and signed by the county auditor or other appropriate county official. A balance in the county extension fund at the end of a year must be carried over or reappropriated.",
	"repealed": false
}