{
	"id": "146A.09",
	"url": "https://www.revisor.mn.gov/statutes/cite/146A.09",
	"title": "146A.09 DISCIPLINARY ACTIONS.",
	"text": "When the commissioner finds that an unlicensed complementary and alternative health care practitioner has violated any provision of this chapter, the commissioner may take one or more of the following actions, only against the individual practitioner:\n(1) revoke the right to practice;\n(2) suspend the right to practice;\n(3) impose limitations or conditions on the practitioner's provision of complementary and alternative health care practices, impose rehabilitation requirements, or require practice under supervision;\n(4) impose a civil penalty not exceeding $10,000 for each separate violation, the amount of the civil penalty to be fixed so as to deprive the practitioner of any economic advantage gained by reason of the violation charged or to reimburse the office for all costs of the investigation and proceeding;\n(5) censure or reprimand the practitioner;\n(6) impose a fee on the practitioner to reimburse the office for all or part of the cost of the proceedings resulting in disciplinary action including, but not limited to, the amount paid by the office for services from the Office of Administrative Hearings, attorney fees, court reports, witnesses, reproduction of records, staff time, and expense incurred by the staff of the Office of Unlicensed Complementary and Alternative Health Care Practice; or\n(7) any other action justified by the case.\nIn all matters relating to the lawful activities of the office, the commissioner may issue subpoenas and compel the attendance of witnesses and the production of all necessary papers, books, records, documents, and other evidentiary material. Any person failing or refusing to appear or testify regarding any matter about which the person may be lawfully questioned or failing to produce any papers, books, records, documents, or other evidentiary materials in the matter to be heard, after having been required by order of the commissioner or by a subpoena of the commissioner to do so may, upon application to the district court in any district, be ordered to comply with the order or subpoena. The commissioner may administer oaths to witnesses or take their affirmation. Depositions may be taken within or without the state in the manner provided by law for the taking of depositions in civil actions. A subpoena or other process may be served upon a person it names anywhere within the state by any officer authorized to serve subpoenas or other process in civil actions in the same manner as prescribed by law for service of process issued out of the district court of this state.\nIf the commissioner proposes to take action against the practitioner as described in subdivision 1, the commissioner must first notify the practitioner against whom the action is proposed to be taken and provide the practitioner with an opportunity to request a hearing under the contested case provisions of chapter 14. If the practitioner does not request a hearing by notifying the commissioner within 30 days after service of the notice of the proposed action, the commissioner may proceed with the action without a hearing.\nThe commissioner may at the commissioner's discretion reinstate the right to practice and may impose any disciplinary measure listed under subdivision 1.\nIn addition to any other remedy provided by law, the commissioner may, acting through a person to whom the commissioner has delegated this authority and without a hearing, temporarily suspend the right of an unlicensed complementary and alternative health care practitioner to practice if the commissioner's delegate finds that the practitioner has violated a statute or rule that the commissioner is empowered to enforce and continued practice by the practitioner would create a serious risk of harm to others. The suspension is in effect upon service of a written order on the practitioner specifying the statute or rule violated. The order remains in effect until the commissioner issues a final order in the matter after a hearing or upon agreement between the commissioner and the practitioner. Service of the order is effective if the order is served on the practitioner or counsel of record personally or by first class mail. Within ten days of service of the order, the commissioner shall hold a hearing on the sole issue of whether there is a reasonable basis to continue, modify, or lift the suspension. Evidence presented by the office or practitioner shall be in affidavit form only. The practitioner or the counsel of record may appear for oral argument. Within five working days after the hearing, the commissioner shall issue the commissioner's order and, if the suspension is continued, schedule a contested case hearing within 45 days after issuance of the order. The administrative law judge shall issue a report within 30 days after closing of the contested case hearing record. The commissioner shall issue a final order within 30 days after receipt of that report.\nThe right of an unlicensed complementary and alternative health care practitioner to practice is automatically suspended if (1) a guardian of an unlicensed complementary and alternative health care practitioner is appointed by order of a court under sections 524.5-101 to 524.5-502, or (2) the practitioner is committed by order of a court pursuant to chapter 253B. The right to practice remains suspended until the practitioner is restored to capacity by a court and, upon petition by the practitioner, the suspension is terminated by the commissioner after a hearing or upon agreement between the commissioner and the practitioner.\nIf a practitioner investigated under this section is licensed or registered by the commissioner of health or a health-related licensing board, is subject to the jurisdiction of the commissioner under section 146A.01, subdivision 6, clause (1), item (ii), and the commissioner determines that the practitioner has violated any provision of this chapter, the commissioner, in addition to taking disciplinary action under this section:\n(1) may, if the practitioner is licensed or regulated in another capacity by the commissioner, take further disciplinary action against the practitioner in that capacity; or\n(2) shall, if the practitioner is licensed or registered in another capacity by a health-related licensing board, report the commissioner's findings under this section, and may make a nonbinding recommendation that the board take further action against the practitioner in that capacity.",
	"repealed": false
}