{
	"id": "325E.125",
	"url": "https://www.revisor.mn.gov/statutes/cite/325E.125",
	"title": "325E.125 GENERAL AND SPECIAL PURPOSE BATTERY REQUIREMENTS.",
	"text": "(a) The manufacturer of a button cell battery that is to be sold in this state shall ensure that each battery contains no intentionally introduced mercury or is labeled to clearly identify for the final consumer of the battery the type of electrode used in the battery.\n(b) The manufacturer of a rechargeable battery that is to be sold in this state shall ensure that each rechargeable battery is labeled to clearly identify for the final consumer of the battery the type of electrode and the name of the manufacturer. The manufacturer of a rechargeable battery shall also provide clear instructions for properly recharging the battery.\n(a) Except as provided in paragraph (c), a manufacturer may not sell, distribute, or offer for sale in this state an alkaline manganese battery that contains more than 0.025 percent mercury by weight.\n(b) On application, the commissioner of the Pollution Control Agency may exempt a specific type of battery from the requirements of paragraph (a) or (d) if there is no battery meeting the requirements that can be reasonably substituted for the battery for which the exemption is sought. A battery exempted by the commissioner under this paragraph is subject to the requirements of section 115A.9155, subdivision 2.\n(c) Notwithstanding paragraph (a), a manufacturer may not sell, distribute, or offer for sale in this state a button cell nonrechargeable battery not subject to paragraph (a) that contains more than 25 milligrams of mercury.\n(d) A manufacturer may not sell, distribute, or offer for sale in this state a dry cell battery containing a mercuric oxide electrode.\n(e) After January 1, 1996, a manufacturer may not sell, distribute, or offer for sale in this state an alkaline manganese battery, except an alkaline manganese button cell, that contains mercury unless the commissioner of the Pollution Control Agency determines that compliance with this requirement is not technically and commercially feasible.\nA manufacturer may not sell, distribute, or offer for sale in this state a nonrechargeable battery other than a zinc air, zinc carbon, silver oxide, lithium, or alkaline manganese battery, without first having received approval of the battery from the commissioner of the Pollution Control Agency. The commissioner shall approve only batteries that comply with subdivision 1 and do not pose an undue hazard when disposed of. This subdivision is intended to ensure that new types of batteries do not add additional hazardous or toxic materials to the state's mixed municipal waste stream.\n(a) A manufacturer may not sell, distribute, or offer for sale in this state a rechargeable consumer product unless:\n(1) the battery can be easily removed by the consumer or is contained in a battery pack that is separate from the product and can be easily removed; and\n(2) the product and the battery are both labeled in a manner that is clearly visible to the consumer indicating that the battery must be recycled or disposed of properly and the battery must be clearly identifiable as to the type of electrode used in the battery.\n(b) \"Rechargeable consumer product\" as used in this subdivision means any product that contains a rechargeable battery and is primarily used or purchased to be used for personal, family, or household purposes.\n(c) On application by a manufacturer, the commissioner of the Pollution Control Agency may exempt a rechargeable consumer product from the requirements of paragraph (a) if:\n(1) the product cannot be reasonably redesigned and manufactured to comply with the requirements prior to the effective date of Laws 1990, chapter 409, section 2;\n(2) the redesign of the product to comply with the requirements would result in significant danger to public health and safety; or\n(3) the type of electrode used in the battery poses no unreasonable hazards when placed in and processed or disposed of as part of mixed municipal solid waste.\n(d) An exemption granted by the commissioner of the Pollution Control Agency under paragraph (c), clause (1), must be limited to a maximum of two years and may be renewed.\n(a) A person who sells rechargeable batteries or products powered by rechargeable batteries governed by section 115A.9157 at retail shall post the notice in paragraph (b) in a manner clearly visible to a consumer making purchasing decisions.\n(b) The notice must be at least four inches by six inches and state:\n\"ATTENTION USERS OF RECHARGEABLE BATTERIES AND CORDLESS PRODUCTS:\nUnder Minnesota law, manufacturers of rechargeable batteries, rechargeable battery packs, and products powered by nonremovable rechargeable batteries will provide a special collection system for these items by April 15, 1994. It is illegal to put rechargeable batteries in the garbage. Use the special collection system that will be provided in your area. Take care of our environment.\nDO NOT PUT RECHARGEABLE BATTERIES OR PRODUCTS POWERED BY NONREMOVABLE RECHARGEABLE BATTERIES IN THE GARBAGE.\"\n(c) Notice is not required for home solicitation sales, as defined in section 325G.06, or for catalogue sales.\nA manufacturer of rechargeable batteries or products powered by rechargeable batteries that does not participate in the pilot projects and programs required in section 115A.9157 may not sell, distribute, or offer for sale in this state rechargeable batteries or products powered by rechargeable batteries after January 1, 1992.\nAfter January 1, 1992, a person who first purchases rechargeable batteries or products powered by rechargeable batteries for importation into the state for resale may not purchase rechargeable batteries or products powered by rechargeable batteries made by any person other than a manufacturer that participates in the projects and programs required under section 115A.9157.",
	"repealed": false
}