{
	"id": "270C.01",
	"url": "https://www.revisor.mn.gov/statutes/cite/270C.01",
	"title": "270C.01 DEFINITIONS.",
	"text": "For purposes of this chapter only, the following words, terms, and phrases have the meanings given them in this section unless the language or context clearly indicates that a different meaning is intended.\n\"Commissioner\" means the commissioner of revenue or a person to whom the commissioner has delegated functions.\n\"Department\" means the Department of Revenue.\n\"Electronic means\" and \"electronically\" mean a method that is electronic, as defined in section 325L.02, paragraph (e), and that is prescribed by the commissioner. Electronic means includes the use of a touch-tone telephone to transmit return information in a manner prescribed by the commissioner.\n\"Law administered by the commissioner\" means a law or rule that vests or imposes a power, duty, responsibility, or authority in the commissioner, except the following laws: (1) the property tax laws, and (2) chapter 16D.\n\"Person\" means an individual, trust, estate, fiduciary, partnership, company, corporation, limited liability company, association, governmental unit or agency, public or private organization of any kind, or other legal entity.\n\"Property tax laws\" means all laws and rules related to the administration of the tax on property referred to in section 272.01, subdivision 1, and all laws related to the administration of the tax on wind energy production imposed under section 272.029, subdivision 1.\n\"Return\" means a return, information return, or report, required by a law administered by the commissioner.\n\"State revenue laws\" means all laws administered by the commissioner and the property tax laws.\n\"Tax\" means a tax or fee imposed by a law administered by the commissioner.\n\"Taxpayer\" means a person subject to, or liable for, a tax or fee imposed by a law administered by the commissioner; a person required to file a return, information return, or report, with respect to, or to pay, or withhold or collect and remit, a tax or fee imposed by a law administered by the commissioner; a person required to obtain a license or a permit under a law administered by the commissioner; or a person required to keep records regarding a tax or fee imposed by a law administered by the commissioner.",
	"repealed": false
}