{
	"id": "72A.061",
	"url": "https://www.revisor.mn.gov/statutes/cite/72A.061",
	"title": "72A.061 MANDATORY FILINGS; FAILURE TO COMPLY; PENALTIES.",
	"text": "Any insurance company licensed to do business in this state, including fraternals, reciprocals and township mutuals, which neglects to file its annual statement in the form prescribed and within the time specified by law shall be subject to a penalty of $100 for each day in default. If, at the end of 45 days, the default has not been corrected, the company shall be given ten days in which to show cause to the commissioner why its license should not be suspended. If the company has not made the requisite showing within the ten-day period, the license and authority of the company may, at the discretion of the commissioner, be suspended during the time the company is in default.\nAny insurance company, including fraternals, reciprocals, and township mutuals, willfully making a false annual or other required statement shall pay a penalty to the state not to exceed $5,000. Either or both of the monetary penalties imposed by this subdivision may be recovered in a civil action brought by and in the name of the state.\nAny insurance company licensed to do business in this state, including fraternals and township mutuals, which neglects to file amended bylaws or related amendments within 30 days after date of approval shall be subject to a penalty of $25 for each day in default.\nAny insurance company licensed to do business in this state, including fraternals and township mutuals, which neglects to file amended articles of incorporation or related amendments within 30 days after date of approval shall be subject to a penalty of $25 for each day in default, provided that foreign insurers shall be allowed 60 days in which to file.\nIf after 90 days the filings required under this subdivision are still in default, the company shall be given ten days in which to show cause why its license should not be suspended.\nAny insurance company licensed to do business in this state, including fraternals, reciprocals, and township mutuals, which neglects to comply with any other mandatory filing in the form prescribed and within the time specified by law or as specified on the document shall be subject to a penalty of $25 for each day in default. If after 90 days a default has not been corrected, the company shall be given ten days in which to show cause why its license should not be suspended.\nAny company which writes new business in this state, including fraternals, reciprocals and township mutuals, while its license is suspended and after it has been notified by the commissioner by a notice mailed to the home office of the company that its license has been suspended shall pay to the state the sum of $25 for each contract of insurance entered into by it after being notified of its license suspension. The notification shall be mailed by registered letter and deemed to have been received by the company at its home office in the usual course of the mails.\nThe commissioner may grant an extension of any filing deadline or requirement specified by this section, on receiving, not less than ten days before the date of default, satisfactory evidence of imminent hardship to the company.\nAll penalties recovered pursuant to this section shall be paid into the general fund.",
	"repealed": false
}