{
	"id": "160.262",
	"url": "https://www.revisor.mn.gov/statutes/cite/160.262",
	"title": "160.262 BIKEWAYS.",
	"text": "(a) The legislature determines that it is in the interests of the public health, safety and welfare, to provide for the addition of bikeways to proposed and existing public highways. The commissioner of transportation is authorized to plan, design, establish, and maintain bikeways on the right-of-way of any trunk highway. The commissioner is responsible for the design and construction of all bikeway projects within the right-of-way of any trunk highway. The commissioner must consider the development of bikeways during the planning, design, construction, reconstruction, or improvement of any trunk highway, or allow the establishment of such bikeways within trunk highway right-of-way.\n(b) The commissioner must maintain bikeway design guidelines consistent with the state transportation goals in section 174.01.\n(c) The commissioner must compile and maintain a map of bikeways in the state and must publish and distribute the map's information at least once every two years in a form and manner suitable to assist persons wishing to use the bikeways.\n(d) The commissioner must maintain bikeways within the limits of trunk highway right-of-way unless a written agreement or limited use permit provides otherwise.\nMS 2016 [Repealed, 1Sp2017 c 3 art 3 s 144]\n(a) The departments and agencies on the active transportation advisory committee identified in section 174.375 must provide information and advice for the bikeway design guidelines maintained by the commissioner.\n(b) The commissioner must provide technical assistance to local units of government in:\n(1) local planning and development of bikeways;\n(2) establishing connections to state bicycle routes; and\n(3) implementing statewide bicycle plans maintained by the commissioner.\n(c) The commissioner may cooperate with and enter into agreements with the United States government, any department of the state of Minnesota, any unit of local government, any tribal government, or any public or private corporation in order to effect the purposes of this section.\nFor streets and highways, the commissioner must allow for the acceptance of performance-specification bids, made by the lowest responsible bidder, for constructing design-build bridges for bikeways and pedestrian facilities that are:\n(1) designed and used primarily for nonmotorized transportation, but may allow for motorized wheelchairs, golf carts, necessary maintenance vehicles and, when otherwise permitted by law, rule, or ordinance, snowmobiles; and\n(2) located apart from any road or highway or protected by barriers, provided that a design-built bridge may cross over and above a road or highway.\nAs an alternative to the procurement method described in subdivision 4, the commissioner may allow for the award of design-build contracts for the projects described in subdivision 4 to the vendor or contractor offering the best value under a request for proposals as described in section 16C.28, subdivision 1, paragraph (a), clause (2), and paragraph (c).",
	"repealed": false
}