{
	"id": "260D.09",
	"url": "https://www.revisor.mn.gov/statutes/cite/260D.09",
	"title": "260D.09 PERMANENCY REVIEW AFTER ADJUDICATION UNDER CHAPTER 260C.",
	"text": "(a) If a child has been ordered into foster care under section 260C.178 or 260C.201, subdivision 1, and the conditions that led to the court's order have been corrected so that the child could safely return home except for the child's need to continue in foster care for treatment due to the child's disability, the child's parent and the agency may enter into a voluntary foster care agreement under this chapter using the procedure set out in paragraph (b).\n(b) When the agency and the parent agree to enter into a voluntary foster care agreement under this chapter, the agency must file a motion to terminate jurisdiction under section 260C.193, subdivision 6, and to dismiss the order for foster care under section 260C.178 or 260C.201, subdivision 1, together with the petition required under section 260D.07, paragraph (b), for permanency review and the court's approval of the voluntary arrangement.\n(c) The court shall send the motion and the petition filed under subdivision 2 together with a notice of hearing by mail as required in section 260D.07, paragraph (e).\n(d) The petition and motion under this section must be filed no later than the time the agency is required to file a petition for permanent placement under section 260C.505 but may be filed as soon as the agency and the parent agree that the child should remain in foster care under a voluntary foster care agreement, because the child needs treatment and voluntary foster care is in the child's best interest.\n(e) In order for the agency to have continuous legal authority to place the child, the parent and the agency must execute a voluntary foster care agreement for the child's continuation in foster care for treatment prior to the termination of the order for foster care under section 260C.178 or 260C.201, subdivision 1. The parent and agency may execute the voluntary foster care agreement at or before the permanency review hearing required under this section. The voluntary foster care agreement shall not be effective until the court terminates jurisdiction under section 260C.193, subdivision 6, and dismisses the order for foster care under section 260C.178 or 260C.201, subdivision 1. Unless the agency and the parent execute a voluntary placement agreement for the child to continue in voluntary foster care for treatment, the agency shall not have legal authority to place the child after the court terminates jurisdiction under chapter 260C.",
	"repealed": false
}