{
	"id": "309.745",
	"url": "https://www.revisor.mn.gov/statutes/cite/309.745",
	"title": "309.745 APPROPRIATION FOR EXPENDITURE OR ACCUMULATION OF ENDOWMENT FUND; RULES OF CONSTRUCTION.",
	"text": "(a) Subject to the intent of a donor expressed in the gift instrument, an institution may appropriate for expenditure or accumulate so much of an endowment fund as the institution determines is prudent for the uses, benefits, purposes, and duration for which the endowment fund is established. Unless stated otherwise in the gift instrument, the assets in an endowment fund are donor-restricted assets until appropriated for expenditure by the institution. In making a determination to appropriate or accumulate, the institution shall act in good faith, with the care that an ordinarily prudent person in a like position would exercise under similar circumstances, and shall consider, if relevant, the following factors:\n(1) the duration and preservation of the endowment fund;\n(2) the purposes of the institution and the endowment fund;\n(3) general economic conditions;\n(4) the possible effect of inflation or deflation;\n(5) the expected total return from income and the appreciation of investments;\n(6) other resources of the institution; and\n(7) the investment policy of the institution.\n(b) To limit the authority to appropriate for expenditure or accumulate under paragraph (a), a gift instrument must specifically state the limitation.\n(c) Terms in a gift instrument designating a gift as an endowment, or a direction or authorization in the gift instrument to use only \"income,\" \"interest,\" \"dividends,\" or \"rents, issues, or profits,\" or \"to preserve the principal intact,\" or words of similar import:\n(1) create an endowment fund of permanent duration unless other language in the gift instrument limits the duration or purpose of the fund; and\n(2) do not otherwise limit the authority to appropriate for expenditure or accumulate under paragraph (a).",
	"repealed": false
}