{
	"id": "123A.67",
	"url": "https://www.revisor.mn.gov/statutes/cite/123A.67",
	"title": "123A.67 ALLOCATION OF ASSETS AND LIABILITIES; LEVY.",
	"text": "Title to all the property, real and personal, of any district dissolved under the provisions of sections 123A.64 to 123A.72 and all legally valid and enforceable claims and contract obligations, pass to the district to which such dissolved district is attached. If a district is divided by virtue of the proceedings, the commissioner shall issue a subsequent order providing for the division of the assets and liabilities according to such terms as the commissioner may deem just and equitable.\nAs of the effective date of the attachment, all the taxable property in the newly enlarged district is taxable for the payment of any bonded debt already incurred by any component district in the proportion which the net tax capacity of that part of a preexisting district which is included in the newly enlarged district bears to the net tax capacity of the entire preexisting district as of the time of the attachment. The county auditor shall make this apportionment and incorporate the apportionment as an annex to the order of the commissioner dividing the assets and liabilities of the component parts. This subdivision shall not relieve any property from any tax liability for payment of any bonded obligation but taxable property in the newly enlarged district becomes primarily liable for the payment of bonded debts to the extent of the proportion stated.\n(a) Liabilities of a dissolved district existing at the time of the attachment other than bonded debt within the purview of subdivision 2 must be obligations of the consolidated district after attachment (in the amount and kind determined by the commissioner according to subdivision 1, where a dissolved district is divided), for the payment of which the consolidated district has a right to reimbursement by special levy or levies. The amount of reimbursement will be equal to the liabilities of the dissolved district for which the consolidated district is obligated less the aggregate of the following which has been or will be received by the consolidated district at or after the time of attachment from or as a result of the dissolution and attachment of the dissolved district:\n(1) all taxes inuring to the consolidating district upon levies made by the dissolved district;\n(2) all cash, bank accounts, investments, and other current assets;\n(3) earned state aids of the dissolved districts;\n(4) returns from the sale of property of the dissolved district.\n(b) The amount of such special levy so computed shall be certified to the county auditor with the other tax requirements of the consolidated district but separately stated and identified. The auditor shall add the amount of special levy so certified to the school rate for the territory in the consolidated district which came from the dissolved district and include it in the levy on the taxable property in that territory. The county auditor shall not spread more of the amount certified for special levy in any year than will amount to 20 percent of the school levy without the special levy, leaving the remaining part of the certified amount for levy in successive years without further certification. Any amount of reimbursement to which it is entitled omitted by the consolidated district from its initial certification for special levy may be certified in a subsequent year for levy in the same manner as the levy upon initial certification.\nThe levy authorized by this subdivision shall be in addition to those otherwise authorized for a district.",
	"repealed": false
}