{
	"id": "14.3895",
	"url": "https://www.revisor.mn.gov/statutes/cite/14.3895",
	"title": "14.3895 PROCESS FOR REPEALING OBSOLETE RULES.",
	"text": "An agency may use this section to repeal rules identified in the agency's annual obsolete rules report under section 14.05, subdivision 5, unless a law specifically requires another process or unless 25 requests are received under subdivision 4. Sections 14.19, 14.20, 14.365, and 14.366 apply to rules repealed under this section.\nThe agency shall draft a notice plan under which the agency will make reasonable efforts to notify persons or classes of persons who may be significantly affected by the rule repeal by giving notice of its intention in newsletters, newspapers, or other publications, or through other means of communication. Before publishing the notice in the State Register and implementing the notice plan, the agency shall obtain prior approval of the notice plan by an administrative law judge in the Office of Administrative Hearings.\nThe agency shall publish notice of the proposed rule repeal in the State Register. The agency shall also mail the notice by United States mail or electronic mail to persons who have registered with the agency to receive mailed notices and to the chairs and ranking minority party members of the legislative policy and budget committees with jurisdiction over the subject matter of the proposed rule repeal. The agency shall also give notice according to the notice plan approved under subdivision 2. The mailed notice must include either a copy of the rule proposed for repeal or a description of the nature and effect of the proposed rule repeal and a statement that a free copy is available from the agency upon request. The notice must include a statement that, if 25 or more people submit a written request, the agency will have to meet the requirements of sections 14.131 to 14.20 for rules adopted after a hearing or the requirements of sections 14.22 to 14.28 for rules adopted without a hearing, including the preparation of a statement of need and reasonableness and the opportunity for a hearing. The agency shall allow 60 days after publication in the State Register for comment on the proposed rule repeal.\nIf 25 or more people submit a written request, the agency may repeal the rule only after complying with sections 14.131 to 14.20 or the requirements of sections 14.22 to 14.28. The requests must be in the manner specified in section 14.25.\nIf the final repeal is identical to the action originally published in the State Register, the agency shall publish a notice of repealers in the State Register. If the final action is different from the action originally published in the State Register, the agency shall publish a copy of the changes in the State Register. The agency shall also file a copy of the repealed rule with the governor. The repeal is effective after it has been subjected to all requirements described in this section or sections 14.131 to 14.20 or 14.22 to 14.28 and five working days after the notice of repeal is published in the State Register unless a later date is required by law or specified in the rule repeal proposal.\nBefore publication of the final rule in the State Register, the agency shall submit the rule to the administrative law judge in the Office of Administrative Hearings. The administrative law judge shall within 14 days approve or disapprove the rule as to its legality and its form to the extent the form relates to legality.",
	"repealed": false
}