{
	"id": "168.62",
	"url": "https://www.revisor.mn.gov/statutes/cite/168.62",
	"title": "168.62 INTERCITY BUS REGISTRATION.",
	"text": "An owner or operator of more than one intercity bus shall register a percentage of those intercity buses of the owner or operator in Minnesota. The percentage of the intercity buses so registered shall be determined by dividing the total number of miles traveled by such intercity buses within the state of Minnesota by the total number of miles traveled by such intercity buses both within and without the state of Minnesota. Such percentage figure so arrived at is the percentage of intercity motor buses which the owner or operator thereof shall register in Minnesota. A fractional intercity bus shall be registered as one intercity bus. The number of intercity buses so registered in the state of Minnesota are deemed to be domiciled in Minnesota and subject to motor vehicle taxation in this state.\nWhen the number of intercity buses to be registered in Minnesota is determined as herein provided, the owner or operator thereof shall select the particular intercity buses to be so registered. The motor vehicle tax to be paid thereon for each calendar year shall be determined by the registrar of motor vehicles, who shall compute the amount of motor vehicle tax on each intercity bus of the owner or operator thereof as though all of such intercity buses were required to be registered in Minnesota. The amount so arrived at shall then be divided by the total number of intercity buses of such owner or operator to obtain the average motor vehicle tax due on an intercity bus registered in Minnesota. Such average tax shall be paid on each intercity bus registered in Minnesota in the same manner and at the same time as other motor vehicles using the streets and highways of Minnesota are taxed and the taxes paid thereon. The registrar of motor vehicles shall issue number plates for the intercity buses registered in Minnesota.\nAt the same time that an owner or operator of intercity buses registers them in Minnesota and obtains number plates for the vehicle, the owner or operator shall apply for special identification plates or certificates for the remainder of that fleet of intercity buses. The registrar of motor vehicles shall design an appropriate plate or identification certificate for this purpose which must be issued upon the payment of a fee in the amount specified for special plates under section 168.12, subdivision 5, covering each intercity bus so identified. The proceeds of such fees shall be deposited to the credit of the driver and vehicle services operating account under section 299A.705, subdivision 1. No intercity bus shall at any time be operated in the state of Minnesota without either Minnesota number plates or special identification plates or certificates issued as herein provided.",
	"repealed": false
}