{
	"id": "135A.062",
	"url": "https://www.revisor.mn.gov/statutes/cite/135A.062",
	"title": "135A.062 CONSIDERATION OF CRIMINAL RECORDS LIMITED.",
	"text": "This section applies to postsecondary institutions under section 136A.155, clause (1), except that the Board of Regents of the University of Minnesota is requested to comply with this section.\nAs used in this section, \"a violent felony or sexual assault\" includes a felony-level violation or attempted violation of section 609.185; 609.19; 609.195; 609.20; 609.221; 609.2242, subdivision 4; 609.2247; 609.245, subdivision 1; 609.247, subdivision 2; 609.282; 609.322; 609.342; 609.343; 609.344; 609.345; 609.3451; 609.3458; 609.561, subdivision 1 or 2; 609.582, subdivision 1; 609.66, subdivision 1e; or 609.749; or a statute from another state, the United States, or a foreign jurisdiction, in conformity with any of these sections.\nA postsecondary institution may not inquire into, consider, or require disclosure of the criminal record or criminal history of an applicant for admission. After a postsecondary institution has made an offer of admission, the postsecondary institution may inquire into, consider, or require disclosure of a conviction or delinquency adjudication that occurred within the previous five years for a violent felony or sexual assault. The postsecondary institution must provide the applicant with an opportunity to submit an explanatory statement, letters of recommendation, evidence of rehabilitation, and any other supporting documents. The institution must provide clear and detailed instructions and guidance to applicants related to what criminal history requires disclosure. The institution must not require the applicant to provide official records of criminal history. A postsecondary institution that rescinds an offer of admission must:\n(1) provide an explanation of the basis for the decision to rescind the offer of admission; and\n(2) provide the applicant with an opportunity to appeal the decision to rescind.\nThis section shall not prohibit or limit a postsecondary institution from inquiring about student conduct records at the applicant's prior postsecondary institution after making an offer of admission. This section shall not prohibit or limit a postsecondary institution from inquiring about a student's ability to meet licensure requirements in a professional program after making an offer of admission.\n(a) A postsecondary institution that complies with this section is immune from liability in a civil action arising out of the institution's decision to admit a student with a criminal history or the institution's failure to conduct a criminal background check.\n(b) Nothing in this section creates or establishes a legal duty upon a postsecondary institution to inquire into or require disclosure of the criminal history or criminal convictions of a student or an applicant for admission.",
	"repealed": false
}