{
	"id": "13D.08",
	"url": "https://www.revisor.mn.gov/statutes/cite/13D.08",
	"title": "13D.08 OPEN MEETING LAW CODED ELSEWHERE.",
	"text": "Certain meetings of the Board of Animal Health are governed by section 35.0661, subdivision 1.\nMeetings of the Minnesota Life and Health Guaranty Association Board of Directors are governed by section 61B.22.\nCertain meetings of the Comprehensive Health Association are governed by section 62E.10, subdivision 4.\nCertain meetings of the Health Technology Advisory Committee are governed by section 62J.156.\nMeetings of the Health Coverage Reinsurance Association are governed by section 62L.13, subdivision 3.\nMeetings of MNsure are governed by section 62V.03, subdivision 2.\nMeetings of the self-insurers' security fund and its board of trustees are governed by section 79A.16.\nMeetings of the commercial self-insurance group security fund are governed by section 79A.28.\nCertain meetings of the Lessard-Sams Outdoor Heritage Council are governed by section 97A.056, subdivision 5.\nCertain meetings of the board of directors of Enterprise Minnesota, Inc. are governed by section 116O.03.\nCertain meetings of Minnesota Business Finance, Inc. are governed by section 116S.02.\nCertain meetings of Northern Technology Initiative, Inc. are governed by section 116T.02.\nCertain meetings of the Agricultural Utilization Research Institute are governed by section 116V.01, subdivision 10.\nCertain meetings of hospitals established under section 144.581 are governed by section 144.581, subdivisions 4 and 5.\nCertain meetings of the Advisory Council on Workers' Compensation are governed by section 175.007, subdivision 3.\nMeetings of a board of directors of an electric cooperative that has more than 50,000 members are governed by section 308A.327.\nCertain meetings of town boards are governed by section 366.01, subdivision 11.\nCertain meetings of the Hennepin County Board on behalf of the HMO or Hennepin Healthcare System, Inc. are governed by section 383B.217.\nCertain meetings of the Hennepin Healthcare System, Inc. are governed by section 383B.917.\nCertain meetings of the Real Estate Appraisal Advisory Board are governed by section 82B.073, subdivision 5.",
	"repealed": false
}