{
	"id": "604A.12",
	"url": "https://www.revisor.mn.gov/statutes/cite/604A.12",
	"title": "604A.12 LIVESTOCK ACTIVITIES; IMMUNITY FROM LIABILITY.",
	"text": "(a) For purposes of this section, the following terms have the meanings given them.\n(b) \"Inherent risks of livestock activities\" means dangers or conditions that are an integral part of livestock activities, including:\n(1) the propensity of livestock to behave in ways that may result in death or injury to persons on or around them, such as kicking, biting, bucking, or charging;\n(2) the unpredictability of livestock's reaction to things like sound, sudden movement, unfamiliar objects, persons, or other animals;\n(3) natural hazards such as surface or subsurface conditions; or\n(4) collisions with other livestock or objects.\n(c) \"Livestock\" means cattle, sheep, swine, horses, ponies, donkeys, mules, hinnies, goats, buffalo, llamas, or poultry.\n(d) \"Livestock activity\" means an activity involving the maintenance or use of livestock, regardless of whether the activity is open to the general public, and, except in the case of livestock grazing under clause (7), provided the activity is not performed for profit. Livestock activity includes:\n(1) livestock production;\n(2) loading, unloading, or transporting livestock;\n(3) livestock shows, fairs, competitions, performances, races, rodeos, or parades;\n(4) livestock training or teaching activities;\n(5) boarding, shoeing, or grooming livestock;\n(6) riding or inspecting livestock or livestock equipment; or\n(7) the use of state property for livestock grazing, pursuant to an agreement with the commissioner of natural resources.\n(e) \"Livestock activity sponsor\" means a person who sponsors, organizes, or provides the facilities for a livestock activity that is open to the general public.\n(f) \"Participant\" means a person who directly and intentionally engages in a livestock activity. Participant does not include a spectator who is in an authorized area.\nA nonprofit corporation, association, or organization, or a person or other entity donating services, livestock, facilities, or equipment for the use of a nonprofit corporation, association, or organization, is not liable for the death of or an injury to a participant resulting from the inherent risks of livestock activities.\nSubdivision 2 does not apply if any of the following exist:\n(1) the person provided livestock for the participant and failed to make reasonable efforts to determine the ability of the participant to safely engage in the livestock activity or to determine the ability of the participant to safely manage the particular livestock based on the participant's representations of the participant's ability;\n(2) the person provided equipment or tack for the livestock and knew or should have known that it was faulty to the extent that it caused the injury or death;\n(3) the person owns or leases the land upon which a participant was injured or died because of a human-made dangerous latent condition and failed to use reasonable care to protect the participant;\n(4) the person is a livestock activity sponsor and fails to comply with the notice requirement of subdivision 4; or\n(5) the act or omission of the person was willful or negligent.\n(a) Any person or entity grazing livestock on state lands under an agreement with the commissioner of natural resources is not liable for damage to property or the death of or an injury to a person due to the inherent risks of livestock activities.\n(b) This subdivision does not apply if the person or entity grazing the livestock:\n(1) fails to exercise reasonable care in using the land for grazing or in managing the livestock; or\n(2) maintains a condition in material violation of an agreement with the commissioner of natural resources for use of the land, and the condition contributed to the damage, death, or injury.\n(a) A livestock activity sponsor shall post plainly visible signs at one or more prominent locations in the premises where the livestock activity takes place that include a warning of the inherent risks of livestock activity and the limitation of liability under this section.\n(b) The commissioner of natural resources shall post plainly visible signs at one or more prominent locations on any state property being used for grazing purposes pursuant to an agreement with the commissioner. The signs shall include a warning of the inherent risks of livestock activity, and the limitations of liability provided in this section and any other applicable law.",
	"repealed": false
}