{
	"id": "401.10",
	"url": "https://www.revisor.mn.gov/statutes/cite/401.10",
	"title": "401.10 FUNDING COMMUNITY SUPERVISION.",
	"text": "(a) Beginning July 1, 2023, the community supervision subsidy paid to each county, the commissioner for supervision of non-CCA jurisdictions served by the Department of Corrections, and each applicable Tribal Nation under paragraph (e) equals the sum of:\n(1) a base funding amount equal to $150,000; and\n(2) a community supervision formula equal to the sum of:\n(i) for each individual with a felony sentence, a felony per diem rate of $5.62 multiplied by the sum of the county's or Tribal Nation's adult felony population, adult supervised release and parole populations, and juvenile supervised release and parole populations as reported in the most recent probation survey published by the commissioner, multiplied by 365; and\n(ii) for each individual sentenced for a gross misdemeanor or misdemeanor or under juvenile probation, the felony per diem rate of $5.62 multiplied by 0.5 and then multiplied by the sum of the county's or Tribal Nation's gross misdemeanor, misdemeanor, and juvenile populations as reported in the most recent probation survey published by the commissioner, multiplied by 365.\n(b) For a non-CCA jurisdiction under section 244.19, subdivision 1b, paragraph (b) or (c), the base funding amount must be shared equally between the jurisdiction and the commissioner for the provision of felony supervision under section 244.20.\n(c) If in any year the total amount appropriated for the purpose of this section is more than or less than the total of base funding plus community supervision formula funding for all counties and applicable Tribal Nations, the sum of each county's and applicable Tribal Nation's base funding plus community supervision formula funding is adjusted by the ratio of amounts appropriated for this purpose divided by the total of base funding plus community supervision formula funding for all counties and applicable Tribal Nations.\n(d) If in any year the base funding plus the community supervision formula amount based on what was appropriated in fiscal year 2024 is less than the funding paid to the county in fiscal year 2023, the difference is added to the community supervision formula amount for that county. A county is not eligible for additional funding under this paragraph unless the base funding plus community supervision formula results in an increase in funding for the county based on what was appropriated in the previous fiscal year. This paragraph expires June 30, 2029.\n(e) For each Tribal Nation, a funding amount of $250,000 is allotted annually to purchase probation services or probation-related services, including contracted services, but a Tribal Nation that becomes a CCA jurisdiction or a non-CCA jurisdiction under section 244.19, subdivision 1b, paragraph (b) or (c), is an applicable Tribal Nation under paragraphs (a) to (c) and:\n(1) has the Tribal Nation's funding amount of $250,000 transferred to the total community supervision subsidy amount appropriated for the purposes of this section; and\n(2) is allotted a base funding amount equal to $150,000 plus an amount as determined according to the community supervision formula under paragraph (a), clause (2).\n(f) Minnesota Rehabilitation and Reinvestment Act savings under section 244.50, subdivision 4, clause (2), are appropriated to each CCA jurisdiction and non-CCA jurisdiction served by the Department of Corrections by dividing the three-year average of the number of individuals on supervised release and intensive supervised release within the jurisdiction by the three-year average of the total number of individuals under supervised release and intensive supervised release statewide, using the numbers reported annually in the Probation Survey report.\nMS 2022 [Repealed by amendment, 2023 c 52 art 17 s 24]\nMS 2022 [Repealed by amendment, 2023 c 52 art 17 s 24]\n(a) By January 15, 2025, and every year thereafter, the commissioner must submit a report to the chairs and ranking minority members of the legislative committees and divisions with jurisdiction over public safety finance and policy. At a minimum, the report must summarize and contain the following data:\n(1) the commissioner's workload study under section 401.17, subdivision 4;\n(2) the commissioner's collected caseload data under section 244.21, subdivision 1; and\n(3) projected growth in the community supervision formula calculated by analyzing caseload trends and data.\n(b) The report may be made in conjunction with reporting under section 244.21.",
	"repealed": false
}