{
	"id": "60A.22",
	"url": "https://www.revisor.mn.gov/statutes/cite/60A.22",
	"title": "60A.22 SPECIAL PROVISIONS AS TO STOCK COMPANIES; STOCKHOLDERS, OFFICERS, DIRECTORS AND INVESTORS.",
	"text": "(1) If an insurance corporation has given notice to shareholders of a proposal to amend the articles of incorporation, which proposed amendment would substantially change the corporate purposes or would extend the duration of the corporation, a shareholder may, at any time prior to the date of the meeting at which such proposed amendment is to be voted upon, file a written objection to such amendment in the office of the secretary or president of the corporation and demand payment for shares held; provided, that such demand shall be of no force and effect if such shareholder votes in favor of the amendment, or at any time consents thereto in writing, or if the proposed amendment be not in fact effected.\n(2) If, after such a demand by a shareholder, the corporation and the shareholder cannot agree upon the fair cash value of the shares at the time such amendment was authorized, such value shall be determined by three disinterested appraisers, one of whom shall be named by the shareholder, another by the corporation, and the third by the two thus chosen. The determination of a majority of the appraisers in good faith made shall be final, and if the amount so determined is not paid by the corporation within 30 days after it is made, such amount may be recovered in an action by the shareholder against the corporation. The corporation shall not be required to make payment of such amount except upon transfer to it of the shares for which such payment was demanded and upon surrender of the certificate or certificates evidencing the same.\n(3) A shareholder shall not be entitled to payment for shares under the provisions of this subdivision unless the value of the corporate assets which would remain after such payment would be at least equal to the aggregate amount of its debts and liabilities exclusive of stated capital.\n(1) Every person who is directly or indirectly the beneficial owner of more than ten percent of any class of any equity security of a domestic stock insurance company, or who is a director or an officer of such company, shall file in the office of the commissioner of commerce on or before January 31, 1966, or within ten days after becoming such beneficial owner, director, or officer, a statement, in such form as the commissioner of commerce may prescribe, of the amount of all equity securities of such company of which that person is the beneficial owner, and within ten days after the close of each calendar month thereafter, if there has been a change in such ownership during such month, shall file in the office of the commissioner of commerce a statement, in such form as the commissioner of commerce may prescribe, indicating ownership at the close of the calendar month and such changes in ownership as may have occurred during such calendar month.\n(2) For the purpose of preventing the unfair use of information which may have been obtained by such beneficial owner, director, or officer by reason of that person's relationship to such company, any profit realized by that person from any purchase and sale, or any sale and purchase, of any equity security of such company within any period of less than six months, unless such security was acquired in good faith in connection with a debt previously contracted, shall inure to and be recoverable by the company, irrespective of any intention on the part of such beneficial owner, director, or officer in entering into such transaction of holding the security purchased or of not repurchasing the security sold for a period exceeding six months. Suit to recover such profit may be instituted at law or in equity in any court of competent jurisdiction by the company, or by the owner of any security of the company in the name and in behalf of the company if the company shall fail or refuse to bring such suit within 60 days after request or shall fail diligently to prosecute the same thereafter; but no such suit shall be brought more than two years after the date such profit was realized. This clause shall not be construed to cover any transaction where such beneficial owner was not such both at the time of the purchase and sale, or the sale and purchase, of the security involved, or any transaction or transactions which the commissioner of commerce by rules may exempt as not comprehended within the purpose of this clause.\n(3) It shall be unlawful for any such beneficial owner, director, or officer, directly or indirectly, to sell any equity security of such company if the person selling the security or that person's principal (a) does not own the security sold, or (b) if owning the security, does not deliver it against such sale within 20 days thereafter, or does not within five days after such sale deposit it in the mails or other usual channels of transportation; but no person shall be deemed to have violated this clause on proving, notwithstanding the exercise of good faith, the inability to make such delivery or deposit within such time, or without causing undue inconvenience or expense.\n(4) The provisions of clause (2) shall not apply to any purchase and sale, or sale and purchase, and the provisions of clause (3) shall not apply to any sale, of any equity security of a domestic stock insurance company not then or theretofore held by the person in an investment account, by a dealer in the ordinary course of business and incident to the establishment or maintenance by the person of a primary or secondary market, otherwise than on an exchange as defined in the federal Securities Exchange Act of 1934, for such security. The commissioner of commerce may, by such rules as the commissioner deems necessary or appropriate in the public interest, define and prescribe terms and conditions with respect to securities held in an investment account and transactions made in the ordinary course of business and incident to the establishment or maintenance of a primary or secondary market.\n(5) The provisions of this subdivision shall not apply to foreign or domestic arbitrage transactions unless made in contravention of such rules as the commissioner of commerce may adopt in order to carry out the purposes of this subdivision.\n(1) It shall be unlawful for any person, in contravention of such rules as the commissioner of commerce may prescribe as necessary or appropriate in the public interest or for the protection of investors, to solicit or to permit the use of that person's name to solicit any proxy or consent or authorization in respect of any equity security of a domestic stock insurance company.\n(2) Unless proxies, consents, or authorizations in respect of an equity security of a domestic stock insurance company are solicited by or on behalf of the management of such company from the holders of record of such security in accordance with the rules prescribed under clause (1), prior to any annual or other meeting of the holders of such security, such company shall, in accordance with such rules as the commissioner of commerce may prescribe as necessary or appropriate in the public interest or for the protection of investors, if required thereby, file with the commissioner of commerce and transmit to all holders of record of such security information substantially equivalent to the information which would be required to be transmitted if a solicitation were made.\nThe provisions of subdivisions 2 and 3 hereof shall not apply to equity securities of a domestic stock insurance company if (a) any equity security of such company shall be registered, or shall be required to be registered, pursuant to section 12 of the federal Securities Exchange Act of 1934, or if (b) such company shall not have equity securities held of record by 100 or more persons on the last day of the year next preceding the year in which the provisions of subdivisions 2 and 3 hereof would apply except for the provisions of this clause (b).\nThe commissioner of commerce shall have the power to make such rules as may be necessary for the execution of the functions vested in the commissioner by subdivisions 2 and 3 hereof, and may for such purpose classify domestic stock insurance companies, securities, and other persons or matters within the commissioner's jurisdiction. No provision of subdivisions 2 and 3 hereof imposing any liability shall apply to any act done or omitted in good faith in conformity with any rule of the commissioner of commerce, notwithstanding that such rule may, after such act or omission, be amended or rescinded or determined by judicial or other authority to be invalid for any reason.\n(1) The term \"equity security\" when used in this section means any stock or similar security; or any security convertible, with or without consideration, into such a security, or carrying any warrant or right to subscribe to or purchase such a security; or any such warrant or right; or any other security which the commissioner of commerce shall deem to be of similar nature and consider necessary or appropriate, by such rules as the commissioner may prescribe in the public interest or for the protection of investors, to treat as an equity security.\n(2) The term \"domestic stock insurance company\" when used in this section includes a domestic stock and mutual insurance company as defined in sections 66A.36 to 66A.43.",
	"repealed": false
}