{
	"id": "125A.023",
	"url": "https://www.revisor.mn.gov/statutes/cite/125A.023",
	"title": "125A.023 STATE AGENCY COORDINATION RESPONSIBILITIES.",
	"text": "This section and section 125A.027 shall be cited as the \"Interagency Services for Children with Disabilities Act.\"\nIt is the policy of the state to develop and implement a coordinated, multidisciplinary, interagency intervention service system for children ages three to 21 with disabilities.\nFor purposes of this section and section 125A.027, the following terms have the meanings given them:\n(a) \"Health plan\" means:\n(1) a health plan under section 62Q.01, subdivision 3;\n(2) a county-based purchasing plan under section 256B.692;\n(3) a self-insured health plan established by a local government under section 471.617; or\n(4) self-insured health coverage provided by the state to its employees or retirees.\n(b) For purposes of this section, \"health plan company\" means an entity that issues a health plan as defined in paragraph (a).\n(c) \"Interagency intervention service system\" means a system that coordinates services and programs required in state and federal law to meet the needs of eligible children with disabilities ages three through 21, including:\n(1) services provided under the following programs or initiatives administered by state or local agencies:\n(i) the maternal and child health program under title V of the Social Security Act;\n(ii) the Minnesota children with special health needs program under sections 144.05 and 144.07;\n(iii) the Individuals with Disabilities Education Act, Part B, section 619, and Part C as amended;\n(iv) medical assistance under title 42, chapter 7, of the Social Security Act;\n(v) developmental disabilities services under chapter 256B;\n(vi) the Head Start Act under title 42, chapter 105, of the Social Security Act;\n(vii) vocational rehabilitation services provided under chapters 248 and 268A and the Rehabilitation Act of 1973;\n(viii) Juvenile Court Act services provided under sections 260.011 to 260.91; 260B.001 to 260B.446; and 260C.001 to 260C.451;\n(ix) Minnesota Comprehensive Children's Mental Health Act under section 245.487;\n(x) the community health services grants under sections 145.88 to 145.9266;\n(xi) the Local Public Health Act under chapter 145A; and\n(xii) the Vulnerable Children and Adults Act, sections 256M.60 to 256M.80;\n(2) service provision and funding that can be coordinated through:\n(i) the children's mental health collaborative under section 245.493;\n(ii) the family services collaborative under section 142D.15;\n(iii) the community transition interagency committees under section 125A.22; and\n(iv) the interagency early intervention committees under section 125A.259;\n(3) financial and other funding programs to be coordinated including medical assistance under title 42, chapter 7, of the Social Security Act, the MinnesotaCare program under chapter 256L, Supplemental Social Security Income, Developmental Disabilities Assistance, and any other employment-related activities associated with the Social Security Administration; and services provided under a health plan in conformity with an individual family service plan or an individualized education program or an individual interagency intervention plan; and\n(4) additional appropriate services that local agencies and counties provide on an individual need basis upon determining eligibility and receiving a request from (i) the school board or county board and (ii) the child's parent.\n(d) \"Children with disabilities\" has the meaning given in section 125A.02.\n(e) A \"standardized written plan\" means those individual services or programs, with accompanying funding sources, available through the interagency intervention service system to an eligible child other than the services or programs described in the child's individualized education program or the child's individual family service plan.\n(a) The commissioner of education, on behalf of the governor, shall convene an interagency committee to develop and implement a coordinated, multidisciplinary, interagency intervention service system for children ages three to 21 with disabilities. The commissioners of commerce, education, health, human rights, human services, employment and economic development, and corrections shall each appoint two committee members from their departments; and the Association of Minnesota Counties, Minnesota School Boards Association, the Minnesota Administrators of Special Education, and the School Nurse Association of Minnesota shall each appoint one committee member. The committee shall select a chair from among its members.\n(b) The committee shall:\n(1) identify and assist in removing state and federal barriers to local coordination of services provided to children with disabilities;\n(2) identify adequate, equitable, and flexible funding sources to streamline these services;\n(3) develop guidelines for implementing policies that ensure a comprehensive and coordinated system of all state and local agency services, including multidisciplinary assessment practices for children with disabilities ages three to 21, including:\n(i) develop, consistent with federal law, a standardized written plan for providing services to a child with disabilities;\n(ii) identify how current systems for dispute resolution can be coordinated;\n(iii) develop an evaluation process to measure the success of state and local interagency efforts in improving the quality and coordination of services to children with disabilities ages three to 21; and\n(iv) develop guidelines to assist the school boards and county boards in carrying out the duties assigned in section 125A.027, subdivision 1, paragraph (b); and\n(4) carry out other duties necessary to develop and implement within communities a coordinated, multidisciplinary, interagency intervention service system for children with disabilities.\n(c) The committee shall consult on an ongoing basis with the state Special Education Advisory Panel and the governor's Interagency Coordinating Council in carrying out its duties under this section, including assisting the school boards and county boards.\n[Repealed, 1Sp2003 c 9 art 3 s 21]\nNothing in this section and section 125A.027 relieves a health plan company, third party administrator or other third-party payer of an obligation to pay for, or changes the validity of an obligation to pay for, services provided to children with disabilities ages three to 21 and their families.\nNothing in this section and section 125A.027 removes the obligation of the state, counties, local school districts, a regional agency, or a local agency or organization to comply with any federal or state law that mandates responsibility for finding, assessing, delivering, assuring, or paying for education or related services for children with disabilities and their families.",
	"repealed": false
}