{
	"id": "216B.2423",
	"url": "https://www.revisor.mn.gov/statutes/cite/216B.2423",
	"title": "216B.2423 WIND POWER MANDATE.",
	"text": "A public utility, as defined in section 216B.02, subdivision 4, that operates a nuclear-powered electric generating plant within this state must construct and operate, purchase, or contract to construct and operate: (1) 225 megawatts of electric energy installed capacity generated by wind energy conversion systems within the state by December 31, 1998; and (2) an additional 200 megawatts of installed capacity so generated by December 31, 2002.\nFor the purpose of this section, \"wind energy conversion system\" has the meaning given it in section 216C.06, subdivision 19.\nThe Public Utilities Commission shall order a public utility subject to subdivision 1, to construct and operate, purchase, or contract to purchase an additional 400 megawatts of electric energy installed capacity generated by wind energy conversion systems by December 31, 2002, subject to resource planning and least cost planning requirements in section 216B.2422.\nThe Public Utilities Commission shall ensure that a utility subject to the requirements of subdivision 1, clause (2), shall implement that clause with a preference for wind energy conversion systems within the state. This preference shall not prevent the utility from constructing or contracting to construct wind energy conversion systems outside the state, if the Public Utilities Commission determines that selection of a facility within the state conflicts with the requirements of section 216B.03.\nThe Public Utilities Commission shall require a public utility subject to subdivision 1 to develop and file in a form acceptable to the commission by October 1, 1997, a standard form contract for the purchase of electricity from wind conversion systems with installed capacity of two megawatts and less. For purposes of applying the two megawatts limit, the installed capacity sold to the public utility from a single seller or affiliated group of sellers shall be cumulated. The standard contract shall include all the terms and conditions for purchasing wind-generated power by the utility, except for price and any other specific terms necessary to ensure system reliability and safety, which shall be separately negotiable.",
	"repealed": false
}