{
	"id": "182.6526",
	"url": "https://www.revisor.mn.gov/statutes/cite/182.6526",
	"title": "182.6526 WAREHOUSE DISTRIBUTION WORKER SAFETY.",
	"text": "(a) The terms defined in this subdivision have the meanings given.\n(b) \"Aggregated employee work speed data\" means a compilation of employee work speed data for multiple employees, in summary form, assembled in full or in another form such that the data cannot be identified with any individual.\n(c) \"Commissioner\" means the commissioner of labor and industry.\n(d)(1) Except as provided in clause (2), \"employee\" means a person who meets the definition in section 182.651, subdivision 9, and who works at a warehouse distribution center.\n(2) For the purposes of subdivisions 2, 3, and 4 only, \"employee\" means a person who: (i) meets the definition in section 182.651, subdivision 9; (ii) does not meet any of the exceptions under section 177.23, subdivision 7, clauses (1) to (19); and (iii) performs warehouse work occurring on the property of a warehouse distribution center. Employee does not include any person performing solely manufacturing, administrative, sales, accounting, human resources, or driving work at, or to and from, a warehouse distribution center.\n(e) \"Employee work speed data\" means information an employer collects, stores, analyzes, or interprets relating to an individual employee's performance of a quota, including but not limited to quantities of tasks performed, quantities of items or materials handled or produced, rates or speeds of tasks performed, measurements or metrics of employee performance in relation to a quota, and time categorized as performing tasks or not performing tasks. Employee work speed data does not include itemized earnings statements pursuant to chapter 181, except for any content of those records that includes employee work speed data as defined in this paragraph.\n(f) \"Employer\" means a person who meets the definition in section 182.651, subdivision 7, and who directly or indirectly, or through an agent or any other person, including through the services of a third-party employer, temporary service, or staffing agency or similar entity, employs or exercises control over the wages, hours, or working conditions of 250 or more employees at a single warehouse distribution center or 1,000 or more employees at one or more warehouse distribution centers in the state. For purposes of this paragraph, all employees of an employer's unitary business, as defined in section 290.17, subdivision 4, shall be counted in determining the number of employees employed at a single warehouse distribution center or at one or more warehouse distribution centers in the state.\n(g) \"Warehouse distribution center\" means an establishment as defined by any of the following North American Industry Classification System (NAICS) codes:\n(1) 493110 for General Warehousing and Storage;\n(2) 423 for Merchant Wholesalers, Durable Goods;\n(3) 424 for Merchant Wholesalers, Nondurable Goods;\n(4) 454110 for Electronic Shopping and Mail-Order Houses; and\n(5) 492110 for Couriers and Express Delivery Services.\n(h) \"Quota\" means a work standard under which:\n(1) an employee or group of employees is assigned or required to perform at a specified productivity speed, or perform a quantified number of tasks, or handle or produce a quantified amount of material, or perform without a certain number of errors or defects, as measured at the individual or group level within a defined time period; or\n(2) an employee's actions are categorized and measured between time performing tasks and not performing tasks, and the employee's failure to complete a task performance standard may have an adverse impact on the employee's continued employment.\n(a) Each employer shall provide to each employee a written description of each quota to which the employee is subject and how it is measured, including the quantified number of tasks to be performed or materials to be produced or handled or the limit on time categorized as not performing tasks, within the defined time period, and any potential adverse employment action that could result from failure to meet the quota.\n(b) The written description must be understandable in plain language and in the language identified by each employee as the primary language of that employee.\n(c) The written description must be provided:\n(1) upon hire or within 30 days of August 1, 2023; and\n(2) no fewer than one working day prior to the effective date of any increase of an existing quota and no later than the time of implementation for any decrease of an existing quota.\n(d) An employer shall not take adverse employment action against an employee for failure to meet a quota that has not been disclosed to the employee.\nAn employee shall not be required to meet a quota that prevents compliance with meal or rest or prayer periods; use of restroom facilities, including reasonable travel time to and from restroom facilities as provided under section 177.253, subdivision 1; or occupational health and safety standards under this chapter or Minnesota Rules, chapter 5205. An employer shall not take adverse employment action against an employee for failure to meet a quota that does not allow a worker to comply with meal or rest or prayer periods or occupational health and safety standards under this chapter.\n(a) Employees have the right to request orally or in writing from their direct supervisor or another representative designated by the employer, and the employer shall provide within four business days: (1) a written description of each quota to which the employee is subject; (2) a copy of the most recent 90 days of the employee's own personal employee work speed data; and (3) a copy of the most recent 90 days of aggregated employee work speed data for similar employees at the same work site.\nThe written description of each quota must meet the requirements of subdivision 2, paragraph (b), and the employee work speed data must be provided in a manner understandable to the employee. An employee may make a request under this paragraph no more than four times per year.\n(b) If an employer disciplines an employee for failure to meet a quota, the employer must, at the time of discipline, provide the employee with a written copy of the most recent 90 days of the employee's own personal employee work speed data. If an employer dismisses an employee for any reason, they must, at the time of firing, provide the employee with a written copy of the most recent 90 days of the employee's own personal employee work speed data. An employer shall not retaliate against an employee for requesting data under this subdivision. Discipline means taking a formal action, documented in writing, and does not mean conversations surrounding performance improvement or training. An employer must formally document any disciplinary action.\nIf a particular work site or employer is found to have an employee incidence rate in a given year, based on data reported to the federal Occupational Safety and Health Administration, of at least 30 percent higher than that year's average incidence rate for the relevant NAICS codes, the commissioner shall open an investigation of violations under this section. The employer must also hold its safety committee meetings as provided under section 182.676 monthly until, for two consecutive years, the work site or employer does not have an employee incidence rate 30 percent higher than the average yearly incidence rate for the relevant NAICS code.\n(a) Subdivisions 2, paragraphs (a) to (c), 4, and 5 shall be enforced by the commissioner under sections 182.66, 182.661, and 182.669. A violation of this section is subject to the penalties provided under sections 182.666 and 182.669.\n(b) A current or former employee aggrieved by a violation of this section may bring a civil cause of action for damages and injunctive relief to obtain compliance with this section; may receive other equitable relief as determined by a court, including reinstatement with back pay; and may, upon prevailing in the action, recover costs and reasonable attorney fees in that action. A cause of action under this section must be commenced within one year of the date of the violation.\n(c) Nothing in this section shall be construed to prevent local enforcement of occupational health and safety standards that are more restrictive than this section.",
	"repealed": false
}