{
	"id": "325E.031",
	"url": "https://www.revisor.mn.gov/statutes/cite/325E.031",
	"title": "325E.031 IMMIGRATION SERVICES.",
	"text": "(a) For the purpose of this section, the terms in this subdivision have the meanings given.\n(b) \"Immigration matter\" means any proceeding, filing, or action affecting the nonimmigrant, immigrant, or citizenship status of any person that arises under immigration and naturalization law, executive order, or presidential proclamation of the United States or any foreign country, or that arises under action of the United States Citizenship and Immigration Services, the United States Department of Labor, or the United States Department of State.\n(c) \"Immigration assistance service\" means any advice, guidance, information, or action provided or offered to customers or prospective customers relating to any immigration matter and for which a fee is charged.\n(a) Any person who provides or offers immigration assistance services in this state shall post a notice at that person's place of business, setting forth information in English and in every other language in which the person provides or offers to provide immigration assistance services. Each language must be on a separate sign and posted in a location visible to customers. Each sign must be at least 11 inches by 17 inches and must contain the following statements:\n(1) \"I AM NOT AN ATTORNEY LICENSED TO PRACTICE LAW AND MAY NOT GIVE LEGAL ADVICE OR ACCEPT FEES FOR LEGAL ADVICE.\"\n(2) \"I AM NOT ACCREDITED TO REPRESENT YOU BEFORE THE UNITED STATES CITIZENSHIP AND IMMIGRATION SERVICES AND THE IMMIGRATION BOARD OF APPEALS.\"\n(b) Any person who advertises immigration assistance services in a language other than English, whether by radio, television, signs, pamphlets, newspapers, or other written communication, with the exception of a single desk plaque, shall post or otherwise include with the advertisement a notice in English and the language in which the advertisement appears that contains the language in paragraph (a), clause (1).\nAny person who provides or offers to provide immigration assistance services may not do any of the following:\n(1) give any legal advice concerning an immigration matter or perform an act constituting the practice of immigration law as defined in Code of Federal Regulations, title 8, section 1.1(i), (j), (k), or (m);\n(2) represent, hold out or advertise, in connection with the provision of assistance in immigration matters, other titles or credentials in any language, including, but not limited to, \"notary public\" or \"immigration consultant,\" that could cause a customer to believe that the person possesses special professional skills or is authorized to provide advice on an immigration matter;\n(3) make any misrepresentation or false statement, directly or indirectly, to influence, persuade, or induce patronage;\n(4) retain any compensation for service not performed; or\n(5) refuse to return documents supplied by, prepared on behalf of, or paid for by the customer upon the request of the customer even if subject to a fee dispute.\nExcept as otherwise provided in this section, before providing an immigration assistance service a person shall provide the customer with a written contract that includes the following:\n(1) an explanation of the services to be performed;\n(2) identification of all compensation and costs to be charged to the customer for the services to be performed; and\n(3) a statement that documents submitted in support of an application for nonimmigrant, immigrant, or naturalization status may not be retained by the person for any purpose, including payment of compensation or costs.\nThe written contract must be in both English and in the language of the customer. A copy of the contract must be provided to the customer upon the customer's execution of the contract. A customer has the right to rescind a contract within 72 hours after signing the contract. Any documents prepared on behalf of, or paid for by the customer, must be returned upon demand of the customer.\nThis subdivision does not apply to a not-for-profit organization that provides advice or assistance in immigration matters to clients without charge beyond a reasonable fee to reimburse the organization's or clinic's reasonable costs relating to providing immigration services to that client.\nThis section does not apply to:\n(1) an attorney licensed to practice law in any state or territory of the United States, or in any foreign country when authorized by the Minnesota Supreme Court, to the extent the attorney renders immigration assistance service in the course of practicing as an attorney;\n(2) a nonlawyer assistant, as described by the rules of the Minnesota Supreme Court, employed by and under the direct supervision of a licensed attorney and rendering immigration assistance service in the course of the assistant's employment;\n(3) a not-for-profit organization recognized by the Board of Immigration Appeals under Code of Federal Regulations, title 8, section 292.2(a), and employees of those organizations accredited under Code of Federal Regulations, title 8, section 292.2(d), and designated entities as defined under Code of Federal Regulations, title 8, section 245a.1; and\n(4) an organization employing or desiring to employ an alien or nonimmigrant alien, where the organization, its employees or its agents provide advice or assistance in immigration matters to alien or nonimmigrant alien employees or potential employees without compensation from the individuals to whom the advice or assistance is provided.\nA person who violates this section is guilty of a misdemeanor. The penalties and remedies of section 8.31 apply to violations of this section, including a private cause of action.",
	"repealed": false
}