{
	"id": "336.9-323",
	"url": "https://www.revisor.mn.gov/statutes/cite/336.9-323",
	"title": "336.9-323 FUTURE ADVANCES.",
	"text": "(a) When priority based on time of advance. Except as otherwise provided in subsection (c), for purposes of determining the priority of a perfected security interest under section 336.9-322 (a)(1), perfection of the security interest dates from the time an advance is made to the extent that the security interest secures an advance that:\n(1) is made while the security interest is perfected only:\n(A) under section 336.9-309 when it attaches; or\n(B) temporarily under section 336.9-312(e), (f), or (g); and\n(2) is not made pursuant to a commitment entered into before or while the security interest is perfected by a method other than under section 336.9-309 or 336.9-312(e), (f), or (g).\n(b) Lien creditor. Except as otherwise provided in subsection (c), a security interest is subordinate to the rights of a person that becomes a lien creditor to the extent that the security interest secures an advance made more than 45 days after the person becomes a lien creditor unless the advance is made:\n(1) without knowledge of the lien; or\n(2) pursuant to a commitment entered into without knowledge of the lien.\n(c) Buyer of receivables. Subsections (a) and (b) do not apply to a security interest held by a secured party that is a buyer of accounts, chattel paper, payment intangibles, or promissory notes or a consignor.\n(d) Buyer of goods. Except as otherwise provided in subsection (e), a buyer of goods takes free of a security interest to the extent that it secures advances made after the earlier of:\n(1) the time the secured party acquires knowledge of the buyer's purchase; or\n(2) 45 days after the purchase.\n(e) Advances made pursuant to commitment: priority of buyer of goods. Subsection (d) does not apply if the advance is made pursuant to a commitment entered into without knowledge of the buyer's purchase and before the expiration of the 45-day period.\n(f) Lessee of goods. Except as otherwise provided in subsection (g), a lessee of goods takes the leasehold interest free of a security interest to the extent that it secures advances made after the earlier of:\n(1) the time the secured party acquires knowledge of the lease; or\n(2) 45 days after the lease contract becomes enforceable.\n(g) Advances made pursuant to commitment: priority of lessee of goods. Subsection (f) does not apply if the advance is made pursuant to a commitment entered into without knowledge of the lease and before the expiration of the 45-day period.",
	"repealed": false
}