{
	"id": "60A.36",
	"url": "https://www.revisor.mn.gov/statutes/cite/60A.36",
	"title": "60A.36 MIDTERM CANCELLATION.",
	"text": "No insurer may cancel a policy of commercial liability and/or property insurance during the term of the policy, except for one or more of the following reasons:\n(1) nonpayment of premium;\n(2) misrepresentation or fraud made by or with the knowledge of the insured in obtaining the policy or in pursuing a claim under the policy;\n(3) actions by the insured that have substantially increased or substantially changed the risk insured;\n(4) refusal of the insured to eliminate known conditions that increase the potential for loss after notification by the insurer that the condition must be removed;\n(5) substantial change in the risk assumed, except to the extent that the insurer should reasonably have foreseen the change or contemplated the risk in writing the contract;\n(6) loss of reinsurance by the insurer which provided coverage to the insurer for a significant amount of the underlying risk insured. A notice of cancellation under this clause shall advise the policyholder that the policyholder has ten days from the date of receipt of the notice to appeal the cancellation to the commissioner of commerce and that the commissioner will render a decision as to whether the cancellation is justified because of the loss of reinsurance within 30 business days after receipt of the appeal;\n(7) a determination by the commissioner that the continuation of the policy could place the insurer in violation of the insurance laws of this state; or\n(8) nonpayment of dues to an association or organization, other than an insurance association or organization, where payment of dues is a prerequisite to obtaining or continuing the insurance. This provision for cancellation for failure to pay dues does not apply to persons who are retired at 62 years of age or older or who are disabled according to Social Security standards.\nCancellation under subdivision 1, clauses (2) to (8), shall not be effective before 60 days after notice to the policyholder. The notice of cancellation shall contain a specific reason for cancellation as provided in subdivision 1.\nA policy shall not be canceled for nonpayment of premium pursuant to subdivision 1, clause (1), unless the insurer, at least ten days before the effective cancellation date, has given notice to the policyholder of the amount of premium due and the due date. The notice shall state the effect of nonpayment by the due date. No cancellation for nonpayment of premium shall be effective if payment of the amount due is made before the effective date in the notice.\nAn insurer shall provide notice to a third party if:\n(1) the policyholder has, separately from the certificate, notified the insurer of the identity of the third party; and\n(2) the third party is a licensing authority authorized by statute to receive the notice or a state, city, or county governmental unit on whose behalf the insured is providing services.\nSubdivisions 1 and 2 do not apply to any insurance policy that has not been previously renewed if the policy has been in effect less than 90 days at the time the notice of cancellation is mailed or delivered. No cancellation under this subdivision is effective until at least ten days after the written notice to the policyholder.\nA policy may be issued for a term longer than one year or for an indefinite term with a clause providing for cancellation by the insurer for the reasons stated in subdivision 1 by giving notice as required by subdivision 2 at least 60 days before any anniversary date.\n(a) No insurer may rescind or void a contract of liability or property insurance unless there was material misrepresentation, material omission, or fraud made by or with the knowledge of the insured in obtaining the contract or in pursuing a claim under the policy.\n(b) No misrepresentation or omission shall be material unless knowledge by the insurer of the facts misrepresented or omitted would have led to a refusal by the insurer to make such a contract. In determining the question of materiality, evidence of the practice of the insurer with respect to the acceptance or rejection of similar risks shall be admissible.\n(c) For purposes of this section, a representation is a statement as to past or present fact, made to an insurer or the insurer's agent by the applicant as an inducement for issuing a contract of commercial liability or property insurance. A misrepresentation is a false representation, and the facts misrepresented are those facts which make the representation false.\n(d) This subdivision does not limit the right to cancel the policy prospectively for the reasons stated in subdivision 1, clause (2).",
	"repealed": false
}