{
	"id": "62S.24",
	"url": "https://www.revisor.mn.gov/statutes/cite/62S.24",
	"title": "62S.24 REQUIREMENTS FOR APPLICATION FORMS AND REPLACEMENT COVERAGE.",
	"text": "An application form must include the following questions designed to elicit information as to whether, as of the date of the application, the applicant has another long-term care insurance policy or certificate in force or whether a long-term care policy or certificate is intended to replace any other accident and sickness or long-term care policy or certificate presently in force. A supplementary application or other form to be signed by the applicant and agent, except where the coverage is sold without an agent, containing the following questions may be used. If a replacement policy is issued to a group as defined under section 62S.01, subdivision 15, clause (1), the following questions may be modified only to the extent necessary to elicit information about long-term care insurance policies other than the group policy being replaced; provided, however, that the certificate holder has been notified of the replacement:\n(1) do you have another long-term care insurance policy or certificate in force (including health care service contract or health maintenance organization contract)?;\n(2) did you have another long-term care insurance policy or certificate in force during the last 12 months?;\n(i) if so, with which company?; and\n(ii) if that policy lapsed, when did it lapse?;\n(3) are you covered by Medicaid?; and\n(4) do you intend to replace any of your medical or health insurance coverage with this policy (certificate)?\nAgents shall list all other health insurance policies they have sold to the applicant that are still in force or were sold in the past five years and are no longer in force.\nAn application for a long-term care insurance policy or certificate must meet the requirements specified under section 62S.21.\nAfter determining that a sale will involve replacement, an insurer, other than an insurer using direct response solicitation methods or its agent, shall furnish the applicant, before issuance or delivery of the individual long-term care insurance policy, a notice regarding replacement of accident and sickness or long-term care coverage. One copy of the notice must be retained by the applicant and an additional copy signed by the applicant must be retained by the insurer. The required notice must be provided in the following manner:\nNOTICE TO APPLICANT REGARDING REPLACEMENT OF\nINDIVIDUAL ACCIDENT AND SICKNESS OR LONG-TERM CARE INSURANCE\n(Insurance company's name and address)\nSAVE THIS NOTICE! IT MAY BE IMPORTANT TO YOU IN THE FUTURE.\nAccording to (your application) (information you have furnished), you intend to lapse or otherwise terminate existing accident and sickness or long-term care insurance and replace it with an individual long-term care insurance policy to be issued by (company name) insurance company. Your new policy provides 30 days within which you may decide, without cost, whether you desire to keep the policy. For your own information and protection, you should be aware of and seriously consider certain factors which may affect the insurance protection available to you under the new policy.\nYou should review this new coverage carefully, comparing it with all accident and sickness or long-term care insurance coverage you now have, and terminate your present policy only if, after due consideration, you find that purchase of this long-term care coverage is a wise decision.\nSTATEMENT TO APPLICANT BY AGENT\n(BROKER OR OTHER REPRESENTATIVE):\n(Use additional sheets, as necessary.)\nI have reviewed your current medical health insurance coverage. I believe the replacement of insurance involved in this transaction materially improves your position. My conclusion has taken into account the following considerations, which I call to your attention:\n(a) Health conditions which you presently have (preexisting conditions) may not be immediately or fully covered under the new policy. This could result in denial or delay in payment of benefits under the new policy, whereas a similar claim might have been payable under your present policy.\n(b) State law provides that your replacement policy or certificate may not contain new preexisting conditions or probationary periods. The insurer will waive any time periods applicable to preexisting conditions or probationary periods in the new policy (or coverage) for similar benefits to the extent such time was spent (depleted) under the original policy.\n(c) If you are replacing existing accident and sickness or long-term care insurance coverage, you may wish to secure the advice of your present insurer or its agent regarding the proposed replacement of your present policy. This is not only your right, but it is also in your best interest to make sure you understand all the relevant factors involved in replacing your present coverage.\n(d) If, after due consideration, you still wish to terminate your present policy and replace it with new coverage, be certain to truthfully and completely answer all questions on the application concerning your medical health history. Failure to include all material medical information on an application may provide a basis for the company to deny any future claims and to refund your premium as though your policy had never been in force. After the application has been completed and before you sign it, reread it carefully to be certain that all information has been properly recorded.\nInsurers using direct response solicitation methods shall deliver a notice regarding replacement of long-term care coverage to the applicant upon issuance of the policy. The required notice must be provided in the following manner:\nNOTICE TO APPLICANT REGARDING REPLACEMENT OF ACCIDENT\nAND SICKNESS OR LONG-TERM CARE INSURANCE\n(Insurance company's name and address)\nSAVE THIS NOTICE! IT MAY BE\nIMPORTANT TO YOU IN THE FUTURE.\nAccording to (your application) (information you have furnished), you intend to lapse or otherwise terminate existing accident and sickness or long-term care insurance and replace it with the long-term care insurance policy delivered herewith issued by (company name) insurance company.\nYour new policy provides 30 days within which you may decide, without cost, whether you desire to keep the policy. For your own information and protection, you should be aware of and seriously consider certain factors which may affect the insurance protection available to you under the new policy.\nYou should review this new coverage carefully, comparing it with all long-term care insurance coverage you now have, and terminate your present policy only if, after due consideration, you find that purchase of this long-term care coverage is a wise decision.\n(a) Health conditions which you presently have (preexisting conditions) may not be immediately or fully covered under the new policy. This could result in denial or delay in payment of benefits under the new policy, whereas a similar claim might have been payable under your present policy.\n(b) State law provides that your replacement policy or certificate may not contain new preexisting conditions or probationary periods. Your insurer will waive any time periods applicable to preexisting conditions or probationary periods in the new policy (or coverage) for similar benefits to the extent such time was spent (depleted) under the original policy.\n(c) If you are replacing existing accident and sickness or long-term care insurance coverage, you may wish to secure the advice of your present insurer or its agent regarding the proposed replacement of your present policy. This is not only your right, but it is also in your best interest to make sure you understand all the relevant factors involved in replacing your present coverage.\n(d) (To be included only if the application is attached to the policy.)\nIf, after due consideration, you still wish to terminate your present policy and replace it with new coverage, read the copy of the application attached to your new policy and be sure that all questions are answered fully and correctly. Omissions or misstatements in the application could cause an otherwise valid claim to be denied. Carefully check the application and write to (company name and address) within 30 days if any information is not correct and complete, or if any past medical history has been left out of the application.\nWhere replacement is intended, the replacing insurer shall notify, in writing, the existing insurer of the proposed replacement. The existing policy must be identified by the insurer, name of the insured, and policy number or address including zip code. The notice must be made within five working days from the date the application is received by the insurer or the date the policy is issued, whichever is sooner.\nIf a long-term care insurance policy or certificate replaces another long-term care policy or certificate, the replacing insurer shall waive any time periods applicable to preexisting conditions and probationary periods in the new long-term care policy for similar benefits to the extent that similar exclusions have been satisfied under the original policy.\nLife insurance policies that accelerate benefits for long-term care shall comply with this section if the policy being replaced is a long-term care insurance policy. If the policy being replaced is a life insurance policy, the insurer shall comply with the replacement requirements of sections 61A.53 to 61A.60. If a life insurance policy that accelerates benefits for long-term care is replaced by another such policy, the replacing insurer shall comply with both the long-term care and the life insurance replacement requirements.\n(a) With respect to the long-term care partnership program referenced in section 256B.0571, issuers of long-term care policies may voluntarily exchange a current long-term care insurance policy for a long-term care partnership policy that meets the requirements of Public Law 109-171, section 6021, after the effective date of the state plan amendment implementing the partnership program in this state. The exchange may be in the form of: (1) an amendment or rider; or (2) a disclosure statement indicating that the coverage is now partnership qualified.\n(b) With respect to the long-term care partnership program referenced in section 256B.0571, to allow an existing long-term care insurance policy to qualify as a partnership policy by addition of: (1) a policy rider or amendment; or (2) a disclosure statement, the issuer of the policy is authorized to add the rider, amendment, or disclosure statement to the policy after the effective date of the state plan amendment implementing the partnership program in this state.\n(c) The commissioner, in cooperation with the commissioner of human services, shall pursue any federal law changes or waivers necessary to allow the implementation of paragraphs (a) and (b).\n(a) Notwithstanding section 256B.0571, subdivision 6, a long-term care insurance policy issued before July 1, 2006, that otherwise meets all requirements for partnership policy status shall be qualified as a partnership policy, provided that benefits have not yet been paid out on the policy.\n(b) An insured may make written inquiry to the issuer of the long-term care insurance policy as to whether the policy meets the requirements for partnership policy status. The issuer of the policy must reply to the inquiry within 30 days, and if the policy does so qualify, must add a rider, amendment, or disclosure statement to the policy as documentation of the partnership policy status.",
	"repealed": false
}