{
	"id": "12.221",
	"url": "https://www.revisor.mn.gov/statutes/cite/12.221",
	"title": "12.221 MINNESOTA NATURAL DISASTER ASSISTANCE.",
	"text": "The Division of Emergency Management may enter into an agreement with the Federal Emergency Management Agency (FEMA) for the maintenance of the Minnesota natural disaster assistance program and for administration of federal disaster assistance programs as provided for under provisions of federal law and regulation.\nUnder the agreement, the Federal Emergency Management Agency will provide $50,000 in federal funds annually toward the cost incurred by implementation of the natural disaster assistance program. The Division of Emergency Management shall provide two planners and the necessary equipment and facilities for project operations.\nThe state director may serve as the governor's authorized representative. As such, the state director may apply for and enter into an agreement with any federal agency to accept and administer federal financial assistance made available to the state as a result of a disaster declaration. Federal money received is appropriated to the state director, who shall report its expenditure to the chairs of the house of representatives Ways and Means Committee and the appropriate senate finance committee.\n(a) The state director, serving as the governor's authorized representative, may enter into subgrant agreements with eligible applicants to provide federal and state financial assistance made available as a result of a disaster declaration.\n(b) When state funds are used to provide the FEMA Public Assistance Program cost-share requirement for a local government, the state director must award a local government 100 percent of the nonfederal share of the local government's FEMA Public Assistance Program costs.\nMS 2002 [Repealed, 1Sp2003 c 1 art 2 s 136]\n(a) A disaster assistance contingency account is created in the special revenue fund in the state treasury. Money in the disaster assistance contingency account is appropriated to the commissioner of public safety to provide:\n(1) cost-share for federal assistance under section 12A.15, subdivision 1;\n(2) state public disaster assistance to eligible applicants under chapter 12B;\n(3) cost-share for federal assistance from the Federal Highway Administration emergency relief program under United States Code, title 23, section 125; and\n(4) cost-share for federal assistance from the United States Department of Agriculture, Natural Resources Conservation Service emergency watershed protection program under United States Code, title 16, sections 2203 to 2205.\n(b) For appropriations under paragraph (a), clause (1), the amount appropriated is 100 percent of any nonfederal share for state agencies, local governments, and utility cooperatives. Money appropriated under paragraph (a), clause (1), may be used to pay all or a portion of the nonfederal share for publicly owned capital improvement projects.\n(c) For appropriations under paragraph (a), clause (2), the amount appropriated is the amount required to pay eligible claims under chapter 12B, as certified by the commissioner of public safety.\n(d) By January 15 of each year, the commissioner of management and budget shall submit a report to the chairs and ranking minority members of the house of representatives Ways and Means Committee and the senate Finance Committee detailing state disaster assistance appropriations and expenditures under this subdivision during the previous calendar year.\n(e) The governor's budget proposal submitted to the legislature under section 16A.11 must include recommended appropriations to the disaster assistance contingency account. The governor's appropriation recommendations must be informed by the commissioner of public safety's estimate of the amount of money that will be necessary to:\n(1) provide 100 percent of the nonfederal share for state agencies, local governments, and utility cooperatives that will receive federal financial assistance from FEMA during the next biennium; and\n(2) fully pay all eligible claims under chapter 12B.\n(f) Notwithstanding section 16A.28:\n(1) funds appropriated or transferred to the disaster assistance contingency account do not lapse but remain in the account until appropriated; and\n(2) funds appropriated from the disaster assistance contingency account do not lapse and are available until expended.",
	"repealed": false
}