{
	"id": "83.45",
	"url": "https://www.revisor.mn.gov/statutes/cite/83.45",
	"title": "83.45 ADVERTISING; SPECIFIC PROHIBITIONS.",
	"text": "The following devices or sales presentations, and the use of those devices or presentations are deceptive or misleading practices:\n(1) An advertisement that offers travel, accommodations, gifts, meals, or entertainment published to induce prospective purchasers to visit a subdivision or attend a sales presentation and that:\n(i) does not prominently set forth all eligibility requirements;\n(ii) describes offers of travel, accommodations, gifts, meals, or entertainment as \"prizes,\" \"awards,\" or by words of similar import or describes prospective purchasers as \"winners\" or by words of similar import;\n(iii) contains the words \"free\" or \"no obligation\" or similar terms unless the offer contained in the advertisement is unequivocally without conditions;\n(iv) states or implies that prospective purchasers have been specially selected;\n(v) does not specifically state that gifts will be provided at the time the prospective purchaser visits the subdivision or attends the sales presentation;\n(vi) does not disclose on its face page the retail market value of the travel, accommodations, gifts, meals, or entertainment provided. For purposes of this paragraph, \"retail market value\" means: the retail price the item sells for in Minnesota; or if the item is not sold in Minnesota, the retail price the item sells for in states contiguous to Minnesota; or if the item is not sold in Minnesota or in any state contiguous to this state, the retail price the item sells for anywhere in the United States;\n(vii) does not specifically and prominently disclose that the purpose of the offer of travel, accommodations, gifts, meals, or entertainment is to induce prospective purchasers to visit a subdivision or attend a sales presentation where they will be encouraged to purchase subdivided land;\n(viii) does not completely disclose rules and procedures if travel, accommodations, gifts, meals, or entertainment are offered through a \"sweepstakes,\" \"giveaway,\" or similar contest;\n(ix) does not specifically disclose the odds, as a fraction, using a common denominator, of a prospective purchaser's receiving each gift if the gift is offered through a \"sweepstakes,\" \"giveaway,\" or similar contest; or\n(x) does not clearly and prominently state that gifts may be given to persons outside the state if the advertisement is part of a national advertising campaign.\n(2) An advertisement that does not prominently disclose the name, address, and phone number of the subdivider on whose behalf the advertisement is distributed.\n(3) An advertisement prepared on the stationery of a person other than the subdivider which creates a likelihood of confusion, misunderstanding, or deception.",
	"repealed": false
}