{
	"id": "103D.221",
	"url": "https://www.revisor.mn.gov/statutes/cite/103D.221",
	"title": "103D.221 ESTABLISHMENT HEARING; NOTICE.",
	"text": "(a) After receiving an establishment petition, the board must determine whether the establishment petition has the requisite number of petitioner signatures.\n(b) If the establishment petition does not have the requisite number of petitioners, the board must dismiss the establishment petition and return it to the petitioners with an explanation of why the petition was dismissed.\n(c) If the board determines that an establishment petition has the requisite number of petitioner signatures, the board must, by order, set a time and location for a hearing on the establishment petition within 35 days after its determination. The hearing must be held within the limits of the proposed watershed district for an establishment hearing unless the board determines a suitable place is not located within the proposed watershed district and selects a place within the limits of a county affected by the proposed watershed district.\n(a) The board must give notice of the establishment hearing by publication in a legal newspaper that is published in counties affected by the proposed watershed district. The last publication must occur at least ten days before the establishment hearing.\n(b) The board must give notice of the establishment hearing by mail to the auditors of counties and to the chief executive officials of municipalities affected by the proposed watershed district.\n(c) The notice must include:\n(1) a statement that an establishment petition has been filed with the board and auditors of counties affected by the proposed watershed district;\n(2) a general description of the need for the proposed district, and the purpose of the proposed watershed district's contemplated improvements, if any;\n(3) a general description of the property to be included in the proposed watershed district;\n(4) the date, time, and location of hearing; and\n(5) a statement that all persons affected or interested in the establishment of the proposed watershed district may attend and give statements at the establishment hearing.",
	"repealed": false
}