{
	"id": "115A.1316",
	"url": "https://www.revisor.mn.gov/statutes/cite/115A.1316",
	"title": "115A.1316 REPORTING REQUIREMENTS.",
	"text": "(a) By March 1 each year, each manufacturer must report to the agency using the form prescribed:\n(1) the total weight of each specific model of its video display devices sold to households during the previous calendar year; and\n(2) either:\n(i) the total weight of its video display devices sold to households during the previous calendar year; or\n(ii) an estimate of the total weight of its video display devices sold to households during the previous calendar year, calculated by multiplying the weight of its video display devices sold nationally times the quotient of Minnesota's population divided by the national population. All manufacturers with sales of 99 or fewer video display devices to households in the state during the previous calendar year must report using the method under this item for calculating sales.\nA manufacturer must submit with the report required under this paragraph a description of how the information or estimate was calculated.\n(b) By August 15 each year, each manufacturer must report to the agency:\n(1) the total weight of covered electronic devices the manufacturer collected from households and recycled or arranged to have collected and recycled during the preceding program year;\n(2) the number of phase I and phase II recycling credits the manufacturer has purchased and sold during the preceding program year;\n(3) the number of phase I and phase II recycling credits possessed by the manufacturer that the manufacturer elects to use in the calculation of its variable recycling fee under section 115A.1314, subdivision 1; and\n(4) the number of phase I and phase II recycling credits the manufacturer retains at the beginning of the current program year.\n(c) Upon request of the commissioner of revenue, the agency shall provide a copy of each report to the commissioner of revenue.\n(a) By July 15 each year, a recycler of covered electronic devices must report to the agency:\n(1) the total weight of covered electronic devices recycled during the preceding program year and must certify that the recycler has complied with section 115A.1318, subdivision 2;\n(2) the weight of video display devices recycled as part of covered electronic devices recycled during the previous program year; and\n(3) an estimate of the weight of portable batteries and any mercury-containing lamps that are associated with the covered electronic devices managed.\n(b) Upon request of the commissioner of revenue, the agency shall provide a copy of each report to the commissioner of revenue.\nBy July 15 each year, a collector must report separately to the agency using the form prescribed by the commissioner:\n(1) the total pounds of covered electronic devices collected in the state;\n(2) a list of all recyclers to whom collectors delivered covered electronic devices; and\n(3) whether the collector had a contract with a recycler or manufacturer to provide pounds toward meeting a manufacturer's obligation.",
	"repealed": false
}