{
	"id": "273.1385",
	"url": "https://www.revisor.mn.gov/statutes/cite/273.1385",
	"title": "273.1385 AID FOR PUBLIC EMPLOYEES RETIREMENT ASSOCIATION EMPLOYER CONTRIBUTION RATE INCREASE.",
	"text": "Beginning with the December 26, 1997, payment, and according to the schedule for payment of local aid under section 477A.015 thereafter, the commissioner of revenue shall pay to each city, county, town, and other nonschool jurisdiction an amount equal to 0.35 percent of the fiscal year 1997 payroll for employees who were members of the general plan of the Public Employees Retirement Association. Except for the December 1997 distribution under this section, the amount of aid must be certified before September 1 of the year preceding the distribution year to the affected local government. The executive director of the Public Employees Retirement Association shall certify the general plan fiscal year covered payroll and other information requested by the commissioner of revenue, on or before August 1, 1997, and in subsequent years where necessary, in order to facilitate administration of this section. The amount necessary to make these aid payments is appropriated annually from the general fund to the commissioner of revenue. Expenditures under this section are estimated to be $7,942,500 in fiscal year 1998, and $15,885,000 in each subsequent fiscal year, less any future reductions under subdivision 2.\n(a) The aid amount received by any jurisdiction in fiscal year 2000 or any year thereafter may not exceed the amount it received in fiscal year 1999. The commissioner may, from time to time, request the most recent fiscal year payroll information by jurisdiction to be certified by the executive director of the Public Employees Retirement Association. For any jurisdiction where newly certified public employees retirement association general plan payroll is significantly lower than the fiscal 1997 amount, as determined by the commissioner, the commissioner shall recalculate the aid amount based on the most recent fiscal year payroll information, certify the recalculated aid amount for the next distribution year, and permanently reduce the aid amount to that jurisdiction.\n(b) Aid to a jurisdiction must not be reduced under this section due to a transfer of an employee from the general plan of the Public Employees Retirement Association to the local government correctional service plan administered by the Public Employees Retirement Association. The executive director of the Public Employees Retirement Association must provide the commissioner of revenue with any information requested by the commissioner to administer this paragraph.\nThe commissioner of revenue may adjust the aid amounts for separate jurisdictions to account for significant changes in boundaries or in the form of government, as determined by the commissioner. If a local government function and the associated Public Employees Retirement Association general plan payroll is assumed by either the state, or a nonpublic organization, the aid amounts attributable to the function under this section must terminate.\nThe aid provided under this section terminates on June 30, 2020.",
	"repealed": false
}