{
	"id": "120B.302",
	"url": "https://www.revisor.mn.gov/statutes/cite/120B.302",
	"title": "120B.302 GENERAL REQUIREMENTS; TEST DESIGN.",
	"text": "For purposes of conforming with existing federal educational accountability requirements, the commissioner must develop and implement computer-adaptive reading and mathematics assessments for grades 3 through 8, state-developed high school reading and mathematics tests aligned with state academic standards, a high school writing test aligned with state standards when it becomes available, and science assessments that districts and sites must use to monitor student growth toward achieving those standards. The commissioner must:\n(1) not develop statewide assessments for academic standards in social studies, health and physical education, and the arts; and\n(2) require annual science assessments in one grade in the grades 3 through 5 span, the grades 6 through 8 span, and a life sciences assessment in the grades 9 through 12 span, and the commissioner must not require students to achieve a passing score on high school science assessments as a condition of receiving a high school diploma.\nThe commissioner, with advice from experts with appropriate technical qualifications and experience and stakeholders, must include state-developed tests in the comprehensive assessment system. State-developed tests administered to all students in a subject other than writing must include multiple choice questions.\n(a) The state assessment system must be aligned to the most recent revision of academic standards.\n(b) The commissioner must ensure that all state tests administered to elementary and secondary students measure students' academic knowledge and skills and not students' values, attitudes, and beliefs.\nA school, school district, and charter school must administer statewide assessments under this section as the assessments become available to evaluate student progress toward career and college readiness in the context of the state's academic standards. A school, school district, or charter school may use a student's performance on a statewide assessment as one of multiple criteria to determine grade promotion or retention. A school, school district, or charter school may use a high school student's performance on a statewide assessment as a percentage of the student's final grade in a course or place a student's assessment score on the student's transcript.",
	"repealed": false
}