{
	"id": "47.206",
	"url": "https://www.revisor.mn.gov/statutes/cite/47.206",
	"title": "47.206 INTEREST RATE OR DISCOUNT POINT AGREEMENTS.",
	"text": "For the purposes of this section, the terms defined in this subdivision have the meanings given them.\n(a) \"Lender\" means a person or entity referred to in section 47.20, subdivision 1, a credit union, or a person making a conventional loan as defined under section 47.20, subdivision 2, clause (3), or cooperative apartment loan as defined under section 47.20, subdivision 2, clause (4), except that conventional loans or cooperative apartment loans include any loan or advance of credit in an original principal balance of less than $200,000. \"Lender\" also means a mortgage broker as defined in paragraph (e).\n(b) \"Loan\" means loans and advances of credit authorized under section 47.20, subdivision 1, clauses (1) to (4), and conventional loans as defined under section 47.20, subdivision 2, clause (3), or cooperative apartment loans as defined under section 47.20, subdivision 2, clause (4), except that conventional loans or cooperative apartment loans also include all loans and advances of credit in an original principal balance of less than $200,000. \"Loan\" does not include a loan or advance of credit secured by a mortgage upon real property containing more than one residential unit or secured by a security interest in shares of more than one residential unit in a building owned or leased by a cooperative apartment corporation.\n(c) \"Borrower\" means a natural person who has submitted an application for a loan to a lender.\n(d) \"Interest rate or discount point agreement\" or \"agreement\" means a contract between a lender and a borrower under which the lender agrees, subject to the lender's underwriting and approval requirements, to make a loan at a specified interest rate or number of discount points, or both, and the borrower agrees to make a loan on those terms. The term also includes an offer by a lender that is accepted by a borrower under which the lender promises to guarantee or lock in an interest rate or number of discount points, or both, for a specific period of time.\n(e) \"Mortgage broker\" includes:\n(1) a person who performs or offers to perform the activities of \"mortgage brokering\" or \"soliciting, placing, or negotiating a residential mortgage loan\" as defined by chapter 58; or\n(2) the employees of a person described in clause (1).\nA lender offering borrowers the opportunity to enter into an agreement in advance of closing shall disclose, in writing, to the borrowers at the time the offer is made: (1) a definite expiration date or term of the agreement, which may not be less than the reasonably anticipated closing date or time required to process, approve, and close the loan; (2) the circumstances, if any, under which the borrower will be permitted to close at a lower rate of interest or points than expressed in the agreement; (3) the steps required to process, approve, and close the loan, including the actions required of the borrower and lender; (4) that the agreement is enforceable by the borrower; and (5) the consideration required for the agreement.\nA borrower or lender may not maintain an action on an agreement unless the agreement is in writing or is permitted by subdivision 4, expresses consideration, sets forth the relevant terms and conditions, and is signed by the borrower and the lender.\nA lender may not offer or induce a borrower to accept an oral agreement and a borrower may not be permitted to orally accept an agreement, provided that if the borrower and lender have not executed a written agreement, this subdivision does not prohibit the offer and acceptance of an oral agreement which is offered and accepted during a period no greater than ten days before closing.\nAn oral or written statement of current loan terms and conditions, including interest rates and number of discount points, is not an offer or an inducement by a lender to enter into an agreement. A written statement of current loan terms and conditions must be accompanied by a disclaimer that the statement is not an offer to enter into an agreement and that an offer may only be made pursuant to subdivisions 3 and 4.\nA person, including a lender, may not advise, encourage, or induce a borrower or third party to misrepresent information that is the subject of a loan application or to violate the terms of the agreement. Neither a mortgage lender nor a mortgage broker shall advertise mortgage terms, including interest rate and discount points, which were not available from the lender or broker on the date or dates specified in the advertisement. For purposes of this section, \"advertisement\" shall include a list or sampler of mortgage terms compiled from information provided by the lender or broker, with or without charge to the lender or broker, by a newspaper, and shall also include advertising on the Internet.\n(a) Except as provided in paragraph (c), a lender who violates this section or who causes unreasonable delay in processing a loan application beyond the expiration date of the agreement is liable to the borrower for a penalty in an amount not to exceed the borrower's actual out-of-pocket damages, including the present value of the increased interest costs over the normal life of the loan, or specific performance of the agreement. This paragraph applies to an agreement entered into after January 1, 1987.\n(b) In addition to the penalty in paragraph (a), a lender is liable to the borrower for $500 for each violation of this section or for unreasonable delay in processing a loan application which causes the agreement to expire before closing.\n(c) A lender who violates subdivision 4 is jointly and severally liable to the borrower for specific performance of the agreement or for a penalty in the amount of $500 or an amount not to exceed the borrower's actual out-of-pocket damages, including the present value of the increased costs over the normal life of the loan, whichever is greater, due to the good faith reliance of the borrower on the lender's oral representation.\n(d) For purposes of this subdivision, evidence of unreasonable delay includes, but is not limited to:\n(1) failure of the lender to return telephone calls or otherwise respond to the borrower's inquiries concerning the status of the loan;\n(2) the addition by the lender of new requirements for processing or approving the loan that were not disclosed to the borrower under subdivision 2, clause (3), unless the requirements result from governmental agency or secondary mortgage market changes, other than changes in interest rates, that occur after the date of the agreement; or\n(3) failure by the lender to take actions necessary to process or approve the loan within a reasonable period of time, if the borrower provided information requested by the lender in a timely manner.",
	"repealed": false
}