{
	"id": "103C.601",
	"url": "https://www.revisor.mn.gov/statutes/cite/103C.601",
	"title": "103C.601 WORKS OF IMPROVEMENT.",
	"text": "(a) The district board may, if directed by resolution of the boards of commissioners from the counties where the district is located undertake, construct, install, maintain, and operate works of improvement for a district purpose. The district board may:\n(1) use the proceeds of tax levies, assessments, and other available funds for the works of improvement;\n(2) acquire necessary real or personal property by purchase or gift for the works of improvement;\n(3) contract, survey, plan, construct, install, maintain, and operate the works of improvement; and\n(4) exercise other authorized powers.\n(b) Two or more district boards may jointly exercise the powers granted by this section.\nA program for works of improvement in any area within one or more districts may be initiated upon written request for a project submitted to the district board by one or more of the owners of land in the affected area. The request must include:\n(1) a general description of the area proposed for inclusion in an improvement work unit, with a proposed name or number for the project;\n(2) a description of the affected land owned by the signers; and\n(3) a statement of the objectives of the proposed works in furtherance of the authorized purposes, the grounds upon which the project will be of public benefit and utility and promote the public health, safety, and welfare, and special benefits to property that will result from the project.\nAs soon as practicable after receipt of the request the district board shall have necessary preliminary surveys and studies conducted.\n(a) The district board may, by resolution, recommend the establishment of an improvement work unit and a program for works of improvement in the work unit to the boards of county commissioners of the counties where the affected land is located if the district board determines the proposed works of improvement:\n(1) are feasible;\n(2) will be of public utility and benefit;\n(3) will promote the public health, safety, and welfare; and\n(4) will further the authorized purposes and best interests of the district.\n(b) The district board shall by resolution give the improvement work unit an appropriate name or number, which may be different from the one proposed in the initial project request.\n(c) The resolution shall recommend definite boundaries for the improvement work unit, which may be those proposed in the request or modified as the district board deems advisable.\n(d) In the resolution the district board may also enlarge, reduce, or otherwise modify the proposed objectives of the program, but not make a substantial change in its main purposes as stated in the initial project request unless consented to in writing by the signers of the request.\n(e) At any time before further action is taken on the project as provided in section 103C.605 the district board may amend the resolution, subject to the foregoing limitations.\n(a) After adoption of the resolution recommending the improvement work unit and program under subdivision 4, the district board after being directed by resolution of the affected boards of county commissioners may have further surveys and studies made as necessary.\n(b) The district board may then have a preliminary general plan with cost estimates made to implement the program for the improvement work unit or part of the work unit.\n(a) The district board, at the direction of the affected county boards, may apply for federal aid, state aid, or aid available from other sources for the works of improvement in the program or part of the works of improvement under federal or state law.\n(b) The district board may take the steps necessary to determine whether aid will be available and the amount of the aid. The district board may consider how the cost of the works not expected to be paid by federal or other aid may be met from funds of the district or from the proceeds of assessments on benefited property or otherwise, and the district board may make estimates of the amounts and sources.\nIf the cooperation or joint action of an adjacent district or other public agency is desirable for the program, the district board, at the direction of the affected county boards, may negotiate with the authorities concerned for cooperation or joint action.\n(a) After completion of the requirements in subdivisions 1 to 7, the district board may make and file a recommendation report, summarizing findings and recommendations for further action on all or part of the program and containing substantially the engineering information required by section 103D.711, subdivisions 1 to 3.\n(b) The district board shall make the recommendation report and the preliminary general plan for the improvement work unit available to the affected county boards and to all other public agencies and concerned persons, and may provide other publicity that it deems advisable. The district board shall transmit a copy of the recommendation report and preliminary general plan to regional development agencies where the project is located. If the preliminary general plan involves a project for which a water-use permit or public-waters-work permit is required from the commissioner of natural resources under chapter 103G, or for which proceedings will be instituted under chapter 103E, the district board shall transmit the recommendation report and plan to the commissioner of natural resources and to the state board.\n(a) The state board shall review the recommendation report and preliminary general plan and, if the state board concludes that the plan is inconsistent with systematic administration of state water policy, the state board shall report the conclusion to the district board and the commissioner of natural resources within 60 days after receiving the recommendation report and preliminary general plan.\n(b) The district board may modify and retransmit the recommendation report and preliminary general plan to the state board, or request a hearing on the recommendation report and preliminary general plan. The state board shall hear the matter in the manner and following the procedures provided in sections 103A.321 to 103A.341, for the hearing of cases when the state board consents to intervention proceedings.\n(c) Unless the state board concludes that the report and plan are inconsistent with state water policy, the district board, with the approval of the county boards, may adopt and sponsor the improvement work unit and a program of work for the unit.",
	"repealed": false
}