{
	"id": "116C.04",
	"url": "https://www.revisor.mn.gov/statutes/cite/116C.04",
	"title": "116C.04 POWERS AND DUTIES.",
	"text": "The powers and duties of the Minnesota Environmental Quality Board shall be as provided in this section and as otherwise provided by law or executive order. Actions of the board shall be taken only at an open meeting upon a majority vote of all the permanent members of the board.\n(a) The board shall determine which environmental problems of interdepartmental concern to state government shall be considered by the board. The board shall initiate interdepartmental investigations into those matters that it determines are in need of study. Topics for investigation may include but need not be limited to air and water resources and quality, solid waste management, transportation and utility corridors, energy policy and need, and planning.\n(b) The board shall review programs of state agencies that significantly affect the environment and coordinate those it determines are interdepartmental in nature, and ensure agency compliance with state environmental policy.\n(c) The board may review environmental rules and criteria for granting and denying permits by state agencies and may resolve conflicts involving state agencies with regard to programs, rules, permits and procedures significantly affecting the environment, provided that such resolution of conflicts is consistent with state environmental policy.\n[Repealed, 2017 c 93 art 2 s 166]\nThe board may establish interdepartmental or citizen task forces or subcommittees to study particular problems.\n[Repealed, 1984 c 558 art 2 s 4]\n[Repealed, 1984 c 558 art 2 s 4]\nAt its discretion, the board shall convene an annual Environmental Quality Board congress including, but not limited to, representatives of state, federal and regional agencies, citizen organizations, associations, industries, colleges and universities, and private enterprises who are active in or have a major impact on environmental quality. The purpose of the congress shall be to receive reports and exchange information on progress and activities related to environmental improvement.\n[Repealed, 1982 c 524 s 9]\n[Repealed, 1982 c 524 s 9]\nThe board may enter into and enforce stipulation agreements made to enforce statutes and rules administered by the board.\nThe Environmental Quality Board shall coordinate the implementation of an interagency compliance with existing state and federal lead regulations and report to the legislature by January 31, 1992, on the changes in programs needed to comply.",
	"repealed": false
}