{
	"id": "174.02",
	"url": "https://www.revisor.mn.gov/statutes/cite/174.02",
	"title": "174.02 COMMISSIONER'S POWERS AND DUTIES.",
	"text": "The department shall be supervised and controlled by the commissioner of transportation, who shall be appointed by the governor and serve under the provisions of section 15.06.\nIt is part of the department's mission that within the department's resources the commissioner shall endeavor to:\n(1) prevent the waste or unnecessary spending of public money;\n(2) use innovative fiscal and human resource practices to manage the state's resources and operate the department as efficiently as possible;\n(3) minimize the degradation of air, water quality, and the climate, including reduction in greenhouse gas emissions;\n(4) coordinate the department's activities wherever appropriate with the activities of other governmental agencies;\n(5) use technology where appropriate to increase agency productivity, improve customer service, increase public access to information about government, and increase public participation in the business of government;\n(6) utilize constructive and cooperative labor-management practices to the extent otherwise required by chapters 43A and 179A;\n(7) ensure that the safety, maintenance, and preservation of Minnesota's transportation infrastructure is a primary priority;\n(8) report to the legislature on the performance of agency operations and the accomplishment of agency goals in the agency's biennial budget according to section 16A.10, subdivision 1; and\n(9) recommend to the legislature appropriate changes in law necessary to carry out the mission and improve the performance of the department.\nThe commissioner may establish four positions in the unclassified service at the deputy and assistant commissioner, assistant to commissioner or personal secretary levels. No more than two of these positions shall be at the deputy commissioner level.\n(a) The commissioner shall appoint a person to the position of transportation ombudsperson. The transportation ombudsperson reports directly to the commissioner. The ombudsperson must be selected without regard to political affiliation and must be qualified to perform the duties specified in this subdivision.\n(b) Powers and duties of the transportation ombudsperson include, but are not limited to:\n(1) providing a neutral, independent resource for dispute and issue resolution between the department and the general public where another mechanism or forum is not available;\n(2) gathering information about decisions, acts, and other matters of the department;\n(3) providing information to the general public;\n(4) facilitating discussions or arranging mediation when appropriate; and\n(5) maintaining and monitoring performance measures for the ombudsperson program.\n(c) The transportation ombudsperson may not hold another formal position within the department. The transportation ombudsperson may not impose a complaint fee.\n(a) The commissioner shall organize the department in a manner recognizing the administrative and staffing needs of all modes of transportation within the commissioner's jurisdiction, and shall employ personnel as the commissioner deems necessary to discharge the functions of the department.\n(b) The commissioner shall adopt an affirmative action plan for the department in order to insure that department hiring encourages the selection of members of groups of persons who because of unfair or unlawful discriminatory practices have in the past been denied equal employment opportunity. This plan need not be promulgated as a rule, but it shall be approved by the commissioner of management and budget. The plan shall provide that the affected groups of persons shall constitute at least the same proportional number of employees in the department as they constitute in the total employment in state government; provided that this limitation shall expire in respect to an affected group when the commissioner of management and budget certifies that members of that affected group are employed in the department in the same proportion as they constitute in the total employment in state government.\nThe commissioner may appear as a party on behalf of the public in any proceeding or matter before the Surface Transportation Board or any other agency or instrumentality of government that regulates public services or rates relating to transportation or other matters related to the powers and responsibilities of the commissioner as prescribed by law. The commissioner shall appear as a party on behalf of the public in proceedings as provided by law on matters that directly relate to the powers and duties of the commissioner or substantially affect the statewide transportation plan.\nTo facilitate the development of a unified and coordinated intrastate and interstate transportation system:\n(1) the commissioner shall maintain close liaison, coordination, and cooperation with the private sectors of transportation, the Upper Great Lakes Seaway Development Commission Corporation, and any multistate organization involved in transportation issues affecting the state;\n(2) the commissioner shall participate in the planning, regulation, and development of the port authorities of the state;\n(3) the commissioner or the commissioner's designee is a nonvoting member of the Metropolitan Airports Commission, as organized and established under sections 473.601 to 473.679;\n(4) the commissioner shall cooperate with all federal agencies for the purpose of harmonizing state rules and federal regulations within the state to the extent and in the manner deemed advisable;\n(5) the commissioner may conduct joint hearings with any federal agency within or outside the state and, to the extent allowed under federal law or regulation, may approve and establish freight rates and charges that depart from the distance principle required by any state law; and\n(6) the commissioner may nominate members to any joint board as provided by federal acts.\n(a) To facilitate the implementation of intergovernmental efficiencies, effectiveness, and cooperation, and to promote and encourage economic and technological development in transportation matters within and between governmental and nongovernmental entities, the commissioner may enter into agreements with other governmental or nongovernmental entities for research and experimentation; for sharing facilities, equipment, staff, data, or other means of providing transportation-related services; or for other cooperative programs that promote efficiencies in providing governmental services or that further development of innovation in transportation for the benefit of the citizens of Minnesota.\n(b) In addition to funds otherwise appropriated by the legislature, the commissioner may accept and spend funds received under any agreement authorized in paragraph (a) for the purposes set forth in that paragraph.\n(c) Funds received under this subdivision must be deposited in the special revenue fund and are appropriated to the commissioner for the purposes set forth in this subdivision.\n[Repealed, 2014 c 227 art 1 s 23]\nNotwithstanding section 3.195, subdivision 1, any legislative report required to be submitted by the commissioner may be submitted electronically.\n(a) The commissioner may select one pilot transportation project on the trunk highway system to implement the authority granted in this subdivision. In connection with the pilot project, the commissioner may enter into agreements with governmental or nongovernmental entities, including private and nonprofit entities, to finance or invest in the transportation project, including repayment agreements. An agreement under this subdivision is subject to (1) the availability of state money or other dedicated revenue or resources; and (2) the approval of the commissioner of management and budget.\n(b) The commissioner shall submit to the chairs and ranking minority members of the house of representatives and senate committees having jurisdiction over transportation policy and finance a report detailing agreements executed under this subdivision. The listing must identify each agreement, the contracting entities, the contract amounts and duration, and any repayment requirements. The listing may be submitted electronically, and is subject to section 3.195, subdivision 1.\n(c) The pilot project is subject to transportation planning, programming, and procurement requirements. Use of this subdivision must not result in the delay of any project programmed in the statewide transportation improvement program.\n(d) This subdivision does not preempt any other statute or provide new toll facility authority or design-build contracting authority.\n(e) Any repayment agreement under this subdivision must comply with all applicable debt and other financial policies and requirements.\nThe commissioner of transportation may bill operations units of the department for costs of centrally managed products or services that benefit multiple operations units. These costs may include equipment acquisition and rental, labor, materials, and other costs determined by the commissioner. Receipts must be credited to the special products and services account, which is established in the trunk highway fund, and are appropriated to the commissioner to pay the costs for which the billings are made.\nThe commissioner must establish a Tribal worksite training program for state-funded construction projects. The commissioner may enter into an agreement with any private, public, or Tribal entity for the planning, designing, developing, and hosting of the program. The commissioner must not use trunk highway funds for the worksite training program if the state-funded construction project is not a highway construction project.",
	"repealed": false
}