{
	"id": "124E.10",
	"url": "https://www.revisor.mn.gov/statutes/cite/124E.10",
	"title": "124E.10 CHARTER CONTRACT.",
	"text": "(a) To authorize a charter school, the authorizer and the charter school board of directors must sign a written contract within 45 business days of the commissioner's approval of the authorizer's affidavit. The authorizer shall submit a copy of the charter contract to the commissioner within ten business days after the contract is signed by the contracting parties. The contract must include at least the following:\n(1) a declaration that the charter school will carry out the primary purpose in section 124E.01, subdivision 1, and indicate how the school will report its implementation of the primary purpose to its authorizer;\n(2) a declaration of the additional purpose or purposes in section 124E.01, subdivision 1, that the school intends to carry out and indicate how the school will report its implementation of those purposes to its authorizer;\n(3) a description of the school program and the specific academic and nonacademic outcomes that pupils must achieve;\n(4) a statement of the school's admission policies and procedures;\n(5) a school governance, management, and administration plan;\n(6) signed agreements from charter school board members to comply with the federal and state laws governing organizational, programmatic, and financial requirements applicable to charter schools;\n(7) the criteria, processes, and procedures the authorizer will use to monitor and evaluate the fiscal, operational, and academic performance, consistent with subdivision 3, paragraphs (a) and (b);\n(8) for contract renewal, the formal written performance evaluation that is a prerequisite for reviewing a charter contract under subdivision 3;\n(9) types and amounts of insurance liability coverage the charter school must obtain, consistent with section 124E.03, subdivision 2, paragraph (d);\n(10) consistent with section 124E.09, paragraph (d), a provision to indemnify and hold harmless from any suit, claim, or liability arising from any charter school operation:\n(i) the authorizer and its officers, agents, and employees; and\n(ii) notwithstanding section 3.736, the commissioner and department officers, agents, and employees;\n(11) the term of the contract, which, for an initial contract, may be up to five years plus a preoperational planning period, or for a renewed contract or a contract with a new authorizer after a transfer of authorizers, may be up to five years, if warranted by the school's academic, financial, and operational performance;\n(12) how the charter school board of directors or the charter school operators will provide special instruction and services for children with a disability under sections 125A.03 to 125A.24, and 125A.65, and a description of the financial parameters within which the charter school will provide the special instruction and services to children with a disability;\n(13) the specific conditions for contract renewal that identify the performance of all students under the primary purpose of section 124E.01, subdivision 1, as the most important factor in determining whether to renew the contract; and\n(14) the additional purposes under section 124E.01, subdivision 1, and related performance obligations under clause (7) contained in the charter contract as additional factors in determining whether to renew the contract.\n(b) In addition to the requirements of paragraph (a), the charter contract must contain the plan for an orderly closing of the school under chapter 317A, that establishes the responsibilities of the school board of directors and the authorizer, whether the closure is a termination for cause, a voluntary termination, or a nonrenewal of the contract. The plan must establish who is responsible for:\n(1) notifying the commissioner, school district in which the charter school is located, and parents of enrolled students about the closure;\n(2) providing parents of enrolled students information and assistance to enable the student to re-enroll in another school;\n(3) transferring student records under section 124E.03, subdivision 5, paragraph (b), to the student's resident school district; and\n(4) closing financial operations.\n(c) A charter school must design its programs to at least meet the outcomes adopted by the commissioner for public school students, including comprehensive achievement and civic readiness goals under section 120B.11, subdivision 1. In the absence of the commissioner's requirements governing state standards and benchmarks, the school must meet the outcomes contained in the contract with the authorizer. The achievement levels of the outcomes contained in the contract may exceed the achievement levels of any outcomes adopted by the commissioner for public school students.\n(a) A school must disclose to the commissioner any potential contract, lease, or purchase of service from the school's authorizer or a current board member, employee, contractor, volunteer, or agent of the school's authorizer. The contract, lease, or purchase must be accepted through an open bidding process and be separate from the charter contract. The school must document the open bidding process. An authorizer must not enter into a contract to provide management and financial services to a school it authorizes, unless the school documents receiving at least two competitive bids. This paragraph does not apply to a charter school or an authorizer when contracting for legal services from a lawyer that provides professional services to the charter school or authorizer and who is subject to the Minnesota Rules of Professional Conduct.\n(b) An authorizer must not condition granting or renewing a charter on:\n(1) the charter school being required to contract, lease, or purchase services from the authorizer; or\n(2) the bargaining unit status of school employees.\n(a) The authorizer shall provide a formal written evaluation of the school's performance before the authorizer renews the charter contract. The commissioner must review and comment on the authorizer's evaluation process at the time the authorizer submits its application for approval and each time the authorizer undergoes its five-year review under section 124E.05, subdivision 5.\n(b) An authorizer shall monitor and evaluate the academic, financial, operational, and student performance of the school, and may assess a charter school a fee according to paragraph (c). The agreed-upon fee structure must be stated in the charter school contract.\n(c) The fee that an authorizer may annually assess is the greater of:\n(1) the basic formula allowance for that year; or\n(2) the lesser of:\n(i) the maximum fee factor times the basic formula allowance for that year; or\n(ii) the fee factor times the basic formula allowance for that year times the charter school's adjusted pupil units for that year. The fee factor equals .015. The maximum fee factor equals 4.0.\n(d) An authorizer may not assess a fee for any required services other than as provided in this subdivision.\n(e) For the preoperational planning period, after a school is chartered, the authorizer may assess a charter school a fee equal to the basic formula allowance.\n(a) The duration of the contract with an authorizer must be for the term contained in the contract according to subdivision 1, paragraph (a). The authorizer may or may not renew a contract at the end of the term for any ground listed in paragraph (b). An authorizer may unilaterally terminate a contract during the term of the contract for any ground listed in paragraph (b). At least 60 business days before not renewing or terminating a contract, the authorizer shall notify the board of directors of the charter school of the proposed action in writing. The notice shall state the grounds for the proposed action in reasonable detail and describe the informal hearing process, consistent with this paragraph. The charter school's board of directors may request in writing an informal hearing before the authorizer within 15 business days after receiving notice of nonrenewal or termination of the contract. Failure by the board of directors to make a written request for an informal hearing within the 15-business-day period shall be treated as acquiescence to the proposed action. Upon receiving a timely written request for a hearing, the authorizer shall give ten business days' notice to the charter school's board of directors of the hearing date. The hearing must be recorded by audio recording, video recording, or a court reporter. The authorizer must preserve the recording for three years and make the recording available to the public. The authorizer shall conduct an informal hearing before taking final action. The authorizer shall take final action to renew or not renew a contract no later than 20 business days before the proposed date for terminating the contract or the end date of the contract.\n(b) An authorizer may terminate or not renew a contract upon any of the following grounds:\n(1) failure to demonstrate satisfactory academic achievement for all students, including the requirements for pupil performance contained in the contract;\n(2) failure to meet generally accepted standards of fiscal management;\n(3) violations of law; or\n(4) other good cause shown.\nIf the authorizer terminates or does not renew a contract under this paragraph, the school must be dissolved according to the applicable provisions of chapter 317A.\n(c) The commissioner, after providing reasonable notice to the board of directors of a charter school and the existing authorizer, and after providing an opportunity for a public hearing, may terminate the existing contract between the authorizer and the charter school board if the charter school has a history of:\n(1) failure to meet pupil performance requirements, consistent with state law;\n(2) financial mismanagement or failure to meet generally accepted standards of fiscal management; or\n(3) repeated or major violations of the law.\nIf the authorizer and the board of directors of a charter school serving enrolled students mutually agree not to renew the contract, or if the governing board of an approved authorizer votes to withdraw as an approved authorizer for a reason unrelated to any cause under subdivision 4, a change in authorizers is allowed. The authorizer and the school board must jointly submit a written and signed letter of their intent to the commissioner to mutually not renew the contract. The authorizer that is a party to the existing contract must inform the proposed authorizer about the fiscal, operational, and student performance status of the school, including unmet contract outcomes and other outstanding contractual obligations. The charter contract between the proposed authorizer and the school must identify and provide a plan to address any outstanding obligations from the previous contract. The proposed authorizer must submit the proposed contract at least 105 business days before the end of the existing charter contract. The commissioner has 30 business days to review and make a determination on the change in authorizer. The proposed authorizer and the school have 15 business days to respond to the determination and address any issues identified by the commissioner. The commissioner must make a final determination no later than 45 business days before the end of the current charter contract. If the commissioner does not approve a change in authorizer, the school and the current authorizer may withdraw their letter of nonrenewal and enter into a new contract. If the commissioner does not approve a change in authorizer and the current authorizer and the school do not withdraw their letter and enter into a new contract, the school must be dissolved according to applicable law and the terms of the contract.\n(a) If a contract is not renewed or is terminated according to subdivision 4 or 5, a pupil who attended the school, siblings of the pupil, or another pupil who resides with the pupil may enroll in the resident district or may submit an application to a nonresident district according to section 124D.03 governing open enrollment at any time. Applications and notices required by section 124D.03 must be processed and provided in a prompt manner. The application and notice deadlines in section 124D.03 do not apply under these circumstances.\n(b) Within ten business days of closing the charter school, the closed school must transfer the student's educational records to the student's school district of residence where the records must be retained or transferred under section 120A.22, subdivision 7.",
	"repealed": false
}