{
	"id": "287.21",
	"url": "https://www.revisor.mn.gov/statutes/cite/287.21",
	"title": "287.21 IMPOSITION OF TAX; DETERMINATION OF TAX.",
	"text": "(a) A tax is imposed on each deed or instrument by which any real property in this state is granted, assigned, transferred, or otherwise conveyed. The tax applies against the net consideration. For purposes of the tax, the conversion of a corporation to a limited liability company, a limited liability company to a corporation, a partnership to a limited partnership, a limited partnership to another limited partnership or other entity, or a similar conversion of one entity to another does not grant, assign, transfer, or convey real property.\n(b) The tax is determined in the following manner: (1) when transfers are made by instruments pursuant to (i) consolidations or mergers, or (ii) designated transfers, the tax is $1.65; (2) when there is no consideration or when the consideration, exclusive of the value of any lien or encumbrance remaining thereon at the time of sale, is $3,000 or less, the tax is $1.65; or (3) when the consideration, exclusive of the value of any lien or encumbrance remaining at the time of sale, exceeds $3,000, the tax is .0033 of the net consideration.\n(c) If, within six months from the date of a designated transfer, an ownership interest in the grantee entity is transferred by an initial owner to any person or entity with the result that the designated transfer would not have been a designated transfer if made to the grantee entity with its subsequent ownership, then a tax is imposed at .0033 of the net consideration for the designated transfer. If the subsequent transfer of ownership interests was reasonably expected at the time of the designated transfer, the applicable penalty under section 287.31, subdivision 1, must be paid. The deed tax imposed under this paragraph is due within 30 days of the subsequent transfer that caused the tax to be imposed under this paragraph. Involuntary transfers of ownership shall not be considered transfers of ownership under this paragraph. The commissioner may adopt rules defining the types of transfers to be considered involuntary.\n(d) The tax is due at the time a taxable deed or instrument is presented for recording, except as provided in paragraph (c). The commissioner may require the tax to be documented in a manner prescribed by the commissioner, and may require that the documentation be attached to and recorded as part of the deed or instrument. The county recorder or registrar of titles shall accept the attachment for recording as part of the deed or instrument and may not require, as a condition of recording a deed or instrument, evidence that a transfer is a designated transfer in addition to that required by the commissioner. Such an attachment shall not, however, provide actual or constructive notice of the information contained therein for purposes of determining any interest in the real property. The commissioner shall prescribe the manner in which the tax due under paragraph (c) is to be paid and may require grantees of designated transfers to file with the commissioner subsequent statements verifying that the tax provided under paragraph (c) does not apply.\nMS 1998 [Repealed, 1999 c 31 s 26]\nMS 1971 [Expired]\nMS 1998 [Repealed, 1999 c 31 s 26]",
	"repealed": false
}