{
	"id": "219.074",
	"url": "https://www.revisor.mn.gov/statutes/cite/219.074",
	"title": "219.074 GRADE CROSSING CHANGE, VACATION.",
	"text": "Public officials having the necessary authority and a railway company operating the railroad may agree to the vacation, relocation, consolidation, or separation of grades at grade crossings. If agreement cannot be reached concerning the location, manner of construction, or a reasonable division of expense, either party may file a petition with the commissioner, setting forth the facts and submitting the matter to it for determination. The commissioner shall then conduct a hearing under chapter 14 and shall apply the rules developed under section 219.073 in coming to a determination. The commissioner may also bring matters concerning vacation, relocation, consolidation, or separation of grades at public grade crossings to the commissioner for determination. If the commissioner determines that the vacation, relocation, consolidation, or separation is consistent with the standards adopted under section 219.073, the commissioner may order the crossing vacated, relocated, consolidated, or separated.\nAs necessary, the commissioner shall develop a list of grade crossings proposed to be vacated. The list must be developed by applying the standards set forth in the rules adopted under section 219.073. Grade crossings that are part of an abandonment, closing, or removal may not be included in the list. The commissioner shall notify the public officials having the necessary authority and the railway companies operating the railroads of the proposed vacations. Either affected party may request a hearing. If requested, the commissioner shall hold a contested case hearing applying in the commissioner's determination the rules developed under section 219.073. If after the hearing the commissioner determines that the vacation is consistent with the standards adopted under section 219.073, the commissioner may order the crossing vacated. If a request for a hearing on a particular crossing is not received within 30 days of the publication in the State Register, the commissioner shall order the crossing vacated.\nThe commissioner shall complete an inventory of all public and private grade crossings in the state and shall annually revise the inventory to reflect grade crossing changes made under this section.",
	"repealed": false
}