{
	"id": "268.051",
	"url": "https://www.revisor.mn.gov/statutes/cite/268.051",
	"title": "268.051 EMPLOYERS TAXES.",
	"text": "(a) Unemployment insurance taxes accrue and become payable by each employer for each calendar year on the taxable wages that the employer paid to employees in covered employment, except for:\n(1) nonprofit organizations that elect to make reimbursements as provided in section 268.053; and\n(2) the state of Minnesota and political subdivisions that make reimbursements, unless they elect to pay taxes as provided in section 268.052.\nEach employer must pay taxes quarterly, at the employer's assigned tax rate under subdivision 6, on the taxable wages paid to each employee. The commissioner must compute the tax due from the wage detail report required under section 268.044 and notify the employer of the tax due. The taxes must be paid to the trust fund and must be received by the department on or before the last day of the month following the end of the calendar quarter.\n(b) If for any reason the wages on the wage detail report under section 268.044 are adjusted for any quarter, the commissioner must recompute the taxes due for that quarter and assess the employer for any amount due or credit the employer as appropriate.\n(a) Every employer that reports 50 or more employees in any calendar quarter on the wage detail report required under section 268.044 must make any payments due under this chapter and section 116L.20 by electronic payment.\n(b) All third-party processors, paying on behalf of a client company, must make any payments due under this chapter and section 116L.20 by electronic payment.\n(c) Regardless of paragraph (a) or (b), the commissioner has the discretion to accept payment by other means.\n(a) For each calendar year the commissioner must compute the tax rate of each taxpaying employer that qualifies for an experience rating by adding the base tax rate to the employer's experience rating along with assigning any appropriate additional assessment under paragraph (c).\n(b) The base tax rate for the calendar year and any additional assessments under this subdivision are determined based upon the amount in the trust fund on March 31 of the prior year as a percentage of total wages paid in covered employment. The base tax rate is:\n(1) one-tenth of one percent if the trust fund is equal to or more than 0.75 percent;\n(2) two-tenths of one percent if the trust fund is less than 0.75 percent but equal to or more than 0.65 percent;\n(3) three-tenths of one percent if the trust fund is less than 0.65 percent but equal to or more than 0.55 percent;\n(4) four-tenths of one percent if the trust fund is less than 0.55 percent, but has a positive balance; or\n(5) five-tenths of one percent if the trust fund has a negative balance and is borrowing from the federal unemployment trust fund in order to pay unemployment benefits as provided for under section 268.194, subdivision 6.\n(c) In addition to the base tax rate, there is an additional assessment for the calendar year on the quarterly unemployment taxes due from every taxpaying employer if the amount in the trust fund on March 31 of the prior year is less than 0.55 percent of total wages paid in covered employment. The assessment is as follows:\n(1) a five percent assessment if the trust fund is less than 0.55 percent but equal to or more than 0.45 percent;\n(2) a ten percent assessment if the trust fund is less than 0.45 percent but equal to or more than 0.35 percent; or\n(3) a 14 percent assessment if the trust fund is less than 0.35 percent.\n(d) For the purposes of this subdivision, the trust fund does not include any money borrowed from the federal unemployment trust fund provided for in section 268.194, subdivision 6.\n(e) For the purposes of this subdivision, total wages paid in covered employment are those wages paid to all employees in covered employment during the calendar year before the March 31 date used in paragraph (b).\n(f) The base tax rate and any additional assessments are assessed on all taxpaying employers to cover a portion of the costs to the trust fund for unemployment benefits paid that do not affect any single employer's future experience rating because:\n(1) the employer's experience rating is limited by the maximum under subdivision 3, paragraph (b);\n(2) the employer has ceased doing business; or\n(3) the unemployment benefits paid have been determined not to be used in computing the employer's experience rating under section 268.047, subdivision 2 or 3.\n(a) If the balance in the trust fund on December 31 of any calendar year is four percent or more above the amount equal to an average high cost multiple of 1.0, future unemployment taxes payable must be reduced by all amounts above 1.0. The amount of tax reduction for any taxpaying employer is the same percentage of the total amount above 1.0 as the percentage of taxes paid by the employer during the calendar year is of the total amount of taxes that were paid by all employers during the year except taxes paid by employers assigned a tax rate equal to the maximum experience rating plus the applicable base tax rate.\n(b) For purposes of this subdivision, \"average high cost multiple\" has the meaning given in Code of Federal Regulations, title 20, section 606.3, as amended through December 31, 2015. An amount equal to an average high cost multiple of 1.0 is a federal measure of adequate reserves in relation to the state's current economy. The commissioner must calculate and publish, as soon as possible following December 31 of any calendar year, the trust fund balance on December 31 along with the amount an average high cost multiple of 1.0 equals. Actual wages paid must be used in the calculation and estimates may not be used.\n(c) The unemployment tax reduction under this subdivision does not apply to employers that were assigned a tax rate equal to the maximum experience rating plus the applicable base tax rate for the year. Computations under paragraph (a) are not subject to the rounding requirement of section 268.034. The refund provisions of section 268.057, subdivision 7, do not apply.\n(d) The unemployment tax reduction under this subdivision applies to taxes paid between March 1 and December 15 of the year following the December 31 computation under paragraph (a).\n(e) If there was an experience rating history transfer under subdivision 4, the successor employer must receive that portion of the predecessor employer's tax reduction equal to that portion of the experience rating history transferred. The predecessor employer retains that portion of tax reduction not transferred to the successor. This paragraph applies to that portion of the tax reduction that remains unused at the time of notice of acquisition is provided under subdivision 4, paragraph (e).\n(a) On or before each December 15, the commissioner must compute an experience rating for each taxpaying employer who has been required to file wage detail reports for the 12 calendar months ending on the prior June 30. The experience rating computed is applicable for the following calendar year.\nThe experience rating is the ratio obtained by dividing 125 percent of the total unemployment benefits required under section 268.047 to be used in computing the employer's tax rate during the 48 calendar months ending on the prior June 30, by the employer's total taxable payroll for that same period.\n(b) The experience rating is computed to the nearest one-hundredth of a percent, to a maximum of 8.90 percent.\n(c) The use of 125 percent of unemployment benefits paid under paragraph (a), rather than 100 percent of the amount of unemployment benefits paid, is done in order for the trust fund to recover from all taxpaying employers a portion of the costs of unemployment benefits paid that do not affect any individual employer's future experience rating because of the reasons set out in subdivision 2, paragraph (f).\n(a) The experience rating history of the predecessor employer is transferred to the successor employer when:\n(1) a taxpaying employer acquires all of the organization, trade or business, or workforce of another taxpaying employer; and\n(2) there is 25 percent or more common ownership or there is substantially common management or control between the predecessor and successor.\n(b) A portion of the experience rating history of the predecessor employer is transferred to the successor employer when:\n(1) a taxpaying employer acquires a portion, but less than all, of the organization, trade or business, or workforce of another taxpaying employer; and\n(2) there is 25 percent or more common ownership or there is substantially common management or control between the predecessor and successor.\nThe successor employer acquires, as of the date of acquisition, that percentage of the predecessor employer's experience rating history equal to that percentage of the employment positions it has obtained, and the predecessor employer retains that percentage of the experience rating history equal to the percentage of the employment positions it has retained.\n(c) Paragraphs (a) and (b) do not require concurrent ownership, management, or control of the predecessor and successor for there to be a transfer, or partial transfer, of the experience rating history.\n(d) The term \"common ownership\" for purposes of this subdivision includes ownership by a spouse, parent, grandparent, child, grandchild, brother, sister, aunt, uncle, niece, nephew, or first cousin, by birth or by marriage.\n(e) Each successor employer must notify the commissioner of the acquisition by electronic transmission, in a format prescribed by the commissioner, within 30 calendar days of the date of acquisition. Any successor employer that fails to notify the commissioner is subject to the penalties under section 268.184, subdivision 1a, if the successor's assigned tax rate under subdivision 2 or 5 was lower than the predecessor's assigned tax rate at the time of the acquisition. Payments made toward the penalties are credited to the trust fund.\n(f) If the successor employer under paragraphs (a) and (b) had an experience rating at the time of the acquisition, the transferred experience rating history of the predecessor is combined with the successor's experience rating history for purposes of recomputing a tax rate.\n(g) If there has been a transfer of an experience rating history under paragraph (a) or (b), employment with a predecessor employer is not considered to have been terminated if similar employment is offered by the successor employer and accepted by the employee.\n(h) The commissioner, upon notification of an employer, or upon the commissioner's own motion if the employer fails to provide the required notification, must determine if an employer is a successor within the meaning of this subdivision. The commissioner must, after determining the issue of succession or nonsuccession, recompute the tax rate under subdivision 6 of all employers affected. The commissioner must send the recomputed tax rate to all affected employers by mail or electronic transmission. Any affected employer may appeal the recomputed tax rate in accordance with the procedures in subdivision 6, paragraph (c).\n(i) The \"experience rating history\" for purposes of this subdivision and subdivision 4a means the amount of unemployment benefits paid and the taxable wages that are being used and would be used in computing the current and any future experience rating.\nFor purposes of this chapter, an \"acquisition\" means anything that results in the successor employer obtaining, in any way or manner, all, or a portion of, the organization, trade or business, or workforce of the predecessor employer.\n(j) Regardless of the ownership, management, or control requirements of paragraph (a), if there is an acquisition or merger of a publicly held corporation by or with another publicly held corporation the experience rating histories of the corporations are combined as of the date of acquisition or merger for the purpose of recomputing a tax rate.\n(a) If the commissioner determines that any action was done, in whole or in part, to avoid:\n(1) an experience rating history;\n(2) the transfer of an experience rating history; or\n(3) the assignment of a tax rate for new employers under subdivision 5, paragraph (a) or (b), the commissioner, to insure that the trust fund receives all the taxes that would have been received had the action not occurred, may, effective the date of the action, transfer all or part of an experience rating history and recompute the tax rate or assign the appropriate new employer tax rate.\n(b) This subdivision applies to any action between persons regardless of whether there is any commonality of ownership, management, or control between the persons. The authority granted to the commissioner under this subdivision is in addition to any other authority granted to the commissioner.\n(a) Each new taxpaying employer that does not qualify for an experience rating under subdivision 3 must be assigned, for the calendar year, a tax rate equal to the average experience rating for the employer's industry, plus the applicable base tax rate and any additional assessments under subdivision 2, paragraph (c). The tax rate assigned may not be less than one percent.\n(b) The employer's industry, except for construction, is determined by the first two digits of the North American Industrial Classification System (NAICS). The construction industry is determined to five digits. For each calendar year the commissioner must compute, in accordance with subdivision 3, the average industry experience rating for the employer's industry.\n(c) Regardless of any law to the contrary, a taxpaying employer must be assigned a tax rate under this subdivision if the employer had no taxable wages during the experience rating period under subdivision 3.\n(d) The commissioner must send to the new employer, by mail or electronic transmission, a determination of tax rate. An employer may appeal the determination of tax rate in accordance with subdivision 6, paragraph (c).\n(a) On or before each December 15, the commissioner must notify each employer by mail or electronic transmission of the employer's tax rate, along with any additional assessments, fees, or surcharges, for the following calendar year. The determination must contain the base tax rate and the factors used in determining the employer's experience rating. Unless an appeal of the tax rate is made, the computed tax rate is final, except for fraud or recomputation required under subdivision 4 or 4a, and is the rate at which taxes must be paid. A recomputed tax rate under subdivision 4 or 4a is the rate applicable for the quarter that includes the date of acquisition and any quarter thereafter during the calendar year in which the acquisition occurred. The tax rate is not subject to collateral attack by way of claim for a credit adjustment or refund, or otherwise.\n(b) If the legislature, after the sending of the determination of tax rate, changes any of the factors used to determine the rate, a new tax rate based on the new factors must be computed and sent to the employer.\n(c) A review of an employer's tax rate may be obtained by the employer filing an appeal within 45 calendar days from the date the determination of tax rate was sent to the employer. Proceedings on the appeal are conducted in accordance with section 268.105.\n(d) The commissioner may at any time upon the commissioner's own motion correct any error in the employer's tax rate.\n(a) Any taxpaying employer that has been assigned a tax rate based upon an experience rating, and has no amounts past due under this chapter, may, upon the payment of an amount equivalent to any portion or all of the unemployment benefits used in computing the experience rating plus a surcharge of 25 percent, obtain a cancellation of unemployment benefits used equal to the payment made, less the surcharge. The payment is applied to the most recent unemployment benefits paid that are used in computing the experience rating. Upon the payment, the commissioner must compute a new experience rating for the employer, and compute a new tax rate.\n(b) Payments for a tax rate buydown may be made only by electronic payment and must be received within 120 calendar days from the beginning of the calendar year for which the tax rate is effective.\n(a) If on October 31 of any year, the commissioner, in consultation with the commissioner of management and budget, determines that an interest payment will be due during the following calendar year on any loan from the federal unemployment trust fund under section 268.194, subdivision 6, a special assessment on taxpaying employers will be in effect for the following calendar year. The legislature authorizes the commissioner, in consultation with the commissioner of management and budget, to determine the appropriate level of the assessment, up to eight percent of the total quarterly unemployment taxes due based upon determined rates and assigned assessments under subdivision 2, that will be necessary to pay the interest due on the loan.\n(b) The special assessment must be placed into a special account from which the commissioner must pay any interest that has accrued on any loan from the federal unemployment trust fund provided for under section 268.194, subdivision 6. If, at the end of each calendar quarter, the commissioner, in consultation with the commissioner of management and budget, determines that the balance in this special account, including interest earned on the special account, is more than is necessary to pay the interest on any loan, the commissioner must immediately pay to the trust fund the amount in excess of that necessary to pay the interest on any loan.\nAny assessment, fee, or surcharge is subject to the same collection procedures that apply to past due taxes.",
	"repealed": false
}