{
	"id": "290.191",
	"url": "https://www.revisor.mn.gov/statutes/cite/290.191",
	"title": "290.191 APPORTIONMENT OF NET INCOME.",
	"text": "(a) Except as otherwise provided in section 290.17, subdivision 5, the net income from a trade or business carried on partly within and partly without this state must be apportioned to this state as provided in this section.\n(b) For purposes of this section, \"state\" means a state of the United States, the District of Columbia, the commonwealth of Puerto Rico, or any territory or possession of the United States or any foreign country.\n(a) Except for those trades or businesses required to use a different formula under subdivision 3 or section 290.36, and for those trades or businesses that receive permission to use some other method under section 290.20 or under subdivision 4, a trade or business required to apportion its net income must apportion its income to this state on the basis of the percentage obtained by taking the sum of:\n(1) the percent for the sales factor under paragraph (b) of the percentage which the sales made within this state in connection with the trade or business during the tax period are of the total sales wherever made in connection with the trade or business during the tax period;\n(2) the percent for the property factor under paragraph (b) of the percentage which the total tangible property used by the taxpayer in this state in connection with the trade or business during the tax period is of the total tangible property, wherever located, used by the taxpayer in connection with the trade or business during the tax period; and\n(3) the percent for the payroll factor under paragraph (b) of the percentage which the taxpayer's total payrolls paid or incurred in this state or paid in respect to labor performed in this state in connection with the trade or business during the tax period are of the taxpayer's total payrolls paid or incurred in connection with the trade or business during the tax period.\n(b) For purposes of paragraph (a) and subdivision 3, the following percentages apply for the taxable years specified:\nExcept for an investment company required to apportion its income under section 290.36, a financial institution that is required to apportion its net income must apportion its net income to this state on the basis of the percentage obtained by taking the sum of:\n(1) the percent for the sales factor under subdivision 2, paragraph (b), of the percentage which the receipts from within this state in connection with the trade or business during the tax period are of the total receipts in connection with the trade or business during the tax period, from wherever derived;\n(2) the percent for the property factor under subdivision 2, paragraph (b), of the percentage which the sum of the total tangible property used by the taxpayer in this state and the intangible property owned by the taxpayer and attributed to this state in connection with the trade or business during the tax period is of the sum of the total tangible property, wherever located, used by the taxpayer and the intangible property owned by the taxpayer and attributed to all states in connection with the trade or business during the tax period; and\n(3) the percent for the payroll factor under subdivision 2, paragraph (b), of the percentage which the taxpayer's total payrolls paid or incurred in this state or paid in respect to labor performed in this state in connection with the trade or business during the tax period are of the taxpayer's total payrolls paid or incurred in connection with the trade or business during the tax period.\n[Repealed, 2014 c 308 art 9 s 94]\nFor purposes of this section, the following rules apply in determining the sales factor.\n(a) The sales factor includes all sales, gross earnings, or receipts received in the ordinary course of the business, except that the following types of income are not included in the sales factor:\n(1) interest;\n(2) dividends;\n(3) sales of capital assets as defined in section 1221 of the Internal Revenue Code;\n(4) sales of property used in the trade or business, except sales of leased property of a type which is regularly sold as well as leased; and\n(5) sales of debt instruments as defined in section 1275(a)(1) of the Internal Revenue Code or sales of stock.\n(b) Sales of tangible personal property are made within this state if the property is received by a purchaser at a point within this state, regardless of the f.o.b. point, other conditions of the sale, or the ultimate destination of the property.\n(c) Tangible personal property delivered to a common or contract carrier or foreign vessel for delivery to a purchaser in another state or nation is a sale in that state or nation, regardless of f.o.b. point or other conditions of the sale.\n(d) Notwithstanding paragraphs (b) and (c), when intoxicating liquor, wine, fermented malt beverages, cigarettes, or tobacco products are sold to a purchaser who is licensed by a state or political subdivision to resell this property only within the state of ultimate destination, the sale is made in that state.\n(e) Sales made by or through a corporation that is qualified as a domestic international sales corporation under section 992 of the Internal Revenue Code are not considered to have been made within this state.\n(f) Sales, rents, royalties, and other income in connection with real property is attributed to the state in which the property is located.\n(g) Receipts from the lease or rental of tangible personal property, including finance leases and true leases, must be attributed to this state if the property is located in this state and to other states if the property is not located in this state. Receipts from the lease or rental of moving property including, but not limited to, motor vehicles, rolling stock, aircraft, vessels, or mobile equipment are included in the numerator of the receipts factor to the extent that the property is used in this state. The extent of the use of moving property is determined as follows:\n(1) A motor vehicle is used wholly in the state in which it is registered.\n(2) The extent that rolling stock is used in this state is determined by multiplying the receipts from the lease or rental of the rolling stock by a fraction, the numerator of which is the miles traveled within this state by the leased or rented rolling stock and the denominator of which is the total miles traveled by the leased or rented rolling stock.\n(3) The extent that an aircraft is used in this state is determined by multiplying the receipts from the lease or rental of the aircraft by a fraction, the numerator of which is the number of landings of the aircraft in this state and the denominator of which is the total number of landings of the aircraft.\n(4) The extent that a vessel, mobile equipment, or other mobile property is used in the state is determined by multiplying the receipts from the lease or rental of the property by a fraction, the numerator of which is the number of days during the taxable year the property was in this state and the denominator of which is the total days in the taxable year.\n(h) Royalties and other income received for the use of or for the privilege of using intangible property, including patents, know-how, formulas, designs, processes, patterns, copyrights, trade names, service names, franchises, licenses, contracts, customer lists, or similar items, must be attributed to the state in which the property is used by the purchaser. If the property is used in more than one state, the royalties or other income must be apportioned to this state pro rata according to the portion of use in this state. If the portion of use in this state cannot be determined, the royalties or other income must be excluded from both the numerator and the denominator. Intangible property is used in this state if the purchaser uses the intangible property or the rights therein in the regular course of its business operations in this state, regardless of the location of the purchaser's customers.\n(i) Sales of intangible property are made within the state in which the property is used by the purchaser. If the property is used in more than one state, the sales must be apportioned to this state pro rata according to the portion of use in this state. If the portion of use in this state cannot be determined, the sale must be excluded from both the numerator and the denominator of the sales factor. Intangible property is used in this state if the purchaser used the intangible property in the regular course of its business operations in this state.\n(j) Receipts from the performance of services must be attributed to the state where the services are received. For the purposes of this section, receipts from the performance of services provided to a corporation, partnership, or trust may only be attributed to a state where it has a fixed place of doing business. If the state where the services are received is not readily determinable or is a state where the corporation, partnership, or trust receiving the service does not have a fixed place of doing business, the services shall be deemed to be received at the location of the office of the customer from which the services were ordered in the regular course of the customer's trade or business. If the ordering office cannot be determined, the services shall be deemed to be received at the office of the customer to which the services are billed.\n(k) For the purposes of this subdivision and subdivision 6, paragraph (l), receipts from management, distribution, or administrative services performed by a person or corporation for a fund of a person or corporation regulated under United States Code, title 15, chapter 2D, subchapter I, must be attributed to the state where the shareholder of the fund resides. Under this paragraph, receipts for services attributed to shareholders are determined on the basis of the ratio of: (1) the average of the outstanding shares in the fund owned by shareholders residing within Minnesota at the beginning and end of each year; and (2) the average of the total number of outstanding shares in the fund at the beginning and end of each year. Residence of the shareholder, in the case of an individual, is determined by the mailing address furnished by the shareholder to the fund. Residence of the shareholder, when the shares are held by an insurance company as a depositor for the insurance company policyholders, is the mailing address of the policyholders. In the case of an insurance company holding the shares as a depositor for the insurance company policyholders, if the mailing address of the policyholders cannot be determined by the taxpayer, the receipts must be excluded from both the numerator and denominator. Residence of other shareholders is the mailing address of the shareholder.\n(a) For purposes of this section, the rules in this subdivision and subdivisions 5, paragraph (k), and 8 apply in determining the receipts factor for financial institutions.\n(b) \"Receipts\" for this purpose means gross income, including net taxable gain on disposition of assets, including securities and money market instruments, when derived from transactions and activities in the regular course of the taxpayer's trade or business.\n(c) \"Money market instruments\" means federal funds sold and securities purchased under agreements to resell, commercial paper, banker's acceptances, and purchased certificates of deposit and similar instruments to the extent that the instruments are reflected as assets under generally accepted accounting principles.\n(d) \"Securities\" means United States Treasury securities, obligations of United States government agencies and corporations, obligations of state and political subdivisions, corporate stock, bonds, and other securities, participations in securities backed by mortgages held by United States or state government agencies, loan-backed securities and similar investments to the extent the investments are reflected as assets under generally accepted accounting principles.\n(e) Receipts from the lease or rental of real or tangible personal property, including both finance leases and true leases, must be attributed to this state if the property is located in this state. Receipts from the lease or rental of tangible personal property that is characteristically moving property, including, but not limited to, motor vehicles, rolling stock, aircraft, vessels, or mobile equipment are included in the numerator of the receipts factor to the extent that the property is used in this state. The extent of the use of moving property is determined as follows:\n(1) A motor vehicle is used wholly in the state in which it is registered.\n(2) The extent that rolling stock is used in this state is determined by multiplying the receipts from the lease or rental of the rolling stock by a fraction, the numerator of which is the miles traveled within this state by the leased or rented rolling stock and the denominator of which is the total miles traveled by the leased or rented rolling stock.\n(3) The extent that an aircraft is used in this state is determined by multiplying the receipts from the lease or rental of the aircraft by a fraction, the numerator of which is the number of landings of the aircraft in this state and the denominator of which is the total number of landings of the aircraft.\n(4) The extent that a vessel, mobile equipment, or other mobile property is used in the state is determined by multiplying the receipts from the lease or rental of property by a fraction, the numerator of which is the number of days during the taxable year the property was in this state and the denominator of which is the total days in the taxable year.\n(f) Interest income and other receipts from assets in the nature of loans that are secured primarily by real estate or tangible personal property must be attributed to this state if the security property is located in this state under the principles stated in paragraph (e).\n(g) Interest income and other receipts from consumer loans not secured by real or tangible personal property that are made to residents of this state, whether at a place of business, by traveling loan officer, by mail, by telephone or other electronic means, must be attributed to this state.\n(h) Interest income and other receipts from commercial loans and installment obligations that are unsecured by real or tangible personal property or secured by intangible property must be attributed to this state if the proceeds of the loan are to be applied in this state. If it cannot be determined where the funds are to be applied, the income and receipts are attributed to the state in which the office of the borrower from which the application would be made in the regular course of business is located. If this cannot be determined, the transaction is disregarded in the apportionment formula.\n(i) Interest income and other receipts from a participating financial institution's portion of participation and syndication loans must be attributed under paragraphs (e) to (h). A participation loan is an arrangement in which a lender makes a loan to a borrower and then sells, assigns, or otherwise transfers all or a part of the loan to a purchasing financial institution. A syndication loan is a loan transaction involving multiple financial institutions in which all the lenders are named as parties to the loan documentation, are known to the borrower, and have privity of contract with the borrower.\n(j) Interest income and other receipts including service charges from financial institution credit card and travel and entertainment credit card receivables and credit card holders' fees must be attributed to the state to which the card charges and fees are regularly billed.\n(k) Merchant discount income derived from financial institution credit card holder transactions with a merchant must be attributed to the state in which the merchant is located. In the case of merchants located within and outside the state, only receipts from merchant discounts attributable to sales made from locations within the state are attributed to this state. It is presumed, subject to rebuttal, that the location of a merchant is the address shown on the invoice submitted by the merchant to the taxpayer.\n(l) Receipts from the performance of fiduciary and other services must be attributed to the state in which the services are received. For the purposes of this section, services provided to a corporation, partnership, or trust must be attributed to a state where it has a fixed place of doing business. If the state where the services are received is not readily determinable or is a state where the corporation, partnership, or trust does not have a fixed place of doing business, the services shall be deemed to be received at the location of the office of the customer from which the services were ordered in the regular course of the customer's trade or business. If the ordering office cannot be determined, the services shall be deemed to be received at the office of the customer to which the services are billed.\n(m) Receipts from the issuance of travelers checks and money orders must be attributed to the state in which the checks and money orders are purchased.\n(n) Receipts from investments of a financial institution in securities and from money market instruments must be apportioned to this state based on the ratio that total deposits from this state, its residents, including any business with an office or other place of business in this state, its political subdivisions, agencies, and instrumentalities bear to the total deposits from all states, their residents, their political subdivisions, agencies, and instrumentalities. In the case of an unregulated financial institution subject to this section, these receipts are apportioned to this state based on the ratio that its gross business income, excluding such receipts, earned from sources within this state bears to gross business income, excluding such receipts, earned from sources within all states. For purposes of this subdivision, deposits made by this state, its residents, its political subdivisions, agencies, and instrumentalities must be attributed to this state, whether or not the deposits are accepted or maintained by the taxpayer at locations within this state.\n(o) A financial institution's interest in property described in section 290.015, subdivision 3, paragraph (b), is included in the receipts factor in the same manner as assets in the nature of securities or money market instruments are included in paragraph (n).\n[Repealed, 1991 c 291 art 7 s 26]\n(a) \"Deposit,\" as used in subdivision 6, paragraph (n), has the meanings in this subdivision.\n(b) \"Deposit\" means the unpaid balance of money or its equivalent received or held by a financial institution in the usual course of business and for which it has given or is obligated to give credit, either conditionally or unconditionally, to a commercial, checking, savings, time, or thrift account whether or not advance notice is required to withdraw the credited funds, or which is evidenced by its certificate of deposit, thrift certificate, investment certificate, or certificate of indebtedness, or other similar name, or a check or draft drawn against a deposit account and certified by the financial institution, or a letter of credit or a traveler's check on which the financial institution is primarily liable. However, without limiting the generality of the term \"money or its equivalent,\" any such account or instrument must be regarded as evidencing the receipt of the equivalent of money when credited or issued in exchange for checks or drafts or for a promissory note upon which the person obtaining the credit or instrument is primarily or secondarily liable, or for a charge against a deposit account, or in settlement of checks, drafts, or other instruments forwarded to the bank for collection.\n(c) \"Deposit\" means trust funds received or held by the financial institution, whether held in the trust department or held or deposited in any other department of the financial institution.\n(d) \"Deposit\" means money received or held by a financial institution, or the credit given for money or its equivalent received or held by a financial institution, in the usual course of business for a special or specific purpose, regardless of the legal relationship so established. Under this paragraph, \"deposit\" includes, but is not limited to, escrow funds, funds held as security for an obligation due to the financial institution or others, including funds held as dealers reserves, or for securities loaned by the financial institution, funds deposited by a debtor to meet maturing obligations, funds deposited as advance payment on subscriptions to United States government securities, funds held for distribution or purchase of securities, funds held to meet its acceptances or letters of credit, and withheld taxes. It does not include funds received by the financial institution for immediate application to the reduction of an indebtedness to the receiving financial institution, or under condition that the receipt of the funds immediately reduces or extinguishes the indebtedness.\n(e) \"Deposit\" means outstanding drafts, including advice or another such institution, cashier's checks, money orders, or other officer's checks issued in the usual course of business for any purpose, but not including those issued in payment for services, dividends, or purchases or other costs or expenses of the financial institution itself.\n(f) \"Deposit\" means money or its equivalent held as a credit balance by a financial institution on behalf of its customer if the entity is engaged in soliciting and holding such balances in the regular course of its business.\n(g) Interinstitution fund transfers are not deposits.\nFor all taxpayers, the property factor includes tangible property, real, personal, and mixed, owned or rented, and used by the taxpayer in connection with the trade or business, as set forth in subdivision 10. For financial institutions only, the property factor also includes intangible property, as set forth in subdivision 11. For both tangible and intangible property, the property included in the property factor is the average of the total property used by the taxpayer in connection with its business during the tax period. Such averages must be on a commensurate basis for property within and without the state.\n(a) Tangible property includes land, buildings, machinery and equipment, inventories, and other tangible personal property actually used by the taxpayer during the taxable year in carrying on the business activities of the taxpayer. Tangible property which is separately allocated under section 290.17 is not includable in the property factor.\n(b) Cash on hand or in banks, shares of stock, notes, bonds, accounts receivable, or other evidences of indebtedness, special privileges, franchises, and goodwill, are specifically excluded from the property factor, except as otherwise provided for financial institutions in subdivision 11.\n(c) The value of tangible property that is owned by the taxpayer and that is to be used in the apportionment fraction is the original cost adjusted for any later capital additions or improvements and partial disposition by reason of sale, exchange, or abandonment.\n(d) For purposes of computing the property factor, United States government property that is used by the taxpayer must be considered owned by the taxpayer.\n(e) Property that is rented by the taxpayer is valued at eight times the net annual rental. Net annual rental is the annual rental paid by the taxpayer less any annual rental received by the taxpayer from subrentals. If the subrents taken into account in determining the net annual rental produce a negative or clearly inaccurate value for any item of property, another method that will properly reflect the value of rented property may be required by the commissioner or requested by the taxpayer. In no case, however, shall the value be less than an amount which bears the same ratio to the annual rental paid by the taxpayer for such property as the fair market value of that portion of the property used by the taxpayer bears to the total fair market value of the rented property. Rents paid during the year cannot be averaged.\n(f) A person filing a combined report shall use this method of calculating the property factor for all members of the group.\n(a) For financial institutions, the property factor includes, as well as tangible property, intangible property as set forth in this subdivision.\n(b) Intangible personal property must be included at its tax basis for federal income tax purposes.\n(c) Goodwill must not be included in the property factor.\n(d) Coin and currency located in this state must be attributed to this state.\n(e) Lease financing receivables must be attributed to this state if and to the extent that the property is located within this state.\n(f) Assets in the nature of loans that are secured by real or tangible personal property must be attributed to this state if and to the extent that the security property is located within this state.\n(g) Assets in the nature of consumer loans and installment obligations that are unsecured or secured by intangible property must be attributed to this state if the loan was made to a resident of this state.\n(h) Assets in the nature of commercial loan and installment obligations that are unsecured by real or tangible personal property or secured by intangible property must be attributed to this state if the proceeds of the loan are to be applied in this state. If it cannot be determined where the funds are to be applied, the assets must be attributed to the state in which there is located the office of the borrower from which the application would be made in the regular course of business. If this cannot be determined, the transaction is disregarded in the apportionment formula.\n(i) A participating financial institution's portion of participation and syndication loans must be attributed under paragraphs (e) to (h).\n(j) Financial institution credit card and travel and entertainment credit card receivables must be attributed to the state to which the credit card charges and fees are regularly billed.\n(k) Receivables arising from merchant discount income derived from financial institution credit card holder transactions with a merchant are attributed to the state in which the merchant is located. In the case of merchants located within and without the state, only receivables from merchant discounts attributable to sales made from locations within the state are attributed to this state. It is presumed, subject to rebuttal, that the location of a merchant is the address shown on the invoice submitted by the merchant to the taxpayer.\n(l) Assets in the nature of securities and money market instruments are apportioned to this state based upon the ratio that total deposits from this state, its residents, its political subdivisions, agencies and instrumentalities bear to the total deposits from all states, their residents, their political subdivisions, agencies and instrumentalities. In the case of an unregulated financial institution, the assets are apportioned to this state based upon the ratio that its gross business income earned from sources within this state bears to gross business income earned from sources within all states. For purposes of this paragraph, deposits made by this state, its residents, its political subdivisions, agencies, and instrumentalities are attributed to this state, whether or not the deposits are accepted or maintained by the taxpayer at locations within this state.\n(m) A financial institution's interest in any property described in section 290.015, subdivision 3, paragraph (b), is included in the property factor in the same manner as assets in the nature of securities or money market instruments are included under paragraph (1).\n(a) The payroll factor must be determined in the same way for all taxpayers.\n(b) Wages or salaries must be determined to be paid or incurred in this state if the individual with respect to whom the wages or salaries are paid is either employed within this state or is actually engaged in work in the territorial confines of this state, or if working without this state, is identified with or accountable to an office within this state.\n(c) The wages or salaries paid to officers and employees working from offices within this state are considered payroll within this state even though the officer's and employee's employment requires them to spend working time without this state. Officers and employees whose employment requires them to work without the state entirely and who are assigned to an office without the state, are not considered employees within the state for the purpose of apportionment even though their salaries are paid from the taxpayer's general offices within the state.",
	"repealed": false
}