{
	"id": "260C.4412",
	"url": "https://www.revisor.mn.gov/statutes/cite/260C.4412",
	"title": "260C.4412 PAYMENT FOR RESIDENTIAL PLACEMENTS.",
	"text": "(a) When a child is placed in a foster care group residential setting under Minnesota Rules, parts 2960.0020 to 2960.0710, a foster residence licensed under chapter 245A that meets the standards of Minnesota Rules, parts 2960.3200 to 2960.3230, or a children's residential facility licensed or approved by a tribe, foster care maintenance payments must be made on behalf of the child to cover the cost of providing food, clothing, shelter, daily supervision, school supplies, child's personal incidentals and supports, reasonable travel for visitation, or other transportation needs associated with the items listed. Daily supervision in the group residential setting includes routine day-to-day direction and arrangements to ensure the well-being and safety of the child. It may also include reasonable costs of administration and operation of the facility.\n(b) The commissioner of human services shall specify the title IV-E administrative procedures under section 142A.418 for each of the following residential program settings:\n(1) residential programs licensed under chapter 245A or licensed by a tribe, including:\n(i) qualified residential treatment programs as defined in section 260C.007, subdivision 26d;\n(ii) program settings specializing in providing prenatal, postpartum, or parenting supports for youth; and\n(iii) program settings providing high-quality residential care and supportive services to children and youth who are, or are at risk of becoming, sex trafficking victims;\n(2) licensed residential family-based substance use disorder treatment programs as defined in section 260C.007, subdivision 22a; and\n(3) supervised settings in which a foster child age 18 or older may live independently, consistent with section 260C.451.\n(c) A lead contract under section 142A.07, subdivision 6, is not required to establish the foster care maintenance payment in paragraph (a) for foster residence settings licensed under chapter 245A that meet the standards of Minnesota Rules, parts 2960.3200 to 2960.3230. The foster care maintenance payment for these settings must be consistent with section 142A.609, subdivision 3, and subject to the annual revision as specified in section 256N.26, subdivision 9.",
	"repealed": false
}