{
	"id": "18B.065",
	"url": "https://www.revisor.mn.gov/statutes/cite/18B.065",
	"title": "18B.065 WASTE PESTICIDE COLLECTION PROGRAM.",
	"text": "The commissioner of agriculture shall establish and operate a program to collect and dispose of waste pesticides. The program must be made available to agricultural and nonagricultural pesticide end users whose waste generating activity occurs in this state. Waste pesticide generated in another state is not eligible for collection under this section.\n(a) The commissioner may obtain a United States Environmental Protection Agency hazardous waste identification number to manage the waste pesticides collected.\n(b) The commissioner may limit the type and quantity of waste pesticides accepted for collection and may assess pesticide end users for portions of the costs incurred.\n(a) For agricultural waste pesticides, the commissioner must enter into a contract with a county or group of counties under a joint powers agreement for household hazardous waste disposal or designate a place that is available at least every other year for persons to dispose of unused portions of agricultural pesticides. The commissioner shall consult with the person responsible for solid waste management and disposal in each county not under contract to determine an appropriate location and to advertise each collection event. Additional collection events may be provided if the commissioner determines that additional collections are warranted.\n(b) For nonagricultural waste pesticides, the commissioner must enter into a contract with a county or group of counties under a joint powers agreement for household hazardous waste disposal or designate a place that is available at least every other year for persons to dispose of unused portions of nonagricultural pesticides.\n(c) As provided under subdivision 7, the commissioner may enter into cooperative agreements with local units of government to provide the collections required under paragraph (a) or (b) and shall provide a local unit of government, as part of the cooperative agreement, with funding for reasonable costs incurred including, but not limited to, related supplies, transportation, advertising, and disposal costs as well as reasonable overhead costs.\n(d) A person who collects waste pesticide under this section shall, on a form provided or in a method approved by the commissioner, record the actual or estimated weight of agricultural waste pesticide products collected and submit this information to the commissioner at least annually.\n(a) The commissioner shall provide informational and educational materials regarding waste pesticides and the proper management of waste pesticides to the public.\n(b) No later than March 15 each year, the commissioner must report the following to the legislative committees with jurisdiction over agriculture finance:\n(1) each instance of a refusal to collect waste pesticide or the assessment of a fee to a pesticide end user as authorized in subdivision 2, paragraph (b); and\n(2) waste pesticide collection information including a discussion of the type and quantity of waste pesticide collected by the commissioner and any entity collecting waste pesticide under subdivision 7 during the previous calendar year, a summary of waste pesticide collection trends, and any corresponding program recommendations.\nThe commissioner shall develop the program in this section in consultation and cooperation with the Pollution Control Agency.\n[Repealed, 1Sp2005 c 1 art 1 s 98]\n[Repealed, 1996 c 310 s 1]\n(a) The commissioner may enter into cooperative agreements with state agencies and local units of government for administration of the waste pesticide collection program. The commissioner shall ensure that the program provides collection opportunities statewide. If the commissioner cannot contract with another party to administer the program in a county, the commissioner shall perform collections according to the provisions of this section.\n(b) The commissioner, according to the terms of a cooperative agreement between the commissioner and a local unit of government, may establish limits for unusual types or excessive quantities of waste pesticide offered by pesticide end users to the local unit of government.\n(a) Except as provided in paragraph (b), the commissioner shall annually collect a waste pesticide program surcharge of $50 on each agricultural waste pesticide product and $125 on each nonagricultural waste pesticide product registered in the state as part of a pesticide product registration application under section 18B.26, subdivision 3.\n(b) Pesticide products classified as minimum risk by the United States Environmental Protection Agency are exempt from the waste pesticide program surcharge.\n(a) A waste pesticide cooperative agreement account is created in the agricultural fund. Notwithstanding section 18B.05, the proceeds of surcharges imposed under subdivision 8 must be deposited in the agricultural fund and credited to the waste pesticide cooperative agreement account.\n(b) Money in the waste pesticide cooperative agreement account, including interest, is appropriated to the commissioner and may only be used for costs incurred under a cooperative agreement pursuant to this section.\n(c) Notwithstanding paragraph (b), if the amount available in the waste pesticide cooperative agreement account in any fiscal year exceeds the amount obligated to local units of government under subdivision 7, the excess is appropriated to the commissioner to perform waste pesticide collections under this section.\n(a) A local unit of government, when operating or participating in a waste pesticide collection program pursuant to a cooperative agreement with the commissioner under this section, is an employee of the state, certified to be acting within the scope of employment, for purposes of the indemnification provisions of section 3.736, subdivision 9, for claims that arise out of the transportation, management, or disposal of any waste pesticide covered by the agreement:\n(1) from and after the time the waste permanently leaves the local unit of government's possession and comes into the possession of the state's authorized transporter; and\n(2) during the time the waste is transported between the local unit of government facilities by the state's authorized transporter.\n(b) The state is not obligated to defend or indemnify a local unit of government under this subdivision to the extent of the local unit of government's liability insurance. The local unit of government's right to indemnify is not a waiver of the limitation, defenses, and immunities available to either the local unit of government or the state by law.",
	"repealed": false
}