{
	"id": "325F.58",
	"url": "https://www.revisor.mn.gov/statutes/cite/325F.58",
	"title": "325F.58 ESTIMATES.",
	"text": "Upon the request of a customer for a written estimate and prior to the commencement of repairs, a shop shall provide the customer with a written estimate. The shop shall include in the estimate all the parts and materials and labor which in the standard practice of the trade or industry would normally be included in the repairs for which the estimate was requested.\nA shop may impose an additional charge for making a written estimate, and the charge may include charges for disassembly, diagnosis, and reassembly necessary to make the estimate. However, a shop shall not impose a charge for making an estimate unless the shop informs the customer that there will be a charge and the basis on which the charge will be calculated before making the estimate and receives authorization to make the estimate.\nAt the time a shop provides a customer with a written estimate, the shop shall inform the customer that any charge for storage or care, a service call or a charge for making an estimate shall be in addition to the estimated price for the repairs.\nAt the option of the customer and upon the customer's authorization a shop which provides a written estimate shall:\n(a) if the customer elects and the shop undertakes the repairs, perform the repairs described in the estimate; or\n(b) return the unrepaired motor vehicle, appliance, or dwelling place as close as possible to its former condition and release the motor vehicle or appliance to the customer upon payment of any charges for making the estimate or a service call.\nA shop is not required to provide a written estimate for repairs or service calls it does not agree to perform.\nIf a shop provides a written estimate of the price of repairs, it shall not charge more than 110 percent of the total price stated in its estimate for the repairs; except if a shop after commencing repairs determines that additional work is necessary to accomplish repairs that are the subject of a written estimate and if the shop did not unreasonably fail to disclose the possible need for the additional work when the estimate was made, the shop may charge more than 110 percent of the estimate for the repairs if the shop immediately provides the customer a revised written estimate pursuant to this section and receives authorization to continue with the repairs. If continuation of the repairs is not authorized, the shop shall return the motor vehicle, appliance, or dwelling place as close as possible to its former condition or place it in a mutually agreed-upon condition and shall release the item to the customer upon payment of charges for repairs actually performed and not in excess of 110 percent of the original estimate. Nothing in this subdivision shall be construed to authorize repair charges in excess of reasonable charges for parts and materials and labor.\nThe requirement of a written estimate in sections 325F.56 to 325F.66 is fulfilled if a shop orally communicates the contents of a required writing to the customer prior to commencing repairs and provides the writing to the customer upon completion of the repairs. If the contents are orally communicated, the shop shall make a notation on the writing of the date, time, and telephone number called, if any, and the name of the person who receives the information and orally authorizes the making of the estimated repairs.\nIf a shop after commencing repairs determines that additional repairs not previously authorized are necessary, the shop may perform the additional repairs if it complies with this section. A customer shall have a right to request a written estimate before any additional repairs are commenced on the motor vehicle, appliance, or dwelling place regardless of whether the customer requested a written estimate of the price of the original repairs.",
	"repealed": false
}