{
	"id": "18C.141",
	"url": "https://www.revisor.mn.gov/statutes/cite/18C.141",
	"title": "18C.141 SOIL AND MANURE TESTING LABORATORY CERTIFICATION.",
	"text": "The commissioner shall establish voluntary programs to certify the accuracy of analyses from soil and manure testing laboratories and promote standardization of soil and manure testing procedures and analytical results.\n(a) The commissioner shall institute a system of check samples that requires a laboratory to be certified to analyze at least two multiple soil or manure check samples during the calendar year. The samples must be supplied by the commissioner or by a person under contract with the commissioner to prepare and distribute the samples.\n(b) Within 30 days after the laboratory receives check samples, the laboratory shall report to the commissioner the results of the analyses for all requested elements or compounds or for the elements or compounds the laboratory makes an analytical determination of as a service to others.\n(c) The commissioner shall compile analytical data submitted by laboratories and provide laboratories submitting samples with a copy of the data without laboratory names or code numbers.\n(d) The commissioner may conduct check samples on laboratories that are not certified.\n(a) The results obtained from soil, manure, or plant analysis must be reported in accordance with standard reporting units established by the commissioner by rule. The standard reporting units must conform as far as practical to uniform standards that are adopted on a regional or national basis.\n(b) If a certified laboratory offers a recommendation for use in Minnesota, the University of Minnesota recommendation or that of another land grant college in a contiguous state must be offered in addition to other recommendations, and the source of the recommendation must be identified on the recommendation form. If relative levels such as low, medium, or high are presented to classify the analytical results, the corresponding relative levels based on the analysis as designated by the University of Minnesota or the land grant college in a contiguous state must also be presented.\nIf the commissioner determines that analysis being performed by a laboratory is inaccurate as evidenced by check sample results, the commissioner may deny, suspend, or revoke certification.\n(a) The commissioner may charge the actual costs for check sample preparation and shipping.\n(b) A laboratory applying for certification may be charged a nonrefundable certification fee to cover the actual costs for administration of the program.\n(c) Certification is renewable on an annual basis. The commissioner shall notify a certified lab that its certification lapses within 30 to 60 days of the date when the certification lapses.\n(d) The commissioner may accept donations to support the development and operation of soil and manure programs.\n(e) Revenues under this section are deposited in the fertilizer account of the agricultural fund.\nThe commissioner shall adopt rules for the establishment of minimum standards for laboratories, equipment, procedures, and personnel used in soil and manure analysis and rules necessary to administer and enforce this section. The commissioner shall consult with representatives of the fertilizer industry, representatives of the laboratories doing business in this state, and with the University of Minnesota College of Agriculture before proposing rules.",
	"repealed": false
}