{
	"id": "60B.46",
	"url": "https://www.revisor.mn.gov/statutes/cite/60B.46",
	"title": "60B.46 DISTRIBUTION OF ASSETS.",
	"text": "Under the direction of the court, the liquidator shall pay dividends in a manner that will assure the proper recognition of priorities and reasonable balance between the expeditious completion of the liquidation and the protection of unliquidated and undetermined claims, including third-party claims. Distribution of assets in kind may be made at valuations set by agreement between the liquidator and the creditor and approved by the court. The court may take into consideration the contributions of the respective parties, including guaranty associations, shareholders, and policy owners, and any other party with a bona fide interest, in making an equitable distribution of the ownership rights of the insurer. No distribution to stockholders of the insurer shall be permitted by the court unless the total amount of assessments levied by guaranty associations with respect to the insurer have been repaid.\n(a) Upon liquidation of a domestic mutual insurance company, any assets held in excess of its liabilities and the amounts which may be paid to its members as provided under paragraph (b) shall be paid into the state treasury to the credit of the general fund.\n(b) The maximum amount payable upon liquidation to any member for and on account of membership in a domestic mutual insurance company, in addition to the insurance benefits promised in the policy, shall be the total of all premium payments made by the member with interest at the legal rate compounded annually.\nWithin 120 days of a final determination of insolvency of a company by a court of competent jurisdiction of this state or as soon thereafter as is practical, the liquidator shall make application to the court for approval of a proposal to disburse assets out of the company's marshalled assets, from time to time as the assets become available, to the Minnesota Insurance Guaranty Association, to the Minnesota Life and Health Insurance Guaranty Association, and to any entity or person performing a similar function in another state.\nThe proposal shall at least include provisions for:\n(1) reserving amounts for the payment of expenses of administration, the payment of claims of secured creditors to the extent of the value of their security, and the payment of claims having a higher priority than those of the guaranty associations;\n(2) disbursements of the assets marshalled to date and subsequent disbursements of assets as they become available;\n(3) equitable allocation of disbursements to each of the guaranty associations entitled thereto;\n(4) the securing by the liquidator from each of the guaranty associations entitled to disbursements pursuant to this section of an agreement to return to the liquidator the assets previously disbursed to them as may be required to pay claims of secured creditors and those claims having a higher priority than those of the guaranty association. No bond shall be required of a guaranty association; and\n(5) a full report to be made by the guaranty association to the liquidator accounting for all assets so disbursed to the association, all disbursements made therefrom, any interest earned by the guaranty association on the assets, and any other matter as the court may direct.\n(a) The proposal shall provide for disbursements to the guaranty associations in amounts estimated to be at least equal to the claim payments made or to be made thereby for which the guaranty association could assess a claim against the liquidator. The proposal shall further provide that if the assets available for distribution from time to time do not equal or exceed the amount of such claim payments made or to be made by the guaranty association, then disbursements shall be in the amount of the available assets.\n(b) The liquidator's proposal shall, with respect to an insolvent insurer writing life or health insurance or annuities, provide for disbursements of assets to any guaranty association or any foreign guaranty association covering life or health insurance or annuities or to any other entity or organization reinsuring, assuming, or guaranteeing policies or contracts of insurance under the acts creating these associations.\nNotice of the application shall be given to the guaranty associations in, and to the commissioners of insurance of, each of the states. The notice shall be deemed to have been given when deposited in the United States mail, certified first class postage prepaid, at least 30 days prior to submission of the application to the court. Action on the application may be taken by the court provided the above required notice has been given and provided further that the liquidator's proposal complies with subdivision 4, clauses (1) and (2).",
	"repealed": false
}