{
	"id": "609.165",
	"url": "https://www.revisor.mn.gov/statutes/cite/609.165",
	"title": "609.165 RESTORATION OF CIVIL RIGHTS; POSSESSION OF FIREARMS AND AMMUNITION.",
	"text": "When a person has been deprived of civil rights by reason of conviction of a crime and is thereafter discharged, such discharge shall restore the person to all civil rights and to full citizenship, the same as if such conviction had not taken place, and the order of discharge shall so provide.\nThe order of discharge must provide that a person who has been convicted of a crime of violence, as defined in section 624.712, subdivision 5, is not entitled to ship, transport, possess, or receive a firearm or ammunition for the remainder of the person's lifetime. Any person who has received such a discharge and who thereafter has received a relief of disability under United States Code, title 18, section 925, or whose ability to possess firearms and ammunition has been restored under subdivision 1d, shall not be subject to the restrictions of this subdivision.\n(a) Any person who has been convicted of a crime of violence, as defined in section 624.712, subdivision 5, and who ships, transports, possesses, or receives a firearm or ammunition, commits a felony and may be sentenced to imprisonment for not more than 15 years or to payment of a fine of not more than $30,000, or both.\n(b) A conviction and sentencing under this section shall be construed to bar a conviction and sentencing for a violation of section 624.713, subdivision 2.\n(c) The criminal penalty in paragraph (a) does not apply to any person who has received a relief of disability under United States Code, title 18, section 925, or whose ability to possess firearms and ammunition has been restored under subdivision 1d.\n[Repealed, 1999 c 61 s 2]\nA person prohibited by state law from shipping, transporting, possessing, or receiving a firearm or ammunition because of a conviction or a delinquency adjudication for committing a crime of violence may petition a court to restore the person's ability to possess, receive, ship, or transport firearms and otherwise deal with firearms and ammunition.\nThe court may grant the relief sought if the person shows good cause to do so and the person has been released from physical confinement.\nIf a petition is denied, the person may not file another petition until three years have elapsed without the permission of the court.\nThe discharge may be:\n(1) by order of the court following stay of sentence or stay of execution of sentence; or\n(2) upon expiration of sentence.\nThis section does not apply to a forfeiture of and disqualification for public office as provided in section 609.42, subdivision 2.",
	"repealed": false
}