{
	"id": "62S.01",
	"url": "https://www.revisor.mn.gov/statutes/cite/62S.01",
	"title": "62S.01 DEFINITIONS.",
	"text": "The definitions in this section apply to this chapter.\n\"Activities of daily living\" means eating, toileting, transferring, bathing, dressing, and continence.\n\"Acute condition\" means that the individual is medically unstable and requires frequent monitoring by medical professionals, such as physicians and registered nurses, in order to maintain the individual's health status.\n\"Adult day care\" means a program for six or more individuals of social and health-related services provided during the day in a community group setting for the purpose of supporting frail, impaired elderly, or other disabled adults who can benefit from care in a group setting outside the home.\n\"Applicant\" means:\n(1) in the case of an individual long-term care insurance policy, the person who seeks to contract for benefits; or\n(2) in the case of a group long-term care insurance policy, the proposed certificate holder.\n\"Bathing\" means washing oneself by sponge bath; or in either a tub or shower, including the task of getting into or out of the tub or shower.\n\"Certificate\" means a certificate issued under a group long-term care insurance policy delivered or issued for delivery in this state.\n\"Chronically ill individual\" means an individual who has been certified by a licensed health care practitioner, within the preceding 12-month period, as either:\n(1) being unable to perform, without substantial assistance from another individual, at least two activities of daily living for a period of at least 90 days due to a loss of functional capacity; or\n(2) requiring substantial supervision to protect the individual from threats to health and safety due to severe cognitive impairment.\n\"Cognitive impairment\" means a deficiency in a person's short or long-term memory, orientation as a person, place and time, deductive or abstract reasoning, or judgment as it relates to safety awareness.\n\"Commissioner\" means the commissioner of commerce.\n\"Continence\" means the ability to maintain control of bowel and bladder function, or when unable to maintain control of bowel or bladder function, the ability to perform associated personal hygiene, including caring for catheter or colostomy bag.\n\"Dressing\" means putting on and taking off all items of clothing and any necessary braces, fasteners, or artificial limbs.\n\"Eating\" means feeding oneself by getting food into the body from a receptacle, such as a plate, cup, or table, or by a feeding tube or intravenously.\n(a) \"Exceptional increase\" means only those premium rate increases filed by an insurer as exceptional for which the commissioner determines that the need for the premium rate increase is justified due to changes in laws or rules applicable to long-term care coverage in this state, or due to increased and unexpected utilization that affects the majority of insurers of similar products.\n(b) Except as provided in section 62S.265, exceptional increases are subject to the same requirements as other premium rate schedule increases. The commissioner may request a review by an independent actuary or a professional actuarial body of the basis for a request that an increase be considered an exceptional increase. The commissioner, in determining that the necessary basis for an exceptional increase exists, shall also determine any potential offsets to higher claims costs.\n\"Loss of functional capacity\" means requiring the substantial assistance of another person to perform the prescribed activities of daily living.\n\"Group long-term care insurance\" means a long-term care insurance policy delivered or issued for delivery in this state and issued to:\n(1) one or more employers or labor organizations, or to a trust or to the trustees of a fund established by one or more employers or labor organizations, or a combination, for employees or former employees, or a combination, or for members or former members, or a combination, of the labor organizations;\n(2) a professional, trade, or occupational association for its members or former or retired members, or combination, if the association:\n(i) is composed of individuals, all of whom are or were actively engaged in the same profession, trade, or occupation; and\n(ii) has been maintained in good faith for purposes other than obtaining insurance;\n(3) an association or a trust or the trustee of a fund established, created, or maintained for the benefit of members of one or more associations. Before advertising, marketing, or offering the policy within this state, the association or the insurer of the association must file evidence with the commissioner that the association has at the outset a minimum of 100 persons and has been organized and maintained in good faith for purposes other than that of obtaining insurance; has been in active existence for at least one year; and has a constitution and bylaws that provide that:\n(i) the association holds regular meetings not less than annually to further purposes of the members;\n(ii) except for credit unions, the association collects dues or solicits contributions from members; and\n(iii) the members have voting privileges and representation on the governing board and committees.\nThirty days after the filing, the association is considered to have satisfied the organizational requirements, unless the commissioner makes a finding that the association does not satisfy the organizational requirements; or\n(4) a group other than as described in clauses (1) to (3), subject to a finding by the commissioner that:\n(i) the issuance of the group policy is not contrary to the best interest of the public;\n(ii) the issuance of the group policy would result in economies of acquisition or administration; and\n(iii) the benefits are reasonable in relation to the premiums charged.\n\"Guaranteed renewable\" means the insured has the right to continue the long-term care insurance in force by the timely payment of premiums and the insurer has no unilateral right to make any change in any provision of the policy or rider while the insurance is in force and cannot decline to renew, except that rates may be revised by the insurer on a class basis.\n\"Hands-on assistance\" means minimal, moderate, or maximal physical assistance without which the individual would not be able to perform the activity of daily living.\n\"Home health care services\" means medical and nonmedical services provided to ill, disabled, or infirm persons in their residences. The services may include homemaker services, assistance with activities of daily living, and respite care services.\n\"Incidental,\" as used in section 62S.265, subdivision 10, means that the value of the long-term care benefits provided is less than ten percent of the total value of the benefits provided over the life of the policy. These values must be measured as of the date of issue.\n\"Long-term care insurance\" means a qualified long-term care insurance policy or rider advertised, marketed, offered, or designed to provide coverage for not less than 12 consecutive months for each covered person on an expense incurred, indemnity, prepaid, or other basis for one or more necessary or medically necessary diagnostic, preventive, therapeutic, rehabilitative, maintenance, or personal care services, provided in a setting other than an acute care unit of a hospital. Long-term care insurance includes:\n(1) group and individual annuities and life insurance policies or riders that provide directly or that supplement long-term care insurance; and\n(2) a policy or rider that provides for payment of benefits based upon cognitive impairment or the loss of functional capacity.\nLong-term care insurance does not include an insurance policy that is offered primarily to provide basic Medicare supplement coverage, basic hospital expense coverage, basic medical-surgical expense coverage, hospital confinement indemnity coverage, major medical expense coverage, disability income or related asset-protection coverage, accident only coverage, specified disease or specified accident coverage, or limited benefit health coverage. With regard to life insurance, long-term care insurance does not include life insurance policies that accelerate the death benefit specifically for one or more of the qualifying events of terminal illness, medical conditions requiring extraordinary medical intervention, or permanent institutional confinement, and that provide the option of a lump-sum payment for those benefits and in which neither the benefits nor the eligibility for the benefits is conditioned upon the receipt of long-term care.\n\"Maintenance\" or \"personal care services\" means any care the primary purpose of which is the provision of needed assistance with any of the disabilities as a result of which the individual is a chronically ill individual, including the protection from threats to health and safety due to severe cognitive impairment.\n\"Medicare\" means The Health Insurance for the Aged Act, Title XVIII of the Social Security Amendments of 1965, as amended, or Title I, Part I, of Public Law 89-97, as Enacted by the Eighty-Ninth Congress of the United States of America, as amended.\n\"Mental or nervous disorder\" means a neurosis, psychoneurosis, psychopathy, psychosis, or mental or emotional disease or disorder.\n\"Noncancelable\" may be used only when the insured has the right to continue the long-term care insurance in force by the timely payment of premiums during which period the insurer has no right to unilaterally make any change in any provision of the insurance or in the premium rate.\n\"Personal care\" means the provision of hands-on services to assist an individual with activities of daily living.\n\"Policy\" means a policy, contract, subscriber agreement, rider, or endorsement delivered or issued for delivery in this state by an insurer; fraternal benefit society; nonprofit health, hospital, or medical service corporation; prepaid health plan; health maintenance organization; or a similar organization.\n\"Qualified actuary\" means a member in good standing of the American Academy of Actuaries.\nAll providers of services, including but not limited to \"skilled nursing facility,\" \"extended care facility,\" \"convalescent nursing home,\" \"personal care facility,\" \"specialized care providers,\" \"assisted living facility,\" and \"home care agency\" are defined in relation to the services and facilities required to be available and the licensure, certification, registration, or degree status of those providing or supervising the services. When the definition requires that the provider be appropriately licensed, certified, or registered, it must also state what requirements a provider must meet in lieu of licensure, certification, or registration when the state in which the service is to be furnished does not require a provider of these services to be licensed, certified, or registered, or when the state licenses, certifies, or registers the provider of services under another name.\n\"Qualified long-term care insurance policy\" means a policy that meets the requirements of section 7702B of the Internal Revenue Code, as amended, and this chapter.\n\"Qualified long-term care services\" means necessary diagnostic, preventive, therapeutic, curing, treating, mitigating, and rehabilitative services and maintenance or personal care services, which are:\n(1) required by a chronically ill individual; and\n(2) provided pursuant to a plan of care prescribed by a licensed health care practitioner.\n\"Similar policy forms\" means all of the long-term care insurance policies and certificates issued by an insurer in the same long-term care benefit classification as the policy form being considered. Certificates of groups that meet the definition in section 62S.01, subdivision 15, clause (1), are not considered similar to certificates or policies otherwise issued as long-term care insurance, but are similar to other comparable certificates with the same long-term care benefit classifications. For purposes of determining similar policy forms, long-term care benefit classifications are defined as follows: institutional long-term care benefits only, noninstitutional long-term care benefits only, or comprehensive long-term care benefits.\n\"Skilled nursing care,\" \"personal care,\" \"home care,\" \"specialized care,\" \"assisted living care,\" and other services are defined in relation to the level of skill required, the nature of the care, and the setting in which care must be delivered.\n\"Toileting\" means getting to and from the toilet, getting on and off the toilet, and performing associated personal hygiene.\n\"Transferring\" means moving into or out of a bed, chair, or wheelchair.",
	"repealed": false
}