{
	"id": "282.261",
	"url": "https://www.revisor.mn.gov/statutes/cite/282.261",
	"title": "282.261 TERMS OF REPURCHASE.",
	"text": "A person repurchasing under section 282.241 shall pay at the time of repurchase not less than one-tenth of the repurchase price and shall pay the balance in ten equal annual installments, with the privilege of paying the unpaid balance in full at any time, with interest as provided in subdivision 2, the first installment of principal and interest to become due and payable on December 31 of the year following the year in which the repurchase was made, the remaining installments to become due and payable on December 31 of each year thereafter until fully paid. The person shall pay the current taxes each year thereafter before they become delinquent up to the time the repurchase price has been paid in full.\n(a) Except as provided under paragraph (b), the unpaid balance on any repurchase contract approved by the county board is subject to interest at the rate determined in section 279.03, subdivision 1a. The interest rate is subject to change each year on the unpaid balance in the manner provided for rate changes in section 279.03, subdivision 1a.\n(b) A county board, by resolution, or a county auditor, if delegated the responsibility to administer tax-forfeited land assigned to the county board as provided under section 282.135, may establish an interest rate lower than the interest rate determined under paragraph (a).\nA county board of commissioners may by resolution provide that the installment arrangement in subdivision 1 is not applicable to nonhomestead property and that this subdivision applies instead. If the resolution is approved, the minimum downpayment shall be 20 percent of the repurchase price and the balance shall be payable in four equal annual installments. A resolution shall remain in force for at least one year after approval and shall be applied uniformly to all nonhomestead property in the county. \"Nonhomestead property\" means all property except that which is classified for property tax purposes as homestead property at the time that the repurchase application is approved.\nThe county auditor may collect a service fee to cover administrative costs as set by the county board for each repurchase application. The fee must be paid at the time of application and must be credited to the county general revenue fund.\nThe county auditor, after receiving county board approval, may impose conditions on repurchase of tax-forfeited lands limiting the use of the parcel subject to the repurchase, including, but not limited to, environmental remediation action plan restrictions or covenants, or easements for lines or equipment for telephone, electric power, or telecommunications.",
	"repealed": false
}