{
	"id": "125A.76",
	"url": "https://www.revisor.mn.gov/statutes/cite/125A.76",
	"title": "125A.76 SPECIAL EDUCATION AID.",
	"text": "(a) For the purposes of this section and section 125A.79, the definitions in this subdivision apply.\n(b) \"Basic revenue\" has the meaning given it in section 126C.10, subdivision 2. For the purposes of computing basic revenue pursuant to this section, each child with a disability shall be counted as prescribed in section 126C.05, subdivision 1.\n(c) \"Essential personnel\" means teachers, cultural liaisons, related services, and support services staff providing services to students. Essential personnel may also include special education paraprofessionals or clericals providing support to teachers and students by preparing paperwork and making arrangements related to special education compliance requirements, including parent meetings and individualized education programs. Essential personnel does not include administrators and supervisors.\n(d) \"Average daily membership\" has the meaning given it in section 126C.05.\n(e) \"Program growth factor\" means 1.046 for fiscal year 2017, and the product of 1.046 and the program growth factor for the previous year for fiscal year 2018 and later.\n(f) \"Nonfederal special education expenditure\" means all direct expenditures that are necessary and essential to meet the district's obligation to provide special instruction and services to children with a disability according to sections 124D.454, 125A.03 to 125A.24, 125A.259 to 125A.48, and 125A.65 as submitted by the district and approved by the department under section 125A.75, subdivision 4, excluding expenditures:\n(1) reimbursed with federal funds;\n(2) reimbursed with other state aids under this chapter;\n(3) for general education costs of serving students with a disability;\n(4) for facilities;\n(5) for pupil transportation; and\n(6) for postemployment benefits.\n(g) \"Old formula special education expenditures\" means expenditures eligible for revenue under Minnesota Statutes 2012, section 125A.76, subdivision 2.\n(h) For the Minnesota State Academy for the Deaf and the Minnesota State Academy for the Blind, expenditures under paragraphs (f) and (g) are limited to the salary and fringe benefits of one-to-one instructional and behavior management aides and one-to-one licensed, certified professionals assigned to a child attending the academy, if the aides or professionals are required by the child's individualized education program.\n(i) \"Special education aid increase limit\" means $80 for fiscal year 2016, $100 for fiscal year 2017, and, for fiscal years 2018 through 2020, the sum of the special education aid increase limit for the previous fiscal year and $40.\n(j) \"District\" means a school district, a charter school, or a cooperative unit as defined in section 123A.24, subdivision 2. Notwithstanding section 123A.26, cooperative units as defined in section 123A.24, subdivision 2, are eligible to receive special education aid under this section and section 125A.79.\n(k) \"Initial special education cross subsidy\" means the greater of zero or:\n(1) the nonfederal special education expenditure under paragraph (f); plus\n(2) the cost of providing transportation services for pupils with disabilities under section 123B.92, subdivision 1, paragraph (b), clause (4); minus\n(3) the special education aid under subdivision 2c and sections 125A.11, subdivision 1, and 127A.47, subdivision 7; minus\n(4) the amount of general education revenue, excluding local optional revenue, plus local optional aid and referendum equalization aid attributable to pupils receiving special instruction and services outside the regular classroom for more than 60 percent of the school day for the portion of time the pupils receive special instruction and services outside the regular classroom, excluding portions attributable to district and school administration, district support services, operations and maintenance, capital expenditures, and pupil transportation.\n(l) The \"minimum aid adjustment multiplier\" for fiscal year 2020 equals 1.046. For fiscal year 2021 and later, the minimum aid adjustment multiplier equals the greater of 1.02 or the minimum aid adjustment multiplier for the previous year minus 0.002.\n(m) The \"minimum aid adjustment factor\" for fiscal year 2020 equals the program growth factor for fiscal year 2020. For fiscal year 2021 and later, the minimum aid adjustment factor equals the product of the minimum aid adjustment factor for the previous fiscal year and the minimum aid adjustment multiplier.\n[Repealed, 2013 c 116 art 5 s 32]\nFor fiscal year 2021 and later, a district's special education initial aid equals the sum of:\n(1) the least of 62 percent of the district's old formula special education expenditures for the prior fiscal year, excluding pupil transportation expenditures, 50 percent of the district's nonfederal special education expenditures for the prior year, excluding pupil transportation expenditures, or 56 percent of the product of the sum of the following amounts, computed using prior fiscal year data, and the program growth factor:\n(i) the product of the district's average daily membership served and the sum of:\n(A) $460; plus\n(B) $405 times the ratio of the sum of the number of pupils enrolled on October 1 who are eligible to receive free meals plus one-half of the pupils enrolled on October 1 who are eligible to receive reduced-price meals to the total October 1 enrollment; plus\n(C) .008 times the district's average daily membership served; plus\n(ii) $13,300 times the December 1 child count for the primary disability areas of autism spectrum disorders, developmental delay, and severely multiply impaired; plus\n(iii) $19,200 times the December 1 child count for the primary disability areas of deaf and hard-of-hearing and emotional or behavioral disorders; plus\n(iv) $25,200 times the December 1 child count for the primary disability areas of developmentally cognitive mild-moderate, developmentally cognitive severe-profound, physically impaired, visually impaired, and deafblind; plus\n(2) the cost of providing transportation services for children with disabilities under section 123B.92, subdivision 1, paragraph (b), clause (4).\n[Repealed, 1Sp2017 c 5 art 4 s 13]\n(a) For fiscal year 2020 and later, a district's special education aid equals the sum of the district's special education initial aid under subdivision 2a, the district's cross subsidy reduction aid under subdivision 2e, special education homeless pupil aid under subdivision 2f, and the district's excess cost aid under section 125A.79, subdivision 5.\n(b) Notwithstanding paragraph (a), for fiscal year 2020, the special education aid for a school district, excluding the cross subsidy reduction aid under subdivision 2e, and excluding special education homeless pupil aid under subdivision 2f, must not exceed the greater of:\n(i) the sum of 56 percent of the district's nonfederal special education expenditures plus 100 percent of the district's cost of providing transportation services for children with disabilities under section 123B.92, subdivision 1, paragraph (b), clause (4), plus the adjustment under sections 125A.11 and 127A.47, subdivision 7; or\n(ii) the sum of: (A) the product of the district's average daily membership served and the special education aid increase limit; and (B) the product of the sum of the special education aid the district would have received for fiscal year 2016 under Minnesota Statutes 2012, sections 125A.76 and 125A.79, as adjusted according to Minnesota Statutes 2012, sections 125A.11 and 127A.47, subdivision 7, the ratio of the district's average daily membership served for the current fiscal year to the district's average daily membership served for fiscal year 2016, and the program growth factor.\n(c) Notwithstanding paragraph (a), for fiscal year 2024 and later the special education aid, excluding the cross subsidy reduction aid under subdivision 2e, excluding special education homeless pupil aid under subdivision 2f, for a school district, not including a charter school or cooperative unit as defined in section 123A.24, must not be less than the lesser of (1) the sum of 90 percent for fiscal year 2020, 85 percent for fiscal year 2021, 80 percent for fiscal year 2022, and 75 percent for fiscal year 2023 and later of the district's nonfederal special education expenditures plus 100 percent of the district's cost of providing transportation services for children with disabilities under section 123B.92, subdivision 1, paragraph (b), clause (4), plus the adjustment under sections 125A.11 and 127A.47, subdivision 7, for that fiscal year, or (2) the product of the sum of the special education aid the district would have received for fiscal year 2016 under Minnesota Statutes 2012, sections 125A.76 and 125A.79, as adjusted according to Minnesota Statutes 2012, sections 125A.11 and 127A.47, subdivision 7, the ratio of the district's adjusted daily membership for the current fiscal year to the district's average daily membership for fiscal year 2016, and the minimum aid adjustment factor.\n(d) Notwithstanding subdivision 2a and section 125A.79, a charter school in its first year of operation shall generate special education aid based on current year data. A newly formed cooperative unit as defined in section 123A.24 may apply to the commissioner for approval to generate special education aid for its first year of operation based on current year data, with an offsetting adjustment to the prior year data used to calculate aid for programs at participating school districts or previous cooperatives that were replaced by the new cooperative. The department shall establish procedures to adjust the prior year data and fiscal year 2016 old formula aid used in calculating special education aid to exclude costs that have been eliminated for districts where programs have closed or where a substantial portion of the program has been transferred to a cooperative unit.\n(e) The department shall establish procedures through the uniform financial accounting and reporting system to identify and track all revenues generated from third-party billings as special education revenue at the school district level; include revenue generated from third-party billings as special education revenue in the annual cross-subsidy report; and exclude third-party revenue from calculation of excess cost aid to the districts.\nBy January 15 of each year, the department must calculate the statewide average special education expenditure per December 1 child count for the prior fiscal year by primary disability area and provide that information to all districts. By January 15 of each odd-numbered year, the commissioner must identify options for aligning the assignment of disability areas to the categories and the rates for each category in subdivision 2a, clause (1), with the latest expenditure data and submit these options to the legislative committees with jurisdiction over education finance.\n(a) A school district's annual cross subsidy reduction aid equals the school district's initial special education cross subsidy for the previous fiscal year times the cross subsidy aid factor for that fiscal year.\n(b) The cross subsidy aid factor equals 6.43 percent for fiscal year 2023; 44 percent for fiscal years 2024, 2025, and 2026; and 50 percent for fiscal year 2027 and later.\n(a) For fiscal year 2024 and later, special education homeless pupil aid must be paid to a school district that is funded for that year based on the district's fiscal year 2016 expenditures calculated under Minnesota Statutes 2012, sections 125A.76 and 125A.79, as adjusted according to Minnesota Statutes 2012, sections 125A.11 and 127A.47, subdivision 7, the ratio of the district's adjusted daily membership for the current fiscal year to the district's average daily membership for fiscal year 2016, and the minimum aid adjustment factor.\n(b) Special education homeless pupil aid equals the greater of zero, or a district's prior year transportation costs under section 123B.92, subdivision 1, paragraph (b), clause (4), items (ii) and (vii), and the additional cost of transporting a student in a shelter care facility as defined in section 260C.007, subdivision 30, a homeless student in another district to the school of origin, or a formerly homeless student from a permanent home in another district to the school of origin but only through the end of the academic year; minus the fiscal year 2016 costs associated with transportation costs under section 123B.92, subdivision 1, paragraph (b), clause (4), items (ii) and (vii), and the additional cost of transporting a student in a shelter care facility as defined in section 260C.007, subdivision 30, a homeless student in another district to the school of origin, or a formerly homeless student from a permanent home in another district to the school of origin, but only through the end of the academic year; adjusted by the ratio of the district's adjusted daily membership for the current fiscal year to the district's average daily membership for fiscal year 2016, and the minimum aid adjustment factor.\n[Repealed, 2007 c 146 art 3 s 25]\n[Repealed, 2013 c 116 art 5 s 32]\n(a) If an agreement is reached between the state of Minnesota and an adjoining state pursuant to section 124D.041 that requires a special education tuition payment from the state of Minnesota to the adjoining state, the tuition payment shall be made from the special education aid appropriation for that year.\n(b) If an agreement is reached between the state of Minnesota and an adjoining state pursuant to section 124D.041 that requires special education tuition payments to be made between the two states and not between districts in the two states, the special education aid for a Minnesota school district serving a student with a disability from the adjoining state shall be calculated according to section 127A.47, subdivision 7, except that no reduction shall be made in the special education aid paid to the resident district.\n[Repealed, 2013 c 116 art 5 s 32]\n[Repealed, 1999 c 241 art 2 s 62]\n[Repealed, 2013 c 116 art 5 s 32]\n(a) If, on the basis of a forecast of general fund revenues and expenditures under section 16A.103, the state's expenditures for special education and related services for children with disabilities from nonfederal sources for a fiscal year, including special education aid under subdivision 2c; travel for home-based services under section 125A.75, subdivision 1; aid for students with disabilities under section 125A.75, subdivision 3; court-placed special education under section 125A.79, subdivision 4; out-of-state tuition under section 125A.79, subdivision 8; and direct expenditures by state agencies are projected to be less than the amount required to meet federal special education maintenance of effort, the reimbursement percentages for excess cost aid under section 125A.79, subdivision 5, must be increased as required to ensure that the additional amount required to meet federal special education maintenance of effort is added to the state total special education aid in subdivision 2c.\n(b) If, on the basis of a forecast of general fund revenues and expenditures under section 16A.103, expenditures in the programs in paragraph (a) are projected to be greater than previously forecast for an enacted budget, and an addition to state total special education aid has been made under paragraph (a), the state total special education aid must be reduced by the lesser of the amount of the expenditure increase or the amount previously added to state total special education aid in subdivision 2c.\n(c) For the purpose of this section, \"previously forecast for an enacted budget\" means the allocation of funding for these programs in the most recent forecast of general fund revenues and expenditures or the act appropriating money for these programs, whichever occurred most recently. It does not include planning estimates for a future biennium.\n(d) If the amount of special education aid is adjusted in accordance with this subdivision, the commissioner of education shall notify the chairs of the legislative committees having jurisdiction over kindergarten through grade 12 education regarding the amount of the adjustment and provide an explanation of the federal maintenance of effort requirements.\nThe commissioner and the commissioner of children, youth, and families shall enter into an agreement, upon federal approval, under which the commissioner of education shall distribute funds appropriated for programs under this section.",
	"repealed": false
}