{
	"id": "168D.01",
	"url": "https://www.revisor.mn.gov/statutes/cite/168D.01",
	"title": "168D.01 DEFINITIONS.",
	"text": "As used in this chapter, the following terms have the meanings given them in this section.\n\"Cancellation\" means the voluntary termination of a license and its provisions.\n\"Commissioner\" means the commissioner of public safety of the state of Minnesota, acting directly or through duly authorized agents.\n\"Jurisdiction\" means a state of the United States, the District of Columbia, a province or territory of Canada, and any other member jurisdiction of the International Fuel Tax Agreement (IFTA) compact as approved by Congress in the Intermodal Surface Transportation Efficiency Act (ISTEA), Public Law 102-240.\n\"Motor carrier\" means an individual, corporation, partnership, association, trust, or other entity, however organized, operating one or more qualified motor vehicles as a part of its interstate business operations.\n\"Motor fuel\" means an agent, regardless of its composition or properties, used to propel a qualified motor vehicle.\n\"Operation\" means operation of qualified motor vehicles whether loaded or empty, whether for compensation or not for compensation, and whether owned by or leased to the motor carrier who operates them or causes them to be operated in two or more jurisdictions.\n(a) \"Qualified motor vehicle\" means a motor vehicle that is used, designed, or maintained to transport persons or property and that:\n(1) has two axles and a gross vehicle weight or registered gross vehicle weight exceeding 26,000 pounds;\n(2) has three or more axles regardless of weight; or\n(3) is used in combination, when the weight of the combination exceeds 26,000 pounds gross vehicle or registered gross vehicle weight.\n(b) Qualified motor vehicle does not include a recreational vehicle or any vehicle exempt from registration under section 168.012, subdivision 1, paragraph (a), clause (1).\n\"Revocation\" means the withdrawal of a license and privileges by the commissioner of public safety.\n\"Suspension\" means the temporary removal of privileges granted to the licensee by the commissioner of public safety.",
	"repealed": false
}