{
	"id": "179A.01",
	"url": "https://www.revisor.mn.gov/statutes/cite/179A.01",
	"title": "179A.01 PUBLIC POLICY.",
	"text": "(a) It is the public policy of this state and the purpose of sections 179A.01 to 179A.25 to promote orderly and constructive relationships between all public employers and their employees. This policy is subject to the paramount right of the citizens of this state to keep inviolate the guarantees for their health, education, safety, and welfare.\n(b) The relationships between the public, public employees, and employer governing bodies involve responsibilities to the public and a need for cooperation and employment protection which are different from those found in the private sector. The importance or necessity of some services to the public can create imbalances in the relative bargaining power between public employees and employers. As a result, unique approaches to negotiations and resolutions of disputes between public employees and employers are necessary.\n(c) Unresolved disputes between the public employer and its employees are injurious to the public as well as to the parties. Adequate means must be established for minimizing them and providing for their resolution. Within these limitations and considerations, the legislature has determined that overall policy is best accomplished by:\n(1) granting public employees certain rights to organize and choose freely their representatives;\n(2) requiring public employers to meet and negotiate with public employees in an appropriate bargaining unit and providing that the result of bargaining be in written agreements; and\n(3) establishing special rights, responsibilities, procedures, and limitations regarding public employment relationships which will provide for the protection of the rights of the public employee, the public employer, and the public at large.\n(d) Nothing in sections 179A.01 to 179A.25 impairs, modifies, or alters the authority of the legislature to establish rates of pay, or retirement or other benefits for its employees.",
	"repealed": false
}