{
	"id": "260E.37",
	"url": "https://www.revisor.mn.gov/statutes/cite/260E.37",
	"title": "260E.37 CHILD PROTECTION WORKERS; TRAINING.",
	"text": "(a) As used in this section, the following terms have the meanings given unless the specific context indicates otherwise.\n(b) \"Advanced training\" means training provided to a local child protection worker after the person has performed an initial six months of employment as a child protection worker.\n(c) \"Child protection agency\" means an agency authorized to receive reports, conduct assessments and investigations, and make determinations pursuant to this chapter.\n(d) \"Child protection services\" means the receipt and assessment of reports of maltreatment and the provision of services to families and children when maltreatment has occurred or when there is risk of maltreatment. These services include:\n(1) the assessment of risk to a child alleged to have been maltreated;\n(2) interviews of any person alleged to have maltreated a child and the child or children involved in the report, and interviews with persons having facts or knowledge necessary to assess the level of risk to a child and the need for protective intervention;\n(3) the gathering of written or evidentiary materials;\n(4) the recording of case findings and determinations; and\n(5) other actions required by this chapter, administrative rule, or agency policy.\n(e) \"Competency-based training\" means a course of instruction that provides both information and skills practice which is based upon clearly stated and measurable instructional objectives and which requires demonstration of the achievement of a particular standard of skills and knowledge for satisfactory completion.\n(f) \"Foundation training\" means training provided to a local child protection worker after the person has begun to perform child protection duties but before the expiration of six months of employment as a child protection worker. This foundation training must occur during the performance of job duties and must include an evaluation of the employee's application of skills and knowledge.\nThe commissioner of children, youth, and families shall develop a program of competency-based foundation and advanced training for child protection workers if funds are appropriated to the commissioner for this purpose.",
	"repealed": false
}