{
	"id": "16A.06",
	"url": "https://www.revisor.mn.gov/statutes/cite/16A.06",
	"title": "16A.06 ADDITIONAL COMMISSIONER DUTIES AND POWERS.",
	"text": "The commissioner has the duties and powers stated in this section. An executive agency must do what the commissioner requires of it under this section.\nThe commissioner from time to time shall require an executive agency to prepare financial reports on department forms so the administration and the legislature can compare spending plans with appropriations for programs and activities.\nThe commissioner shall provide a system to measure the effect of fund expenditures so as to evaluate and compare the cost of functions or programs.\nExecutive agencies shall prepare performance-based budget plans according to schedules, forms, and standards as established by the commissioner. The commissioner may also require other periodic reports of agency performance.\nThe commissioner from time to time shall require an executive agency to report estimates of its income and receipts. The commissioner shall use the estimates to evaluate the state's financial condition.\nThe commissioner shall, when directed, report on the state's financial affairs to the governor.\nThe commissioner shall obtain from an executive agency any information needed to make state financial policy.\n[Repealed, 1994 c 632 art 3 s 65]\n[Repealed, 2013 c 134 s 31]\n[Repealed, 2003 c 112 art 1 s 19]\nThe commissioner shall annually report to the Legislative Permanent School Fund Commission and the legislature the amount of the permanent school fund transfer and information about the investment of the permanent school fund provided by the State Board of Investment. The State Board of Investment shall provide information about how they maximized the long-term economic return of the permanent school fund.\nThe commissioner shall contract with a qualified auditor to conduct the annual audit required by the Single Audit Act of 1984, Public Law 98-502; the Single Audit Act Amendments of 1996, Public Law 104-156; and Code of Federal Regulations, title 2, part 200, Uniform Administrative Requirements, Cost Principles, and Audit Requirements for Federal Awards (Uniform Guidance). The cost of the audit shall be billed to the agencies audited during the subsequent fiscal year. Amounts paid by state agencies shall be deposited in the general fund.",
	"repealed": false
}