{
	"id": "17.86",
	"url": "https://www.revisor.mn.gov/statutes/cite/17.86",
	"title": "17.86 URBAN FOREST PROMOTION AND DEVELOPMENT.",
	"text": "The following course of action is intended as a basis for prompt action to the maximum extent practical within the limits of state, local, and commercial resources. The assignment of a basic responsibility to a particular agency is not intended to confer exclusive responsibility or authority unless specifically stated, for joint action is intended as the key to a successful program.\nThe University of Minnesota and its Extension Service in cooperation with the commissioner of agriculture shall institute a continuing research program on tree varieties most suitable for growth within the state; and the proper placement of individual trees and groups of trees in new or existing commercial, industrial, and residential settings to maximize energy saving benefits. The University of Minnesota and the commissioner shall work closely with nurseries and other suppliers of trees to assure a constant and reliable supply of the desirable varieties is available for planting.\nThe University of Minnesota Extension Service, in cooperation with the commissioners of agriculture, education, natural resources, and commerce, shall serve as the principal agency for publishing and circulating information derived from research under subdivision 2 among the various municipalities and individual property owners in the state. Where practical, the Extension Service and the State Energy Office in the Department of Commerce shall secure the advice and assistance of various energy utilities interested and concerned with conservation. The commissioner of agriculture shall establish an information source for requests for nursery stock, to match needs of municipalities with stocks of trees available for planting from private and governmental sources.\nThe commissioner of transportation shall utilize information on varieties and placement of trees to provide maximum forestation in rest areas and other areas controlled by the department. The commissioner of transportation should consider the use of trees in conjunction with solid noise walls along urban freeways to the maximum extent practical.\nThe commissioners of education, agriculture, and natural resources, with the state Arbor Month Committee and its individual public and private members, shall jointly work to expand and strengthen programs available to all levels of schools in forestry education and shall encourage reinstitution of Arbor Day activities. Information on desirable shade tree varieties and efficient spacing and location of shade trees shall be made available for use in related adult education courses.\nA city of the first or second class shall, by ordinance, require of the developer the use of properly placed trees in new subdivisions and plantings on lands dedicated to parks and open spaces. Cities of the third and fourth class may adopt such ordinances. Counties may assist and encourage the smaller cities in tree planting programs. A municipality may contract on a long-term basis with nurseries and shade tree wholesalers to assure continued availability of nursery stock of the desirable shade tree varieties.",
	"repealed": false
}