{
	"id": "160.02",
	"url": "https://www.revisor.mn.gov/statutes/cite/160.02",
	"title": "160.02 DEFINITIONS.",
	"text": "For the purposes of this chapter the terms defined in this section have the meanings given them.\n\"Bikeway\" has the meaning given in section 169.011, subdivision 9.\n[Renumbered subd 29]\n[Renumbered subd 18]\n[Renumbered subd 17]\n[Renumbered subd 21]\n[Renumbered subd 28]\n[Renumbered subd 26]\n\"Commissioner\" means the commissioner of transportation.\n[Renumbered subd 25]\n[Renumbered subd 23]\n[Renumbered subd 20]\n\"Controlled-access highway\" means any highway, street, or road, including streets within cities, over, from, or to which owners or occupants of abutting land or other persons have or are to have no right of access, or only a controlled right of the easement of access, light, air, or view.\n[Renumbered subd 24]\n[Renumbered subd 22]\n[Renumbered subd 27]\n[Renumbered subd 19]\n\"County highways\" includes those roads which have heretofore been or which hereafter may be established, constructed, or improved under authority of the several county boards, including all roads lying within the county or on the line between counties established by judicial proceedings, except those roads established, constructed, or improved by the counties that have been maintained by the towns for a period of at least one year prior to July 1, 1957. All roads heretofore designated prior to July 1, 1957 as county-aid highways shall be county highways until abandoned or changed in accordance with law.\n\"County state-aid highways\" includes all roads established in accordance with law as county state-aid highways.\n\"Dynamic shoulder lane\" means the shoulder of a freeway on which the commissioner may allow the operation of vehicles during certain periods.\n\"Expressway\" means a divided highway with partial control of access.\n\"Freeway\" means a divided highway with full control of access.\n\"Interstate bridge\" means all bridges now existing or which shall be hereafter constructed across boundary waters between the state of Minnesota and any adjoining state thereby connecting highways of this state with the highway system of any adjoining state.\n\"Municipal state-aid streets\" includes all streets within the cities having a population of 5,000 or more, established in accordance with law as municipal state-aid streets.\n[Renumbered 169.011, subd 46a]\n\"Noxious weeds\" has the meaning given in section 18.77, subdivision 8.\n\"Portage\" means a passageway two rods in width extending from one public or navigable water to another public or navigable water or from a public or navigable water to a public highway.\n\"Public property\" means any property except streets, roads, or bridges owned by any subdivision of government, including but not limited to, the property of school districts however organized, towns, cities, municipalities, counties, and any board or commission of any thereof, and public corporations created by the laws of this state.\n\"Road authority\" means the commissioner, as to trunk highways; the county board, as to county state-aid highways and county highways; the town board, as to town roads; and the governing bodies of cities when the governing bodies or city streets are specifically mentioned.\n\"Road\" or \"highway\" includes, unless otherwise specified, the several kinds of highways as defined in this section, including roads designated as minimum-maintenance roads, and also cartways, together with all bridges or other structures thereon which form a part of the same.\nThe terms \"roadway,\" \"bicycle lane,\" \"bicycle route,\" and \"bicycle path\" have the meanings given in section 169.011.\nMS 2020 [Renumbered 169.011 subd 73a]\n\"Town roads\" includes those roads and cartways which have heretofore been or which hereafter may be established, constructed, or improved under the authority of the several town boards, roads established, constructed, or improved by counties that have been maintained by the towns for a period of at least one year prior to July 1, 1957.\n\"Trunk highways\" includes all roads established or to be established under the provisions of article 14, section 2 of the Constitution of the state of Minnesota.",
	"repealed": false
}