{
	"id": "138.585",
	"url": "https://www.revisor.mn.gov/statutes/cite/138.585",
	"title": "138.585 STATE MONUMENTS.",
	"text": "The monuments, memorials, tablets, markers and cenotaphs enumerated in this section are \"state monuments,\" officially established as such by the state of Minnesota since 1873.\nCaptain John S. Marsh State Monument in Fort Ridgely Cemetery, in memory of Captain John S. Marsh and 25 men killed at Redwood Ferry in the Sioux Uprising of 1862, established in 1873.\nEliza Miller State Monument, in Fort Ridgely Cemetery, in memory of the valor of Mrs. Eliza Miller during the Siege of Fort Ridgely in the Sioux Uprising of 1862, established in 1877.\nNess Lutheran Cemetery State Monument, in Meeker County, marks the mass grave of the five settlers killed at the Baker cabin at Acton in 1862, established in 1878.\nLundborg-Broberg State Monument, in Kandiyohi County, in Lebanon Swedish Cemetery, New London, marks the mass grave of 13 members of two families killed during the Sioux Uprising of 1862, established in 1891.\nDefenders' State Monument, in Brown County, a twenty-four foot granite shaft on Center Street, New Ulm, commemorates the two battles fought in this city during the Sioux Uprising of 1862, established in 1891.\nCamp Release State Monument, in Lac qui Parle County, a fifty foot granite shaft in Camp Release Memorial State Wayside, near Montevideo, marks the spot where the Sioux Indians surrendered and released 269 Sioux Uprising captives on September 26, 1862, established in 1894.\nBirch Coulee State Monument, in Renville County, a fifty-two foot granite shaft overlooking highway 19 at Morton, in memory of those who fought in the Battle of Birch Coulee in the Sioux Uprising of 1862, established in 1894.\nFort Ridgely State Monument, in Nicollet County, a fifty-two foot granite shaft in Fort Ridgely State Park, commemorating the heroism of the fort's defenders during its nine day siege in the Sioux Uprising of 1862, established in 1896.\nHinckley Fire State Monument, in Pine County, a fifty-two foot granite shaft in Hinckley Memorial Cemetery, marks the mass grave of 248 victims of the Hinckley Fire of 1894, established in 1900.\nGuri Endreson Rosseland State Monument, in Kandiyohi County, in Vikor Lutheran Cemetery, near Willmar, marks the grave of Sioux Uprising heroine Guri Endreson, established in 1907.\nChief White Cloud State Monument, in Becker County, in Calvary Catholic Cemetery, near White Earth, honoring Chippewa Chief White Cloud, established in 1909.\nActon State Monument, in Meeker County, a granite shaft at Acton, near Grove City, marks the site of the Howard Baker cabin, where the Sioux Uprising began on August 17, 1862, established in 1909.\nJackson State Monument, in Jackson County, a granite shaft in Ashley Park, Jackson, in memory of 19 pioneer settlers killed in this area in 1857 and 1862, established in 1909.\nJoseph R. Brown State Monument, in Sibley County, a granite shaft in Brown's Cemetery, Henderson, marks the grave of pioneer Joseph R. Brown (1805-1870), established in 1910.\nWood Lake State Monument, in Yellow Medicine County, a fifty foot granite shaft in Wood Lake State Wayside, near Granite Falls, in memory of seven soldiers who died in the Sioux Uprising battle at this site in 1862, established in 1910.\nChief Mouzoomaunee State Monument, in Nicollet County, in Fort Ridgely Cemetery, in recognition of the loyalty of Chief Mouzoomaunee and the Chippewa Indians during the Sioux Uprising, established in 1914.\nBrook Park State Monument, in Pine County, a thirty-two foot granite shaft in Brook Park Cemetery, marks the mass grave of 23 Brook Park Township residents who perished in the Great Fire of 1894.\nSchwandt State Monument, in Renville County, on County Road No. 15 near North Redwood, in memory of six members of the Johann Schwandt family killed during the Sioux Uprising of 1862, established in 1915.\nLake Shetek State Monument, in Murray County, a twenty-five foot high granite shaft in Lake Shetek State Park, in memory of those killed at this site during the Sioux Uprising of 1862, established in 1925.\nWilliam Colvill State Monument, in Goodhue County, a granite shaft with a statue of William Colvill (1830-1905), honors the colonel who led the First Minnesota Regiment in the Civil War battle of Gettysburg in 1863, established in 1928.\nMilford State Monument, in Brown County, on county road No. 4 near Essig, in memory of over 50 Milford Township settlers killed in the Sioux Uprising of 1862, established in 1929.\nMoose Lake State Monument, in Carlton County, a twenty-seven foot granite shaft in Riverside Cemetery, Moose Lake, in memory of 183 victims of the Fire of 1918, established in 1929.\nSamuel J. Brown State Monument, in Traverse County, a bronze tablet in Sam Brown Memorial Park, Browns Valley, honors Samuel J. Brown (1845-1925), the \"Paul Revere of the Northwestern Frontier\" for his valiant ride in 1866, established in 1929.\nCount Beltrami State Monument, in Beltrami County, in honor of Count Beltrami to commemorate the discovery of the height of land on the Continental Divide on August 23, 1823, established in 1945.\nChief Sleepy Eyes State Monument, in Brown County, a twenty-foot granite shaft in the city of Sleepy Eye, honoring Santee Sioux Chief Sleepy Eyes (Ishtaba), for whom the city is named, established in 1971.\nSioux Indians State Monument, in Renville County, a fifty-foot granite shaft overlooking trunk highway 19 near Morton honoring the Indians who were friendly to white settlers during the Sioux Uprising of 1862, established in 1971.\nTraverse des Sioux State Monument in Nicollet County, including the Traverse des Sioux Treaty Site, where the treaty of Traverse des Sioux was signed in 1851, consists of two tracts divided by United States Highway No. 169 as follows: All that land owned by the state of Minnesota under the jurisdiction of the Departments of Natural Resources and Transportation within the statutory boundary of the Traverse des Sioux State Park located westerly of United States Highway No. 169 and northerly of Chestnut Street of the plat of Traverse des Sioux north of Sibley Street and containing approximately 19 acres, more or less, and, all that land owned by the state of Minnesota under the jurisdiction of the Department of Natural Resources within the statutory boundary of the Traverse des Sioux State Park located easterly of United States Highway No. 169 and northerly of McCann Street of the plat of Traverse des Sioux south of Sibley Street, and containing approximately 90 acres, more or less, both parcels located in Sections 4 and 9, Township 110 North, Range 26 West.\nGovernor Floyd B. Olson State Monument, in Hennepin County, a statue of Floyd B. Olson, who served as Minnesota's 22nd governor from 1931 to 1936, located along Trunk Highway 55 at Penn Avenue North in the city of Minneapolis, established in 1983.\nMonument to the Living, in Ramsey County, a statue of a military fighting man, created by Roger Brodin to serve as a memento to all living Minnesota veterans, dedicated in May of 1982 and located on the State Capitol grounds in St. Paul, established in 1984.\nNative American Monument, in Ramsey County, to memorialize Native Americans, located in a place of honor in the capitol complex in St. Paul.",
	"repealed": false
}