{
	"id": "115B.16",
	"url": "https://www.revisor.mn.gov/statutes/cite/115B.16",
	"title": "115B.16 DISPOSITION OF FACILITIES.",
	"text": "No person shall use any property on or in which hazardous waste remains after closure of a disposal facility as defined in section 115A.03, subdivision 10, in any way that disturbs the integrity of the final cover, liners, or any other components of any containment system, or the function of the disposal facility's monitoring systems, unless the agency finds that the disturbance:\n(1) is necessary to the proposed use of the property, and will not increase the potential hazard to human health or the environment; or\n(2) is necessary to reduce a threat to human health or the environment.\n(a) Before any transfer of ownership of any property which the owner knew or should have known was used as the site of a hazardous waste disposal facility as defined in section 115A.03, subdivision 10, or which the owner knew or should have known is subject to extensive contamination by release of a hazardous substance, the owner shall record with the county recorder of the county in which the property is located an affidavit containing a legal description of the property that discloses to any potential transferee:\n(1) that the land has been used to dispose of hazardous waste or that the land is contaminated by a release of a hazardous substance;\n(2) the identity, quantity, location, condition and circumstances of the disposal or contamination to the full extent known or reasonably ascertainable; and\n(3) that the use of the property or some portion of it may be restricted as provided in subdivision 1.\n(b) An owner must also file an affidavit within 60 days after any material change in any matter required to be disclosed under paragraph (a), clauses (1) to (3), with respect to property for which an affidavit has already been recorded.\n(c) If the owner or any subsequent owner of the property removes the hazardous substance, together with any residues, liner, and contaminated underlying and surrounding soil, that owner may record an affidavit indicating the removal of the hazardous substance.\n(d) Failure to record an affidavit as provided in this subdivision does not affect or prevent any transfer of ownership of the property.\nThe county recorder shall record all affidavits presented in accordance with subdivision 2. The affidavits shall be recorded in a manner which will assure their disclosure in the ordinary course of a title search of the subject property.\n(a) Any person who knowingly violates the provisions of subdivision 1 is subject to a civil penalty in an amount determined by the court of not more than $100,000, and shall be liable under sections 115B.04 and 115B.05 for any release or threatened release of any hazardous substance resulting from the violation.\n(b) Any person who knowingly fails to record an affidavit as required by subdivision 2 shall be liable under sections 115B.04 and 115B.05 for any release or threatened release of any hazardous substance from a facility located on that property.\n(c) A civil penalty may be imposed and recovered by an action brought by a county attorney or by the attorney general in the district court of the county in which the property is located.\n(d) Any civil fines recovered under this subdivision shall be deposited in the remediation fund.",
	"repealed": false
}