{
	"id": "260E.24",
	"url": "https://www.revisor.mn.gov/statutes/cite/260E.24",
	"title": "260E.24 CONCLUSION OF ASSESSMENT OR FAMILY INVESTIGATION BY LOCAL WELFARE AGENCY.",
	"text": "The local welfare agency shall conclude the family assessment or the investigation within 45 days of the receipt of a report. The conclusion of the assessment or investigation may be extended to permit the completion of a criminal investigation or the receipt of expert information requested within 45 days of the receipt of the report.\nAfter conducting a family assessment or a noncaregiver human trafficking assessment, the local welfare agency shall determine whether child protective services are needed to address the safety of the child and other family members and the risk of subsequent maltreatment. The local welfare agency must document the information collected under section 260E.20, subdivision 3, related to the completed family assessment in the child's or family's case notes.\n[See Note.]\n(a) After conducting an investigation, the local welfare agency shall make two determinations: (1) whether maltreatment occurred; and (2) whether child protective services are needed.\n(b) No determination of maltreatment shall be made when the alleged offender is a child under the age of ten.\n(c) The local welfare agency or the agency responsible for investigating the report may make a determination of no maltreatment early in an investigation, close the case, and retain immunity, if the collected information shows no basis for a full investigation.\nFor the purposes of this chapter, except for section 260E.37, a determination that child protective services are needed means that the local welfare agency documented conditions during the assessment or investigation sufficient to cause a child protection worker, as defined in section 260E.37, to conclude that a child is at significant risk of maltreatment if protective intervention is not provided and that the individual or individuals responsible for the child's care have not taken or are not likely to take action to protect the child from maltreatment or risk of maltreatment.\n(a) Within ten working days of the conclusion of an investigation, the local welfare agency or agency responsible for investigating the report shall notify the parent or guardian of the child and the person determined to be maltreating the child, if not the parent or guardian of the child, of the determination and a summary of the specific reasons for the determination.\n(b) The notice must include a certification that the information collection procedures under section 260E.20 were followed and a notice of the right of a data subject to obtain access to other private data on the subject collected, created, or maintained under this section.\n(c) In addition, the notice shall include the length of time that the records will be kept under section 260E.35, subdivision 6. The investigating agency shall notify the parent or guardian of the child who is the subject of the report and any person determined to have maltreated the child of their appeal or review rights under this chapter.\n(d) The notice must also state that a finding of maltreatment may result in denial of a license or certification application or background study disqualification under chapter 245C related to employment or services that are licensed or certified by the Department of Human Services under chapter 245A; the Department of Children, Youth, and Families under chapter 142B or 142C; the Department of Health under chapter 144 or 144A; or the Department of Corrections under section 241.021 and from providing services related to an unlicensed personal care provider organization under chapter 256B.\n(a) A child under age three who is involved in a substantiated case of maltreatment shall be referred for screening under the Individuals with Disabilities Education Act, part C. Parents must be informed that the evaluation and acceptance of services are voluntary. The commissioner of children, youth, and families shall monitor referral rates by county. Refusal to have a child screened is not a basis for a child in need of protection or services petition under chapter 260C.\n(b) The commissioner of children, youth, and families shall include the referral rates by county for screening under the Individuals with Disabilities Education Act, part C in the annual report on child maltreatment under section 257.0725. This paragraph expires January 1, 2032.\nWithin ten working days of the conclusion of a family assessment or a noncaregiver human trafficking assessment, the local welfare agency shall notify the parent or guardian of the child of the need for services to address child safety concerns or significant risk of subsequent maltreatment. The local welfare agency and the family may also jointly agree that family support and family preservation services are needed.\n[See Note.]",
	"repealed": false
}