{
	"id": "142E.14",
	"url": "https://www.revisor.mn.gov/statutes/cite/142E.14",
	"title": "142E.14 COUNTY CONTRIBUTION.",
	"text": "(a) In addition to payments from basic sliding fee child care program participants, each county shall contribute from county tax or other sources a fixed local match equal to its calendar year 1996 required county contribution reduced by the administrative funding loss that would have occurred in state fiscal year 1996 under section 142E.02, subdivision 9. The commissioner shall recover funds from the county as necessary to bring county expenditures into compliance with this subdivision. The commissioner may accept county contributions, including contributions above the fixed local match, in order to make state payments.\n(b) The commissioner may accept payments from counties to:\n(1) fulfill the county contribution as required under subdivision 1;\n(2) pay for services authorized under this chapter beyond those paid for with federal or state funds or with the required county contributions; or\n(3) pay for child care services in addition to those authorized under this chapter, as authorized under other federal, state, or local statutes or regulations.\n(c) The county payments must be deposited in an account in the special revenue fund. Money in this account is appropriated to the commissioner for child care assistance under this chapter and other applicable statutes and regulations and is in addition to other state and federal appropriations.\n(a) An amount of child care assistance paid to a recipient or provider in excess of the payment due is recoverable by the county agency or commissioner under paragraphs (b) and (e), even when the overpayment was caused by circumstances outside the responsibility and control of the family or provider. Overpayments designated solely as agency error, and not the result of acts or omissions on the part of a provider or recipient, must not be established or collected.\n(b) An overpayment must be recouped or recovered from the family if the overpayment benefited the family by causing the family to pay less for child care expenses than the family otherwise would have been required to pay under child care assistance program requirements. The recoupment or recovery shall proceed as follows:\n(1) if the family remains eligible for child care assistance, the overpayment must be recovered through recoupment as identified in Minnesota Rules, part 3400.0187, except that the overpayments must be calculated and collected on a service period basis;\n(2) if the family no longer remains eligible for child care assistance and the overpayments were the result of fraud under section 256.98 or 256.046, theft under section 609.52, false claims under the state or federal False Claims Act, or a federal crime relating to theft of government funds or fraudulent receipt of benefits for a program administered by the county or commissioner, the county or commissioner shall seek voluntary repayment from the family and shall initiate civil court proceedings to recover the overpayment if the county or commissioner is unable to recoup the overpayment through voluntary repayment;\n(3) if the family no longer remains eligible for child care assistance, the overpayments were not the result of fraud, theft, or a federal crime as described in clause (2), and the overpayment is less than $50, the county or commissioner may choose to initiate efforts to recover overpayments from the family; or\n(4) if the family no longer remains eligible for child care assistance, the overpayments were not the result of fraud, theft, or a federal crime as described in clause (2), and the overpayment is greater than or equal to $50, the county or commissioner shall seek voluntary repayment of the overpayment from the family. If the county or commissioner is unable to recoup the overpayment through voluntary repayment, the county or commissioner shall initiate civil court proceedings to recover the overpayment unless the county's or commissioner's costs to recover the overpayment will exceed the amount of the overpayment.\n(c) The commissioner's authority to recoup and recover overpayments from families in paragraph (b) is limited to investigations conducted under chapter 142E.\n(d) A family with an outstanding debt under this subdivision is not eligible for child care assistance until:\n(1) the debt is paid in full;\n(2) satisfactory arrangements are made with the county or commissioner to retire the debt consistent with the requirements of this chapter and Minnesota Rules, chapter 3400, and the family is in compliance with the arrangements; or\n(3) the commissioner determines that it is in the best interests of the state to compromise debts owed to the state pursuant to section 16D.15.\n(e) The county or commissioner must recover an overpayment from a provider if the overpayment did not benefit the family by causing it to receive more child care assistance or to pay less for child care expenses than the family otherwise would have been eligible to receive or required to pay under child care assistance program requirements, and benefited the provider by causing the provider to receive more child care assistance than otherwise would have been paid on the family's behalf under child care assistance program requirements. The recovery shall proceed as follows:\n(1) if the provider continues to care for children receiving child care assistance, the overpayment must be recovered through recoupment as identified in Minnesota Rules, part 3400.0187, and the provider may not charge families using that provider more to cover the cost of recouping the overpayment;\n(2) if the provider no longer cares for children receiving child care assistance and the overpayment was the result of fraud under section 256.98 or 256.046, theft under section 609.52, false claims under the state or federal False Claims Act, or a federal crime relating to theft of government funds or fraudulent billing for a program administered by the county or commissioner, the county or commissioner shall seek voluntary repayment from the provider and shall initiate civil court proceedings to recover the overpayment if the county or commissioner is unable to recoup the overpayment through voluntary repayment;\n(3) if the provider no longer cares for children receiving child care assistance, the overpayment was not the result of fraud, theft, or a federal crime as described under clause (2), and the overpayment is less than $50, the county or commissioner may choose to initiate efforts to recover the overpayment; or\n(4) if the provider no longer cares for children receiving child care assistance, the overpayment was not the result of fraud, theft, or a federal crime as described under clause (2), and the overpayment is greater than or equal to $50, the county or commissioner shall seek voluntary repayment of the overpayment from the provider. If the county or commissioner is unable to recoup the overpayment through voluntary repayment, the county or commissioner shall initiate civil court proceedings to recover the overpayment unless the county's or commissioner's costs to recover the overpayment will exceed the amount of the overpayment.\n(f) A provider with an outstanding debt under this subdivision is not eligible to care for children receiving child care assistance until:\n(1) the debt is paid in full;\n(2) satisfactory arrangements are made with the county or commissioner to retire the debt consistent with the requirements of this chapter and Minnesota Rules, chapter 3400, and the provider is in compliance with the arrangements; or\n(3) the commissioner determines that it is in the best interests of the state to compromise debts owed to the state pursuant to section 16D.15.\n(g) When both the family and the provider acted together to intentionally cause the overpayment, both the family and the provider are jointly liable for the overpayment regardless of who benefited from the overpayment. The county or commissioner must recover the overpayment as provided in paragraphs (b) and (e). When the family or the provider is in compliance with a repayment agreement, the party in compliance is eligible to receive child care assistance or to care for children receiving child care assistance despite the other party's noncompliance with repayment arrangements.\n(h) Neither a county agency nor the commissioner shall recover an overpayment from a family or a provider that occurred more than six years before the county or the commissioner determined the amount of the overpayment. This paragraph does not apply to overpayments that are the result of fraud under section 256.046 or 256.98, theft under section 609.52, false claims under the state or federal False Claims Act, or a federal crime relating to theft of government funds or fraudulent receipt of benefits.\nThe commissioner shall recover from counties any state or federal money that was spent for persons found to be ineligible, except if the recovery is made by a county agency using any method other than recoupment, the county may keep 25 percent of the recovery. If a federal audit exception is taken based on a percentage of federal earnings, all counties shall pay a share proportional to their respective federal earnings during the period in question.\nTo receive money through this program, each county shall certify, in its annual plan to the commissioner, that the county has not reduced allocations from other federal and state sources, which, in the absence of the child care fund, would have been available for child care assistance. However, the county must continue contributions, as necessary, to maintain on the basic sliding fee program, families who are receiving assistance on July 1, 1995, until the family loses eligibility for the program or until a family voluntarily withdraws from the program. This subdivision does not affect the local match required for this program under other sections of the law.",
	"repealed": false
}