{
	"id": "611.49",
	"url": "https://www.revisor.mn.gov/statutes/cite/611.49",
	"title": "611.49 LIKELIHOOD TO ATTAIN COMPETENCY.",
	"text": "(a) The court may hold a hearing on its own initiative or upon request of either party to determine whether the defendant is likely to attain competency in the foreseeable future when the most recent court examiner's report states that the defendant is unlikely to attain competency in the foreseeable future, and either:\n(1) the defendant has not attained competency after participating and cooperating with court-ordered competency attainment programming for at least one year; or\n(2) the defendant has not received timely competency attainment services under section 611.46 after one year.\n(b) The court cannot find a defendant unlikely to attain competency based upon a defendant's refusal to cooperate with or remain at a competency program or cooperate with an examination.\n(c) The parties are entitled to 30 days of notice prior to the hearing and, unless the parties agree to a longer time period, the court must determine within 30 days after the hearing whether there is a substantial probability that the defendant will attain competency within the foreseeable future.\n(d) A party attempting to demonstrate that there is a substantial probability that the defendant will attain competency within the foreseeable future must prove that probability by a preponderance of the evidence.\n(a) If the court finds that there is a substantial probability that the defendant will attain competency within the reasonably foreseeable future, the court shall find the defendant incompetent and proceed under section 611.46.\n(b) If the court finds that there is not a substantial probability the defendant will attain competency within the reasonably foreseeable future, the court may not order the defendant to participate in or continue to participate in a competency attainment program in a locked treatment facility. The court must release the defendant from any custody holds pertaining to the underlying criminal case and require the forensic navigator to develop a bridge plan.\n(c) If the court finds that there is not a substantial probability the defendant will attain competency within the foreseeable future, the court may issue an order to the designated agency in the county of financial responsibility or the county where the defendant is present to conduct a prepetition screening pursuant to section 253B.07.\n(d) If the court finds that there is not a substantial probability that the defendant will attain competency within the foreseeable future, the court must dismiss the case unless:\n(1) the person is charged with a violation of section 609.2112 (criminal vehicular homicide); 609.2114, subdivision 1 (criminal vehicular operation, death to an unborn child); 609.2661 (murder of an unborn child in the first degree); 609.2662 (murder of an unborn child in the second degree); 609.2663 (murder of an unborn child in the third degree); 609.2664 (manslaughter of an unborn child in the first degree); or 609.2665 (manslaughter of an unborn child in the second degree); or a crime of violence as defined in section 624.712, subdivision 5, except for a violation of chapter 152; or\n(2) there is a showing of a danger to public safety if the matter is dismissed.\n(e) If the court does not dismiss the charges, the court must order continued supervision under subdivision 3.\n(a) If the court orders the continued supervision of a defendant, any party may request a hearing on the issue of continued supervision by filing a notice no more than ten days after the order for continued supervision.\n(b) When continued supervision is ordered, the court must identify the supervisory agency responsible for the supervision of the defendant and may identify a forensic navigator as the responsible entity.\n(c) Notwithstanding the reporting requirements of section 611.46, subdivision 6, the court examiner must provide an updated report to the court one year after the initial order for continued supervision as to the defendant's competency and a description of the efforts made to assist the defendant in attaining competency. The court shall hold a review hearing within 30 days of receipt of the report.\n(d) If continued supervision is ordered at the review hearing under paragraph (c), the court must set a date for a review hearing no later than two years after the most recent order for continuing supervision. The court must order review of the defendant's status, including an updated competency examination and report by the court examiner. The court examiner must submit the updated report to the court. At the review hearing, the court must determine if the defendant has attained competency, whether there is a substantial probability that the defendant will attain competency within the foreseeable future, and whether the absence of continuing supervision of the defendant is a danger to public safety. Notwithstanding subdivision 2, paragraph (d), the court may hear any motions to dismiss pursuant to the interest of justice at the review hearing.\n(e) Continued supervision of a defendant in cases where the most serious charge is a targeted misdemeanor or gross misdemeanor is subject to the limitations established in section 611.45, subdivision 3, paragraph (b).\n(f) The court may not order continued supervision of a defendant charged with a felony for more than ten years unless the defendant is charged with a violation of section 609.2112 (criminal vehicular homicide); 609.2114, subdivision 1 (criminal vehicular operation, death to an unborn child); 609.2661 (murder of an unborn child in the first degree); 609.2662 (murder of an unborn child in the second degree); 609.2663 (murder of an unborn child in the third degree); 609.2664 (manslaughter of an unborn child in the first degree); or 609.2665 (manslaughter of an unborn child in the second degree); or a crime of violence as defined in section 624.712, subdivision 5, except for a violation of chapter 152.\n(g) At any time, the head of the program may discharge the defendant from the program or facility. The head of the program must notify the court, prosecutor, defense counsel, forensic navigator, and any entity responsible for the supervision of the defendant prior to any planned discharge. Absent emergency circumstances, this notification shall be made five days prior to the discharge. If the defendant is discharged from the program or facility under emergency circumstances, notification of emergency discharge shall include a description of the emergency circumstances and may include a request for emergency transportation. The court shall make a determination on a request for emergency transportation within 24 hours. Nothing in this section prohibits a law enforcement agency from transporting a defendant pursuant to any other authority.\n(h) The court may provide, partner, or contract for pretrial supervision services or continued supervision if the defendant is found incompetent and unlikely to attain competency in the foreseeable future.",
	"repealed": false
}