{
	"id": "469.190",
	"url": "https://www.revisor.mn.gov/statutes/cite/469.190",
	"title": "469.190 LOCAL LODGING TAX.",
	"text": "Notwithstanding section 477A.016 or any other law, a statutory or home rule charter city may by ordinance, and a town may by the affirmative vote of the electors at the annual town meeting, or at a special town meeting, impose a tax of up to three percent on the gross receipts from the furnishing for consideration of lodging at a hotel, motel, rooming house, tourist court, or resort, other than the renting or leasing of it for a continuous period of 30 days or more. A statutory or home rule charter city may by ordinance impose the tax authorized under this subdivision on the camping site receipts of a municipal campground.\nNo statutory or home rule charter city or town may impose a tax under this section upon transient lodging that, when combined with any tax authorized by special law or enacted prior to 1972, exceeds a rate of three percent.\nNinety-five percent of the gross proceeds from any tax imposed under subdivision 1 shall be used by the statutory or home rule charter city or town to fund a local convention or tourism bureau for the purpose of marketing and promoting the city or town as a tourist or convention center. This subdivision shall not apply to any statutory or home rule charter city or town that has a lodging tax authorized by special law or enacted prior to 1972 at the time of enactment of this section.\nA county board acting as a town board with respect to an unorganized territory may impose a lodging tax within the unorganized territory according to this section if it determines by resolution that imposition of the tax is in the public interest.\nIf the county board passes a resolution under subdivision 4 to impose the tax, the resolution must be published for two successive weeks in a newspaper of general circulation within the unorganized territory, together with a notice fixing a date for a public hearing on the proposed tax.\nThe hearing must be held not less than two weeks nor more than four weeks after the first publication of the notice. After the public hearing, the county board may determine to take no further action, or may adopt a resolution authorizing the tax as originally proposed or approving a lesser rate of tax. The resolution must be published in a newspaper of general circulation within the unorganized territory. The voters of the unorganized territory may request a referendum on the proposed tax by filing a petition with the county auditor within 30 days after the resolution is published. The petition must be signed by voters who reside in the unorganized territory. The number of signatures must equal at least five percent of the number of persons voting in the unorganized territory in the last general election. If such a petition is timely filed, the resolution is not effective until it has been submitted to the voters residing in the unorganized territory at a general or special election and a majority of votes cast on the question of approving the resolution are in the affirmative. The commissioner of revenue shall prepare a suggested form of question to be presented at the referendum.\nAny statutory or home rule charter city, town, or county when the county board is acting as a town board with respect to an unorganized territory, may enter into a joint exercise of powers agreement pursuant to section 471.59 for the purpose of imposing the tax and disposing of its proceeds pursuant to this section.\nThe statutory or home rule charter city may agree with the commissioner of revenue that a tax imposed pursuant to this section shall be collected by the commissioner together with the tax imposed by chapter 297A, and subject to the same interest, penalties, and other rules and that its proceeds, less the cost of collection, shall be remitted to the city.",
	"repealed": false
}