{
	"id": "15.17",
	"url": "https://www.revisor.mn.gov/statutes/cite/15.17",
	"title": "15.17 OFFICIAL RECORDS.",
	"text": "All officers and agencies of the state, counties, cities, towns, school districts, municipal subdivisions or corporations, or other public authorities or political entities within the state, hereinafter \"public officer,\" shall make and preserve all records necessary to a full and accurate knowledge of their official activities. Government records may be produced in the form of computerized records. All government records shall be made on a physical medium of a quality to insure permanent records. Every public officer is empowered to reproduce records if the records are not deemed to be of permanent or archival value by the commissioner of administration and the records disposition panel under section 138.17. The public officer is empowered to reproduce these records by any photographic, photostatic, microphotographic, optical disk imaging system, microfilming, or other reproduction method that clearly and accurately reproduces the records. Each public officer may order that those photographs, photostats, microphotographs, microfilms, optical images, or other reproductions, be substituted for the originals of them. The public officer may direct the destruction or sale for salvage or other disposition of the originals from which they were made, in accordance with the disposition requirements of section 138.17. Photographs, photostats, microphotographs, microfilms, optical images, or other reproductions are for all purposes deemed the original recording of the papers, books, documents, and records reproduced when so ordered by any public officer and are admissible as evidence in all courts and proceedings of every kind. A facsimile or exemplified or certified copy of a photograph, photostat, microphotograph, microfilm, optical image, or other reproduction, or an enlargement or reduction of it, has the same effect and weight as evidence as would a certified or exemplified copy of the original.\nThe chief administrative officer of each public agency shall be responsible for the preservation and care of the agency's government records, which shall include written or printed books, papers, letters, contracts, documents, maps, plans, computer-based data, and other records made or received pursuant to law or in connection with the transaction of public business. It shall be the duty of each agency, and of its chief administrative officer, to carefully protect and preserve government records from deterioration, mutilation, loss, or destruction. Records or record books may be repaired, renovated, or rebound when necessary to preserve them properly.\nEvery legal custodian of government records, at the expiration of that official's term of office or authority, or on the official's death a legal representative, shall deliver to a successor in office all government records in custody; and the successor shall receipt therefor to the predecessor or legal representative and shall file in the office a signed acknowledgment of the delivery. Every public officer shall demand from a predecessor in office, or the predecessor's legal representative, the delivery of all government records belonging to the office.\nAccess to records containing government data is governed by sections 13.03 and 138.17.",
	"repealed": false
}