{
	"id": "241.08",
	"url": "https://www.revisor.mn.gov/statutes/cite/241.08",
	"title": "241.08 MONEY OF INMATES OF CORRECTIONAL INSTITUTIONS.",
	"text": "The chief executive officer of each institution under the jurisdiction of the commissioner of corrections shall have the care and custody of all money belonging to inmates thereof which may come into the chief executive officer's hands, keep accurate accounts thereof, and pay them out under rules prescribed by law under section 243.23, subdivision 3, or by the commissioner of corrections, taking vouchers therefor. All such money received by any officer or employee shall be paid to the chief executive officer forthwith. Every such executive officer, at the close of each month, or oftener if required by the commissioner, shall forward to the commissioner a statement of the amount of all money so received and the names of the inmates from whom received, accompanied by a check for the amount, payable to the commissioner of management and budget. On receipt of such statement, the commissioner shall transmit the same to the commissioner of management and budget, together with such check. Upon the payment of such check, the amount shall be credited to a fund to be known as \"Correctional Inmates Fund,\" for the institution from which the same was received. All such funds shall be paid out by the commissioner of management and budget upon vouchers duly approved by the commissioner of corrections as in other cases. The commissioner may permit a contingent fund to remain in the hands of the executive officer of any such institution from which necessary expenditure may from time to time be made.\nNotwithstanding the provisions of subdivision 1 or other law to the contrary, the commissioner of corrections may permit the inmates of the institutions under the commissioner's control to deposit money in a bank or other financial institution. The commissioner shall establish rules governing the deposits and shall require each inmate to maintain at the institution in which confined an amount adequate for the inmate's needs during the period of confinement and to assist the inmate upon release therefrom on parole or by discharge.",
	"repealed": false
}