{
	"id": "244.09",
	"url": "https://www.revisor.mn.gov/statutes/cite/244.09",
	"title": "244.09 MINNESOTA SENTENCING GUIDELINES COMMISSION.",
	"text": "There is hereby established the Minnesota Sentencing Guidelines Commission which shall be comprised of 11 members.\nThe Sentencing Guidelines Commission shall consist of the following:\n(1) the chief justice of the supreme court or a designee;\n(2) one judge of the court of appeals, appointed by the chief judge of the appellate court;\n(3) one district court judge appointed by the Judicial Council upon recommendation of the Minnesota District Judges Association;\n(4) one public defender appointed by the governor upon recommendation of the state public defender;\n(5) one county attorney appointed by the governor upon recommendation of the board of directors of the Minnesota County Attorneys Association;\n(6) the commissioner of corrections or a designee;\n(7) one peace officer as defined in section 626.84 appointed by the governor;\n(8) one probation officer or supervised release officer appointed by the governor;\n(9) one person who works for an organization that provides treatment or rehabilitative services for individuals convicted of felony offenses appointed by the governor;\n(10) one person who is an academic with a background in criminal justice or corrections appointed by the governor; and\n(11) three public members appointed by the governor, one of whom shall be a person who has been the victim of a crime defined as a felony or a victims' advocate, and one of whom shall be a person who has been formerly convicted of and discharged from a felony-level sentence.\nWhen an appointing authority selects individuals for membership on the commission, the authority shall make reasonable efforts to appoint qualified members of protected groups, as defined in section 43A.02, subdivision 33.\nOne of the members shall be designated by the governor as chair of the commission.\n(a) Except as provided in paragraph (b), each appointed member shall be appointed for four years and shall continue to serve during that time as long as the member occupies the position which made the member eligible for the appointment. Each member shall continue in office until a successor is duly appointed. Members shall be eligible for reappointment, and appointment may be made to fill an unexpired term.\n(b) The term of any member appointed or reappointed by the governor before the first Monday in January 2027 expires on that date. The terms of members appointed or reappointed by the governor to fill the vacancies that occur on the first Monday in January 2027 shall be staggered so that five members shall be appointed for initial terms of four years and four members shall be appointed for initial terms of two years.\n(c) The members of the commission shall elect any additional officers necessary for the efficient discharge of their duties.\nEach member of the commission shall be reimbursed for all reasonable expenses actually paid or incurred by that member in the performance of official duties in the same manner as other employees of the state. The public members of the commission shall be compensated at the rate of $50 for each day or part thereof spent on commission activities.\nThe commission shall promulgate Sentencing Guidelines for the district court. The guidelines shall be based on reasonable offense and offender characteristics. The guidelines promulgated by the commission shall be advisory to the district court and shall establish:\n(1) the circumstances under which imprisonment of an offender is proper; and\n(2) a presumptive, fixed sentence for offenders for whom imprisonment is proper, based on each appropriate combination of reasonable offense and offender characteristics. The guidelines shall provide for an increase of 20 percent and a decrease of 15 percent in the presumptive, fixed sentence.\nThe Sentencing Guidelines promulgated by the commission may also establish appropriate sanctions for offenders for whom imprisonment is not proper. Any guidelines promulgated by the commission establishing sanctions for offenders for whom imprisonment is not proper shall make specific reference to noninstitutional sanctions, including but not limited to the following: payment of fines, day fines, restitution, community work orders, work release programs in local facilities, community based residential and nonresidential programs, incarceration in a local correctional facility, and probation and the conditions thereof.\nAlthough the Sentencing Guidelines are advisory to the district court, the court shall follow the procedures of the guidelines when it pronounces sentence in a proceeding to which the guidelines apply by operation of statute. Sentencing pursuant to the Sentencing Guidelines is not a right that accrues to a person convicted of a felony; it is a procedure based on state public policy to maintain uniformity, proportionality, rationality, and predictability in sentencing.\nIn establishing and modifying the Sentencing Guidelines, the primary consideration of the commission shall be public safety. The commission shall also consider current sentencing and release practices; correctional resources, including but not limited to the capacities of local and state correctional facilities; and the long-term negative impact of the crime on the community.\nThe provisions of sections 14.001 to 14.69 do not apply to the promulgation of the Sentencing Guidelines, and the Sentencing Guidelines, including severity levels and criminal history scores, are not subject to review by the legislative commission to review administrative rules. However, the commission shall adopt rules pursuant to sections 14.001 to 14.69 which establish procedures for the promulgation of the Sentencing Guidelines, including procedures for the promulgation of severity levels and criminal history scores, and these rules shall be subject to review by the Legislative Coordinating Commission.\nThe commission, in addition to establishing Sentencing Guidelines, shall serve as a clearinghouse and information center for the collection, preparation, analysis and dissemination of information on state and local sentencing practices, and shall conduct ongoing research regarding Sentencing Guidelines, use of imprisonment and alternatives to imprisonment, plea bargaining, and other matters relating to the improvement of the criminal justice system. The commission shall from time to time make recommendations to the legislature regarding changes in the Criminal Code, criminal procedures, and other aspects of sentencing.\nThis information shall include information regarding the impact of statutory changes to the state's criminal laws related to controlled substances, including those changes enacted by the legislature in Laws 2016, chapter 160.\nAfter the implementation of the Sentencing Guidelines promulgated by the commission, the commission shall study their impact and review the powers and duties of the commissioner of corrections.\nThe commissioner of corrections shall provide adequate office space and administrative services for the commission, and the commission shall reimburse the commissioner for the space and services provided. The commission may also utilize, with their consent, the services, equipment, personnel, information and resources of other state agencies; and may accept voluntary and uncompensated services, contract with individuals, public and private agencies, and request information, reports and data from any agency of the state, or any of its political subdivisions, to the extent authorized by law.\nWhen any person, corporation, the United States government, or any other entity offers funds to the Sentencing Guidelines Commission to carry out its purposes and duties, the commission may accept the offer by majority vote and upon acceptance the chair shall receive the funds subject to the terms of the offer, but no money shall be accepted or received as a loan nor shall any indebtedness be incurred except in the manner and under the limitations otherwise provided by law.\nThe commission may select and employ a research director who shall perform the duties the commission directs, including the hiring of any clerical help and other employees as the commission shall approve. The research director shall be in the unclassified service of the state. The compensation of the research director and other staff shall be established pursuant to chapter 43A. They shall be reimbursed for the expenses necessarily incurred in the performance of their official duties in the same manner as other state employees.\nThe commission shall meet as necessary for the purpose of modifying and improving the guidelines. Any modification which amends the Sentencing Guidelines grid, including severity levels and criminal history scores, or which would result in the reduction of any sentence or in the early release of any inmate, with the exception of a modification mandated or authorized by the legislature or relating to a crime created or amended by the legislature in the preceding session, shall be submitted to the legislature by January 15 of any year in which the commission wishes to make the change and shall be effective on August 1 of that year, unless the legislature by law provides otherwise. All other modifications shall take effect according to the procedural rules of the commission. On or before January 15 of each year, the commission shall submit a written report to the committees of the senate and the house of representatives with jurisdiction over criminal justice policy that identifies and explains all modifications made during the preceding 12 months and all proposed modifications that are being submitted to the legislature that year.\n[Repealed, 1997 c 239 art 3 s 25; 1Sp1997 c 5 s 5]\nThe guidelines shall be submitted to the legislature on January 1, 1980, and shall be effective May 1, 1980, unless the legislature provides otherwise.\nThe commission shall have authority to promulgate rules to carry out the purposes of subdivision 5.\nThe Sentencing Guidelines Commission shall include in its annual report to the legislature a summary and analysis of reports received from county attorneys under section 609.11, subdivision 10.\nThe Sentencing Guidelines Commission shall include in its annual report to the legislature a summary and analysis of sentence adjustments issued under section 609.133. At a minimum, the summary and analysis must include information on the counties where a sentencing adjustment was granted and on the race, sex, and age of individuals who received a sentence adjustment.",
	"repealed": false
}