{
	"id": "58.04",
	"url": "https://www.revisor.mn.gov/statutes/cite/58.04",
	"title": "58.04 LICENSING REQUIREMENT.",
	"text": "(a) No person shall act as a residential mortgage originator, or make residential mortgage loans without first obtaining a license from the commissioner according to the licensing procedures provided in this chapter.\n(b) A licensee must be either a partnership, limited liability partnership, association, limited liability company, corporation, or other form of business organization, and must have and maintain a surety bond in the amounts prescribed under section 58.08.\n(c) The following persons are exempt from the residential mortgage originator licensing requirements:\n(1) a person who is not in the business of making residential mortgage loans and who makes no more than three such loans, with its own funds, during any 12-month period;\n(2) a financial institution as defined in section 58.02, subdivision 10;\n(3) an agency of the federal government, or of a state or municipal government;\n(4) an employee or employer pension plan making loans only to its participants;\n(5) a person acting in a fiduciary capacity, such as a trustee or receiver, as a result of a specific order issued by a court of competent jurisdiction;\n(6) a person who is a bona fide nonprofit organization that meets all the criteria required by the federal Secure and Fair Enforcement Licensing Act in Regulation H, adopted pursuant to Code of Federal Regulations, title 12, part 1008, subpart B, section 1008.103 (e)(7)(ii);\n(7) a person exempted by order of the commissioner; or\n(8) a manufactured home dealer, as defined in section 327B.01, subdivision 7 or 11b, or a manufactured home salesperson, as defined in section 327B.01, subdivision 19, that:\n(i) performs only clerical or support duties in connection with assisting a consumer in filling out a residential mortgage loan application but does not in any way offer or negotiate loan terms, or hold themselves out as a housing counselor;\n(ii) does not receive any direct or indirect compensation or gain from any individual or company for assisting consumers with a residential mortgage loan application, in excess of the customary salary or commission from the employer in connection with the sales transaction; and\n(iii) discloses to the borrower in writing:\n(A) if a corporate affiliation with a lender exists;\n(B) if a corporate affiliation with a lender exists, that the lender cannot guarantee the lowest or best terms available and the consumer has the right to choose their lender; and\n(C) if a corporate affiliation with a lender exists, the name of at least one unaffiliated lender.\n(d) For the purposes of this subdivision, \"housing counselor\" means an individual who provides assistance and guidance about residential mortgage loan terms including rates, fees, or other costs.\n(e) The disclosures required under paragraph (c), clause (8), item (iii), must be made on a one-page form prescribed by the commissioner and developed in consultation with the Manufactured and Modular Home Association. The form must be posted on the department's website.\n(a) Beginning August 1, 1999, no person shall engage in activities or practices that fall within the definition of \"servicing a residential mortgage loan\" under section 58.02, subdivision 22, without first obtaining a license from the commissioner according to the licensing procedures provided in this chapter.\n(b) The following persons are exempt from the residential mortgage servicer licensing requirements:\n(1) a person licensed as a residential mortgage originator;\n(2) an employee of one licensee or one person holding a certificate of exemption based on an exemption under this subdivision;\n(3) a person servicing loans made with its own funds, if no more than three such loans are made in any 12-month period;\n(4) a financial institution as defined in section 58.02, subdivision 10;\n(5) an agency of the federal government, or of a state or municipal government;\n(6) an employee or employer pension plan making loans only to its participants;\n(7) a person acting in a fiduciary capacity, such as a trustee or receiver, as a result of a specific order issued by a court of competent jurisdiction;\n(8) a person who is a bona fide nonprofit organization that meets all the criteria required by the federal Secure and Fair Enforcement Licensing Act in Regulation H, Code of Federal Regulations, title 12, part 1008, subpart B, section 1008.103 (e)(7)(ii); or\n(9) a person exempted by order of the commissioner.\nNo person required to be licensed under this chapter may, without a license, do business under a name or title or circulate or use advertising or make representations or give information to a person, that indicates or reasonably implies activity within the scope of this chapter.\nNo person licensed under this chapter may do business under more than one name or title.\nExcept for sections 58.13 and 58.137, subdivisions 2 and 3, this chapter does not apply to a bank, savings bank, savings association, or credit union, or to any subsidiary of any of them, that is subject to supervision by either a federal regulatory agency or the commissioner.",
	"repealed": false
}