{
	"id": "325F.19",
	"url": "https://www.revisor.mn.gov/statutes/cite/325F.19",
	"title": "325F.19 HOME INSULATION; CONSUMER PROTECTION; DEFINITIONS.",
	"text": "For the purposes of sections 325F.19 to 325F.24, the following terms shall have the meanings here given them.\n\"Advertisement\" means any written or verbal statement, illustration or depiction which appears in the mass media, in brochures, leaflets, or circulars, outdoor advertising, retail displays, or on vehicles, which is designed to cause the sale of or interest in the purchase of insulation.\n\"Commissioner\" means the commissioner of commerce.\n\"Industry members\" means producers and suppliers of materials from which insulation is made who promote the sale or distribution of insulation; manufacturers of insulation; jobbers, wholesalers and retailers of insulation; contractors and applicators who sell and install residential insulation; and those engaged in the marketing of insulation who are, or who purport to act as, agents of manufacturers or suppliers of insulation.\n\"Insulation\" means any material or assembly of materials used primarily to provide resistance to heat flow in building structures, including but not limited to mineral fibrous, mineral cellular, organic fibrous, organic cellular or reflective materials, whether in loose fill, flexible, semirigid or rigid form.\n\"Laboratory qualified to test thermal insulation\" means an approved laboratory classified by the commissioner in consultation with industry members as passing an appropriate examination of ability to perform tests and continuing inspection or follow-up service according to specifications for manufacture and installation, also referred to as \"testing laboratory.\"\n\"Presenting a clear and present danger\" means known to cause physical damage to structure or health hazards to occupants through continuing direct contact or release of a hazardous substance as defined in section 115B.02.\n\"R value\" means the measure of resistance to heat flow through a material or the reciprocal of the heat flow through a material expressed in British thermal units per hour per square foot per degree Fahrenheit at 75 degrees Fahrenheit mean temperature.\n\"Specifications for manufacture and installation\" means those specifications in section 325F.20.",
	"repealed": false
}