{
	"id": "103D.255",
	"url": "https://www.revisor.mn.gov/statutes/cite/103D.255",
	"title": "103D.255 WITHDRAWING TERRITORY.",
	"text": "(a) Proceedings to withdraw territory from an existing watershed district must be initiated by a petition filed with the board.\n(b) A majority of the managers may file a petition for withdrawal. Otherwise, the required signatures on a petition for withdrawal are the same as prescribed for an establishment petition, but the percentages must be calculated only with reference to the territory that is proposed to be withdrawn from the watershed district.\n(c) The petition must state that:\n(1) the territory described has not received or will not receive any benefits from the operation of the watershed districts;\n(2) the watershed district can perform the functions for which it was established without the inclusion of the territory; and\n(3) the territory is not, in fact, a part of the watershed.\n(d) The petition must request the release of the described territory from the watershed district.\n(e) The petition must be served on the board and any affected watershed district, and the board shall proceed as prescribed for an establishment petition. The requirements for notices and public hearings are as prescribed for the establishment petition. The board must also give notice of the hearing by mail at least ten days before the hearing to each watershed district affected by the proposed withdrawal of territory.\n(a) After the hearing, the board may issue an order releasing the territory, or a part of the territory, as described in the petition, if the board determines that:\n(1) the territory described in the petition has not received and will not receive any benefit from the operation of the watershed district;\n(2) the watershed district can perform the functions for which it was established without the inclusion of the territory; and\n(3) the territory is not, in fact, a part of the watershed.\n(b) Property may not be released that has been determined subject to benefits or damages for a project previously constructed.\n(c) Property released remains liable for the proportionate share of any indebtedness existing at the time of the order. Levies on the property released continue in force until fully paid.\n(d) If the board determines that the order prescribing the distribution of managers should be amended following the withdrawal of any territory, the board may direct redistribution of managers in the order authorizing the withdrawal.\n(e) The board must file a certified copy of the findings and order of withdrawal with the secretary of state, the auditor of each county affected by the watershed district, the commissioner, and the watershed district.",
	"repealed": false
}