{
	"id": "356.465",
	"url": "https://www.revisor.mn.gov/statutes/cite/356.465",
	"title": "356.465 SUPPLEMENTAL NEEDS TRUST AS OPTIONAL ANNUITY FORM RECIPIENT.",
	"text": "A retiring member may designate a qualified supplemental needs trust under subdivision 2 as the remainder recipient on an optional retirement annuity form for a period not to exceed the lifetime of the beneficiary of the supplemental needs trust.\nA qualified supplemental needs trust is a trust that:\n(1) was established on or after July 1, 1992;\n(2) was established solely for the benefit of one person who has a disability under federal Social Security Administration Supplemental Security Income or retirement, survivors, and disability insurance disability determination standards and who was determined as such before the creation of the trust;\n(3) is funded, in whole or in part, by the primary recipient of the optional annuity form and, unless the trust is a Zebley trust, is not funded by the beneficiary, the beneficiary's spouse, or a person who is required to pay a sum to or for the trust beneficiary under the terms of litigation or a litigation settlement;\n(4) is established to cover reasonable living expenses and other basic needs of the disabilitant, in whole or in part, in instances when public assistance does not provide sufficiently for these needs;\n(5) is not permitted to make disbursement to replace or reduce public assistance otherwise available;\n(6) is irrevocable;\n(7) terminates upon the death of the disabled person for whose benefit it was established; and\n(8) is determined by the executive director to be a trust that contains excluded assets for purposes of the qualification for public entitlement benefits under the applicable federal and state laws and regulations.\nThe provisions of this section apply to the following retirement plans:\n(1) the general state employees retirement plan of the Minnesota State Retirement System established under chapter 352;\n(2) the correctional state employees retirement plan of the Minnesota State Retirement System established under chapter 352;\n(3) the State Patrol retirement plan established under chapter 352B;\n(4) the legislators retirement plan established under chapter 3A;\n(5) the judges retirement plan established under chapter 490;\n(6) the general employees retirement plan of the Public Employees Retirement Association established under chapter 353;\n(7) the public employees police and fire plan of the Public Employees Retirement Association established under chapter 353;\n(8) the teachers retirement plan established under chapter 354;\n(9) the St. Paul Teachers Retirement Fund Association established under chapter 354A; and\n(10) the local government correctional service retirement plan of the Public Employees Retirement Association established under chapter 353E.\n(a) Notwithstanding subdivision 1, for a retirement plan specified in paragraph (b), a designation under subdivision 1 may be made by an active, disabled, deferred, or retiring member.\n(b) The applicable plan is the Teachers Retirement Association established under chapter 354.",
	"repealed": false
}