{
	"id": "501C.0814",
	"url": "https://www.revisor.mn.gov/statutes/cite/501C.0814",
	"title": "501C.0814 DISCRETIONARY POWERS; TAX SAVINGS.",
	"text": "(a) Notwithstanding the breadth of discretion granted to a trustee in the terms of the trust, including the use of such terms as \"absolute,\" \"sole,\" or \"uncontrolled,\" the trustee must exercise a discretionary power in good faith, in accordance with the terms and purposes of the trust and, in the best interests of the beneficiaries.\n(b) Subject to paragraph (d), and unless the terms of the trust expressly indicate that this paragraph does not apply:\n(1) a person other than a settlor who is a beneficiary and trustee of a trust that confers on the trustee a power to make discretionary distributions to or for the trustee's personal benefit may exercise the power only in accordance with an ascertainable standard; and\n(2) a trustee may not exercise a power to make discretionary distributions to satisfy a legal obligation of support that the trustee personally owes another person.\n(c) A power that is limited or prohibited by paragraph (b) may be exercised by a majority of the remaining trustees whose exercise of the power is not so limited or prohibited. If the power of all trustees is so limited or prohibited, the court may appoint a special fiduciary with authority to exercise the power, or all of the trustees, acting by unanimous agreement, may appoint a special fiduciary with authority to exercise the power. A special fiduciary appointed by the other trustees may not be related to or subordinate to any trustee within the meaning of section 672(c) of the Internal Revenue Code.\n(d) Paragraph (b) does not apply to:\n(1) a power held by the settlor's spouse who is the trustee of a trust for which a marital deduction, as defined in section 2056(b)(5) or 2523(e) of the Internal Revenue Code of 1986, as in effect on January 1, 2016, or as later amended, was previously allowed;\n(2) any trust during any period that the trust may be revoked or amended by its settlor;\n(3) a trust if contributions to the trust qualify for the annual exclusion under section 2503(c) of the Internal Revenue Code of 1986, as in effect on January 1, 2016, or as later amended;\n(4) a trust created on or before May 14, 1993, if the entire principal of the trust would be included in the gross estate of the trustee for federal estate tax purposes if the trustee had died on May 14, 1993, without regard to any power described in paragraph (a);\n(5) a trust created on or before May 14, 1993, if no part of the principal of the trust would be included in the gross estate of the trustee for federal estate tax purposes if the trustee had died on May 14, 1993, without exercising the power; or\n(6) a trust created on or before May 14, 1993, if (i) the trust is not exempt from the generation-skipping transfer tax under chapter 13 of the Internal Revenue Code of 1986, as amended through December 31, 1992, because of Public Law 99-514, section 1433(b) to (d); (ii) there would be a taxable termination with respect to the assets held in the trust if the trustee and all beneficiaries of the trust who are assigned to the trustee's generation or a higher generation had died on May 14, 1993; and (iii) the trust would have an inclusion ratio, as defined in section 2642(c) of the Internal Revenue Code of 1986, as amended through December 31, 1992, of one with respect to the taxable termination.\n(e) This section does not apply to a power exercisable in a capacity other than as a trustee.\n(f) If a distribution to a beneficiary is subject to the exercise of the trustee's discretion, whether or not the terms of a trust include a standard to guide the trustee in making distributions, then the interest is neither a property interest nor an enforceable right, but a mere expectancy.",
	"repealed": false
}