{
	"id": "116L.561",
	"url": "https://www.revisor.mn.gov/statutes/cite/116L.561",
	"title": "116L.561 MINNESOTA YOUTH PROGRAM.",
	"text": "The Minnesota youth program is established to:\n(1) improve the employability of eligible applicants through exposure to public or private sector work;\n(2) enhance the basic educational skills of eligible applicants;\n(3) encourage the completion of high school or equivalency;\n(4) assist eligible applicants to enter employment, school-to-work transition programs, the military, or postsecondary education or training;\n(5) enhance the citizenship skills of eligible applicants through community service and service-learning; and\n(6) provide educational, career, and life skills counseling.\nThe rate of pay for Minnesota youth program positions with public, private nonprofit, and private for-profit employers is the minimum wage. Employers may use their own funds to increase the participants' hourly wage rates. Youths designated as supervisors may be paid at a higher level to be determined by the local contractor.\nThe commissioner may enter into arrangements with existing public and private nonprofit organizations and agencies with experience in administering youth employment programs for the purpose of providing employment opportunities for eligible applicants in furtherance of this section and section 116L.56. The Department of Employment and Economic Development shall retain ultimate responsibility for the administration of this employment program.\nPreference shall be given to local contractors with experience in administering youth employment and training programs and those who have demonstrated efforts to coordinate state and federal youth programs locally.\nSeventy percent of Minnesota youth program funds must be allocated based on the county's share of economically disadvantaged youth. The remaining 30 percent must be allocated based on the county's share of population ages 14 to 24.\nOf the total allocation, up to 15 percent may be used for administrative purposes and the remainder may be used for a combination of training and participant support activities.\nEach contractor shall report to the commissioner in a format to be determined by the commissioner.\nData collected on individuals under this subdivision are private data on individuals as defined in section 13.02, subdivision 12, except that summary data may be provided under section 13.05, subdivision 7.\nWages and subsidies under this section may be paid for part-time employment.\nAn employer may not lay off, terminate, or reduce the working hours of an employee for the purpose of hiring an individual with funds provided by this section. An employer may not hire an individual with funds available under this section if any other individual is laid off from the same or a substantially equivalent job.",
	"repealed": false
}