{
	"id": "168.002",
	"url": "https://www.revisor.mn.gov/statutes/cite/168.002",
	"title": "168.002 DEFINITIONS.",
	"text": "Unless the language or context clearly indicates that a different meaning is intended, the following words, terms, and phrases, for the purposes of this chapter, shall be given the meanings subjoined to them.\n\"All-terrain vehicle\" has the meaning given in section 84.92, subdivision 8.\n\"Application for registration\" shall have the same meaning as \"listing for taxation,\" and when a motor vehicle is registered it is also listed.\n(a) \"Bus\" means (1) every motor vehicle designed for carrying more than 15 passengers including the driver and used for transporting persons, (2) every motor vehicle that is (i) designed for carrying more than ten passengers including the driver, (ii) used for transporting persons, and (iii) owned by a nonprofit organization and not operated for hire or for commercial purposes, or (3) every motor vehicle certified by the Department of Transportation as a special transportation service provider vehicle and receiving reimbursement as provided in section 256B.0625, subdivision 17.\n(b) \"Intercity bus\" means any bus operating as a common passenger carrier over regular routes and between fixed termini, but excluding all buses operating wholly within the limits of one city, or wholly within two or more contiguous cities, or between contiguous cities and a terminus outside the corporate limits of such cities, and not more than 20 miles distant measured along the fixed route from such corporate limits.\n\"Commissioner\" means the commissioner of the Minnesota Department of Public Safety.\n\"Dealer\" means any person, firm, or corporation regularly engaged in the business of manufacturing, or selling, purchasing, and generally dealing in new and unused motor vehicles having an established place of business for the sale, trade, and display of new and unused motor vehicles and having in possession new and unused motor vehicles for the purposes of sale or trade. \"Dealer\" also includes any person, firm or corporation regularly engaged in the business of manufacturing or selling, purchasing, and generally dealing in new and unused motor vehicle bodies, chassis mounted or not, and having an established place of business for the sale, trade and display of such new and unused motor vehicle bodies, and having in possession new and unused motor vehicle bodies for the purposes of sale or trade.\n\"Distributor\" means a person, firm, or corporation which has a bona fide contract or franchise with a manufacturer to distribute the new motor vehicles of that manufacturer to licensed new motor vehicle dealers, but does not include a dealer.\n(a) \"Farm truck\" means all single-unit trucks, truck-tractors, tractors, semitrailers, and trailers used by the owner thereof to transport agricultural, horticultural, dairy, and other farm products, including livestock, produced or finished by the owner of the truck, and any other personal property owned by the farmer to whom the license for the truck is issued, from the farm to market, and to transport property and supplies to the farm of the owner. Trucks, truck-tractors, tractors, semitrailers, and trailers registered as \"farm trucks\" may be used by the owner thereof to occasionally transport unprocessed and raw farm products, not produced by the owner of the truck, from the place of production to market when the transportation constitutes the first haul of the products, and may be used by the owner thereof, either farmer or logger who harvests and hauls forest products only, to transport logs, pulpwood, lumber, chips, railroad ties and other raw and unfinished forest products from the place of production to an intermediate or final assembly point or transfer yard or railhead, which transportation may be continued by another farm truck to a place for final processing or manufacture located within 200 miles of the place of production and all of which is deemed to constitute the first haul of unfinished wood products; provided that the owner and operator of the vehicle transporting planed lumber shall have in immediate possession a statement signed by the producer of the lumber designating the governmental subdivision, section, and township where the lumber was produced and that this haul, indicating the date, is the first haul thereof. The licensed vehicles may also be used by the owner thereof to transport, to and from timber-harvesting areas, equipment and appurtenances incidental to timber harvesting, and gravel and other road-building materials for timber haul roads.\n(b) \"Farm trucks\" shall also include only single-unit trucks that, because of their construction, cannot be used for any other purpose and are used exclusively to transport milk and cream en route from a farm to an assembly point or place for final manufacture, and for transporting milk and cream from an assembly point to a place for final processing or manufacture. This section shall not be construed to mean that the owner or operator of the truck cannot carry on usual accommodation services for patrons on regular return trips, such as butter, cream, cheese, and other dairy supplies.\n\"Final-stage manufacturer\" means a person, firm, or corporation which performs manufacturing operations on an incomplete motor vehicle or a van-type motor vehicle so that it becomes a type A, B, or C motor home.\n\"First year of life\" means the year of model designation of the vehicle, or, if there be no year of model designation, it shall mean the year of manufacture.\n\"First-stage manufacturer\" means a person, firm, or corporation which manufactures, assembles, and sells new motor vehicles for resale in this state.\n\"Fleet\" means a combination of 50 or more vehicles and trailers owned by a person solely for the use of that person or employees of the person and registered in this state under section 168.127. It does not include vehicles licensed under section 168.187.\n\"Full-service provider\" means a person who is appointed by the commissioner as both a deputy registrar under this chapter and a driver's license agent under chapter 171 who provides all driver services, excluding International Registration Plan and International Fuel Tax Agreement transactions. The commissioner is not a full-service provider.\n(a) \"Gross weight\" means the actual unloaded weight of the vehicle, either a truck or tractor, or the actual unloaded combined weight of a truck-tractor and semitrailer or semitrailers, or of the truck-tractor, semitrailer and one additional semitrailer, fully equipped for service, plus the weight of the maximum load which the applicant has elected to carry on such vehicle or combined vehicles.\n(b) The term gross weight applied to a truck used for towing a trailer means the unloaded weight of the truck, fully equipped for service, plus the weight of the maximum load which the applicant has elected to carry on such truck, including the weight of such part of the trailer and its load as may rest upon the truck.\n(c) The term gross weight applied to school buses means the weight of the vehicle fully equipped with all fuel tanks full of fuel, plus the weight of the passengers and their baggage computed at the rate of 100 pounds per passenger seating capacity, including that for the driver. The term gross weight applied to other buses means the weight of the vehicle fully equipped with all fuel tanks full of fuel, plus the weight of passengers and their baggage computed at the rate of 150 pounds per passenger seating capacity, including that for the driver. For bus seats designed for more than one passenger, but which are not divided so as to allot individual seats for the passengers that occupy them, allow two feet of its length per passenger to determine seating capacity.\n(d) The term gross weight applied to a truck, truck-tractor or a truck used as a truck-tractor used exclusively by the owner thereof for transporting unfinished forest products or used by the owner thereof to transport agricultural, horticultural, dairy and other farm products including livestock produced or finished by the owner of the truck and any other personal property owned by the farmer to whom the license for such truck is issued, from the farm to market, and to transport property and supplies to the farm of the owner, as described in subdivision 8, shall be the actual weight of the truck, truck-tractor or truck used as a truck-tractor or the combined weight of the truck-tractor and semitrailer plus the weight of the maximum load which the applicant has elected to carry on such vehicle or combined vehicles and shall be licensed and taxed as provided by section 168.013, subdivision 1c.\n(e) The term gross weight applied to a truck-tractor or a truck used as a truck-tractor used exclusively by the owner, or by a for-hire carrier hauling exclusively for one owner, for towing an equipment dolly shall be the actual weight of the truck-tractor or truck used as a truck-tractor plus the weight of such part of the equipment dolly and its load as may rest upon the truck-tractor or truck used as a truck-tractor, and shall be licensed separately and taxed as provided by section 168.013, subdivision 1e, and the equipment dolly shall be licensed separately and taxed as provided in section 168.013, subdivision 1d, which is applicable for the balance of the weight of the equipment dolly and the balance of the maximum load the applicant has elected to carry on such combined vehicles. The term \"equipment dolly\" as used in this subdivision means a heavy semitrailer used solely by the owner, or by a for-hire carrier hauling exclusively for one owner, to transport the owner's construction machinery, equipment, implements and other objects used on a construction project, but not to be incorporated in or to become a part of a completed project.\n(f) The term gross weight applied to a tow truck or towing vehicle defined in section 168B.011, subdivision 12a, means the weight of the tow truck or towing vehicle fully equipped for service, including the weight of the crane, winch and other equipment to control the movement of a towed vehicle, but does not include the weight of a wrecked or disabled vehicle towed or drawn by the tow truck or towing vehicle.\n\"Highway\" has the meaning given \"street or highway\" in section 169.011, subdivision 81.\n\"Limousine\" means a luxury passenger automobile that has a seating capacity of not more than 15 persons, including the driver.\n\"Manufactured home\" has the meaning given it in section 327.31, subdivision 6.\n(a) \"Motor home\" means a recreational vehicle designed to provide temporary living quarters. The motor home has a living unit built into as an integral part of, or permanently attached to the chassis of, a motor vehicle or van.\n(b) A motor home must contain permanently installed, independent, life-support systems that meet the American National Standards Institute standard number A119.2 for recreational vehicles and provide at least four of the following facilities, two of which must be from the systems listed in clauses (1), (5), and (6): (1) a cooking facility with liquid propane gas supply, (2) a refrigerator, (3) a self-contained toilet or a toilet connected to a plumbing system with a connection for external water disposal, (4) a heating or air conditioning system separate from the motor vehicle engine, (5) a potable water supply system including a sink with a faucet either self-contained or with connections for an external source, and (6) a separate 110-125 volts electrical power supply.\n(c) For purposes of this subdivision, \"permanently installed\" means built into or attached as an integral part of a chassis or van, and designed not to be removed except for repair or replacement. A system that is readily removable or held in place by clamps or tie-downs is not permanently installed.\n(d) Motor homes include a:\n(1) type A motor home, which is a raw chassis upon which is built a driver's compartment and an entire body that provides temporary living quarters as described in paragraph (b);\n(2) type B motor home, which is a van that conforms to the description in paragraph (b) and has been completed or altered by a final-stage manufacturer; and\n(3) type C motor home, which is an incomplete vehicle upon which is permanently attached a body designed to provide temporary living quarters as described in paragraph (b).\n(e) A motor vehicle with a slip-in camper or other removable equipment that is mounted into or on a motor vehicle is not a motor home, is not a recreational vehicle, and must not be registered as a recreational vehicle under section 168.013.\n(a) \"Motor vehicle\" means any self-propelled vehicle designed and originally manufactured to operate primarily on highways, and not operated exclusively upon railroad tracks. It includes any vehicle propelled or drawn by a self-propelled vehicle and includes vehicles known as trackless trolleys that are propelled by electric power obtained from overhead trolley wires but not operated upon rails.\n(b) \"Motor vehicle\" includes an all-terrain vehicle only if the all-terrain vehicle (1) has at least four wheels, (2) is owned and operated by a physically disabled person, and (3) displays both disability plates and a physically disabled certificate issued under section 169.345.\n(c) \"Motor vehicle\" does not include an all-terrain vehicle except (1) an all-terrain vehicle described in paragraph (b), or (2) an all-terrain vehicle licensed as a motor vehicle before August 1, 1985. The owner may continue to license an all-terrain vehicle described in clause (2) as a motor vehicle until it is conveyed or otherwise transferred to another owner, is destroyed, or fails to comply with the registration and licensing requirements of this chapter.\n(d) \"Motor vehicle\" does not include a snowmobile; a manufactured home; a park trailer; an electric personal assistive mobility device as defined in section 169.011, subdivision 26; a motorized foot scooter as defined in section 169.011, subdivision 46; or an electric-assisted bicycle as defined in section 169.011, subdivision 27.\n(e) \"Motor vehicle\" includes an off-highway motorcycle modified to meet the requirements of chapter 169 according to section 84.788, subdivision 12.\n(f) \"Motor vehicle\" includes a roadable aircraft as defined in section 169.011, subdivision 67a.\n\"Motorcycle\" has the meaning given in section 169.011, subdivision 44.\n\"Motorized bicycle\" has the meaning given in section 169.011, subdivision 45.\n\"Neighborhood electric vehicle\" has the meaning given in section 169.011, subdivision 47.\n\"Noncommercial vehicle\" means a one-ton pickup truck registered under section 168.013, subdivision 1e, with a 15,000 pounds or less gross vehicle weight rating and for which the owner has made a declaration that the vehicle will be operated exclusively for personal use. The declaration must be based on one or more of the following:\n(1) a change of vehicle use;\n(2) registration of a new vehicle;\n(3) transfer of vehicle ownership; or\n(4) registration renewal.\n\"One-ton pickup truck\" means any truck resembling a pickup truck with a manufacturer's nominal rated carrying capacity of one ton. If the manufacturer's nominal rated carrying capacity is not provided or is not known, then the value specified by the manufacturer as the gross vehicle weight rating as indicated on the manufacturer's certification label must be 10,001 pounds or more, not to exceed 15,000 pounds, in accordance with the definition of \"commercial motor vehicle\" in Code of Federal Regulations, title 49, section 390.5.\n\"Owner\" means any person owning or leasing a vehicle, or having the exclusive use of the vehicle, under a lease or otherwise, for a period greater than 30 days.\n\"Park trailer\" means a trailer that:\n(1) exceeds 8-1/2 feet in width in travel mode but is no larger than 400 square feet when the collapsible components are fully extended or at maximum horizontal width; and\n(2) is used as temporary living quarters.\n\"Park trailer\" does not include a manufactured home.\n(a) \"Passenger automobile\" means any motor vehicle designed and used for carrying not more than 15 individuals, including the driver.\n(b) \"Passenger automobile\" does not include motorcycles, motor scooters, buses, school buses, or commuter vans as defined in section 168.126.\n(c) \"Passenger automobile\" includes but is not limited to:\n(1) a vehicle that is a pickup truck or a van as defined in subdivisions 26 and 40;\n(2) neighborhood electric vehicles, as defined in section 169.011, subdivision 47;\n(3) medium-speed electric vehicles, as defined in section 169.011, subdivision 39; and\n(4) roadable aircraft, as defined in section 169.011, subdivision 67a.\n\"Person\" has the meaning given in section 168A.01, subdivision 14.\n\"Pickup truck\" means any truck with a manufacturer's nominal rated carrying capacity of three-fourths ton or less and commonly known as a pickup truck. If the manufacturer's nominal rated carrying capacity is not provided or cannot be determined, then the value specified by the manufacturer as the gross vehicle weight as indicated on the manufacturer's certification label must be 10,000 pounds or less.\n(a) \"Recreational vehicle\" means travel trailers including those that telescope or fold down, chassis-mounted campers, motor homes, tent trailers, teardrop trailers, and converted buses that provide temporary human living quarters.\n(b) \"Recreational vehicle\" is a vehicle that:\n(1) is not used as the residence of the owner or occupant;\n(2) is used while engaged in recreational or vacation activities; and\n(3) is either self-propelled or towed on the highways incidental to the recreational or vacation activities.\n\"Registered owner\" means any person, other than a secured party, having title to a vehicle. If a passenger automobile is under lease for a term of 180 days or more, the lessee is deemed to be the registered owner, for purposes of registration only; provided that the application for renewal of the registration of a passenger automobile is sent to the lessor.\n\"Registrar\" means the registrar of motor vehicles designated in this chapter.\n\"Semitrailer\" means a vehicle of the trailer type so designed and used in conjunction with a truck-tractor that a considerable part of its own weight or that of its load rests upon and is carried by the truck-tractor and shall include a trailer drawn by a truck-tractor semitrailer combination. For the purpose of registration, trailers coupled with a truck-tractor, semitrailer combination are semitrailers.\n(a) \"Special mobile equipment\" means every vehicle not designed or used for the transportation of persons or property and only incidentally operated or moved over a highway, except vehicles described in paragraph (b). Special mobile equipment includes, but is not limited to: ditch-digging apparatuses, pump hoists and other water well-drilling equipment registered and licensed under chapter 103I, other road construction or road maintenance machinery, aggregate processing and conveying equipment, truck-mounted log loaders that are used exclusively for commercial logging, and self-propelled cranes.\n(b) \"Special mobile equipment\" does not include:\n(1) machinery that has been temporarily or permanently mounted on a commercial motor vehicle chassis that is used only to provide a service and is not able to haul goods for resale; or\n(2) dump trucks.\nUnless otherwise specified, \"special plates\" or \"special plate\" means plates, or a single motorcycle plate, that are designed with wording or graphics that differ from a regular Minnesota passenger automobile plate or motorcycle plate.\n\"State\" means a state of the United States, the District of Columbia, Puerto Rico, the United States Virgin Islands, or any territory or insular possession subject to the jurisdiction of the United States.\n\"Tax\" means the annual registration tax imposed on vehicles in lieu of all other taxes, except wheelage taxes which may be imposed by any city, and gross earnings taxes paid by companies. The annual tax is both a property tax and a highway use tax and shall be on the basis of the calendar year.\n\"Tractor\" means any motor vehicle designed or used for drawing other vehicles but having no provision for carrying loads independently.\n\"Trailer\" means any vehicle designed for carrying property or passenger on its own structure and for being drawn by a motor vehicle but shall not include a trailer drawn by a truck-tractor semitrailer combination, or an auxiliary axle on a motor vehicle which carries a portion of the weight of the motor vehicle to which it is attached. For the purpose of registration, trailers coupled with a truck-tractor, semitrailer combination are semitrailers.\n\"Travel trailer\" means a trailer, mounted on wheels, that:\n(1) is designed to provide temporary living quarters during recreation, camping, or travel;\n(2) does not require a special highway movement permit based on its size or weight when towed by a motor vehicle; and\n(3) complies with sections 169.80, subdivision 2, and 169.81, subdivision 2.\n\"Truck\" means any motor vehicle designed and used for carrying things other than passengers, except pickup trucks and vans included within the definition of passenger automobile in subdivision 24.\n\"Truck-tractor\" means:\n(1) a motor vehicle designed and used primarily for drawing other vehicles and not constructed to carry a load other than a part of the weight of the vehicle and load drawn; and\n(2) a motor vehicle designed and used primarily for drawing other vehicles used exclusively for transporting motor vehicles and capable of carrying motor vehicles on its own structure.\n\"Unloaded weight\" means the actual weight of the vehicle fully equipped without a load.\n\"Van\" means any vehicle of box-like design with no barrier or separation between the operator's area and the remainder of the cargo-carrying area, and with a manufacturer's nominal rated carrying capacity of three-fourths ton or less. If the manufacturer's nominal rated carrying capacity is not provided or not known, then the value specified by the manufacturer as the maximum gross weight or gross vehicle weight rating as indicated on the manufacturer's certification label must be less than 10,000 pounds.\n\"Van converter or modifier\" means a person, firm, or corporation engaged in the business of modifying, completing or converting van-type vehicles into multipurpose passenger vehicles which are not motor homes as defined in subdivision 27.\n\"Vehicle\" has the meaning given in section 168A.01, subdivision 24.",
	"repealed": false
}