{
	"id": "80E.08",
	"url": "https://www.revisor.mn.gov/statutes/cite/80E.08",
	"title": "80E.08 NOTICE OF TERMINATION, CANCELLATION, OR NONRENEWAL.",
	"text": "Notwithstanding the terms of any franchise agreement or waiver to the contrary, prior to the termination, cancellation, or nonrenewal of any franchise, the manufacturer shall furnish notice of the termination, cancellation, or nonrenewal to the new motor vehicle dealer as provided in subdivision 2.\nNotice shall be in writing and except as provided in subdivision 3 shall be given not less than 90 days prior to the effective date of the termination, cancellation, or nonrenewal.\n(a) At least 15 days' notice must be provided with respect to terminations, cancellations, or nonrenewals involving the following circumstances:\n(1) conviction of or plea of nolo contendere of a franchised motor vehicle dealer, or one of its principal owners, of a crime which constitutes a felony as defined in section 609.02, subdivision 2;\n(2) the business operations of the franchised motor vehicle dealer have been abandoned or closed for seven consecutive business days unless the closing is due to an act of God, strike or labor difficulty, or other cause over which the dealer has no control;\n(3) a significant misrepresentation by the new motor vehicle dealer; or\n(4) the suspension, revocation, or refusal to renew the franchised motor vehicle dealer's license pursuant to section 168.27.\n(b) Not less than 180 days' notice must be provided prior to the effective date of cancellation, termination, or nonrenewal where the manufacturer or distributor is discontinuing the sale of the product line.\nThe notice shall be sent by certified mail or personally delivered to the new motor vehicle dealer. The notice shall contain the following information:\n(a) a statement of intention to terminate, cancel, or nonrenew the franchise;\n(b) a statement of the reasons for the termination, cancellation, or nonrenewal; and\n(c) the date on which the termination, cancellation, or nonrenewal takes effect.",
	"repealed": false
}