{
	"id": "116J.8749",
	"url": "https://www.revisor.mn.gov/statutes/cite/116J.8749",
	"title": "116J.8749 MAIN STREET ECONOMIC REVITALIZATION PROGRAM.",
	"text": "(a) For the purposes of this section, the following terms have the meanings given.\n(b) \"Borrower\" means an eligible recipient receiving a loan guaranteed under this section.\n(c) \"Commissioner\" means the commissioner of employment and economic development.\n(d) \"Eligible project\" means the development, redevelopment, demolition, site preparation, predesign, design, engineering, repair, or renovation of real property or capital improvements. Eligible projects must be designed to address the greatest economic development and redevelopment needs that have arisen in the community surrounding that real property since March 15, 2020. Eligible project includes but is not limited to the construction of buildings, infrastructure, and related site amenities, landscaping, or street-scaping. Eligible project does not include the purchase of real estate or business operations or business operating expenses, such as inventory, wages, or working capital.\n(e) \"Eligible recipient\" means a:\n(1) business;\n(2) nonprofit organization; or\n(3) developer\nthat is seeking funding to complete an eligible project. Eligible recipient does not include a partner organization or a local unit of government.\n(f) \"Guaranteed loan\" means a loan guaranteed by the state for 80 percent of the loan amount for a maximum period of 15 years from the origination of the loan.\n(g) \"Leveraged grant\" means a grant that is matched by the eligible recipient's commitment to the eligible project of nonstate funds at a level of 200 percent of the grant amount. The nonstate match may include but is not limited to funds contributed by a partner organization and insurance proceeds.\n(h) \"Loan guarantee trust fund\" means a dedicated account established under this section for the purpose of compensation for defaulted loan guarantees.\n(i) \"Partner organizations\" or \"partners\" means:\n(1) foundations engaged in economic development;\n(2) community development financial institutions; and\n(3) community development corporations.\n(j) \"Program\" means the Main Street Economic Revitalization Program under this section.\n(k) \"Subordinated loan\" means a loan secured by a lien that is lower in priority than one or more specified other liens.\nThe commissioner shall establish the Main Street Economic Revitalization Program to make grants to partner organizations to fund leveraged grants and guaranteed loans to specific named eligible recipients for eligible projects that are designed to address the greatest economic development and redevelopment needs that have arisen in the surrounding community since March 15, 2020.\n(a) The commissioner shall make grants to partner organizations to provide leveraged grants and guaranteed loans to eligible recipients using criteria, forms, applications, and reporting requirements developed by the commissioner.\n(b) To be eligible for a grant, a partner organization must:\n(1) outline a plan to provide leveraged grants and guaranteed loans to eligible recipients for specific eligible projects that represent the greatest economic development and redevelopment needs in the surrounding community. This plan must include an analysis of the economic impact of the eligible projects the partner organization proposes to make these investments in;\n(2) establish a process of ensuring there are no conflicts of interest in determining awards under the program; and\n(3) demonstrate that the partner organization has raised funds for the specific purposes of this program to commit to the proposed eligible projects or will do so within the 15-month period following the encumbrance of funds. Existing assets and state or federal funds may not be used to meet this requirement.\n(c) Grants shall be made in up to three rounds:\n(1) a first round with an application date before September 1, 2021, during which no more than 50 percent of available funds will be granted;\n(2) a second round with an application date after September 1, 2021, but before March 1, 2022; and\n(3) a third round with an application date after June 30, 2023, if any funds remain after the first two rounds.\nA partner may apply in multiple rounds for projects that were not funded in earlier rounds or for new projects.\n(d) Up to four percent of a grant under this subdivision may be used by the partner organization for administration and monitoring of the program.\nIn awarding grants under this section, the commissioner shall give funding preference to applications that:\n(1) have the greatest regional economic impact under subdivision 3, paragraph (b), clause (1), particularly with regard to increasing the local tax base; and\n(2) have the greatest portion of the estimated cost of the eligible projects met through nonstate funds.\n(a) A leveraged grant to an eligible recipient shall be for no more than $750,000.\n(b) A leveraged grant may be used to finance no more than 30 percent of an eligible project.\n(c) An eligible project must have secured commitments for all required matching funds and all required development approvals before a leveraged grant may be distributed.\n(a) A guaranteed loan to an eligible recipient must:\n(1) be for no more than $2,000,000;\n(2) be for a term of no more than 15 years; and\n(3) comply with the terms under subdivision 7.\n(b) An eligible project must have all required development approvals before a guaranteed loan may be distributed.\n(c) Upon origination of a guaranteed loan, the commissioner must reserve ten percent of the loan amount into the loan guarantee trust fund created under subdivision 8.\n(d) No guaranteed loan may be made to an eligible recipient after December 31, 2024.\nFor a guaranteed loan under the program:\n(1) principal and interest payments made by the borrower under the terms of the loan are to reduce the guaranteed and nonguaranteed portion of the loan on a proportionate basis. The nonguaranteed portion shall not receive preferential treatment over the guaranteed portion;\n(2) the partner organization shall not accelerate repayment of the loan or exercise other remedies if the borrower defaults, unless:\n(i) the borrower fails to make a required payment of principal or interest within 60 days of the due date; or\n(ii) the commissioner consents in writing;\n(3) in the event of a default, the partner organization may not make a demand for payment pursuant to the guarantee unless the commissioner agrees in writing that the default has materially affected the rights or security of the parties;\n(4) the partner organization must timely prepare and deliver to the commissioner, annually by the date specified in the loan guarantee, an audited or reviewed financial statement for the loan, prepared by a certified public accountant according to generally accepted accounting principles, if available, and documentation that the borrower used the loan proceeds solely for an eligible project;\n(5) the commissioner shall have access to loan documents at any time subsequent to the loan documents being submitted to the partner organization;\n(6) the partner organization must maintain adequate records and documents concerning the loan so that the commissioner may determine the borrower's financial condition and compliance with program requirements;\n(7) orderly liquidation of collateral securing the loan must be provided for in the event of default, pursuant to the loan guarantee; and\n(8) the guaranteed portion of the loan may be subordinate to other loans made by lenders in the overall financing package.\nA loan guarantee trust fund account in the special revenue fund is created in the state treasury to pay for defaulted loan guarantees. The commissioner shall administer this account. The day that this section expires, all remaining funds in the account are canceled to the general fund.\nIn proportion to eligible demand, leveraged grants and guaranteed loans under this section shall be made so that an approximately equal dollar amount of leveraged grants and guaranteed loans are made to businesses in the metropolitan area as in the nonmetropolitan area, not to exceed 65 percent in any one area. After June 30, 2023, the department may allow leveraged grants and guaranteed loans to be made anywhere in the state without regard to geographic area.\nAll grants and grant-making processes under this section are exempt from Minnesota Statutes, sections 16A.15, subdivision 3; 16B.97; and 16B.98, subdivisions 5, 7, and 8. The commissioner must audit the use of funds under this section in accordance with standard accounting practices. The exemptions under this subdivision expire on December 31, 2023.\n(a) By January 31, 2022, and annually until December 31, 2026, after which biennial reporting will be permitted after the commissioner consults with the legislature, partner organizations participating in the program must provide a report to the commissioner that includes descriptions of the eligible projects supported by the program, the type and amount of support provided, any economic development gains attributable to the support, and an explanation of administrative expenses.\n(b) By February 15, 2022, and annually until December 31, 2026, after which biennial reporting will be permitted after the commissioner consults with the legislature, the commissioner must report to the legislative committees in the house of representatives and senate with jurisdiction over economic development about funding provided under this program based on the information received under paragraph (a) and about the performance of the loan guarantee trust fund.\nThis section expires December 31, 2036.",
	"repealed": false
}