{
	"id": "515A.2-115",
	"url": "https://www.revisor.mn.gov/statutes/cite/515A.2-115",
	"title": "515A.2-115 SUBDIVISION OR CONVERSION OF UNITS.",
	"text": "(a) If the declaration expressly so permits, (i) a unit may be subdivided into two or more units, or, (ii) if owned by a declarant, a unit may be subdivided or converted into two or more units, limited common elements, common elements, or a combination of units, limited common elements and common elements. Subject to the provisions of the declaration and other provisions of law, the unit owner shall prepare and execute an amendment to the declaration, including the floor plans or if amended after July 31, 1986, the condominium plat, subdividing or converting that unit. The amendment to the declaration shall be executed by the unit owner and any holder of an interest as security for an obligation of the unit to be subdivided or converted, assign an identifying number to each unit created, and reallocate the common element interest, votes in the association, and common expense liability formerly allocated to the subdivided unit to the units in accord with section 515A.2-108.\n(b) The unit owner shall deliver a certified copy of the recorded amendment to the association.\n(c) In the case of a unit owned by a declarant, if a declarant converts part or all of a unit to common elements, the amendment to the declaration shall reallocate among the other units the common element interest, votes in the association, and common expense liability formerly allocated to the converted unit or portion thereof on the same basis used for the initial allocation thereof.\n(d) If a holder of an interest as security for an obligation joins in the amendment pursuant to this section, the interest and remedies shall be deemed to apply to the units and the common element interests that result from the subdivision or conversion under this section. In the event of enforcement of any remedy, including foreclosure by advertisement, all instruments and notices shall describe the subject property in terms of the amended description.",
	"repealed": false
}