{
	"id": "124D.385",
	"url": "https://www.revisor.mn.gov/statutes/cite/124D.385",
	"title": "124D.385 MINNESOTA COMMISSION ON NATIONAL AND COMMUNITY SERVICE.",
	"text": "The Minnesota Commission on National and Community Service is established to assist the governor and the legislature in implementing sections 124D.37 to 124D.45 and federal law. Retroactive to the first Monday in January 1994, the terms of the members of the first commission shall be, as nearly as possible, one year for one-third of the members, two years for one-third of the members, and three years for one-third of the members. The members of the first commission shall determine the length of their terms by lot. Thereafter, the terms of commission members shall be for three years. Commission members may be reappointed upon the completion of their current term. The compensation, filling of vacancies, and removal of members are governed by section 15.0575. The commission may accept gifts and contributions from public and private organizations.\n(a) The commission consists of 25 voting members. Voting members shall include the commissioner of education.\n(b) The governor shall appoint nine additional voting members that include a representative of organizations experienced in youth education, development and training, organizations promoting adult service and volunteerism, community-based service agencies or organizations, local public or private sector labor unions, local governments, business, a national service or service learning program, Indian tribes, and an individual between the ages of 16 and 25 who is a participant or supervisor in a program. The remaining 15 voting members appointed by the governor shall include individuals with expertise in the management and operations of a nonprofit organization, including individuals with expertise in public relations, finance, and development.\n(c) The governor shall appoint up to five ex officio nonvoting members from appropriate state agencies. A representative of the Corporation for National and Community Service shall also serve as an ex officio nonvoting member.\n(d) Voting and ex officio nonvoting members may appoint designees to act on their behalf. The number of voting members who are state employees shall not exceed 25 percent.\n(e) The governor shall ensure that, to the extent possible, the membership of the commission is balanced according to geography, race, ethnicity, age, and gender. The speaker of the house and the majority leader of the senate shall each appoint two legislators to be nonvoting members of the commission.\n(a) The commission shall:\n(1) develop, with the assistance of the governor, the commissioner of education, and affected state agencies, a comprehensive state plan to provide services under sections 124D.37 to 124D.45 and federal law;\n(2) actively pursue public and private funding sources for services, including funding available under federal law;\n(3) administer the ServeMinnesota grant program under sections 124D.39 to 124D.44, including soliciting and approving grant applications from eligible organizations, and administering individual postservice benefits;\n(4) establish an evaluation plan for programs developed and services provided under sections 124D.37 to 124D.45;\n(5) report to the governor, commissioner of education, and legislature; and\n(6) administer the federal AmeriCorps Program.\n(b) Nothing in sections 124D.37 to 124D.45 precludes an organization from independently seeking public or private funding to accomplish purposes similar to those described in paragraph (a).\nThe commission may create a private nonprofit corporation that is exempt from taxation under section 501(c)(3) of the federal Internal Revenue Code of 1986. If the commission creates a private nonprofit corporation, the commission must serve as the corporation's board of directors. The private nonprofit corporation is not subject to laws governing state agencies or political subdivisions, except the provisions of chapter 13, the Open Meeting Law under chapter 13D, salary limits under section 15A.0815, subdivision 2, and audits by the legislative auditor under chapter 3 apply. Further provided that the board of directors and the executive director of the nonprofit corporation are each considered an \"official\" for purposes of section 10A.071. The commission may delegate any or all of its powers and duties under federal law or under sections 124D.37 to 124D.45 to the corporation if the nonprofit corporation is approved under federal law to administer the National and Community Service Trust Act. The commission may revoke a delegation of powers and duties at any time, and must revoke the delegation if the corporation is no longer approved under federal law as the administrator in the state of Minnesota for the National and Community Service Trust Act.",
	"repealed": false
}