{
	"id": "462.357",
	"url": "https://www.revisor.mn.gov/statutes/cite/462.357",
	"title": "462.357 OFFICIAL CONTROLS: ZONING ORDINANCE.",
	"text": "For the purpose of promoting the public health, safety, morals, and general welfare, a municipality may by ordinance regulate on the earth's surface, in the air space above the surface, and in subsurface areas, the location, height, width, bulk, type of foundation, number of stories, size of buildings and other structures, the percentage of lot which may be occupied, the size of yards and other open spaces, the density and distribution of population, the uses of buildings and structures for trade, industry, residence, recreation, public activities, or other purposes, and the uses of land for trade, industry, residence, recreation, agriculture, forestry, soil conservation, water supply conservation, conservation of shorelands, as defined in sections 103F.201 to 103F.221, access to direct sunlight for solar energy systems as defined in section 216C.06, flood control or other purposes, and may establish standards and procedures regulating such uses. To accomplish these purposes, official controls may include provision for purchase of development rights by the governing body in the form of conservation easements under chapter 84C in areas where the governing body considers preservation desirable and the transfer of development rights from those areas to areas the governing body considers more appropriate for development. No regulation may prohibit earth sheltered construction as defined in section 216C.06, subdivision 14, relocated residential buildings, manufactured homes built in conformance with sections 327.31 to 327.35, or industrialized or modular buildings for residential use built in conformance with Minnesota Rules, chapter 1361, that comply with all other zoning ordinances promulgated pursuant to this section. The regulations may divide the surface, above surface, and subsurface areas of the municipality into districts or zones of suitable numbers, shape, and area. The regulations shall be uniform for each class or kind of buildings, structures, or land and for each class or kind of use throughout such district, but the regulations in one district may differ from those in other districts. The ordinance embodying these regulations shall be known as the zoning ordinance and shall consist of text and maps. A city may by ordinance extend the application of its zoning regulations to unincorporated territory located within two miles of its limits in any direction, but not in a county or town which has adopted zoning regulations; provided that where two or more noncontiguous municipalities have boundaries less than four miles apart, each is authorized to control the zoning of land on its side of a line equidistant between the two noncontiguous municipalities unless a town or county in the affected area has adopted zoning regulations. Any city may thereafter enforce such regulations in the area to the same extent as if such property were situated within its corporate limits, until the county or town board adopts a comprehensive zoning regulation which includes the area.\nA municipality must not enact, amend, or enforce a zoning ordinance that has the effect of altering the existing density, lot-size requirements, or manufactured home setback requirements in any manufactured home park constructed before January 1, 1995, if the manufactured home park, when constructed, complied with the then existing density, lot-size and setback requirements.\nA manufactured home park, as defined in section 327.14, subdivision 3, is a conditional use in a zoning district that allows the construction or placement of a building used or intended to be used by two or more families.\nExcept as otherwise provided in this subdivision, a municipality must not enact, amend, or enforce an ordinance providing for the elimination or termination of a use by amortization which use was lawful at the time of its inception. This subdivision does not apply to adults-only bookstores, adults-only theaters, or similar adults-only businesses, as defined by ordinance.\nSubdivision 1c does not prohibit a municipality from enforcing an ordinance providing for the prevention or abatement of nuisances, as defined in section 561.01, or eliminating a use determined to be a public nuisance, as defined in section 617.81, subdivision 2, paragraph (a), clauses (i) to (ix), without payment of compensation.\n(a) Except as otherwise provided by law, any nonconformity, including the lawful use or occupation of land or premises existing at the time of the adoption of an additional control under this chapter, may be continued, including through repair, replacement, restoration, maintenance, or improvement, but not including expansion, unless:\n(1) the nonconformity or occupancy is discontinued for a period of more than one year; or\n(2) any nonconforming use is destroyed by fire or other peril to the extent of greater than 50 percent of its estimated market value, as indicated in the records of the county assessor at the time of damage, and no building permit has been applied for within 180 days of when the property is damaged. In this case, a municipality may impose reasonable conditions upon a zoning or building permit in order to mitigate any newly created impact on adjacent property or water body. When a nonconforming structure in the shoreland district with less than 50 percent of the required setback from the water is destroyed by fire or other peril to greater than 50 percent of its estimated market value, as indicated in the records of the county assessor at the time of damage, the structure setback may be increased if practicable and reasonable conditions are placed upon a zoning or building permit to mitigate created impacts on the adjacent property or water body.\n(b) Any subsequent use or occupancy of the land or premises shall be a conforming use or occupancy. A municipality may, by ordinance, permit an expansion or impose upon nonconformities reasonable regulations to prevent and abate nuisances and to protect the public health, welfare, or safety. This subdivision does not prohibit a municipality from enforcing an ordinance that applies to adults-only bookstores, adults-only theaters, or similar adults-only businesses, as defined by ordinance.\n(c) Notwithstanding paragraph (a), a municipality shall regulate the repair, replacement, maintenance, improvement, or expansion of nonconforming uses and structures in floodplain areas to the extent necessary to maintain eligibility in the National Flood Insurance Program and not increase flood damage potential or increase the degree of obstruction to flood flows in the floodway.\n(d) Paragraphs (d) to (j) apply to shoreland lots of record in the office of the county recorder on the date of adoption of local shoreland controls that do not meet the requirements for lot size or lot width. A municipality shall regulate the use of nonconforming lots of record and the repair, replacement, maintenance, improvement, or expansion of nonconforming uses and structures in shoreland areas according to paragraphs (d) to (j).\n(e) A nonconforming single lot of record located within a shoreland area may be allowed as a building site without variances from lot size requirements, provided that:\n(1) all structure and septic system setback distance requirements can be met;\n(2) a Type 1 sewage treatment system consistent with Minnesota Rules, chapter 7080, can be installed or the lot is connected to a public sewer; and\n(3) the impervious surface coverage does not exceed 25 percent of the lot.\n(f) In a group of two or more contiguous lots of record under a common ownership, an individual lot must be considered as a separate parcel of land for the purpose of sale or development, if it meets the following requirements:\n(1) the lot must be at least 66 percent of the dimensional standard for lot width and lot size for the shoreland classification consistent with Minnesota Rules, chapter 6120;\n(2) the lot must be connected to a public sewer, if available, or must be suitable for the installation of a Type 1 sewage treatment system consistent with Minnesota Rules, chapter 7080, and local government controls;\n(3) impervious surface coverage must not exceed 25 percent of each lot; and\n(4) development of the lot must be consistent with an adopted comprehensive plan.\n(g) A lot subject to paragraph (f) not meeting the requirements of paragraph (f) must be combined with the one or more contiguous lots so they equal one or more conforming lots as much as possible.\n(h) Notwithstanding paragraph (f), contiguous nonconforming lots of record in shoreland areas under a common ownership must be able to be sold or purchased individually if each lot contained a habitable residential dwelling at the time the lots came under common ownership and the lots are suitable for, or served by, a sewage treatment system consistent with the requirements of section 115.55 and Minnesota Rules, chapter 7080, or connected to a public sewer.\n(i) In evaluating all variances, zoning and building permit applications, or conditional use requests, the zoning authority shall require the property owner to address, when appropriate, stormwater runoff management, reducing impervious surfaces, increasing setback, restoration of wetlands, vegetative buffers, sewage treatment and water supply capabilities, and other conservation-designed actions.\n(j) A portion of a conforming lot may be separated from an existing parcel as long as the remainder of the existing parcel meets the lot size and sewage treatment requirements of the zoning district for a new lot and the newly created parcel is combined with an adjacent parcel.\nNotwithstanding subdivision 1e, Minnesota Rules, parts 6105.0351 to 6105.0550, may allow for the continuation and improvement of substandard structures, as defined in Minnesota Rules, part 6105.0354, subpart 30, in the Lower Saint Croix National Scenic Riverway.\n(a) A municipality proposing to adopt a new feedlot zoning control or to amend an existing feedlot zoning control must notify the Pollution Control Agency and commissioner of agriculture at the beginning of the process, no later than the date notice is given of the first hearing proposing to adopt or amend a zoning control purporting to address feedlots.\n(b) Prior to final approval of a feedlot zoning control, the governing body of a municipality may submit a copy of the proposed zoning control to the Pollution Control Agency and to the commissioner of agriculture and request review, comment, and recommendations on the environmental and agricultural effects from specific provisions in the ordinance.\n(c) The agencies' response to the municipality may include:\n(1) any recommendations for improvements in the ordinance; and\n(2) the legal, social, economic, or scientific justification for each recommendation under clause (1).\n(d) At the request of the municipality's governing body, the municipality must prepare a report on the economic effects from specific provisions in the ordinance. Economic analysis must state whether the ordinance will affect the local economy and describe the kinds of businesses affected and the projected impact the proposal will have on those businesses. To assist the municipality, the commissioner of agriculture, in cooperation with the Department of Employment and Economic Development, must develop a template for measuring local economic effects and make it available to the municipality. The report must be submitted to the commissioners of employment and economic development and agriculture along with the proposed ordinance.\n(e) A local ordinance that contains a setback for new feedlots from existing residences must also provide for a new residence setback from existing feedlots located in areas zoned agricultural at the same distances and conditions specified in the setback for new feedlots, unless the new residence is built to replace an existing residence. A municipality may grant a variance from this requirement under section 462.358, subdivision 6.\nWhen adopting or updating a comprehensive plan in a municipality located within a county that is not a greater than 80 percent area, as defined in section 103G.005, subdivision 10b, and that is located outside the metropolitan area, as defined by section 473.121, subdivision 2, the municipality shall consider adopting goals and objectives for the preservation of agricultural, forest, wildlife, and open space land and the minimization of development in sensitive shoreland areas. Within three years of updating the comprehensive plan, the municipality shall consider adopting ordinances as part of the municipality's official controls that encourage the implementation of the goals and objectives.\nAirport safety zones must be included on maps that illustrate boundaries of zoning districts and that are adopted as official controls.\n(a) At any time after the adoption of a land use plan for the municipality, the planning agency, for the purpose of carrying out the policies and goals of the land use plan, may prepare a proposed zoning ordinance and submit it to the governing body with its recommendations for adoption.\n(b) Subject to the requirements of subdivisions 3, 4, and 5, the governing body may adopt and amend a zoning ordinance by a majority vote of all its members. The adoption or amendment of any portion of a zoning ordinance which changes all or part of the existing classification of a zoning district from residential to either commercial or industrial requires a two-thirds majority vote of all members of the governing body.\n(c) The land use plan must provide guidelines for the timing and sequence of the adoption of official controls to ensure planned, orderly, and staged development and redevelopment consistent with the land use plan.\nNo zoning ordinance or amendment thereto shall be adopted until a public hearing has been held thereon by the planning agency or by the governing body. A notice of the time, place and purpose of the hearing shall be published in the official newspaper of the municipality at least ten days prior to the day of the hearing. When an amendment involves changes in district boundaries affecting an area of five acres or less, a similar notice shall be mailed at least ten days before the day of the hearing to each owner of affected property and property situated wholly or partly within 350 feet of the property to which the amendment relates. For the purpose of giving mailed notice, the person responsible for mailing the notice may use any appropriate records to determine the names and addresses of owners. A copy of the notice and a list of the owners and addresses to which the notice was sent shall be attested to by the responsible person and shall be made a part of the records of the proceedings. The failure to give mailed notice to individual property owners, or defects in the notice shall not invalidate the proceedings, provided a bona fide attempt to comply with this subdivision has been made.\nAn amendment to a zoning ordinance may be initiated by the governing body, the planning agency, or by petition of affected property owners as defined in the zoning ordinance. An amendment not initiated by the planning agency shall be referred to the planning agency, if there is one, for study and report and may not be acted upon by the governing body until it has received the recommendation of the planning agency on the proposed amendment or until 60 days have elapsed from the date of reference of the amendment without a report by the planning agency.\nThe provisions of this subdivision apply to the adoption or amendment of any portion of a zoning ordinance which changes all or part of the existing classification of a zoning district from residential to either commercial or industrial of a property located in a city of the first class, except a city of the first class in which a different process is provided through the operation of the city's home rule charter. In a city to which this subdivision applies, amendments to a zoning ordinance shall be made in conformance with this section but only after there shall have been filed in the office of the city clerk a written consent of the owners of two-thirds of the several descriptions of real estate situate within 100 feet of the total contiguous descriptions of real estate held by the same owner or any party purchasing any such contiguous property within one year preceding the request, and after the affirmative vote in favor thereof by a majority of the members of the governing body of any such city. The governing body of such city may, by a two-thirds vote of its members, after hearing, adopt a new zoning ordinance without such written consent whenever the planning commission or planning board of such city shall have made a survey of the whole area of the city or of an area of not less than 40 acres, within which the new ordinance or the amendments or alterations of the existing ordinance would take effect when adopted, and shall have considered whether the number of descriptions of real estate affected by such changes and alterations renders the obtaining of such written consent impractical, and such planning commission or planning board shall report in writing as to whether in its opinion the proposals of the governing body in any case are reasonably related to the overall needs of the community, to existing land use, or to a plan for future land use, and shall have conducted a public hearing on such proposed ordinance, changes or alterations, of which hearing published notice shall have been given in a daily newspaper of general circulation at least once each week for three successive weeks prior to such hearing, which notice shall state the time, place and purpose of such hearing, and shall have reported to the governing body of the city its findings and recommendations in writing.\nAppeals to the board of appeals and adjustments may be taken by any affected person upon compliance with any reasonable conditions imposed by the zoning ordinance. The board of appeals and adjustments has the following powers with respect to the zoning ordinance:\n(1) To hear and decide appeals where it is alleged that there is an error in any order, requirement, decision, or determination made by an administrative officer in the enforcement of the zoning ordinance.\n(2) To hear requests for variances from the requirements of the zoning ordinance including restrictions placed on nonconformities. Variances shall only be permitted when they are in harmony with the general purposes and intent of the ordinance and when the variances are consistent with the comprehensive plan. Variances may be granted when the applicant for the variance establishes that there are practical difficulties in complying with the zoning ordinance. \"Practical difficulties,\" as used in connection with the granting of a variance, means that the property owner proposes to use the property in a reasonable manner not permitted by the zoning ordinance; the plight of the landowner is due to circumstances unique to the property not created by the landowner; and the variance, if granted, will not alter the essential character of the locality. Economic considerations alone do not constitute practical difficulties. Practical difficulties include, but are not limited to, inadequate access to direct sunlight for solar energy systems. Variances shall be granted for earth sheltered construction as defined in section 216C.06, subdivision 14, when in harmony with the ordinance. The board of appeals and adjustments or the governing body as the case may be, may not permit as a variance any use that is not allowed under the zoning ordinance for property in the zone where the affected person's land is located. The board or governing body as the case may be, may permit as a variance the temporary use of a one family dwelling as a two family dwelling. The board or governing body as the case may be may impose conditions in the granting of variances. A condition must be directly related to and must bear a rough proportionality to the impact created by the variance.\nIt is the policy of this state that persons with disabilities should not be excluded by municipal zoning ordinances or other land use regulations from the benefits of normal residential surroundings. For purposes of subdivisions 6a through 9, \"person\" has the meaning given in section 245A.02, subdivision 11.\nA state licensed residential facility, including an assisted living facility under chapter 144G, serving six or fewer persons, a licensed day care facility serving 12 or fewer persons, and a group family day care facility licensed under Minnesota Rules, parts 9502.0315 to 9502.0445 to serve 14 or fewer children shall be considered a permitted single family residential use of property for the purposes of zoning, except that a residential facility whose primary purpose is to treat juveniles who have violated criminal statutes relating to sex offenses or have been adjudicated delinquent on the basis of conduct in violation of criminal statutes relating to sex offenses shall not be considered a permitted use.\nExcept as otherwise provided in subdivision 7 or in any town, municipal or county zoning regulation as authorized by this subdivision, a state licensed residential facility serving from 7 through 16 persons or a licensed day care facility serving from 13 through 16 persons shall be considered a permitted multifamily residential use of property for purposes of zoning. A township, municipal or county zoning authority may require a conditional use or special use permit in order to assure proper maintenance and operation of a facility, provided that no conditions shall be imposed on the facility which are more restrictive than those imposed on other conditional uses or special uses of residential property in the same zones, unless the additional conditions are necessary to protect the health and safety of the residents of the residential facility. Nothing herein shall be construed to exclude or prohibit residential or day care facilities from single family zones if otherwise permitted by a local zoning regulation.\nIn adopting official controls after July 1, 2008, in a municipality outside the metropolitan area, as defined by section 473.121, subdivision 2, the municipality shall consider restricting new residential, commercial, and industrial development so that the new development takes place in areas subject to the following goals and objectives:\n(1) minimizing the fragmentation and development of agricultural, forest, wildlife, and open space lands, including consideration of appropriate minimum lot sizes;\n(2) minimizing further development in sensitive shoreland areas;\n(3) minimizing development near wildlife management areas, scientific and natural areas, and nature centers;\n(4) encouraging land uses in airport safety zones that are compatible with the safe operation of the airport and the safety of people in the vicinity of the airport;\n(5) identification of areas of preference for higher density, including consideration of existing and necessary water and wastewater services, infrastructure, other services, and to the extent feasible, encouraging full development of areas previously zoned for nonagricultural uses;\n(6) encouraging development close to places of employment, shopping centers, schools, mass transit, and other public and private service centers;\n(7) identification of areas where other developments are appropriate; and\n(8) other goals and objectives a municipality may identify.",
	"repealed": false
}