{
	"id": "424A.014",
	"url": "https://www.revisor.mn.gov/statutes/cite/424A.014",
	"title": "424A.014 FINANCIAL REPORT; BOND; EXAMINATION.",
	"text": "(a) An annual financial report and audited financial statements in accordance with paragraphs (c) to (e) must be submitted by the board of trustees of the Bloomington Fire Department Relief Association and the board of trustees of each firefighters relief association with special fund assets of at least $750,000 or special fund liabilities of at least $750,000, according to any previous year's financial report.\n(b) The board of trustees of a firefighters relief association with special fund assets of less than $750,000 and special fund liabilities of less than $750,000, according to each previous year's financial report, may submit an annual financial report and audited financial statements in accordance with paragraphs (c) to (e).\n(c) The financial report must cover the relief association's special fund and general fund and be in the style and form prescribed by the state auditor. The financial report must be countersigned by:\n(1) the municipal clerk or clerk-treasurer of the municipality in which the relief association is located if the relief association is directly associated with a municipal fire department;\n(2) the municipal clerk or clerk-treasurer of the largest municipality in population that contracts with the independent nonprofit firefighting corporation if the firefighters relief association is a subsidiary of an independent nonprofit firefighting corporation, and by the secretary of the independent nonprofit firefighting corporation; or\n(3) the chief financial official of the county in which the firefighters relief association is located or primarily located if the relief association is associated with a fire department that is not located in or associated with an organized municipality.\n(d) The financial report must be retained in the office of the Bloomington Fire Department Relief Association or the firefighters relief association for public inspection and must be filed with the governing body of the government subdivision in which the associated fire department is located after the close of the fiscal year. One copy of the financial report must be furnished to the state auditor on or before June 30 after the close of the fiscal year.\n(e) Audited financial statements that present the true financial condition of the relief association's special fund and general fund must be attested to by a certified public accountant or by the state auditor and must be filed with the state auditor on or before June 30 after the close of the fiscal year. Audits must be conducted in compliance with generally accepted auditing standards and section 6.65 governing audit procedures. The state auditor may accept audited financial statements in lieu of the financial report required in paragraph (a).\n(a) The board of trustees of each firefighters relief association that is not required to and does not choose to file a financial report and audit under subdivision 1 must prepare a detailed statement of the financial affairs for the preceding fiscal year of the relief association's special and general funds in the style and form prescribed by the state auditor. The detailed statement must show:\n(1) the sources and amounts of all money received;\n(2) all disbursements, accounts payable, and accounts receivable;\n(3) the amount of money remaining in the treasury;\n(4) total assets, including a listing of all investments;\n(5) the accrued liabilities; and\n(6) all other items necessary to show accurately the revenues and expenditures and financial position of the relief association.\n(b) The detailed financial statement of the special and general funds required under paragraph (a) must be certified by a certified public accountant or by the state auditor in accordance with agreed-upon procedures and forms prescribed by the state auditor. The accountant must have at least five years of public accounting, auditing, or similar experience and must not be an active, inactive, or retired member of the relief association or the fire department.\n(c) The detailed financial statement required under paragraph (a) must be countersigned by:\n(1) the municipal clerk or clerk-treasurer of the municipality;\n(2) where applicable, the municipal clerk or clerk-treasurer of the largest municipality in population that contracts with the independent nonprofit firefighting corporation if the relief association is a subsidiary of an independent nonprofit firefighting corporation, and by the secretary of the independent nonprofit firefighting corporation; or\n(3) the chief financial official of the county in which the firefighters relief association is located or primarily located if the relief association is associated with a fire department that is not located in or associated with an organized municipality.\n(d) The firefighters relief association board must submit a copy of the detailed financial statement required under paragraph (a) that has been certified by the governing body of the municipality to the state auditor on or before March 31 after the close of the fiscal year.\n(e) A certified public accountant or auditor who performs the agreed-upon procedures under paragraph (b) is subject to the reporting requirement of section 6.67.\nThe state auditor may, upon a demonstration by a relief association of hardship or an inability to conform, extend the deadline for reports under subdivision 1 or 2, but not beyond November 30 following the due date. If the reports are not received by November 30, the municipality or relief association forfeits its current year state aid, and, until the state auditor receives the required information, the relief association or municipality is ineligible to receive any future state aid. A municipality or relief association does not qualify initially to receive, or be entitled subsequently to retain, fire state aid and police and firefighter retirement supplemental state aid payable under chapter 477B and section 423A.022 if the financial reporting requirement or the applicable requirements of this chapter or any other statute or special law have not been complied with or are not fulfilled.\n(a) The treasurer of the Bloomington Fire Department Relief Association may not enter upon duties without having given the association a bond in a reasonable amount acceptable to the municipality for the faithful discharge of duties according to law.\n(b) No treasurer of a relief association governed by sections 424A.091 to 424A.096 may enter upon the duties of the office until the treasurer has given the association a good and sufficient bond in an amount equal to at least ten percent of the assets of the relief association; however, the amount of the bond need not exceed $500,000.\n(a) The chief administrative officer of each municipality that has a fire department but does not have a relief association governed by sections 424A.091 to 424A.095 or Laws 2014, chapter 275, article 2, section 23, and that is not exempted under paragraph (b) or (c) must annually prepare a detailed financial report of the receipts and disbursements by the municipality for fire protection service during the preceding calendar year on a form prescribed by the state auditor. The financial report must contain any information that the state auditor deems necessary to disclose the sources of receipts and the purpose of disbursements for fire protection service. The financial report must be signed by the municipal clerk or clerk-treasurer with the state auditor on or before July 1 annually. The municipality does not qualify initially to receive, and is not entitled subsequently to retain, any fire state aid and police and firefighter retirement supplemental state aid payable under chapter 477B and section 423A.022 if the financial reporting requirement or the applicable requirements of any other statute or special law have not been complied with or are not fulfilled.\n(b) Each municipality that has a fire department and provides retirement coverage to its firefighters through the statewide volunteer firefighter plan under chapter 353G qualifies to have fire state aid transmitted to and retained in the statewide volunteer firefighter retirement fund without filing a detailed financial report if the executive director of the Public Employees Retirement Association certifies compliance by the municipality with the requirements of sections 353G.04 and 353G.08, subdivision 1, paragraph (e), and certifies compliance by the applicable fire chief with the requirements of section 353G.07.\n(c) Each municipality qualifies to receive fire state aid under chapter 477B without filing a financial report under paragraph (a) if the municipality:\n(1) has a fire department;\n(2) does not have a firefighters relief association directly associated with its fire department;\n(3) does not participate in the statewide volunteer firefighter retirement plan under chapter 353G;\n(4) provides retirement coverage to its firefighters through the public employees police and fire retirement plan under sections 353.63 to 353.68; and\n(5) is certified by the executive director of the Public Employees Retirement Association to the state auditor to have had an employer contribution under section 353.65, subdivision 3, for its firefighters for the immediately prior calendar year equal to or greater than its fire state aid for the immediately prior calendar year.\n(a) The state auditor, in performing an audit or examination, must notify the Legislative Commission on Pensions and Retirement if the audit or examination reveals malfeasance, misfeasance, or nonfeasance in office by relief association officials or municipal officials.\n(b) The commissioner of revenue must notify the Legislative Commission on Pensions and Retirement if the state auditor has not filed the required financial compliance reports by July 1.",
	"repealed": false
}