{
	"id": "356A.01",
	"url": "https://www.revisor.mn.gov/statutes/cite/356A.01",
	"title": "356A.01 DEFINITIONS.",
	"text": "For purposes of this chapter, the following terms have the meanings given them in this section.\n\"Benefit\" means an amount, other than an administrative expense, paid or payable from a pension plan, including a retirement annuity, service pension, disability benefit, survivor benefit, death benefit, funeral benefit, or refund.\n\"Benefit provisions\" means the portion of a pension plan that deals specifically with the benefit coverage provided by the plan, including the kinds of coverage, the eligibility for and entitlement to benefits, and the amount of benefits.\n\"Benefit recipient\" means a person who has received a benefit from a pension plan or to whom a benefit is payable under the terms of the plan document of the pension plan.\n\"Chief administrative officer\" means the person who has primary responsibility for the execution of the administrative or management affairs of a pension plan.\n\"Cofiduciary\" means a fiduciary of a pension plan, other than a fiduciary directly undertaking a fiduciary activity or directly and primarily responsible for a fiduciary activity.\n\"Covered governmental entity\" means a governmental subdivision or other governmental entity that employs persons who are plan participants in a covered pension plan and who are eligible for that participation because of their employment.\n\"Covered pension plan\" means a pension plan or fund listed in section 356.20, subdivision 2, or section 356.30, subdivision 3, or a plan established under chapter 353D, 354B, 354C, or 354D.\n\"Covered pension plan other than a statewide plan\" means a pension plan not included in the definition of a statewide plan in subdivision 24.\n\"Direct or indirect profit\" means a payment of money, the provision of a service or an item of other than nominal value, an extension of credit, a loan, or any other special consideration to a fiduciary or a direct relative of a fiduciary on behalf of the fiduciary in consideration for the performance of a fiduciary activity or a failure to perform a fiduciary activity.\n\"Direct relative\" means any of the persons or spouses of persons related to one another within the third degree of kindred under civil law.\n\"Fiduciary\" means a person identified in section 356A.02.\n\"Fiduciary activity\" means an activity described in section 356A.02, subdivision 2.\n\"Financial institution\" means a bank, savings institution, or credit union organized under federal or state law.\n\"Governing board of a pension plan\" means the body of a pension plan that is assigned or that undertakes the chief policy-making powers and management duties of the plan.\n\"Investment Advisory Council\" means the Investment Advisory Council established by section 11A.08.\n\"Liability\" means a secured or unsecured debt or an obligation for a future payment of money, including an actuarial accrued liability or an unfunded actuarial accrued liability, except where the context clearly indicates another meaning.\n\"Office of the pension plan\" means an administrative facility or portion of a facility where the primary business or administrative affairs of a pension plan are conducted and the primary and permanent records and files of the plan are retained.\n\"Pension fund\" means the assets amassed and held in a pension plan, other than the general fund, as reserves for present and future payment of benefits and administrative expenses. For the Bloomington Fire Department Relief Association or a retirement plan governed by chapter 424A, the term means the relief association special fund.\n\"Pension plan\" means all aspects of an arrangement between a public employer and its employees concerning the pension benefit coverage provided to the employees.\n\"Plan document\" means a written document or series of documents containing the eligibility requirements and entitlement provisions constituting the benefit coverage of a pension plan, including any articles of incorporation, bylaws, governing body rules and policies, municipal charter provisions, municipal ordinance provisions, or general or special state law.\n\"Plan participant\" means a person who is an active member of a pension plan by virtue of the person's employment or who is making a pension plan member contribution.\n\"State Board of Investment\" means the Minnesota State Board of Investment created by the Minnesota Constitution, article XI, section 8.\n\"Statewide plan\" means any of the following pension plans:\n(1) the Minnesota State Retirement System or a pension plan administered by it;\n(2) the Public Employees Retirement Association or a pension plan administered by it; and\n(3) the Teachers Retirement Association or a pension plan administered by it.",
	"repealed": false
}