{
	"id": "353.0141",
	"url": "https://www.revisor.mn.gov/statutes/cite/353.0141",
	"title": "353.0141 OTHER MILITARY LEAVE.",
	"text": "(a) Unless prohibited under paragraph (b), a member is eligible to purchase allowable service credit, not to exceed five cumulative years of allowable service credit, for one or more periods of service in the uniformed services, as defined in United States Code, title 38, section 4303(13), if:\n(1) the member has at least three years of allowable service credit with the general employees retirement plan, the local government correctional employees retirement plan under chapter 353E, or the public employees police and fire retirement plan;\n(2) the member's current period of employment is at least six months; and\n(3) one of the following applies:\n(i) the member's service in the uniformed services occurred before becoming a public employee as defined in section 353.01, subdivision 2; or\n(ii) the member failed to obtain service credit for a uniformed services leave of absence under section 353.01, subdivision 16, paragraph (a), clause (8).\n(b) A service credit purchase is prohibited if:\n(1) the member separated from service in the uniformed services with a dishonorable or bad conduct discharge or under other than honorable conditions; or\n(2) the member has purchased or otherwise received service credit from any Minnesota public employee pension plan for the same period of service in the uniformed services.\n(c) When purchasing a period of service, if the period of service in the uniformed services is one year or less, then the member must purchase the full period of service. If the period of service in the uniformed services is longer than one year, the member may purchase the full period, not to exceed five cumulative years, or may purchase a portion of the period of service. If a member wishes to purchase a portion of the period of service, the portion must:\n(1) not be less than one year; and\n(2) be in increments of six months of service.\nA member who desires to purchase service credit under subdivision 1 must apply with the executive director to make the purchase. The application must include all necessary documentation of the member's qualifications to make the purchase, signed written permission to allow the executive director to request and receive necessary verification of applicable facts and eligibility requirements, and any other relevant information that the executive director may require. The member must submit with the application payment of the administrative fee in the amount of $250 to cover the costs of calculating the purchase payment amount under section 356.551. If the member proceeds with the purchase, the administrative fee will be credited toward the purchase payment amount.\n(a) The purchase payment amount is the amount determined under section 356.551 for the period or periods of service requested, except that, for purposes of calculating the purchase payment amount to purchase allowable service credit for service in the uniformed services that occurred before becoming a public employee or between periods of public employment, section 356.551, subdivision 2, paragraph (c), shall not apply.\n(b) Allowable service credit must be granted by the applicable plan to the purchasing member upon the executive director's receipt of the purchase payment amount. The allowable service credit purchased under this section may not be used for the purpose of determining a disability benefit under section 353.031, 353.33, 353.656, or 353E.06.\n(c) Payment must be made before the effective date of the member's retirement.",
	"repealed": false
}