{
	"id": "256.015",
	"url": "https://www.revisor.mn.gov/statutes/cite/256.015",
	"title": "256.015 PUBLIC ASSISTANCE LIEN ON RECIPIENT'S CAUSE OF ACTION.",
	"text": "When the state agency provides, pays for, or becomes liable for medical care or furnishes subsistence or other payments to a person, the agency shall have a lien for the cost of the care and payments on any and all causes of action or recovery rights under any policy, plan, or contract providing benefits for health care or injury which accrue to the person to whom the care or payments were furnished, or to the person's legal representatives, as a result of the occurrence that necessitated the medical care, subsistence, or other payments. For purposes of this section, \"state agency\" includes prepaid health plans under contract with the commissioner according to sections 256B.69, 256L.01, subdivision 7, 256L.03, subdivision 6, and 256L.12, and Minnesota Statutes 2009 Supplement, section 256D.03, subdivision 4, paragraph (c); children's mental health collaboratives under section 245.493; demonstration projects for persons with disabilities under section 256B.77; nursing homes under the alternative payment demonstration project under section 256B.434; and county-based purchasing entities under section 256B.692.\n(a) The state agency may perfect and enforce its lien under sections 514.69, 514.70, and 514.71, and must file the verified lien statement with the appropriate court administrator in the county of financial responsibility. The verified lien statement must contain the following: the name and address of the person to whom medical care, subsistence, or other payment was furnished; the date of injury; the name and address of vendors furnishing medical care; the dates of the service or payment; the amount claimed to be due for the care or payment; and to the best of the state agency's knowledge, the names and addresses of all persons, firms, or corporations claimed to be liable for damages arising from the injuries.\n(b) This section does not affect the priority of any attorney's lien. The state agency is not subject to any limitations period referred to in section 514.69 or 514.71 and has one year from the date notice is first received by it under subdivision 4, paragraph (c), even if the notice is untimely, or one year from the date medical bills are first paid by the state agency, whichever is later, to file its verified lien statement. The state agency may commence an action to enforce the lien within one year of (1) the date the notice required by subdivision 4, paragraph (c), is received, or (2) the date the person's cause of action is concluded by judgment, award, settlement, or otherwise, whichever is later.\n(c) If the notice required in subdivision 4 is not provided by any of the parties to the claim at any stage of the claim, the state agency will have one year from the date the state agency learns of the lack of notice to commence an action. If amounts on the claim or cause of action are paid and the amount required to be paid to the state agency under subdivision 5 is not paid to the state agency, the state agency may commence an action to recover on the lien against any or all of the parties or entities which have either paid or received the payments.\nThe attorney general shall represent the commissioner to enforce the lien created under this section or, if no action has been brought, may initiate and prosecute an independent action on behalf of the commissioner against a person, firm, or corporation that may be liable to the person to whom the care or payment was furnished.\nAny prepaid health plan providing services under sections 256B.69 and 256L.12 and Minnesota Statutes 2009 Supplement, section 256D.03, subdivision 4, paragraph (c); children's mental health collaboratives under section 245.493; demonstration projects for persons with disabilities under section 256B.77; nursing homes under the alternative payment demonstration project under section 256B.434; or the county-based purchasing entity providing services under section 256B.692 may retain legal representation to enforce their lien created under this section or, if no action has been brought, may initiate and prosecute an independent action on their behalf against a person, firm, or corporation that may be liable to the person to whom the care or payment was furnished.\nThe state agency must be given notice of monetary claims against a person, firm, or corporation that may be liable in damages to the injured person when the state agency has paid for or become liable for the cost of medical care or payments related to the injury. Notice must be given as follows:\n(a) Applicants for public assistance shall notify the state or county agency of any possible claims they may have against a person, firm, or corporation when they submit the application for assistance. Recipients of public assistance shall notify the state or county agency of any possible claims when those claims arise.\n(b) A person providing medical care services to a recipient of public assistance shall notify the state agency when the person has reason to believe that a third party may be liable for payment of the cost of medical care.\n(c) A party to a claim upon which the state agency may be entitled to a lien under this section shall notify the state agency of its potential lien claim at each of the following stages of a claim:\n(1) when a claim is filed;\n(2) when an action is commenced; and\n(3) when a claim is concluded by payment, award, judgment, settlement, or otherwise.\nEvery party involved in any stage of a claim under this subdivision is required to provide notice to the state agency at that stage of the claim. However, when one of the parties to the claim provides notice at that stage, every other party to the claim is deemed to have provided the required notice at that stage of the claim. If the required notice under this paragraph is not provided to the state agency, every party will be deemed to have failed to provide the required notice. A party to a claim includes the injured person or the person's legal representative, the plaintiff, the defendants, or persons alleged to be responsible for compensating the injured person or plaintiff, and any other party to the cause of action or claim, regardless of whether the party knows the state agency has a potential or actual lien claim.\nNotice given to the county agency is not sufficient to meet the requirements of paragraphs (b) and (c).\nUpon any judgment, award, or settlement of a cause of action, or any part of it, upon which the state agency has filed its lien, including compensation for liquidated, unliquidated, or other damages, reasonable costs of collection, including attorney fees, must be deducted first. The full amount of public assistance paid to or on behalf of the person as a result of the injury must be deducted next, and paid to the state agency. The rest must be paid to the public assistance recipient or other plaintiff. The plaintiff, however, must receive at least one-third of the net recovery after attorney fees and other collection costs.\nThe lien created under this section is effective with respect to any public assistance paid on or after August 1, 1987.\n(a) Upon the request of the commissioner of human services:\n(1) any state agency or third-party payer shall cooperate by furnishing information to help establish a third-party liability, as required by the federal Deficit Reduction Act of 2005, Public Law 109-171;\n(2) any employer or third-party payer shall cooperate by furnishing a data file containing information about group health insurance plan or medical benefit plan coverage of its employees or insureds within 60 days of the request. The information in the data file must include at least the following: full name, date of birth, Social Security number if collected and stored in a system routinely used for producing data files by the employer or third-party payer, employer name, policy identification number, group identification number, and plan or coverage type.\n(b) For purposes of section 176.191, subdivision 4, the commissioner of labor and industry may allow the commissioner of human services and county agencies direct access and data matching on information relating to workers' compensation claims in order to determine whether the claimant has reported the fact of a pending claim and the amount paid to or on behalf of the claimant to the commissioner of human services.\n(c) For the purpose of compliance with section 169.09, subdivision 13, and federal requirements under Code of Federal Regulations, title 42, section 433.138 (d)(4), the commissioner of public safety shall provide accident data as requested by the commissioner of human services. The disclosure shall not violate section 169.09, subdivision 13, paragraph (d).\n(d) The commissioner of human services and county agencies shall limit its use of information gained from agencies, third-party payers, and employers to purposes directly connected with the administration of its public assistance and child support programs. The provision of information by agencies, third-party payers, and employers to the department under this subdivision is not a violation of any right of confidentiality or data privacy.",
	"repealed": false
}