{
	"id": "115C.094",
	"url": "https://www.revisor.mn.gov/statutes/cite/115C.094",
	"title": "115C.094 ABANDONED UNDERGROUND STORAGE TANKS.",
	"text": "(a) As used in this section, an abandoned underground petroleum storage tank means an underground petroleum storage tank that was:\n(1) taken out of service prior to December 22, 1988;\n(2) taken out of service on or after December 22, 1988, if the current property owner did not know of the existence of the underground petroleum storage tank and could not have reasonably been expected to have known of the tank's existence at the time the owner first acquired right, title, or interest in the tank; or\n(3) taken out of service and is located on property that is being held by the state in trust for local taxing districts under section 281.25.\n(b) The board may contract for:\n(1) a statewide assessment in order to determine the quantity, location, cost, and feasibility of removing abandoned underground petroleum storage tanks;\n(2) the removal of an abandoned underground petroleum storage tank; and\n(3) the removal and disposal of petroleum-contaminated soil if the removal is required by the commissioner at the time of tank removal.\n(c) Before the board may contract for removal of an abandoned petroleum storage tank, the tank owner must provide the board with written access to the property and release the board from any potential liability for the work performed.\n(d) If at the time of the forfeiture of property identified under paragraph (a), clause (3), the property owner or the owner's heirs, devisees, or representatives, or any person to whom the right to pay taxes was granted by statute, mortgage, or other agreement, repurchases the property under section 282.241, the board's contracted costs for the underground storage tank removal project must be included as a special assessment included in the repurchase price, as provided under section 282.251, and must be returned to the board upon the sale of the property.\n(e) Money in the fund is appropriated to the board for the purposes of this section.",
	"repealed": false
}