{
	"id": "559A.05",
	"url": "https://www.revisor.mn.gov/statutes/cite/559A.05",
	"title": "559A.05 REMEDIES FOR VIOLATION.",
	"text": "For the purposes of this section, \"material violation of section 559A.03\" means:\n(1) if applicable, failure to disclose any balloon payment as required under section 559A.03, subdivision 2;\n(2) failure to disclose the price paid by the investor seller under the contract for deed to acquire property as required under section 559A.03, subdivision 3;\n(3) failure to disclose the other essential terms of the contract as required under section 559A.03, subdivision 4;\n(4) failure to provide the general disclosure in substantially the form required under section 559A.03, subdivision 5;\n(5) failure to disclose the amortization schedule as required under section 559A.03, subdivision 6;\n(6) a violation of section 559A.03, subdivision 1, paragraph (b) or (c);\n(7) a violation of section 559A.03, subdivision 7; or\n(8) a material omission or misstatement of any of the information required to be disclosed under section 559A.03.\n(a) Notwithstanding any provision in the purchase agreement or contract for deed to the contrary, a purchaser may, within two years of the execution of the contract for deed, bring an action for relief for a material violation of section 559A.03 or a violation of 559A.04, subdivision 4. A prevailing purchaser may rescind a contract and, in conjunction with the rescission, may recover against the investor seller a sum equal to:\n(1) all amounts paid by the purchaser under the contract for deed, including payments to third parties, less the fair rental value of the residential real property for the period of time the purchaser was in possession of the property;\n(2) the reasonable value of any improvements to the residential real property made by the purchaser;\n(3) actual, consequential, and incidental damages; and\n(4) reasonable attorneys' fees and costs.\n(b) A claim for rescission and a money judgment awarded under this subdivision shall not affect any rights or responsibilities of a successor in interest to the investor seller prior to the filing of a lis pendens in the action in which such relief is sought, unless it is established by clear and convincing evidence that the successor in interest had prior knowledge that the contract for deed was executed in violation of the requirements of section 559A.03 or 559A.04, subdivision 4.\n(c) A purchaser barred under paragraph (b) from making a claim against a successor in interest to the investor seller may, within two years of the execution of the contract for deed, bring a claim for violation of the requirements of section 559A.03 or 559A.04, subdivision 4, against the original investor seller who entered into the contract for deed and may recover the greater of actual damages or statutory damages of $5,000, plus reasonable attorneys' fees and costs. The original investor seller shall have no claim for indemnification or contribution against the successor in interest.\n(a) If a mortgage holder commences foreclosure of its mortgage based on the sale to a purchaser under the contract for deed and notwithstanding any provision in the purchase agreement or contract for deed to the contrary, a purchaser may bring an action for the failure of the investor seller to procure the agreement with the mortgage holder as required under section 559A.04, subdivision 2. A prevailing purchaser may rescind a contract and may recover against the investor seller a sum equal to:\n(1) all amounts paid by the purchaser under the contract for deed, including payments to third parties, less the fair rental value of the residential real property for the period of time the purchaser was in possession of the property;\n(2) the reasonable value of any improvements to the residential real property made by the purchaser;\n(3) actual, consequential, and incidental damages; and\n(4) reasonable attorneys' fees and costs.\n(b) An action under this subdivision may be brought at any time and is not subject to the statute of limitations in subdivision 2, provided that, at least 30 days prior to bringing the action, a purchaser must deliver a notice of violation to the investor seller under the contract for deed personally or by United States mail.\n(c) An investor seller may cure the violation at any time prior to entry of a final judgment by delivering to the purchaser either evidence of the agreement with the mortgage holder as required under section 559A.04, subdivision 2, or evidence that the mortgage holder has abandoned foreclosure of the mortgage. If the violation is cured, the purchaser's action must be dismissed. An investor seller is liable to the purchaser for reasonable attorneys' fees and court costs if the seller delivers evidence of the mortgage holder's agreement or abandonment of the foreclosure after the purchaser has commenced the action.\n(d) Nothing in this subdivision shall be construed to bar or limit any other claim by a purchaser arising from the investor seller's breach of a senior mortgage.\nA purchaser's right to the remedy under subdivision 2 or 3 shall constitute grounds for injunctive relief under section 559.211.\nAn action under subdivision 2 or 3 is personal to the purchaser only, does not constitute an interest separate from the purchaser's interest in the contract for deed, and may not be assigned except to a successor in interest.\nThe rights and remedies provided in this section are cumulative to, and not a limitation of, any other rights and remedies provided under law and at equity. Nothing in this chapter shall preclude a court from construing a contract for deed as an equitable mortgage.\nThe attorney general has authority under section 8.31 to investigate and prosecute violations of sections 559A.03 and 559A.04, subdivision 4.",
	"repealed": false
}