{
	"id": "53.03",
	"url": "https://www.revisor.mn.gov/statutes/cite/53.03",
	"title": "53.03 CERTIFICATE.",
	"text": "Any corporation hereafter organized as an industrial loan and thrift company, shall, after compliance with the requirements set forth in sections 53.01 and 53.02, file a written application with the Department of Commerce for a certificate of authorization. A corporation that will not sell or issue thrift certificates for investment as permitted by this chapter need not comply with subdivision 2b. The application must be in the form prescribed by the Department of Commerce. The application must be made in the name of the corporation, executed and acknowledged by an officer designated by the board of directors of the corporation, requesting a certificate authorizing the corporation to transact business as an industrial loan and thrift company, at the place and in the name stated in the application. At the time of filing the application the applicant shall pay $1,500 filing fee if the corporation will not sell or issue thrift certificates for investment, and a filing fee of $8,000 if the corporation will sell or issue thrift certificates for investment. The fees must be collected by the commissioner and deposited in the financial institutions account under section 46.131, subdivision 11. The applicant shall also submit a copy of the bylaws of the corporation, its articles of incorporation and all amendments thereto at that time. An application for powers under subdivision 2b must also require that a notice of the filing of the application must be published once within 30 days of the receipt of the form prescribed by the Department of Commerce, at the expense of the applicant, in a qualified newspaper published in the municipality in which the proposed industrial loan and thrift company is to be located, or, if there be none, in a qualified newspaper likely to give notice in the municipality in which the company is proposed to be located. If the Department of Commerce receives a written objection to the application from any person within 15 days of the notice having been fully published, the commissioner shall proceed in the same manner as required under section 46.041, subdivisions 3 and 4, relating to state banks.\nUpon receiving an application the Department of Commerce shall make, or cause to be made, an examination to ascertain whether the assets of such corporation, over and above all its liabilities, have an actual value of not less than the par value of all of its capital represented by shares of common stock, which shall not be less than the amount prescribed by section 53.02. If upon its investigation or hearing provided for in subdivision 1 those facts appear and it further appears that the bylaws and articles of incorporation and amendments thereto are in accordance with law; that the shareholders of the corporation are of good moral character and financial integrity; that the company reasonably anticipates public demand for the loans it proposes to make in the location specified in the application, and that the proposed company will be properly and safely managed, the application shall be granted; otherwise it shall be denied.\nBefore filing the articles of incorporation or an amendment to them, the proposed name of the industrial loan and thrift company shall be submitted to the commissioner. If it is likely to confuse the public as to the character of its business, or is otherwise objectionable, additional names shall be submitted. When a satisfactory name is selected, the commissioner shall give written approval of it and issue an amended certificate of authorization.\nIf an application includes the right to issue thrift certificates for investment, the Department of Commerce must, in addition to the duties in subdivision 2, make a determination that there is a reasonable public demand for that company and that the probable volume of business in that location is sufficient to insure the solvency of any then existing industrial loan and thrift companies or banks in that locality, without endangering the safety of the company or bank in the locality as a place for investing or depositing public and private money.\n[Repealed, 1977 c 346 s 14]\nIf the application be granted without hearing the Department of Commerce shall, not later than 60 days after the application has been accepted, issue a certificate authorizing the corporation to transact business as an industrial loan and thrift company as provided in this chapter. If the application be denied without hearing the Department of Commerce shall, not later than 60 days after the application has been accepted, notify the corporation of the denial and the reasons for the denial. The applicant may request within 30 days of receiving the notice of denial, and shall be granted, a contested case hearing on the application which shall then be conducted as if no order of denial had been issued. If the commissioner approves the application after a hearing the commissioner shall, not later than 30 days after a hearing, issue a certificate authorizing the corporation to transact business as an industrial loan and thrift company as provided in this chapter. If the application be denied after a hearing the commissioner shall, not later than 30 days after a hearing, notify the corporation of the denial.\n[Repealed, 1Sp1985 c 1 s 25]\nNot more than one place of business may be maintained under any certificate of authorization issued subsequent to the enactment of Laws 1943, chapter 67, pursuant to the provisions of this chapter, but the Department of Commerce may issue more than one certificate of authorization to the same corporation upon compliance with all the provisions of this chapter governing an original issuance of a certificate of authorization. To the extent that previously filed applicable information remains unchanged, the applicant need not refile this information, unless requested. The filing fee for a branch application shall be $500 and the investigation fee $250. An industrial loan and thrift corporation with deposit liabilities may change one or more of its locations upon the written approval of the commissioner of commerce. A fee of $100 must accompany each application to the commissioner for approval to change the location of an established office. An industrial loan and thrift corporation that does not sell and issue thrift certificates for investment may change one or more locations by giving 30 days' written notice to the Department of Commerce which shall promptly amend the certificate of authorization accordingly. No change in place of business of a company to a location outside of its current trade area or more than 25 miles from its present location, whichever distance is greater, shall be permitted under the same certificate unless all of the applicable requirements of this section have been met. All money collected by the commissioner under this chapter must be deposited into the financial institutions account under section 46.131, subdivision 11.\nUpon approval by the commissioner of commerce of a commitment for insurance or guarantee of certificates to be held for investment as required in section 53.10, subdivision 3, an industrial loan and thrift company may apply to the Department of Commerce for an amended certificate of authorization and consent to sell and issue thrift certificates for investment.\nThe application, in triplicate, must be in the form prescribed by the Department of Commerce and filed in its office. At the time of filing the application, the applicant shall pay a filing fee of $8,000 and if an application is contested, 50 percent of an additional fee equal to the actual costs incurred by the Department of Commerce in approving or disapproving the application, payable to the commissioner of management and budget and credited by the commissioner of management and budget to the general fund, must be paid by the applicant and 50 percent equally by the intervening parties. A notice of the filing of the application must be published once within 30 days of the receipt of the form prescribed by the Department of Commerce, at the expense of the applicant, in a newspaper published in the municipality in which the place of business under the application is located, or if there is none, in a newspaper published at the county seat of the county in which the place of business is located. Not more than one place of business maintained under a certificate of authorization may be the subject of an application.\nUpon receiving written objection to the application from any person within 15 days of the notice having been fully published, the Department of Commerce shall order a contested case hearing to be conducted on the application.\nUpon receiving an application, the Department of Commerce shall make or cause to be made, an investigation of the application to determine that the corporation is in a solvent condition, meets current thrift industry standards of management quality and asset condition, is in compliance with the requirements of this chapter. If upon completion of its investigation and any hearing provided for in subdivision 7, it appears to the Department of Commerce that the requirements for approval contained in this subdivision have been met, the application shall be approved. In all other cases, the application shall be denied. As a condition of approval, the capital funds of the applicant corporation shall not be less than the total amount which the Department of Commerce considers necessary having in mind the potential for the issuance of certificates for investment by the applicant. The procedure in subdivision 3a shall be followed in decisions, notice, and hearing of applications for consent to sell and issue thrift certificates for investment by issuance of an amended certificate of authorization.\nSection 58A.04, subdivisions 2 and 3, apply to this section.",
	"repealed": false
}