{
	"id": "624.7142",
	"url": "https://www.revisor.mn.gov/statutes/cite/624.7142",
	"title": "624.7142 CARRYING WHILE UNDER INFLUENCE OF ALCOHOL OR CONTROLLED SUBSTANCE.",
	"text": "A person may not carry a pistol on or about the person's clothes or person in a public place:\n(1) when the person is under the influence of a controlled substance, as defined in section 152.01, subdivision 4;\n(2) when the person is under the influence of a combination of any two or more of the elements named in clauses (1), (4), and (7);\n(3) when the person is under the influence of an intoxicating substance as defined in section 169A.03, subdivision 11a, and the person knows or has reason to know that the substance has the capacity to cause impairment;\n(4) when the person is under the influence of alcohol;\n(5) when the person's alcohol concentration is 0.10 or more;\n(6) when the person's alcohol concentration is less than 0.10, but more than 0.04; or\n(7) when the person is under the influence of cannabis flower, a cannabis product, a lower-potency hemp edible, a hemp-derived consumer product, an artificially derived cannabinoid, or tetrahydrocannabinols, as those terms are defined in section 342.01.\nA peace officer may arrest a person for a violation under subdivision 1 without a warrant upon probable cause, without regard to whether the violation was committed in the officer's presence.\nWhen an officer authorized under subdivision 2 to make arrests has reason to believe that the person may be violating or has violated subdivision 1, the officer may require the person to provide a breath sample for a preliminary screening test using a device approved by the commissioner for this purpose. The results of the preliminary screening test must be used for the purpose of deciding whether an arrest should be made under this section and whether to require the chemical tests authorized in section 624.7143, but may not be used in any court action except: (1) to prove that the test was properly required of a person under section 624.7143, or (2) in a civil action arising out of the use of the pistol. Following the preliminary screening test, additional tests may be required of the person as provided under section 624.7143. A person who refuses a breath sample is subject to the provisions of section 624.7143 unless, in compliance with that section, the person submits to a blood, breath, or urine test to determine the presence of alcohol or a controlled substance.\nIn a prosecution for a violation of subdivision 1, the admission of evidence of the amount of alcohol or a controlled substance in the person's blood, breath, or urine is governed by section 169A.45.\nA person who is charged with a violation under this section may have their authority to carry a pistol in a public place on or about the person's clothes or person under the provisions of a permit or otherwise suspended by the court as a condition of release.\n(a) A person who violates a prohibition under subdivision 1, clauses (1) to (5), is guilty of a misdemeanor. A second or subsequent violation is a gross misdemeanor.\n(b) A person who violates subdivision 1, clause (6), is guilty of a misdemeanor.\n(c) In addition to the penalty imposed under paragraph (a), if a person violates subdivision 1, clauses (1) to (5), the person's authority to carry a pistol in a public place on or about the person's clothes or person under the provisions of a permit or otherwise is revoked and the person may not reapply for a period of one year from the date of conviction.\n(d) In addition to the penalty imposed under paragraph (b), if a person violates subdivision 1, clause (6), the person's authority to carry a pistol in a public place on or about the person's clothes or person under the provisions of a permit or otherwise is suspended for 180 days from the date of conviction.\n(e) Notwithstanding section 609.531, a firearm carried in violation of subdivision 1, clause (6), is not subject to forfeiture.\nSuspensions and revocations under this section must be reported in the same manner as in section 624.714, subdivision 12a.",
	"repealed": false
}