{
	"id": "388.051",
	"url": "https://www.revisor.mn.gov/statutes/cite/388.051",
	"title": "388.051 DUTIES.",
	"text": "The county attorney shall:\n(1) appear in all cases in which the county is a party;\n(2) give opinions and advice, upon the request of the county board or any county officer, upon all matters in which the county is or may be interested, or in relation to the official duties of the board or officer;\n(3) prosecute felonies, including the drawing of indictments found by the grand jury, and, to the extent prescribed by law, gross misdemeanors, misdemeanors, petty misdemeanors, and violations of municipal ordinances, charter provisions and rules or regulations;\n(4) attend before the grand jury, give them legal advice, and examine witnesses in their presence;\n(5) request the court administrator to issue subpoenas to bring witnesses before the grand jury or any judge or judicial officer before whom the county attorney is conducting a criminal hearing;\n(6) attend any inquest at the request of the coroner; and\n(7) appear, when requested by the attorney general, for the state in any case instituted by the attorney general in the county attorney's county or before the United States Land Office in case of application to preempt or locate any public lands claimed by the state and assist in the preparation and trial.\n(a) In Anoka, Carver, Dakota, Hennepin, Scott, and Washington Counties, only the county attorney shall prosecute gross misdemeanor violations of sections 289A.63, subdivisions 1, 2, 4, and 6; 297B.10; 609.255, subdivision 3; 609.377; 609.378; 609.41; and 617.247.\n(b) In Ramsey County, only the county attorney shall prosecute gross misdemeanor violations of sections 609.255, subdivision 3; 609.377; and 609.378.\n(c) The county attorney shall prosecute failure to report physical or sexual child abuse or neglect as provided under section 260E.08, paragraphs (a), (b), and (c), violations of fifth-degree criminal sexual conduct under section 609.3451, and environmental law violations under sections 115.071, 299F.098, and 609.671.\n(d) Except in Hennepin and Ramsey Counties, only the county attorney shall prosecute gross misdemeanor violations of section 152.025.\n(a) On or before January 1, 1995, each county attorney shall adopt written guidelines governing the county attorney's charging and plea negotiation policies and practices. The guidelines shall address, but need not be limited to, the following matters:\n(1) the circumstances under which plea negotiation agreements are permissible;\n(2) the factors that are considered in making charging decisions and formulating plea agreements; and\n(3) the extent to which input from other persons concerned with a prosecution, such as victims and law enforcement officers, is considered in formulating plea agreements.\n(b) Plea negotiation policies and procedures adopted under this subdivision are public data, as defined in section 13.02.\nNotwithstanding section 626.84, subdivision 2, a county attorney, or an assistant county attorney appointed under section 388.10, who lawfully possesses a permit to carry a pistol issued in accordance with section 624.714 may possess and carry a firearm while on duty, unless restricted by the county attorney.",
	"repealed": false
}