{
	"id": "6.72",
	"url": "https://www.revisor.mn.gov/statutes/cite/6.72",
	"title": "6.72 STATE AUDITOR; REPORT TO LEGISLATURE ON VOLUNTEER FIREFIGHTERS' RELIEF ASSOCIATIONS.",
	"text": "(a) Annually, the state auditor shall report to the legislature on the general financial condition of the various volunteer firefighters' relief associations in the state as of December 31 of the year preceding the filing of the report.\n(b) Two copies of the report shall be filed with the executive director of the Legislative Commission on Pensions and Retirement and the report shall be filed with the director of the Legislative Reference Library as provided by section 3.195.\nThe report must include for all volunteer firefighters' relief associations directly associated with the municipal fire departments and all volunteer firefighters' relief associations subsidiary to independent nonprofit firefighting corporations, the following:\n(1) amount of accrued liability;\n(2) amount of the assets of the special fund;\n(3) amount of surplus or unfunded accrued liability;\n(4) funding ratio;\n(5) amount of annual accruing liability or normal cost;\n(6) amount of annual required contribution to amortize the unfunded accrued liability;\n(7) amount of total required contribution;\n(8) amount of fire state aid and supplemental fire state aid;\n(9) amount of any municipal contributions;\n(10) amount of administrative expenses;\n(11) amount of service pension disbursements;\n(12) amount of other retirement benefit disbursements;\n(13) number of active members;\n(14) number of retired members;\n(15) number of deferred members;\n(16) amount of fidelity bond of secretary and treasurer;\n(17) amount of lump sum or monthly service pension accrued per year of service credit;\n(18) minimum retirement age required for commencement of a service pension;\n(19) minimum years of active service credit required for commencement of service pension;\n(20) minimum years of active membership credit required for commencement of service pension; and\n(21) type and amount of other retirement benefits.\nThe report required by this section must be organized in a manner that the state auditor determines to provide fair representation of the condition of the various volunteer firefighters' relief associations.",
	"repealed": false
}