{
	"id": "342.40",
	"url": "https://www.revisor.mn.gov/statutes/cite/342.40",
	"title": "342.40 CANNABIS EVENT ORGANIZER OPERATIONS.",
	"text": "A cannabis event organizer must receive local approval, including obtaining any necessary permits or licenses issued by a local unit of government, before holding a cannabis event.\n(a) A cannabis event organizer may charge an entrance fee to a cannabis event.\n(b) A cannabis event organizer may charge a fee to a cannabis business or hemp business in exchange for space to display and sell cannabis plants, adult-use cannabis flower, adult-use cannabis products, lower-potency hemp edibles, and hemp-derived consumer products. Any fee paid for participation in a cannabis event shall not be based on or tied to the sale of cannabis plants, adult-use cannabis flower, adult-use cannabis products, lower-potency hemp edibles, or hemp-derived consumer products.\nA cannabis event organizer must hire or contract for licensed security personnel to provide security services at the cannabis event. All security personnel hired or contracted for shall be at least 21 years of age and present on the licensed event premises at all times that cannabis plants, adult-use cannabis flower, adult-use cannabis products, lower-potency hemp edibles, or hemp-derived consumer products are available for sale or consumption of adult-use cannabis flower, adult-use cannabis products, lower-potency hemp edibles, or hemp-derived consumer products is allowed. The security personnel shall not consume cannabis flower, cannabis products, lower-potency hemp edibles, or hemp-derived consumer products for at least 24 hours before the event or during the event.\nA cannabis event organizer shall ensure that access to an event is limited to individuals who are at least 21 years of age. At or near each public entrance to any area where the sale or consumption of adult-use cannabis flower, adult-use cannabis products, lower-potency hemp edibles, or hemp-derived consumer products is allowed, a cannabis event organizer shall maintain a clearly visible and legible sign consisting of the following statement: \"No persons under 21 allowed.\" The lettering of the sign shall be not less than one inch in height.\nA cannabis event organizer shall ensure that all used, unused, and waste cannabis plants, adult-use cannabis flower, adult-use cannabis products, lower-potency hemp edibles, and hemp-derived consumer products that are not removed by a customer, cannabis business, or hemp business are disposed of in a manner approved by the office.\nAll transportation of cannabis plants, adult-use cannabis flower, adult-use cannabis products, lower-potency hemp edibles, and hemp-derived consumer products intended for display or sale and all such items used for display or not sold during the cannabis event must be transported to and from the cannabis event by a licensed cannabis transporter.\n(a) Cannabis microbusinesses with a retail endorsement, cannabis mezzobusinesses with a retail endorsement, cannabis retailers, medical cannabis combination businesses operating a retail location, and lower-potency hemp edible retailers, including the cannabis event organizer, may be authorized to sell cannabis plants, adult-use cannabis flower, adult-use cannabis products, lower-potency hemp edibles, and hemp-derived consumer products to customers at a cannabis event.\n(b) All sales of cannabis plants, adult-use cannabis flower, adult-use cannabis products, lower-potency hemp edibles, and hemp-derived consumer products at a cannabis event must take place in a retail area as designated in the premises diagram.\n(c) Authorized retailers may only conduct sales within their specifically assigned area.\n(d) Authorized retailers must verify the age of all customers pursuant to section 342.27, subdivision 4, before completing a sale and may not sell cannabis plants, adult-use cannabis flower, adult-use cannabis products, lower-potency hemp edibles, or hemp-derived consumer products to an individual under 21 years of age.\n(e) Authorized retailers may display one sample of each type of cannabis plant, adult-use cannabis flower, adult-use cannabis product, lower-potency hemp edible, and hemp-derived consumer product available for sale. Samples of adult-use cannabis and adult-use cannabis products must be stored in a sample jar or display case and be accompanied by a label or notice containing the information required to be affixed to the packaging or container containing adult-use cannabis flower and adult-use cannabis products sold to customers. A sample may not consist of more than eight grams of adult-use cannabis flower or adult-use cannabis concentrate, or an edible cannabis product infused with more than 100 milligrams of tetrahydrocannabinol. A cannabis retailer may allow customers to smell the adult-use cannabis flower or adult-use cannabis product before purchase.\n(f) The notice requirements under section 342.27, subdivision 6, apply to authorized retailers offering cannabis plants, adult-use cannabis flower, adult-use cannabinoid products, and hemp-derived consumer products for sale at a cannabis event.\n(g) Authorized retailers may not:\n(1) sell adult-use cannabis flower, adult-use cannabis products, lower-potency hemp edibles, or hemp-derived consumer products to a person who is visibly intoxicated;\n(2) knowingly sell more cannabis plants, adult-use cannabis flower, adult-use cannabis products, lower-potency hemp edibles, or hemp-derived consumer products than a customer is legally permitted to possess;\n(3) sell medical cannabis flower or medical cannabinoid products;\n(4) give away cannabis plants, cannabis flower, cannabis products, lower-potency hemp edibles, or hemp-derived consumer products; or\n(5) allow for the dispensing of cannabis plants, cannabis flower, cannabis products, lower-potency hemp edibles, or hemp-derived consumer products in vending machines.\n(h) Except for samples of a cannabis plant, adult-use cannabis flower, adult-use cannabis product, lower-potency hemp edible, and hemp-derived consumer product, all cannabis plants, adult-use cannabis flower, adult-use cannabis products, lower-potency hemp edibles, and hemp-derived consumer products for sale at a cannabis event must be stored in a secure, locked container that is not accessible to the public. Such items being stored at a cannabis event shall not be left unattended.\n(i) All cannabis plants, adult-use cannabis flower, adult-use cannabis products, lower-potency hemp edibles, and hemp-derived consumer products for sale at a cannabis event must comply with this chapter and rules adopted pursuant to this chapter regarding the testing, packaging, and labeling of those items.\n(j) All cannabis plants, adult-use cannabis flower, and adult-use cannabis products sold, damaged, or destroyed at a cannabis event must be recorded in the statewide monitoring system.\n(a) If approved by the local unit of government, a cannabis event may designate an area for consumption of adult-use cannabis flower, adult-use cannabis products, lower-potency hemp edibles, hemp-derived consumer products, or any combination of those items.\n(b) Access to areas where consumption of adult-use cannabis flower, adult-use cannabis products, lower-potency hemp edibles, or hemp-derived consumer products is allowed shall be restricted to individuals who are at least 21 years of age.\n(c) The cannabis event organizer shall ensure that consumption of adult-use cannabis flower, adult-use cannabis products, lower-potency hemp edibles, or hemp-derived consumer products within a designated consumption area is not visible from any public place.\n(d) The cannabis event organizer shall not permit consumption of alcohol or tobacco.\n(e) The cannabis event organizer shall not permit smoking, according to section 144.413, of adult-use cannabis flower or cannabis products at any location where smoking is not permitted under sections 144.413 to 144.417. Nothing in this section prohibits a statutory or home rule charter city or county from enacting and enforcing more stringent measures to protect individuals from secondhand smoke or involuntary exposure to aerosol or vapor from electronic delivery devices.",
	"repealed": false
}