{
	"id": "515.215",
	"url": "https://www.revisor.mn.gov/statutes/cite/515.215",
	"title": "515.215 DISCLOSURE REQUIREMENTS TO APARTMENT PURCHASERS.",
	"text": "Not later than 15 days prior to the closing of the first conveyance of each apartment, the vendor shall furnish to the purchaser the following:\n(1) the purchase agreement for the apartment;\n(2) a copy of the declaration and bylaws;\n(3) a copy of the articles of incorporation of the association of apartment owners;\n(4) a copy of any management contract, employment contract, or other contract affecting the use, maintenance, or access of all or part of the condominium;\n(5) a copy of the annual operating budget for the condominium including reasonable details concerning the monthly payments by the purchaser for assessments, and monthly charges for the use, rental, or lease of any facilities;\n(6) a copy of any lease to which it is anticipated the apartment owners or the association of apartment owners will be a party following closing;\n(7) a copy of the floor plan of the apartment;\n(8) a description of any recreational or other facilities which are to be used by the apartment owners and maintained by them or by the association of apartment owners and a statement as to whether or not they are to be part of the common areas and facilities;\n(9) a statement as to whether streets within the condominium are to be dedicated to public use or maintained by the association of apartment owners; and\n(10) in the case of condominiums containing buildings substantially completed more than five years prior to the recording of the declaration, a statement of the physical condition and state of repair of the major structural, mechanical, electrical, and plumbing components of the improvements to the extent reasonably ascertainable. The vendor is entitled to rely on the reports of architects or engineers authorized to practice their profession in this state;\n(11) a statement of the total number of apartments in the association of apartment owners, and the number of apartments sold which shall be updated at least monthly;\n(12) a statement concerning any plans for future development or expansion of the project, including any buildings, apartments or common areas and facilities that may be added, if the plans are used in the promotion of the project, or the plats and plans or blueprints of the future development have been prepared;\n(13) a statement of the terms of any financing being offered by the vendor in connection with the sale of apartments;\n(14) a statement of the provisions of any warranties offered by the vendor in connection with the sale of apartments;\n(15) a statement of the insurance coverage that will be provided by the association of apartment owners.\nAny material furnished pursuant to subdivision 1 may not be changed or amended following delivery to the purchaser, if the change or amendment would affect materially the rights of the purchaser, without first obtaining approval of the purchaser. A copy of any amendments shall be delivered promptly to the purchaser.\nAny vendor referred to in subdivision 1 who, in disclosing the information required pursuant to subdivisions 1 and 2, makes any untrue statement of a material fact, or omits to state a material fact necessary in order to make the statements made, in the light of circumstances under which they were made, not misleading, shall be liable to any person purchasing an apartment from that vendor. However, no action may be maintained to enforce any liability created under this section unless brought within three years after the date of closing.\nThe rights of purchasers under this section may not be waived in the purchase agreement and any attempted waiver is void. However, any purchaser who proceeds to closing terminates any right under this section to rescind.\nThe requirements of this section do not apply to the sale of any unit which is to be occupied and used for nonresidential purposes.\n(a) A purchaser has an unconditional right to rescind a purchase agreement at any time within five days after the date the purchaser receives all the information contained in subdivision 1.\n(b) Each purchase agreement shall prominently contain upon its face the following notice printed in bold type, stating:\n\"Notice to Purchaser\nYou are entitled to rescind this agreement at anytime within five days from the day you actually receive the information required by law. Such rescission must be in writing and mailed to the vendor or the vendor's agent or lender at the address stated in this document. Upon rescission, you will receive a refund of all moneys paid.\"\n(c) Rescission occurs when the purchaser gives written notice of rescission to the vendor, or agent of the vendor or the lender at the address stated in the purchase agreement. Notice of rescission, if given by mail, is effective when it is deposited in a mailbox properly addressed and postage prepaid.\nWhen the purchase agreement relates to a condominium not yet formed, the applicable information required by subdivision 1, may be a proposed form.",
	"repealed": false
}