{
	"id": "403.11",
	"url": "https://www.revisor.mn.gov/statutes/cite/403.11",
	"title": "403.11 911 SYSTEM COST ACCOUNTING REQUIREMENTS; FEE.",
	"text": "(a) Each customer of a wireless or wire-line switched or packet-based telecommunications service provider connected to the public switched telephone network that furnishes service capable of originating a 911 emergency telephone call is assessed a fee based upon the number of wired or wireless telephone lines, or their equivalent, to cover the costs of ongoing maintenance and related improvements for trunking and central office switching equipment for 911 emergency telecommunications service, to offset administrative and staffing costs of the commissioner related to managing the 911 emergency telecommunications service program, to make distributions provided for in section 403.113, and to offset the costs, including administrative and staffing costs, incurred by the State Patrol Division of the Department of Public Safety in handling 911 emergency calls made from wireless phones.\n(b) Money remaining in the 911 emergency telecommunications service account after all other obligations are paid must not cancel and is carried forward to subsequent years and may be appropriated from time to time to the commissioner to provide financial assistance to counties for the improvement of local emergency telecommunications services.\n(c) The fee may not be more than 95 cents a month for each customer access line or other basic access service, including trunk equivalents as designated by the Public Utilities Commission for access charge purposes and including wireless telecommunications services. With the approval of the commissioner of management and budget, the commissioner of public safety shall establish the amount of the fee within the limits specified and inform the companies and carriers of the amount to be collected. When the revenue bonds authorized under section 403.27, subdivision 1, have been fully paid or defeased, the commissioner shall reduce the fee to reflect that debt service on the bonds is no longer needed. The commissioner shall provide companies and carriers a minimum of 45 days' notice of each fee change. The fee must be the same for all customers, except that the fee imposed under this subdivision does not apply to prepaid wireless telecommunications service, which is instead subject to the fee imposed under section 403.161, subdivision 1, paragraph (a).\n(d) The fee must be collected by each wireless or wire-line telecommunications service provider subject to the fee. Fees are payable to and must be submitted to the commissioner monthly before the 25th of each month following the month of collection, except that fees may be submitted quarterly if less than $250 a month is due, or annually if less than $25 a month is due. Receipts must be deposited in the state treasury and credited to a 911 emergency telecommunications service account in the special revenue fund. The money in the account may only be used for 911 telecommunications services.\n(e) Competitive local exchanges carriers holding certificates of authority from the Public Utilities Commission are eligible to receive payment for recurring 911 services.\nIf the commissioner disputes the accuracy of a fee submission or if no fees are submitted by a wireless, wire-line, or packet-based telecommunications service provider, the wireless, wire-line, or packet-based telecommunications service provider shall submit a sworn declaration signed by an officer of the company certifying, under penalty of perjury, that the information provided with the fee submission is true and correct. The sworn declaration must specifically describe and affirm that the 911 fee computation is complete and accurate. When a wireless, wire-line, or packet-based telecommunications service provider fails to provide a sworn declaration within 90 days of notice by the commissioner that the fee submission is disputed, the commissioner may estimate the amount due from the wireless, wire-line, or packet-based telecommunications service provider and refer that amount for collection under section 16D.04.\nIf the commissioner determines that an examination is necessary to document the fee submission and sworn declaration in subdivision 1a, the wireless, wire-line, or packet-based telecommunications service provider must contract with an independent certified public accountant to conduct an examination of fees. The examination must be conducted in accordance with attestation audit standards.\nMS 2000 [Repealed, 2002 c 372 s 21]\n(a) Any wireless or wire-line telecommunications service provider incurring reimbursable costs under subdivision 1 shall submit an invoice itemizing rate elements by county or service area to the commissioner for 911 services furnished under contract. Any wireless or wire-line telecommunications service provider is eligible to receive payment for 911 services rendered according to the terms and conditions specified in the contract. The commissioner shall pay the invoice within 30 days following receipt of the invoice unless the commissioner notifies the service provider that the commissioner disputes the invoice.\n(b) The commissioner shall estimate the amount required to reimburse 911 emergency telecommunications service providers and wireless and wire-line telecommunications service providers for the state's obligations under subdivision 1 and the governor shall include the estimated amount in the biennial budget request.\nAn invoice for services provided for in the contract with a wireless or wire-line telecommunications service provider must be submitted to the commissioner no later than 90 days after commencing a new or additional eligible 911 service. Each applicable contract must provide that, if certified expenses under the contract deviate from estimates in the contract by more than ten percent, the commissioner may reduce the level of service without incurring any termination fees.\nIf the commissioner disputes an invoice, the wireless and wire-line telecommunications service providers shall submit a declaration under section 16A.41 signed by an officer of the company with the invoices for payment of service described in the service provider's 911 contract. The sworn declaration must specifically describe and affirm that the 911 service contracted for is being provided and the costs invoiced for the service are true and correct. When a wireless or wire-line telecommunications service provider fails to provide a sworn declaration within 90 days of notice by the commissioner that the invoice is disputed, the disputed amount of the invoice must be disallowed.\nIf the commissioner determines that an audit is necessary to document the invoice and sworn declaration in subdivision 3b, the wireless or wire-line telecommunications service provider must contract with an independent certified public accountant to conduct the audit. The audit must be conducted according to generally accepted accounting principles. The wireless or wire-line telecommunications service provider is responsible for any costs associated with the audit.\nNo wireless communications provider may provide telecommunications services under a designation of eligible telecommunications carrier, as provided under Minnesota Rules, part 7811.1400, until and unless the commissioner of public safety certifies to the chair of the public utilities commission that the wireless telecommunications provider is not in arrears in amounts owed to the 911 emergency telecommunications service account in the special revenue fund.\nRecurring costs of telecommunications equipment and services at public safety answering points must be borne by the local governmental agency operating the public safety answering point or allocated pursuant to section 403.10, subdivision 3. Costs attributable to local government electives for services not otherwise addressed under section 403.11 or 403.113 must be borne by the governmental agency requesting the elective service.\nWire-line telecommunications service providers or wireless telecommunications service providers holding eligible telecommunications carrier status shall give notice to the commissioner and any other affected governmental agency of tariff or price list changes related to 911 service at the same time that the filing is made with the public utilities commission.\n(a) Each wireless telecommunications service provider shall semiannually report to the commissioner, based on the mobile telephone number, both the total number of prepaid wireless telecommunications subscribers sourced to Minnesota and the total number of wireless telecommunications subscribers sourced to Minnesota. The report must be filed on the same schedule as Federal Communications Commission Form 477.\n(b) The commissioner shall make a standard form available to all wireless telecommunications service providers for submitting information required to compile the report required under this subdivision.\n(c) The information provided to the commissioner under this subdivision is considered trade secret information under section 13.37 and may only be used for purposes of administering this chapter.",
	"repealed": false
}