{
	"id": "473J.11",
	"url": "https://www.revisor.mn.gov/statutes/cite/473J.11",
	"title": "473J.11 STADIUM DESIGN AND CONSTRUCTION.",
	"text": "(a) The design, development, and construction of the stadium shall be a collaborative process between the authority and the NFL team. The authority and the NFL team shall establish a process to reach consensus on key elements of the stadium program and design, development, and construction.\n(b) Unless the authority and the NFL team agree otherwise:\n(1) the authority shall create a stadium design and construction group, including representatives of the authority and the NFL team, to manage the design of the stadium and oversee construction;\n(2) this group shall engage an owner's representative to act on behalf of the group. The cost of the owner's representative shall be a stadium cost; and\n(3) the authority and the NFL team shall enter into a development administration agreement providing for rights and responsibilities of the authority and the NFL team, the design and construction group, and the owner's representative for design and construction of the stadium, including, but not limited to, establishment of minimum design standards. This development administration agreement shall provide for binding arbitration in the event that the authority and the NFL team are unable to agree on minimum design standards or other material aspects of the design.\n(c) The authority may enter into an agreement with the NFL team and any other entity relating to the design, construction, financing, operation, maintenance, and use of the stadium and related facilities and stadium infrastructure. The authority may contract for materials, supplies, and equipment in accordance with section 471.345, except that the authority may employ or contract with persons, firms, or corporations to perform one or more or all of the functions of architect, engineer, construction manager, or program manager with respect to all or any part of the design, construction, financing, operation, maintenance, and use of the stadium and stadium infrastructure under the traditional separate design and build, integrated design-build, construction manager at risk, or public/private partnership (P3) structures, or a combination thereof.\nTo the extent practicable, the agreement must provide that at least 25 percent of the materials, supplies, and equipment used in the construction, operation, maintenance, and use of the stadium and related facilities and stadium infrastructure, other than the material subject to section 473J.15, subdivision 11, paragraph (c), must be made or produced by Minnesota businesses.\n(d) The authority and the NFL team shall prepare a request for proposals for one or more of the functions described in paragraph (c). The request must be published in the State Register and shall include, at a minimum, such requirements that are agreed to by the authority and the NFL team. The authority and the NFL team may prequalify offerors by issuing a request for qualifications, in advance of the request for proposals, and select a short list of responsible offerors prior to discussions and evaluations.\n(e) As provided in the request for proposals, the authority, and the NFL team, may conduct discussions and negotiations with responsible offerors in order to determine which proposal is most advantageous to the authority and the NFL team and to negotiate the terms of an agreement. In conducting discussions, there shall be no disclosure of any information derived from proposals submitted by competing offerors and the content of all proposals is nonpublic data under chapter 13 until such time as a notice to award a contract is given by the authority. The agreement shall be subject to the approval of the NFL team.\n(f) Prior to the time the authority enters into a construction contract with a construction manager or program manager certifying a maximum price and a completion date as provided in paragraph (h), at the request of the NFL team, the authority may authorize, such authorization not to be unreasonably withheld or delayed, the NFL team to provide for management of the construction of the stadium and related stadium infrastructure, in which event the NFL team must assume the role and responsibilities of the authority for completion of construction in a manner consistent with the agreed minimum design standards and design documents, subject to the terms of Laws 2012, chapter 299, including responsibility for cost overruns.\n(g) For each contract for supplies, materials, labor, equipment, or services for the construction of the stadium or infrastructure, the construction manager or program manager shall require: (1) that the contract specify a guaranteed maximum price; and (2) if the amount charged under the contract is less than the guaranteed maximum price, the authority shall pay as follows: (i) one-half of the difference to the contract holder; and (ii) one-half of the difference to the state for transfer to the authority for capital reserves.\n(h) The construction manager or program manager may enter into contracts with contractors for labor, materials, supplies, and equipment for the construction of the stadium and related stadium infrastructure through the process of public bidding, except that the construction manager or program manager may, with the consent of the authority or the NFL team if the NFL team has assumed responsibility for construction:\n(1) narrow the listing of eligible bidders to those which the construction manager or program manager determines to possess sufficient expertise to perform the intended functions;\n(2) award contracts to the contractors that the construction manager or program manager determines provide the best value under a request for proposals as described in section 16C.28, subdivision 1, paragraphs (a), clause (2), and (c), which are not required to be the lowest responsible bidder; and\n(3) for work the construction manager or program manager determines to be critical to the completion schedule, award contracts on the basis of competitive proposals, or perform work with its own forces without soliciting competitive bids if the construction manager or program manager provides evidence of competitive pricing.\n(i) The authority and the NFL team shall require that the construction manager or program manager certify, before the contract is signed, a guaranteed maximum construction price and completion date to the authority and post a performance bond in an amount at least equal to 100 percent of the certified price or such other security satisfactory to the authority, to cover any costs which may be incurred in excess of the certified price including, but not limited to, costs incurred by the authority or loss of revenues resulting from incomplete construction on the completion date. The authority may secure surety bonds as provided in section 574.26, securing payment of just claims in connection with all public work undertaken by the authority. Persons entitled to the protection of the bonds may enforce them as provided in sections 574.28 to 574.32 and are not entitled to a lien on any property of the authority under the provisions of sections 514.01 to 514.16. The construction of the stadium is a project as that term is defined in section 177.42, subdivision 2, and is subject to the prevailing wage law under sections 177.41 to 177.43. The authority's contract with the construction manager or program manager shall provide that if the construction manager's or program manager's fees charged under the contract are less than the guaranteed maximum price, the authority shall pay: (1) one-half of the difference to the contract holder; and (2) one-half of the difference to the state for transfer to the authority for capital reserves. Costs or fees above the agreed guaranteed maximum price shall be the responsibility of the construction manager or program manager.\nUnless otherwise agreed to by the authority and the NFL team, if either party requests an agreed upon change in minimum design standards, and this change is responsible for requiring the project to exceed the stated budget, the requesting party is liable for any cost overruns or associated liabilities.\nThe stadium and stadium infrastructure shall be designed and constructed incorporating the following general program and design elements:\n(1) unless otherwise agreed to by the authority and the NFL team, the stadium shall comprise approximately 1,500,000 square feet with approximately 65,000 seats, expandable to 72,000, shall meet or exceed NFL program requirements, and include approximately 150 suites and approximately 7,500 club seats or other such components as agreed to by the authority and the NFL team;\n(2) space for NFL team-related exhibitions and sales, which shall include the following: NFL team museum and Hall of Fame, retail merchandise and gift shop retail venues, and themed concessions and restaurants;\n(3) year-round space for the NFL team administrative operations, sales, and marketing, including a ticket office, team meeting space, locker, and training rooms;\n(4) space for administrative offices of the authority;\n(5) 2,000 parking spaces within one block of the stadium, connected by skyway or tunnel to the stadium, and 500 parking spaces within two blocks of the stadium, with a dedicated walkway on game days;\n(6) elements sufficient to provide community and civic uses as determined by the authority; and\n(7) a roof that is fixed or retractable, provided that if the roof is retractable, it is accomplished without any increase to the funding provided by the state or the city.\n(a) Within the limits of paragraph (b), the authority may accept financial obligations relating to cost overruns associated with acquisition of the stadium site, stadium infrastructure, and stadium design, development, and construction, provided that the authority shall bid project construction in a manner that any cost overruns are the responsibility of the successful bidder and not the authority or the state. The authority shall not accept responsibility for cost overruns and shall not be responsible for cost overruns if the authority has authorized the NFL team to provide for management of construction of the stadium under subdivision 1. Cost savings or additional funds obtained by the authority or the NFL team for the stadium or stadium infrastructure may be used first to fund additional stadium or stadium infrastructure, as agreed to by the authority and the NFL team, if any, and then to fund capital reserves.\n(b) The state share of stadium costs shall be limited to $348,000,000 for construction of a new stadium, as permitted under section 16A.726. The city of Minneapolis share shall be limited to no more than a $150,000,000 contribution for construction, and the annual operating cost and capital contributions contained under section 473J.13.",
	"repealed": false
}