{
	"id": "325A.04",
	"url": "https://www.revisor.mn.gov/statutes/cite/325A.04",
	"title": "325A.04 MANDATORY CONTRACT FORM.",
	"text": "A contract for invention development services shall set forth the information required in this section in at least 10-point type or equivalent size if handwritten.\nThe following disclosure statement shall be in boldface type and shall be located conspicuously on a cover sheet that contains no other writing:\n\"The following disclosures are required by law and are expressly made a part of this contract: You have the right to cancel this contract for any reason at any time within three business days from the date you and the invention developer sign the contract and you receive a fully executed copy of it. To exercise this option you need only mail or personally deliver to this invention developer written notice of your cancellation. The method and time for notification is set forth in this contract immediately above the place for your signature. Upon cancellation, the invention developer must return by mail or personal delivery, within ten business days after receipt of the cancellation notice, all money paid and all materials provided either by you or by another party in your behalf.\nAn invention developer who is also a lawyer may give you legal advice concerning patent, copyright, or trademark law or advise you of whether your idea or invention may be patentable or may be protected under the patent, copyright, or trademark laws of the United States or any other law. An invention developer who is not a lawyer may not give you legal advice on these subjects.\nNo patent, copyright or trademark protection will be acquired for you by the invention developer or by this contract. Your failure to inquire into the law governing patent, copyright or trademark matters may jeopardize your rights in your idea or invention both in the United States and in foreign countries. Your failure to identify and investigate existing patents, trademarks or registered copyrights may place you in jeopardy of infringing the copyrights, patent or trademark rights of other persons if you proceed to make, use, distribute or sell your idea or invention.\"\nThe contract shall describe fully and in detail the acts or services that the invention developer contracts to perform for the customer.\nThe contract shall state whether the invention developer contracts to construct one or more prototypes, models or devices embodying the customer's invention, the number of such prototypes to be constructed and whether the invention developer contracts to sell or distribute such prototypes, models or devices.\nIf an oral or written estimate of customer earnings is made, the contract shall state the estimate and the data upon which it is based.\nIn a single statement the contract shall set forth both (1) the total number of customers who have contracted with the invention developer, except that the number need not reflect those customers who have contracted within the last 30 days, and (2) the number of customers who have received, by virtue of the invention developer's performance of invention development services, an amount of money in excess of the amount of money paid by such customers to the invention developer pursuant to a contract for invention development services.\nThe contract shall state the expected date of completion of the invention development services.\nThe contract shall state whether and the extent to which it effectuates or makes possible the purchase by the invention developer of an interest in the title to the customer's invention.\nThe contract shall explain that the invention developer is required to maintain all records and correspondence relating to performance of the invention development services for that customer for a period not less than three years after expiration of the term of the contract for invention development services.\nThe contract shall state that the records and correspondence required to be maintained pursuant to section 325A.08 will be made available to the customer or the customer's representative for review and copying at the customer's expense on the invention developer's premises during normal business hours upon seven days' written notice, the time period to begin from the date the notice is placed in the United States mail properly addressed and first class postage prepaid.\nThe contract shall state the name of the person or firm contracting to perform the invention development services, all names under which said person or firm is doing or has done business as an invention developer during the previous ten years, the names of all parent and subsidiary companies to the firm and the names of all companies that have a contractual obligation to the firm to perform invention development services.\nThe contract shall state the invention developer's principal business address and the name and address of its agent in this state authorized to receive service of process in this state.\nThe contract must state that the invention developer has fully complied with the bonding requirements of section 325A.06.",
	"repealed": false
}