{
	"id": "84.765",
	"url": "https://www.revisor.mn.gov/statutes/cite/84.765",
	"title": "84.765 OPERATING OFF-ROAD RECREATIONAL VEHICLES WHILE IMPAIRED.",
	"text": "As used in this section, \"controlled substance,\" \"intoxicating substance,\" and \"off-road recreational vehicle\" have the meanings given in section 169A.03.\n(a) An owner or other person having charge or control of an off-road recreational vehicle must not authorize or allow an individual the person knows or has reason to believe is under the influence of alcohol, a controlled substance, or an intoxicating substance to operate the off-road recreational vehicle anywhere in the state or on the ice of a boundary water of the state.\n(b) A person who operates or is in physical control of an off-road recreational vehicle anywhere in the state or on the ice of a boundary water of the state is subject to chapter 169A.\n(c) The provisions of chapters 169A, 171, and 609 relating to revoking, suspending, or canceling a driver's license, an instruction permit, or a nonresident operating privilege for alcohol, controlled substance, or intoxicating substance violations apply to operators of off-road recreational vehicles and operating privileges for off-road recreational vehicles.\n(d) The commissioner of public safety must notify a person of the period during which the person is prohibited from operating an off-road recreational vehicle under section 169A.52, 169A.54, or 171.177.\n(e) The court must promptly forward to the commissioner of public safety copies of all convictions and criminal and civil sanctions imposed under chapter 169A and section 171.177.\n(f) If the person operating or in physical control of an off-road recreational vehicle is a program participant in the ignition interlock device program described in section 171.306, the off-road recreational vehicle may be operated only if it is equipped with an approved ignition interlock device and all requirements of section 171.306 are satisfied. For purposes of this paragraph, \"program participant\" and \"ignition interlock device\" have the meanings given in section 171.306, subdivision 1.\n(a) A person who violates subdivision 2, paragraph (a), or an ordinance conforming to subdivision 2, paragraph (a), is guilty of a misdemeanor.\n(b) A person who operates an off-road recreational vehicle during the period the person is prohibited from operating an off-road recreational vehicle under subdivision 2, paragraph (d), is subject to the penalty provided in section 171.24.",
	"repealed": false
}