{
	"id": "375A.12",
	"url": "https://www.revisor.mn.gov/statutes/cite/375A.12",
	"title": "375A.12 HOW, WHEN TO ADOPT, ABANDON OPTIONS.",
	"text": "Except as otherwise provided in sections 375A.01 to 375A.13 the options provided in sections 375A.01 to 375A.10 shall be adopted in the manner and at the times specified in this section.\nExcept as provided in section 375A.1205 or by special law, the options provided in sections 375A.01 to 375A.10 shall be adopted in any county only after an affirmative vote of the voters in the county on the question of the adoption of the option. Except as provided in section 375A.01, only one such plan may be submitted at any one election.\nAny referendum required to be held as a condition of the adoption of an option may be initiated by a resolution by the county board, a recommendation of a county government study commission or a petition signed by voters equal in number to five percent of the electors voting at the last previous election for the office of governor requesting that a referendum be held on the adoption of one or more of the options provided in sections 375A.01 to 375A.10. If a study commission has been established, a referendum on an option may not be initiated by a resolution of the county board or a petition of voters until after the study commission has completed its study provided for in section 375A.13, subdivision 3.\nWhen a referendum is required to be held, the county auditor shall conduct the referendum following the procedures provided in section 375.20, as far as practicable, and not inconsistent with sections 375A.01 to 375A.10. The referendum may be held at any primary, general or special election held not less than 30 days before the first day on which candidates may file for county office.\nIn the submission of any proposal pursuant to subdivision 2 the ballot shall be substantially in the following form:\n\"Shall the office(s) of ....... be appointed rather than elected at the expiration of the(ir) current term(s)?\"\nAny optional plan or other option provided for in sections 375A.01 to 375A.13 may be abandoned by the same procedures required for the adoption of the optional plan or the option. Except as otherwise provided in sections 375A.01 to 375A.13 any plan or option shall remain in effect until abandoned or another plan or option is adopted, but a plan or option shall remain in effect not less than three years after its adoption before proceedings to abandon may be commenced, except that options consistent with the at-large chair plan and the administrator plan may be adopted at any time after either the at-large chair plan or the administrator plan has been adopted.",
	"repealed": false
}