{
	"id": "277.17",
	"url": "https://www.revisor.mn.gov/statutes/cite/277.17",
	"title": "277.17 ESCROW REQUIREMENT FOR DELINQUENCIES ON MANUFACTURED HOMES.",
	"text": "At least once in each calendar year, the county treasurer must send a letter to each owner of a manufactured home for which the taxes due in that calendar year have not been fully paid. The first letter sent, in regard to any specific delinquent amount, must contain a notification that if the delinquent taxes are not paid in full within 90 days of the date of issuance of the notice one of the following may occur:\n(1) the owner may be required under state law to begin making monthly payments of delinquent property taxes, and the property taxes will also be escrowed for payment of property taxes the following year; or\n(2) the county will notify the lender of the tax delinquency and request the lender to initiate the process provided under section 47.209. The form and content of the notice to the owner shall be specified by the commissioner of revenue.\nUnless the collection of the tax is in jeopardy and the treasurer is proceeding under the authority of section 277.21, subdivision 2, the county may not levy and seize property of the taxpayer until 90 days after the postmark date of the letter containing the notification required under this subdivision.\nThe county treasurer may establish a tax escrow account for delinquent property taxes for an owner who receives a notice under subdivision 1 if the county does not initiate the process provided under section 47.209. If an escrow account is established for an owner who receives a notice regarding taxes due, the treasurer shall determine an amount the owner must pay each month such that by the following August 31, the owner will have paid the delinquent manufactured home personal property taxes, penalties, and interest due, plus the estimated manufactured home personal property tax that will become due and payable in the year following the year of delinquency. If the owner fails to pay any manufactured home personal property tax that becomes due prior to the following August 31, the additional amount of tax due but unpaid, plus penalty and interest, will be added to the delinquent property taxes payable by installment under this section.\nWithin 30 days of receipt of notice from the county treasurer under subdivision 2, the owner must make the first monthly payment under subdivision 2 to the county treasurer. The commissioner of revenue shall prescribe the procedures to be used for monthly collections of the delinquent and current tax payments. If an owner is making the payments at the time required under this section, no action may be taken under section 277.21 with respect to the manufactured home for which the property taxes are being paid into the escrow account.",
	"repealed": false
}