{
	"id": "211B.34",
	"url": "https://www.revisor.mn.gov/statutes/cite/211B.34",
	"title": "211B.34 PROBABLE CAUSE HEARING.",
	"text": "The assigned administrative law judge must hold a probable cause hearing on the complaint no later than three business days after determining the complaint sets forth a prima facie violation of chapter 211A or 211B, an expedited hearing is required by section 211B.33, except that for good cause the administrative law judge may hold the hearing no later than seven days after the prima facie determination. If an expedited hearing is not required by section 211B.33, because no party requested one under section 211B.33, subdivision 2, paragraph (b), the administrative law judge must hold the hearing not later than 30 days after determining the complaint sets forth a prima facie violation of chapter 211A or 211B.\nAfter the probable cause hearing, the administrative law judge must make one of the following determinations within three business days after the hearing record closes:\n(a) The complaint is frivolous, or there is no probable cause to believe that the violation of law alleged in the complaint has occurred. If the administrative law judge makes either determination, the administrative law judge must dismiss the complaint.\n(b) There is probable cause to believe that the violation of law alleged in the complaint has occurred. If the administrative law judge so determines, the chief administrative law judge must schedule the complaint for an evidentiary hearing under section 211B.35.\n(a) If the administrative law judge dismisses the complaint, the administrative law judge shall provide to the complainant written notice of the right to seek reconsideration of the decision on the record by the chief administrative law judge.\n(b) A petition for reconsideration must be filed within two business days after the dismissal. The chief administrative law judge must make a decision on the petition within three business days after receiving the petition. If the chief administrative law judge determines that the assigned administrative law judge made a clear error of law and grants the petition, within five business days after granting the petition, the chief administrative law judge shall schedule the complaint for an evidentiary hearing under section 211B.35.",
	"repealed": false
}