{
	"id": "363A.29",
	"url": "https://www.revisor.mn.gov/statutes/cite/363A.29",
	"title": "363A.29 HEARINGS.",
	"text": "A determination issued by the commissioner may be heard as a contested case, except that the report of the administrative law judge shall be binding on all parties to the proceeding and if appropriate shall be implemented by an order as provided for in subdivision 3. The party contesting the determination issued by the commissioner may file a request with the commissioner to appear at a hearing on the party's own behalf or through a private attorney. The commissioner shall forward the request for hearing to the Office of Administrative Hearings, which shall promptly set the matter for hearing. The hearing shall be conducted at a place designated by the commissioner, within the county where the unfair discriminatory practice occurred or where the respondent resides or has a principal place of business. The hearing shall be conducted in accordance with sections 14.57 to 14.62, and is subject to appeal in accordance with sections 14.63 to 14.68.\nThe commissioner shall make a determination of probable cause or no probable cause within one year of the filing of a case in which the time has not been tolled. The amount of time during which a case is involved in significant settlement negotiations, is being investigated by another enforcement agency under a work sharing agreement, or has been referred to mediation or to a local human rights commission for no fault grievance processing is tolled. Tolling of the time during settlement negotiations requires written approval of the charging party or the party's attorney.\nThe administrative law judge shall make findings of fact and conclusions of law, and if the administrative law judge finds that the respondent has engaged in an unfair discriminatory practice, the administrative law judge shall issue an order directing the respondent to cease and desist from the unfair discriminatory practice found to exist and to take such affirmative action as in the judgment of the administrative law judge will effectuate the purposes of this chapter. The order shall be a final decision of the department.\n(a) The administrative law judge shall order any respondent found to be in violation of any provision of sections 363A.08 to 363A.19 and 363A.28, subdivision 10, to pay a civil penalty to the state. This penalty is in addition to compensatory and punitive damages to be paid to an aggrieved party. The administrative law judge shall determine the amount of the civil penalty to be paid, taking into account the seriousness and extent of the violation, the public harm occasioned by the violation, whether the violation was intentional, and the financial resources of the respondent. Any penalties imposed under this provision shall be paid into the general fund of the state. In all cases where the administrative law judge finds that the respondent has engaged in an unfair discriminatory practice, the administrative law judge shall order the respondent to pay an aggrieved party, who has suffered discrimination, compensatory damages in an amount up to three times the actual damages sustained. In all cases, the administrative law judge may also order the respondent to pay an aggrieved party, who has suffered discrimination, damages for mental anguish or suffering and reasonable attorney's fees, in addition to punitive damages in an amount not more than $25,000 pursuant to section 549.20.\n(b) In any case where a political subdivision is a respondent, the total of punitive damages awarded an aggrieved party may not exceed $25,000 and in that case if there are two or more respondents the punitive damages may be apportioned among them. Punitive damages may only be assessed against a political subdivision in its capacity as a corporate entity and no regular or ex officio member of a governing body of a political subdivision shall be personally liable for payment of punitive damages pursuant to subdivisions 3 to 6.\nIn addition to the remedies in subdivision 4, in a case involving discrimination in:\n(1) employment, the administrative law judge may order the hiring, reinstatement or upgrading of an aggrieved party, who has suffered discrimination, with or without back pay, admission or restoration to membership in a labor organization, or admission to or participation in an apprenticeship training program, on-the-job training program, or other retraining program, or any other relief the administrative law judge deems just and equitable; or\n(2) housing, the administrative law judge may order the sale, lease, or rental of the housing accommodation or other real property to an aggrieved party, who has suffered discrimination, or the sale, lease, or rental of a like accommodation or other real property owned by or under the control of the person against whom the complaint was filed, according to terms as listed with a real estate broker, or if no such listing has been made, as otherwise advertised or offered by the vendor or lessor, or any other relief the administrative law judge deems just and equitable.\nThe administrative law judge shall cause the findings of fact, conclusions of law, and order to be served on the respondent personally, on the charging party by registered or certified mail, and shall furnish copies to the attorney general and the commissioner.\nIf the administrative law judge makes findings of fact, conclusions of law, and an order in favor of the respondent, the order shall be a final decision of the department.\nIn the case of a respondent which is subject to the licensing or regulatory power of the state or any political subdivision or agency thereof, if the administrative law judge determines that the respondent has engaged in a discriminatory practice, and if the respondent does not cease to engage in such discriminatory practice, the commissioner may so certify to the licensing or regulatory agency. Unless such determination of discriminatory practice is reversed in the course of judicial review, a final determination is binding on the licensing or regulatory agency. Such agency may take appropriate administrative action, including suspension or revocation of the respondent's license or certificate of public convenience and necessity, if the agency is otherwise authorized to take such action.\nIn the case of a respondent which is a party to a public contract, if the administrative law judge determines that the respondent has engaged in a discriminatory practice, the commissioner may so certify to the contract letting agency. Unless the finding of a discriminatory practice is reversed in the course of judicial review, a final determination is binding on the contract letting agency and the agency may take appropriate administrative action, including the imposition of financial penalties or termination of the contract, in whole or in part, if the agency is otherwise authorized to take the action.\nAfter the issuance of a complaint pursuant to section 363A.28, subdivision 6, a charging party or a respondent may request that the administrative law judge issue subpoenas requiring the presence of witnesses or the production for examination of books or papers not privileged and relevant to any matter in question at the hearing.\nThe administrative law judge shall order a respondent who is determined to have engaged in an unfair discriminatory practice to reimburse the department and the attorney general for all appropriate litigation and hearing costs expended in preparing for and conducting the hearing, unless payment of the costs would impose a financial hardship on the respondent. Appropriate costs include but are not limited to the costs of services rendered by the attorney general, private attorneys if engaged by the department, administrative law judges, court reporters, and expert witnesses as well as the costs of transcripts and other necessary supplies and materials.\nMoney reimbursed to the Department of Human Rights under this subdivision must be paid into the state treasury and credited to a special revenue account. Money in that account is appropriated to the commissioner of human rights to the extent the reimbursements were made to cover the department's costs and are available for the department's activities in enforcing the Minnesota Human Rights Act.",
	"repealed": false
}