{
	"id": "50.17",
	"url": "https://www.revisor.mn.gov/statutes/cite/50.17",
	"title": "50.17 DEPOSIT ACCOUNTS.",
	"text": "A deposit account with a savings bank is subject to a lien for the payment of charges that may accrue on the account under this chapter. A deposit account is subject to a debt offset for the debts of the deposit account holder to the savings bank. Deposit accounts may not be assessed for any debts or losses of the savings bank.\nThe savings bank shall determine the rate and amount of interest, if any, to be paid on or credited to deposit accounts. The savings bank may establish reasonable classifications of accounts based on the types of accounts, the length of time accounts are continued in effect, the size of initial deposits into accounts, the minimum balances of accounts required for payment of interest, the frequency and extent of the activity on accounts, or location of the account, or on other classifications the savings bank considers appropriate.\nDeposit accounts must be represented only by the account of each deposit account holder on the books of the savings bank, and the accounts or any interest is transferable only on the books of the savings bank and upon proper written application by the transferee. The savings bank may treat the holder of record of a deposit account as the owner of it for all purposes without being affected by any notice to the contrary unless the savings bank has acknowledged in writing notice of a pledge of the deposit account. A savings bank may also offer negotiable time deposits.\nA savings bank may issue deposit accounts to or in the name of a minor, which shall be held for the exclusive right and benefit of the minor, free from the control or lien of all other persons, except creditors, and, together with interest or dividends, shall be paid to the minor. The minor's receipt, draft, negotiable order of withdrawal, or acquittance in any form, is sufficient release and discharge of the savings bank for withdrawal, until a guardian appointed in this state for the minor has delivered a certificate of appointment to the savings bank.\nA savings bank may contract with the proper authorities of any public or nonpublic elementary or secondary school or institution of higher learning, or any public or charitable institution caring for minors, for the participation and implementation by the savings bank in any school or institution thrift or savings plan, and it may accept savings accounts at the school or institution, either by its own collector or by any representative of the school or institution which becomes the agent of the association for this purpose.\nWhen a deposit is made in the names of two or more persons jointly, or by a person payable on death (P.O.D.) to another, or by a person in trust for another, the rights of the parties and the savings bank are determined by sections 524.6-201 to 524.6-214.\nThe pledge or hypothecation to a savings bank of all or part of a deposit account in joint tenancy signed by a tenant or tenants whether minor or adult, upon whose signature or signatures withdrawals may be made from the account must, unless the terms of the deposit account provide specifically to the contrary, be a valid pledge and transfer to the savings bank of that part of the account pledged or hypothecated, and must not operate to sever or terminate the joint and survivorship ownership of all or any part of the account.\nA savings bank may accept deposits in the name of any administrator, executor, custodian, conservator, guardian, trustee, or other fiduciary for a named beneficiary or beneficiaries. The fiduciary may open, make additions to, and withdraw the account in whole or in part. The withdrawal value of the account, and interest, or other rights relating to it may be paid or delivered, in whole or in part, to the fiduciary without regard to any notice to the contrary as long as the fiduciary is living. The payment or delivery to the fiduciary or a receipt or acquittance signed by the fiduciary to whom the payment or any delivery of rights is made is a valid and sufficient release and discharge of a savings bank for the payment or delivery so made. Whenever a person holding an account in a fiduciary capacity dies and no written notice of the revocation or termination of the fiduciary relationship has been given to a savings bank and the savings bank has no written notice of any other disposition of the beneficial estate, the withdrawal value of the account, and interest or dividends, or other rights relating to it may, at the option of a savings bank, be paid or delivered, in whole or in part, to the beneficiary or beneficiaries. The payment or delivery to the beneficiary, beneficiaries, or designated person, or a receipt or acquittance signed by the beneficiary, beneficiaries, or designated person, for the payment or delivery is a valid and sufficient release and discharge of a savings bank for the payment or delivery. This section does not apply to P.O.D. accounts under sections 524.6-201 to 524.6-214.\nWhen a deposit account is held in a savings bank by a person who becomes incompetent and an adjudication of incompetency has been made by a court of competent jurisdiction, the savings bank may pay or deliver the withdrawal value of the deposit account and any earnings that may have accrued on it to the guardian for the person upon proof of appointment and qualification. If the savings bank has received no written notice and is not on actual notice that the deposit account holder has been adjudicated incompetent, it may pay or deliver the funds to the holder in accordance with the provisions of the deposit account contract, and the receipt or acquittance of the holder is a valid and sufficient release and discharge of the savings bank for the payment or delivery so made.\nAdministrators, executors, custodians, conservators, guardians, trustees, and other fiduciaries of every kind and nature, insurance companies, business and manufacturing companies, banks, trust companies, credit unions, and other types of similar financial organizations, charitable, educational, eleemosynary, and public corporations authorized by law, funds, and organizations, are specifically authorized and empowered to invest funds held by them, without any order of any court, in deposit accounts of a savings bank, and the investments are considered legal investments for the funds.\nA savings bank may contract with depositors for service charges in connection with the opening and maintaining of deposit accounts and for providing services ancillary to the opening and maintaining of deposit accounts. The service charges are a matter of contract between the savings bank and the depositor, and the contract will be fully enforceable in accordance with its stated terms.",
	"repealed": false
}