{
	"id": "16E.04",
	"url": "https://www.revisor.mn.gov/statutes/cite/16E.04",
	"title": "16E.04 INFORMATION AND TELECOMMUNICATIONS TECHNOLOGY POLICY.",
	"text": "The office shall develop, establish, and enforce policies and standards for state agencies to follow in developing and purchasing information and telecommunications technology systems and services and training appropriate persons in their use. The office shall develop, promote, and manage state technology, architecture, standards and guidelines, information needs analysis techniques, contracts for the purchase of equipment and services, and training of state agency personnel on these issues.\n(a) The office may develop and establish a state information architecture to ensure:\n(1) that state agency information and communications systems, equipment, and services do not needlessly duplicate or conflict with the systems of other agencies; and\n(2) enhanced public access to data can be provided consistent with standards developed under section 16E.05, subdivision 4.\nWhen state agencies have need for the same or similar public data, the chief information officer, in coordination with the affected agencies, shall manage the most efficient and cost-effective method of producing and storing data for or sharing data between those agencies. The development of this information architecture must include the establishment of standards and guidelines to be followed by state agencies. The office shall ensure compliance with the architecture.\n(b) The office shall review and approve agency requests for funding for the development or purchase of information systems equipment or software before the requests may be included in the governor's budget.\n(c) The office may review and approve agency requests for grant funding that have an information and technology component.\n(d) The office shall review major purchases of information systems equipment to:\n(1) ensure that the equipment follows the standards and guidelines of the state information architecture;\n(2) ensure the agency's proposed purchase reflects a cost-effective policy regarding volume purchasing; and\n(3) ensure that the equipment is consistent with other systems in other state agencies so that data can be shared among agencies, unless the office determines that the agency purchasing the equipment has special needs justifying the inconsistency.\n(e) The office shall review the operation of information systems by state agencies and ensure that these systems are operated efficiently and securely and continually meet the standards and guidelines established by the office. The standards and guidelines must emphasize uniformity that is cost-effective for the enterprise, that encourages information interchange, open systems environments, and portability of information whenever practicable and consistent with an agency's authority and chapter 13.\n(a) A risk assessment and risk mitigation plan are required for all information systems development projects or initiatives undertaken by a state agency in the executive or judicial branch or by a constitutional officer. The chief information officer must contract with an entity outside of state government to conduct the initial assessment and prepare the mitigation plan for a project or initiative estimated to cost more than $10,000,000. The outside entity conducting the risk assessment and preparing the mitigation plan must not have any other direct or indirect financial interest in the project or initiative. The risk assessment and risk mitigation plan must provide for periodic monitoring by the commissioner until the project or initiative is completed.\n(b) The risk assessment and risk mitigation plan must be paid for with money appropriated for the information and telecommunications technology project or initiative.",
	"repealed": false
}