{
	"id": "145.987",
	"url": "https://www.revisor.mn.gov/statutes/cite/145.987",
	"title": "145.987 HEALTH EQUITY ADVISORY AND LEADERSHIP (HEAL) COUNCIL.",
	"text": "The health equity advisory and leadership (HEAL) council consists of 18 members appointed by the commissioner of health who will provide representation from the following groups:\n(1) African American and African heritage communities;\n(2) Asian American and Pacific Islander communities;\n(3) Latina/o/x communities;\n(4) American Indian communities and Tribal governments and nations;\n(5) disability communities;\n(6) lesbian, gay, bisexual, transgender, and queer (LGBTQ) communities; and\n(7) representatives who reside outside the seven-county metropolitan area.\n(a) Terms, compensation, and removal of members of the advisory council shall be as provided in section 15.059, subdivisions 2 to 4, except that terms for advisory council members shall be for two years. Members may be reappointed to serve up to two additional terms. Notwithstanding section 15.059, subdivision 6, the advisory council shall not expire. The commissioner shall recommend appointments to replace members vacating their positions in a timely manner, no more than three months after the advisory council reviews panel recommendations.\n(b) The commissioner must convene meetings at least quarterly and must provide meeting space and administrative support to the advisory council. Subcommittees may be convened as necessary. Advisory council meetings are subject to the Open Meeting Law under chapter 13D.\nThe advisory council shall:\n(1) advise the commissioner on health equity issues and the health equity priorities and concerns of the populations specified in subdivision 1;\n(2) assist the agency in efforts to advance health equity, including consulting in specific agency policies and programs, providing ideas and input about potential budget and policy proposals, and recommending review of agency policies, standards, or procedures that may create or perpetuate health inequities; and\n(3) assist the agency in developing and monitoring meaningful performance measures related to advancing health equity.\nThe advisory council shall remain in existence until health inequities in the state are eliminated. Health inequities will be considered eliminated when race, ethnicity, income, gender, gender identity, geographic location, or other identity or social marker will no longer be predictors of health outcomes in the state. Section 145.928 describes nine health disparities that must be considered when determining whether health inequities have been eliminated in the state.\nBy January 15 each year, the commissioner or a designee, in collaboration with the advisory council, must submit a report to the chairs and ranking minority members of the legislative committees with jurisdiction over health policy and finance summarizing the work of the advisory council over the previous year and setting goals for the upcoming year.",
	"repealed": false
}