{
	"id": "289A.18",
	"url": "https://www.revisor.mn.gov/statutes/cite/289A.18",
	"title": "289A.18 DUE DATES FOR FILING OF RETURNS.",
	"text": "The returns required to be made under sections 289A.08 and 289A.12 must be filed at the following times:\n(1) returns made on the basis of the calendar year must be filed on April 15 following the close of the calendar year, except that returns of corporations and partnerships must be filed on the due date for filing the federal income tax return;\n(2) returns made on the basis of the fiscal year must be filed on the 15th day of the fourth month following the close of the fiscal year, except that returns of corporations and partnerships must be filed on the due date for filing the federal income tax return;\n(3) returns for a fractional part of a year must be filed on the due date for filing the federal income tax return;\n(4) in the case of a final return of a decedent for a fractional part of a year, the return must be filed on the 15th day of the fourth month following the close of the 12-month period that began with the first day of that fractional part of a year;\n(5) in the case of the return of a cooperative association, returns must be filed on or before the 15th day of the ninth month following the close of the taxable year;\n(6) if a corporation has been divested from a unitary group and files a return for a fractional part of a year in which it was a member of a unitary business that files a combined report under section 290.17, subdivision 4, the divested corporation's return must be filed on the 15th day of the third month following the close of the common accounting period that includes the fractional year;\n(7) returns of entertainment entities must be filed on April 15 following the close of the calendar year;\n(8) returns required to be filed under section 289A.08, subdivision 4, must be filed on the 15th day of the fifth month following the close of the taxable year;\n(9) returns of mining companies must be filed on May 1 following the close of the calendar year; and\n(10) returns required to be filed with the commissioner under section 289A.12, subdivision 2, 4 to 10, or 16 must be filed within 30 days after being demanded by the commissioner.\n(a) Withholding returns are due on or before the last day of the month following the close of the quarterly period. However, if the return shows timely deposits in full payment of the taxes due for that period, the returns may be filed on or before the tenth day of the second calendar month following the period. An employer, in preparing a quarterly return, may take credit for deposits previously made for that quarter. Entertainer withholding tax returns are due within 30 days after each performance. Returns for withholding from payments to out-of-state contractors are due within 30 days after the payment to the contractor. Returns for withholding by partnerships are due on or before the due date specified for filing partnership returns. Returns for withholding by S corporations are due on or before the due date specified for filing corporate franchise tax returns.\n(b) A seasonal employer who provides notice in the form and manner prescribed by the commissioner before the end of the calendar quarter is not required to file a withholding tax return for periods of anticipated inactivity unless the employer pays wages during the period from which tax is withheld. For purposes of this paragraph, a seasonal employer is an employer that regularly, in the same one or more quarterly periods of each calendar year, pays no wages to employees.\n(a) An employer who deducts and withholds an amount required to be withheld by section 290.92 may file an annual return and make an annual payment of the amount required to be deducted and withheld for that calendar year if the employer has received a notification under paragraph (b). The ability to elect to file an annual return continues through the year following the year where an employer is required to deduct and withhold more than $500.\n(b) The commissioner is authorized to determine which employers are eligible to file an annual return and to notify employers who newly qualify to file an annual return because the amount an employer is required to deduct and withhold for that calendar year is $500 or less based on the most recent period of four consecutive quarters for which the commissioner has compiled data on that employer's withholding tax for that period. At the time of notification, eligible employers may still decide to file returns and make deposits quarterly. An employer who decides to file returns and make deposits quarterly is required to make all returns and deposits required by this chapter and, notwithstanding paragraph (a), is subject to all applicable penalties for failing to do so.\n(c) If, at the end of any calendar month other than the last month of the calendar year, the aggregate amount of undeposited tax withheld by an employer who has elected to file an annual return exceeds $500, the employer must deposit the aggregate amount with the commissioner within 30 days of the end of the calendar month.\n(d) If an employer who has elected to file an annual return ceases to pay wages for which withholding is required, the employer must file a final return and deposit any undeposited tax within 30 days of the end of the calendar month following the month in which the employer ceased paying wages.\n(e) An employer not subject to paragraph (c) or (d) who elects to file an annual return must file the return and pay the tax not previously deposited before February 1 of the year following the year in which the tax was withheld.\nAn estate tax return must be filed with the commissioner within nine months after the decedent's death.\nA recapture tax return must be filed with the commissioner within six months after the date of the disposition or cessation as provided by section 291.03, subdivision 11, paragraph (a).\n(a) Sales and use tax returns must be filed on or before the 20th day of the month following the close of the preceding reporting period, except that annual use tax returns provided for under section 289A.11, subdivision 1, must be filed by April 15 following the close of the calendar year, in the case of individuals. Annual use tax returns of businesses, including sole proprietorships, and annual sales tax returns must be filed by February 5 following the close of the calendar year.\n(b) Returns for the June reporting period filed by retailers required to remit their June liability under section 289A.20, subdivision 4, paragraph (b), are due on or before August 20.\n(c) If a retailer has an average sales and use tax liability, including local sales and use taxes administered by the commissioner, equal to or less than $500 per month in any quarter of a calendar year, and has substantially complied with the tax laws during the preceding four calendar quarters, the retailer may request authorization to file and pay the taxes quarterly in subsequent calendar quarters. The authorization remains in effect during the period in which the retailer's quarterly returns reflect sales and use tax liabilities of less than $1,500 and there is continued compliance with state tax laws.\n(d) If a retailer has an average sales and use tax liability, including local sales and use taxes administered by the commissioner, equal to or less than $100 per month during a calendar year, and has substantially complied with the tax laws during that period, the retailer may request authorization to file and pay the taxes annually in subsequent years. The authorization remains in effect during the period in which the retailer's annual returns reflect sales and use tax liabilities of less than $1,200 and there is continued compliance with state tax laws.\n(e) The commissioner may also grant quarterly or annual filing and payment authorizations to retailers if the commissioner concludes that the retailers' future tax liabilities will be less than the monthly totals identified in paragraphs (c) and (d). An authorization granted under this paragraph is subject to the same conditions as an authorization granted under paragraphs (c) and (d).\n(f) A taxpayer who is a materials supplier may report gross receipts either on:\n(1) the cash basis as the consideration is received; or\n(2) the accrual basis as sales are made.\nAs used in this paragraph, \"materials supplier\" means a person who provides materials for the improvement of real property; who is primarily engaged in the sale of lumber and building materials-related products to owners, contractors, subcontractors, repairers, or consumers; who is authorized to file a mechanics lien upon real property and improvements under chapter 514; and who files with the commissioner an election to file sales and use tax returns on the basis of this paragraph.\n(g) Notwithstanding paragraphs (a) to (f), a seller that is not a Model 1, 2, or 3 seller, as those terms are used in the Streamlined Sales and Use Tax Agreement, that does not have a legal requirement to register in Minnesota, and that is registered under the agreement, must file a return by February 5 following the close of the calendar year in which the seller initially registers, and must file subsequent returns on February 5 on an annual basis in succeeding years. Additionally, a return must be submitted on or before the 20th day of the month following any month by which sellers have accumulated state and local tax funds for the state in the amount of $1,000 or more.\nA claim for a refund based on property taxes payable must be filed with the commissioner on or before August 15 of the year in which the property taxes are due and payable.\n[See Note.]",
	"repealed": false
}