{
	"id": "169.99",
	"url": "https://www.revisor.mn.gov/statutes/cite/169.99",
	"title": "169.99 UNIFORM TRAFFIC TICKET.",
	"text": "(a) Except as provided in subdivision 3; section 169.147, subdivision 8; and section 169.999, subdivision 3, there shall be a uniform ticket issued throughout the state by the police and peace officers or by any other person for violations of this chapter and ordinances in conformity thereto. Such uniform traffic ticket shall be in the form and have the effect of a summons and complaint. Except as provided in paragraph (b), the uniform ticket shall state that if the defendant fails to appear in court in response to the ticket, an arrest warrant may be issued. The uniform traffic ticket shall consist of four parts, on paper sensitized so that copies may be made without the use of carbon paper, as follows:\n(1) the complaint, with reverse side for officer's notes for testifying in court, driver's past record, and court's action, printed on white paper;\n(2) the abstract of court record for the Department of Public Safety, which shall be a copy of the complaint with the certificate of conviction on the reverse side, printed on yellow paper;\n(3) the police record, which shall be a copy of the complaint and of the reverse side of copy (1), printed on pink paper; and\n(4) the summons, with, on the reverse side, such information as the court may wish to give concerning the Traffic Violations Bureau, and a plea of guilty and waiver, printed on off-white tag stock.\n(b) If the offense is a petty misdemeanor, the uniform ticket must state that a failure to appear will be considered a plea of guilty and waiver of the right to trial, unless the failure to appear is due to circumstances beyond the person's control.\n[See Note.]\nIn every charge of a violation of any provision of this chapter, the uniform traffic ticket shall contain a blank or space wherein the officer shall specify the officer's opinion as to whether or not an offense which is otherwise a petty misdemeanor was committed in a manner or under circumstances so as to endanger or be likely to endanger any person or property.\n(a) For a citation issued before August 1, 2014, the uniform traffic ticket must provide a blank or space wherein an officer who issues a citation for a violation of a speed limit of 55 or 60 miles per hour must specify whether the speed was greater than ten miles per hour in excess of the speed limit.\n(b) For a citation issued on or after August 1, 2014, the uniform traffic ticket must provide a blank or space wherein an officer who issues a citation for a violation of a speed limit of 55 or 60 miles per hour must specify whether the speed was greater than ten miles per hour in excess of a 55 miles per hour speed limit, or more than five miles per hour in excess of a 60 miles per hour speed limit.\nAll parts of the uniform traffic ticket must provide conspicuous notice that, if convicted, the person to whom it was issued may be required to pay a state-imposed surcharge under section 357.021, subdivision 6, and the current amount of the required surcharge.\nThe first paragraph on the reverse side of the summons on the uniform traffic ticket must include the following, or substantially similar, language: \"All or part of the cost of this summons may be waived on a showing of indigency or undue hardship on you or your family. You may schedule a court appearance to request a waiver based on your ability to pay by calling the Minnesota Court Payment Center (CPC) [followed by the Court Payment Center telephone number]. For more information, call the CPC or visit www.mncourts.gov/fines.\"\nThe commissioner of public safety shall prescribe the detailed form of the uniform traffic ticket, and shall revise the uniform ticket on such subsequent occasions as necessary and proper to keep the uniform ticket in conformity with state and federal law.\nAny city of the first class, through its governing body, may alter by deletion or addition the uniform traffic ticket in such manner as it deems advisable for use in such city, provided that it includes the notice required by subdivision 1, paragraph (b). In respect to any public corporation organized and existing pursuant to sections 473.601 to 473.679, whose ordinances and regulations for the control of traffic are enforced through prosecution in the district court having jurisdiction in one or the other of the cities of the first class included within such public corporation, the traffic ticket used in such enforcement shall conform to that used by the city of the first class in the district court having jurisdiction where its ordinances and regulations are enforced, except as to color and as to information uniquely applying to such public corporation and to its ordinances and regulations.",
	"repealed": false
}