{
	"id": "123B.663",
	"url": "https://www.revisor.mn.gov/statutes/cite/123B.663",
	"title": "123B.663 AIR VENTILATION PILOT PROGRAM; GRANTS AND GUIDELINES.",
	"text": "The Department of Commerce must establish and administer an air ventilation program to award grants to eligible entities under this section.\n(a) An air ventilation program account is created in the special revenue fund of the state treasury. The commissioner must credit to the account appropriations and transfers made to the account. Earnings, such as interest, dividends, and any other earnings arising from assets of the account, must be credited to the account. Money remaining in the account at the end of a fiscal year does not cancel to the general fund but remains available until expended. The commissioner is the fiscal agent and must manage the account.\n(b) Money in the account is appropriated to the commissioner to pay for grants issued under the program and the reasonable costs incurred by the commissioner to administer the program.\n(a) The commissioner may award grants under the program for the following activities:\n(1) completing a heating, ventilation, and air conditioning assessment report;\n(2) HVAC testing, adjusting, and balancing work;\n(3) ventilation equipment upgrades, replacements, or other measures recommended by a heating, ventilation, and air conditioning assessment report;\n(4) work on an HVAC system to improve health, safety, energy, or system efficiency, or to reduce greenhouse gas emissions from the system; and\n(5) other HVAC projects that have not already been approved under section 123B.595.\n(b) The commissioner must prioritize grants that give direct support to schools and school children in communities with high rates of poverty as determined by receipt of federal Title I funding.\n(c) A grant under the program may be used to reimburse an eligible entity for no more than 50 percent of its costs for work described in paragraph (a) and must not exceed a total of $50,000 per school.\n(a) The commissioner must:\n(1) adopt guidelines for the air ventilation program no later than October 1, 2023;\n(2) establish the timing of grant funding;\n(3) ensure that the program is operating and accepting applications for grants by March 31, 2024; and\n(4) provide technical assistance to eligible entities.\n(b) The commissioner may modify the technical and reporting requirements of the program as necessary to comply with current COVID-19 guidance or any other applicable guidance to achieve the intent of the program and to ensure consistency with related requirements and codes.\nAn eligible entity must apply to the commissioner for a grant on behalf of a school on a form prescribed by the commissioner. The form must include, at a minimum, the following information:\n(1) a plan to complete a heating, ventilation, and air conditioning assessment report by a skilled and trained workforce; and\n(2) an estimate of total project costs and funding needed to conduct the assessment and subsequent work.\nThe commissioner may reimburse expenses incurred by the eligible entity while under contract with the department upon receipt of the following:\n(1) a report, verified by a licensed professional engineer, that includes costs of adjustments or repairs necessary to meet minimum ventilation and filtration requirements and that determines whether any cost-effective energy efficiency or electrification upgrades or replacements are warranted or recommended;\n(2) an HVAC verification report that includes the name and address of the school facility and individual or contractor preparing and certifying the report and a description of the assessment, maintenance, adjustment, repair, upgrade, and replacement activities and outcomes; and\n(3) verification that the eligible entity has complied with all requirements. Verification must include:\n(i) documentation that either MERV 13 filters have been installed or verification that the maximum MERV-rated filter that the system is able to effectively handle has been installed;\n(ii) documentation of the MERV rating;\n(iii) the verified ventilation rates for occupied areas of the school and whether those rates meet the requirements set forth in ANSI/ASHRAE Standard 62.1, with an accompanying explanation for any ventilation rates that do not meet applicable requirements documenting why the current system is unable to meet requirements;\n(iv) the verified exhaust for occupied areas and whether those rates meet the requirements set forth in the system design intent;\n(v) documentation of system deficiencies;\n(vi) recommendations for additional maintenance, replacement, or upgrades to improve energy efficiency, safety, or performance, or reduce greenhouse gas emissions;\n(vii) documentation of initial operating verifications, adjustments, and final operating verifications;\n(viii) documentation of any adjustments or repairs performed;\n(ix) verification of carbon dioxide monitors, if required, including correct installation and operation according to regulations;\n(x) make and model of monitors;\n(xi) verification of the contractor's name; and\n(xii) verification that all construction work has been performed by a skilled and trained workforce.\nAn eligible entity may utilize available matching funds from federal programs in conjunction with a grant awarded under this section to increase funding amounts.\nAn eligible entity that receives a grant under the program must maintain a copy of the HVAC verification report described in subdivision 6, clause (2), and must make the report available to students, parents, school personnel, and any member of the public upon request.\nAll work for which reimbursement is sought through a grant under the program that is performed after conducting a heating, ventilation, and air conditioning assessment must be performed by a skilled and trained workforce. Any project awarded a grant under the program is subject to the requirements and enforcement provisions of sections 177.27, 177.30, 177.32, 177.41 to 177.435, 177.44, and 177.45.",
	"repealed": false
}