{
	"id": "35.82",
	"url": "https://www.revisor.mn.gov/statutes/cite/35.82",
	"title": "35.82 RENDERING PLANT PERMITS; DISPOSITION OF CARCASSES.",
	"text": "No person may engage in the business of rendering all or parts of animals, poultry, or fish, including scraps and grease, without first obtaining a permit from the board in accordance with the rules adopted by the board relative to transportation, rendering, and other provisions the board considers necessary to prevent the spread of disease.\n[Repealed, 1974 c 159 s 5]\n(a) The board, through its executive director, may issue a permit to the owner or operator of a pet food processing establishment, a mink rancher, or a supplier of an establishment, located within the boundaries of Minnesota, to transport the carcasses of domestic animals that have died or have been killed, other than by being slaughtered for human or animal consumption, over the public highways to the establishment for pet food or mink food purposes only. The owners and operators of pet food processing establishments or their suppliers and mink ranch operators located in any adjacent state with which a reciprocal agreement is in effect under subdivision 3 are not required to possess a permit issued under this subdivision. The permit is valid for one year following the date of issue unless it is revoked.\n(b) The owner or operator of a pet food processing plant or mink ranch shall employ an official veterinarian. A veterinarian named in the permit application who is accepted by the board to act as the official veterinarian is authorized to act as its representative.\n(c) Carcasses collected by owners or operators under permit may be used for pet food or mink food purposes if the official veterinarian examines them and finds them suitable for pet food or mink food purposes.\n(d) Carcasses not passed by the official veterinarian for pet food or mink food purposes must be disposed of by a rendering plant operating under permit from the board.\n(e) The board must require pet food processing establishments, owners and operators of mink ranches, and suppliers of these establishments to conform to rules of the board applicable to rendering plants within the state.\n(a) Except as provided in subdivision 1b and paragraph (d), every person owning or controlling any domestic animal that has died or been killed otherwise than by being slaughtered for human or animal consumption, shall as soon as reasonably possible bury the carcass at a depth adequate to prevent scavenging by other animals in the ground or thoroughly burn it or dispose of it by another method approved by the board as being effective for the protection of public health and the control of livestock diseases. The board, through its executive director, may issue permits to owners of rendering plants located in Minnesota which are operated and conducted as required by law, to transport carcasses of domestic animals and fowl that have died, or have been killed otherwise than by being slaughtered for human or animal consumption, over the public highways to their plants for rendering purposes in accordance with the rules adopted by the board relative to transportation, rendering, and other provisions the board considers necessary to prevent the spread of disease. The board may issue permits to owners of rendering plants located in an adjacent state with which a reciprocal agreement is in effect under subdivision 3.\n(b) Carcasses collected by rendering plants under permit may be used for pet food or mink food if the owner or operator meets the requirements of subdivision 1b.\n(c) An authorized employee or agent of the board may enter private or public property and inspect the carcass of any domestic animal that has died or has been killed other than by being slaughtered for human or animal consumption. Failure to dispose of the carcass of any domestic animal within the period specified by this subdivision is a public nuisance. The board may petition the district court of the county in which a carcass is located for a writ requiring the abatement of the public nuisance. A civil action commenced under this paragraph does not preclude a criminal prosecution under this section. No person may sell, offer to sell, give away, or convey along a public road or on land the person does not own, the carcass of a domestic animal when the animal died or was killed other than by being slaughtered for human or animal consumption unless it is done with a special permit pursuant to this section. The carcass or parts of a domestic animal that has died or has been killed other than by being slaughtered for human or animal consumption may be transported along a public road for a medical or scientific purpose if the carcass is enclosed in a leakproof container to prevent spillage or the dripping of liquid waste. The board may adopt rules relative to the transportation of the carcass of any domestic animal for a medical or scientific purpose. A carcass on a public thoroughfare may be transported for burial or other disposition in accordance with this section.\nNo person who owns or controls diseased animals shall negligently or willfully permit them to escape from that control or to run at large.\n(d) A sheep producer may compost sheep carcasses owned by the producer on the producer's land without a permit and is exempt from compost facility specifications contained in rules of the board.\n(e) The board shall develop best management practices for dead animal disposal and the Pollution Control Agency feedlot program shall distribute them to livestock producers in the state.\nThe executive director of the board may enter into a reciprocal agreement on behalf of this state with an adjacent state which provides for permits to be issued to rendering plants, pet food processing establishments or suppliers of establishments, and mink ranch operators located in either state to transport carcasses to their plants, establishments, or ranches over the public highways of this state and the reciprocating state.\nThis subdivision applies if the adjacent state has in effect standards and requirements which are the equivalent of the standards and requirements of this state as established by the board.\nThe term \"domestic animal\" as used in this section does not include any species of domestic animal which in common practice is maintained in the home of the owner whether or not the particular domestic animal was so housed at any time prior to its death. Nothing in this section limits the authority of local governmental units to regulate the disposition of carcasses of domestic animals excluded from the provisions of this section by this subdivision.",
	"repealed": false
}