{
	"id": "609.11",
	"url": "https://www.revisor.mn.gov/statutes/cite/609.11",
	"title": "609.11 MINIMUM SENTENCES OF IMPRISONMENT.",
	"text": "All commitments to the commissioner of corrections for imprisonment of the defendant are without minimum terms except when the sentence is to life imprisonment as required by law and except as otherwise provided in this chapter.\n[Repealed, 1978 c 723 art 2 s 5]\n[Repealed, 1981 c 227 s 13]\nAny defendant convicted of an offense listed in subdivision 9 in which the defendant or an accomplice, at the time of the offense, used, whether by brandishing, displaying, threatening with, or otherwise employing, a dangerous weapon other than a firearm, shall be committed to the commissioner of corrections for not less than one year plus one day, nor more than the maximum sentence provided by law. Any defendant convicted of a second or subsequent offense in which the defendant or an accomplice, at the time of the offense, used a dangerous weapon other than a firearm, shall be committed to the commissioner of corrections for not less than three years nor more than the maximum sentence provided by law.\n(a) Except as otherwise provided in paragraph (b), any defendant convicted of an offense listed in subdivision 9 in which the defendant or an accomplice, at the time of the offense, had in possession or used, whether by brandishing, displaying, threatening with, or otherwise employing, a firearm, shall be committed to the commissioner of corrections for not less than three years, nor more than the maximum sentence provided by law. Any defendant convicted of a second or subsequent offense in which the defendant or an accomplice, at the time of the offense, had in possession or used a firearm shall be committed to the commissioner of corrections for not less than five years, nor more than the maximum sentence provided by law.\n(b) Any defendant convicted of violating section 609.165 or 624.713, subdivision 1, clause (2), shall be committed to the commissioner of corrections for not less than five years, nor more than the maximum sentence provided by law.\nNotwithstanding section 609.035, whenever a defendant is subject to a mandatory minimum sentence for a felony violation of chapter 152, other than a violation of section 152.021, subdivision 2b, clause (1), or a violation of chapter 152 sentenced under section 152.021, subdivision 3, paragraph (c), and is also subject to this section, the minimum sentence imposed under this section shall be consecutive to that imposed under chapter 152.\nAny defendant convicted and sentenced as required by this section is not eligible for probation, parole, discharge, or supervised release until that person has served the full term of imprisonment as provided by law, notwithstanding the provisions of sections 242.19, 243.05, 244.04, 609.12 and 609.135.\nThe question of whether the defendant or an accomplice, at the time of commission of an offense listed in subdivision 9, used a firearm or other dangerous weapon or had in possession a firearm shall be determined by the fact finder at the time of a verdict or finding of guilt at trial or the entry of a plea of guilty based upon the record of the trial or the plea of guilty. The fact finder shall also determine whether the defendant has been convicted of a second or subsequent offense in which the defendant or an accomplice, at the time of commission of an offense listed in subdivision 9, used a firearm or other dangerous weapon or had in possession a firearm.\n(a) Except as otherwise provided in paragraphs (b) and (c), prior to the time of sentencing, the prosecutor may file a motion to have the defendant sentenced without regard to the mandatory minimum sentences established by this section. The motion shall be accompanied by a statement on the record of the reasons for it. When presented with the motion, or on its own motion, the court may sentence the defendant without regard to the mandatory minimum sentences established by this section if the court finds substantial and compelling reasons to do so. A sentence imposed under this subdivision is a departure from the Sentencing Guidelines.\n(b) The court may not, on its own motion or the prosecutor's motion, sentence a defendant without regard to the mandatory minimum sentences established by this section if the defendant previously has been convicted of an offense listed in subdivision 9 in which the defendant used or possessed a firearm or other dangerous weapon.\n(c) The court may not, on its own motion or the prosecutor's motion, sentence a defendant without regard to the mandatory minimum sentences established by subdivision 5, if the defendant was convicted of a crime under section 152.021, subdivision 1, or 152.022, subdivision 1, and the person or an accomplice possessed on their person or within immediate reach, or used, whether by brandishing, displaying, threatening with, or otherwise employing, a firearm.\nThe crimes for which mandatory minimum sentences shall be served as provided in this section are: murder in the first, second, or third degree; assault in the first, second, or third degree; burglary; kidnapping; false imprisonment; manslaughter in the first or second degree; aggravated robbery; simple robbery; carjacking in the first, second, or third degree; first-degree or aggravated first-degree witness tampering; criminal sexual conduct under the circumstances described in sections 609.342, subdivision 1, and subdivision 1a, clauses (a) to (f) and (i); 609.343, subdivision 1, and subdivision 1a, clauses (a) to (f) and (i); and 609.344, subdivision 1, clauses (a) to (c) and (d), under the conditions described in section 609.341, subdivision 24, clause (2), item (i), (ii), or (iii), and subdivision 1a, clauses (a) to (e), (h), and (i), under the conditions described in section 609.341, subdivision 24, clause (2), item (i), (ii), or (iii); escape from custody; arson in the first, second, or third degree; drive-by shooting under section 609.66, subdivision 1e; harassment under section 609.749, subdivision 3, paragraph (a), clause (3); possession or other unlawful use of a firearm or ammunition in violation of section 609.165, subdivision 1b, or 624.713, subdivision 1, clause (2), a felony violation of chapter 152; or any attempt to commit any of these offenses.\nBeginning on July 1, 1994, every county attorney shall collect and maintain the following information on criminal complaints and prosecutions within the county attorney's office in which the defendant is alleged to have committed an offense listed in subdivision 9 while possessing or using a firearm:\n(1) whether the case was charged or dismissed;\n(2) whether the defendant was convicted of the offense or a lesser offense; and\n(3) whether the mandatory minimum sentence required under this section was imposed and executed or was waived by the prosecutor or court.\nNo later than July 1 of each year, beginning on July 1, 1995, the county attorney shall forward this information to the Sentencing Guidelines commission upon forms prescribed by the commission.",
	"repealed": false
}