{
	"id": "595.024",
	"url": "https://www.revisor.mn.gov/statutes/cite/595.024",
	"title": "595.024 EXCEPTION AND PROCEDURE.",
	"text": "A person seeking disclosure may apply to the district court of the county where the person employed by or associated with a news media resides, has a principal place of business or where the proceeding in which the information sought is pending.\nThe application shall be granted only if the court determines after hearing the parties that the person making application, by clear and convincing evidence, has met all three of the following conditions:\n(1) that there is probable cause to believe that the specific information sought (i) is clearly relevant to a gross misdemeanor or felony, or (ii) is clearly relevant to a misdemeanor so long as the information would not tend to identify the source of the information or the means through which it was obtained,\n(2) that the information cannot be obtained by alternative means or remedies less destructive of first amendment rights, and\n(3) that there is a compelling and overriding interest requiring the disclosure of the information where the disclosure is necessary to prevent injustice.\nThe district court shall consider the nature of the proceedings, the merits of the claims and defenses, the adequacies of alternative remedies, the relevancy of the information sought, and the possibility of establishing by other means that which the source is expected or may tend to prove. The court shall make its appropriate order after making findings of fact. The order may be appealed directly to the court of appeals according to the Rules of Appellate Procedure. The order is stayed and nondisclosure shall remain in full force and effect during the pendency of the appeal. Where the court finds that the information sought has been published or broadcast, there shall be no automatic stay unless an appeal is filed within two days after the order is issued. Either party may request expedited consideration.",
	"repealed": false
}