{
	"id": "115.426",
	"url": "https://www.revisor.mn.gov/statutes/cite/115.426",
	"title": "115.426 INCENTIVE FOR VOLUNTARY MUNICIPAL OR INDUSTRIAL INVESTMENT IN NUTRIENT TREATMENT TECHNOLOGY.",
	"text": "For purposes of this section:\n(1) \"biological nutrient removal system\" means technology that uses microorganisms to remove nitrogen and phosphorus from wastewater;\n(2) \"public funds\" means loans, grants, or bond proceeds from the state or funds raised by the municipality through taxes, assessments, bonds, rates, or similar means; and\n(3) \"regulatory certainty\" means that, after the initial permit issuance to authorize biological nutrient removal and for the period of time specified under subdivision 2, the agency shall not issue new permit limits for phosphorus or nitrogen.\n(a) A municipality that installs a biological nutrient removal system on a voluntary basis and receives public funds to construct the biological nutrient removal system or an industrial national pollutant discharge elimination system/state disposal system (NPDES/SDS) permit holder that installs a biological nutrient removal system may request the regulatory certainty incentive under this section.\n(b) A municipality with an existing wastewater facility that includes treatment technology that is designed for nitrogen removal on July 1, 2016, is eligible for the regulatory certainty incentive under this section if it agrees to meet water-quality-based permit limits for phosphorus and also voluntarily accepts a nitrogen limit determined by the commissioner based on agency review of its engineering plans and specifications and its existing facilities.\n(c) The commissioner of the Pollution Control Agency may provide phosphorus and nitrogen regulatory certainty for an eligible municipality or industrial permit holder in a NPDES/SDS permit. Before the NPDES/SDS permit is finalized for an eligible municipality or industrial permit holder, the commissioner must determine whether to provide regulatory certainty, based on the system's effectiveness in removing nitrogen. If the commissioner will provide regulatory certainty, the commissioner and the municipality or industrial permit holder must execute an agreement recognizing the term and requirements relating to the regulatory certainty. The agreement becomes part of the NPDES/SDS permit.\n(d) Regulatory certainty extends for the expected design life of the biological nutrient removal system, or 20 years, whichever is shorter, as long as the system is properly maintained and operated by the municipality or industrial permit holder. A municipality or industrial permit holder may receive regulatory certainty only one time for each wastewater treatment facility. In addition to the provisions of this section, a municipality or industrial permit holder remains subject to applicable provisions in Minnesota Rules, chapter 7001, relating to permitting of wastewater treatment works.\nApplications must not be accepted under this section after December 31, 2031, or the day following United States Environmental Protection Agency approval of a Minnesota Pollution Control Agency-adopted total nitrate-nitrogen aquatic life water quality standard, whichever occurs first. Notwithstanding this subdivision, agreements entered into under subdivision 2, paragraph (a), continue in effect for the term stated in the agreement.",
	"repealed": false
}