{
	"id": "138.17",
	"url": "https://www.revisor.mn.gov/statutes/cite/138.17",
	"title": "138.17 GOVERNMENT RECORDS; ADMINISTRATION.",
	"text": "(a) The attorney general, legislative auditor in the case of state records, state auditor in the case of local records, and director of the Minnesota Historical Society, hereinafter director, shall constitute the Records Disposition Panel. The members of the panel shall have power by majority vote to direct the destruction or sale for salvage of government records determined to be no longer of any value, or to direct the disposition by gift to the Minnesota Historical Society or otherwise of government records determined to be valuable for preservation. The Records Disposition Panel may by majority vote order any of those records to be reproduced by photographic or other means, and order that photographic or other reproductions be substituted for the originals of them. It may direct the destruction or sale for salvage or other disposition of the originals from which they were made. Photographic or other reproductions shall for all purposes be deemed the originals of the records reproduced when so ordered by the records disposition panel, and shall be admissible as evidence in all courts and in proceedings of every kind. A facsimile, exemplified or certified copy of a photographic, optical disk imaging, or other reproduction, or an enlargement or reduction of it, shall have the same effect and weight as evidence as would a certified or exemplified copy of the original. The Records Disposition Panel, by majority vote, may direct the storage of government records, except as herein provided, and direct the storage of photographic or other reproductions. Photographic or other reproductions substituted for original records shall be disposed of in accordance with the procedures provided for the original records.\n(b) For the purposes of this chapter:\n(1) the term \"government records\" means state and local records, including all cards, correspondence, discs, maps, memoranda, microfilms, papers, photographs, recordings, reports, tapes, writings, optical disks, and other data, information, or documentary material, regardless of physical form or characteristics, storage media or conditions of use, made or received by an officer or agency of the state and an officer or agency of a county, city, town, school district, municipal subdivision or corporation or other public authority or political entity within the state pursuant to state law or in connection with the transaction of public business by an officer or agency;\n(2) the term \"state record\" means a record of a department, office, officer, commission, commissioner, board or any other agency, however styled or designated, of the executive branch of state government; a record of the state legislature; a record of any court, whether of statewide or local jurisdiction; and any other record designated or treated as a state record under state law;\n(3) the term \"local record\" means a record of an agency of a county, city, town, school district, municipal subdivision or corporation or other public authority or political entity;\n(4) the term \"records\" excludes data and information that does not become part of an official transaction, library and museum material made or acquired and kept solely for reference or exhibit purposes, extra copies of documents kept only for convenience of reference and stock of publications and processed documents, and bonds, coupons, or other obligations or evidences of indebtedness, the destruction or other disposition of which is governed by other laws;\n(5) the term \"state archives\" means those records preserved or appropriate for preservation as evidence of the organization, functions, policies, decisions, procedures, operations or other activities of government or because of the value of the information contained in them, when determined to have sufficient historical or other value to warrant continued preservation by the state of Minnesota and accepted for inclusion in the collections of the Minnesota Historical Society.\n(c) If the decision is made to dispose of records by majority vote, the Minnesota Historical Society may acquire and retain whatever they determine to be of potential historical value.\nGovernment records which a state agency, political subdivision, or statewide system lists on a records disposition application or records schedule, or on which archival assistance or advice is requested, may be inspected by state archives' employees if state archives gives prior notice. Employees of the archives shall have access to the records for the purpose of determining the historical or other continuing value of the records, regardless of the records' classification pursuant to chapter 13 or 270B. Employees of the archives shall be liable to the penalties set forth for improper disclosure by them of private, confidential, nonpublic, or protected nonpublic data inspected for this purpose.\nAfter July 1, 1982, all records deemed to be of continuing value and authorized for transfer to the archives by the Records Disposition Panel shall be retained by the requesting agency or may be transferred to the archives in accordance with subdivision 1, notwithstanding the provisions of chapter 13. The responsible authority of the state agency, political subdivision, or statewide system transferring records to the archives shall notify the archivist or a designee with regard to the records transferred of the classification of the records pursuant to chapter 13.\n(a) All records transferred to the archives shall be accessible to the public unless the archives determines that the information:\n(1) was compiled for law enforcement purposes and disclosure would (i) materially impair the effectiveness of an ongoing investigation, criminal intelligence operation, or law enforcement proceeding; (ii) identify a confidential informant; (iii) reveal confidential investigative techniques or procedures, including criminal intelligence activity; or (iv) endanger the life of an individual;\n(2) is administrative or technical information, including software, operating protocols, employee manuals, or other information, the disclosure of which would jeopardize the security of a record-keeping system;\n(3) is proprietary information, including computer programs and software and other types of information manufactured or marketed by persons under exclusive legal right, owned by the agency or entrusted to it;\n(4) contains trade secrets or confidential commercial and financial information obtained, upon request, from a person;\n(5) is library, archival, or museum material contributed by private persons to the extent of any lawful limitation imposed upon the material; or\n(6) if disclosed, would constitute a clearly unwarranted invasion of personal privacy. Disclosure of an individually identifiable record does not constitute a clearly unwarranted invasion of personal privacy if the public interest in disclosure outweighs the privacy interest of the individual.\n(b) The society may withhold access to state archives from any person who willfully mutilates, damages, or defaces archival records, or wrongfully removes them from state archives; provided that the society shall notify the person of the decision to withhold access, and the person may, within 30 days, appeal the decision to the Executive Council of the society.\n(c) The state archivist shall notify any person from whom access is withheld pursuant to paragraph (a). The person may, within 30 days of the day the notice is sent, appeal the archivist's determination to the Executive Council of the society. The Executive Council shall, within 30 days of the filing of an appeal, issue a decision determining if the archivist has correctly applied the standards of paragraph (a). The decision of the Executive Council may be appealed to the District Court of Ramsey County.\n[Repealed, 1971 c 529 s 15]\nLaws 1971, chapter 529, sections 1 to 14 shall not apply to the public records of the University of Minnesota, the Minnesota State Agriculture Society, or the Minnesota Historical Society.\nNo public records of the Minnesota State Library shall be subject to the disposition or orders provided by Laws 1971, chapter 529, except with the consent of the state librarian.\nNo public records of the supreme court shall be subject to the disposition or orders provided by Laws 1971, chapter 529, except with the consent of the court.\nThe Minnesota Historical Society shall employ a professional archivist, who shall be known as the state archivist, and other agents and personnel as are necessary to enable it to carry out its duties and powers. The archivist shall be appointed by the director of the society.\nIt shall be the duty of the head of each state agency and the governing body of each county, municipality, and other subdivision of government to establish and maintain an active, continuing program for the economical and efficient management of the records of each agency, county, municipality, or other subdivision of government. Public officials shall prepare an inclusive inventory of records in their custody, to which shall be attached a schedule, approved by the head of the governmental unit or agency having custody of the records, establishing a time period for the retention or disposal of each series of records. When the schedule is unanimously approved by the records disposition panel, the head of the governmental unit or agency having custody of the records may dispose of the type of records listed in the schedule at a time and in a manner prescribed in the schedule for particular records which were created after the approval. A list of records disposed of pursuant to this subdivision shall be maintained by the governmental unit or agency. When records containing not public data as defined in section 13.02, subdivision 8a, are being disposed of under this subdivision, the records must be destroyed in a way that prevents their contents from being determined.\nEvery county, municipality, or other subdivision of government may institute a program for the preservation of necessary documents essential to the continuity of government in the event of a disaster or emergency.\n[Repealed, 2007 c 76 s 2]\n[Repealed, 2007 c 76 s 2]",
	"repealed": false
}