{
	"id": "383B.61",
	"url": "https://www.revisor.mn.gov/statutes/cite/383B.61",
	"title": "383B.61 TRANSFER OF DRAINAGE SYSTEMS.",
	"text": "(a) This section applies to transfers of management jurisdiction for the drainage systems listed in paragraph (b) from Hennepin County to a water management authority, as defined under section 103E.005, subdivision 29. The transfer procedure described in this section is an alternative to the procedure prescribed in section 103E.812. Section 103E.812 does not apply to transfers under this section, except as specified in this section.\n(b) This section applies to transfer of the following drainage systems: Hennepin County Ditches 3, 6, 7, 9, 11, 12, 13, 16, 18, 19, 21, 22, 25, 26, 30, J-6, and J-20.\n(c) For purposes of this section, \"board\" means the Hennepin County Board of Commissioners.\n(a) A water management authority may petition for transfer if the drainage system or portion of the drainage system proposed to be transferred lies within the jurisdictional boundaries of the water management authority. The petition must be in a form prescribed by the board and must provide that the transferred drainage system be managed according to a plan adopted under sections 103B.205 to 103B.255.\n(b) Upon receipt of a petition under paragraph (a), the board shall set a date and location for public hearing and shall publish notice of the hearing in newspapers with general circulation in the affected areas at least 30 days prior to the hearing. The notice shall include a statement that property owners have a right to object to the transfer at the hearing.\n(c) The hearing shall be conducted according to procedures established by the board. Transfer shall be completed upon approval of the board.\n(d) Costs of the transfer proceedings shall be attributable according to section 103E.812, subdivision 6.\nThe transfer of a drainage system under this section is not a compromise of any property right held by an owner of assessed property on the transferred drainage system and the rights of the property owners are as provided in section 103E.812, subdivision 7. Transfer of a drainage system under this section has the effect given under section 103E.812, subdivision 8.",
	"repealed": false
}