{
	"id": "124D.66",
	"url": "https://www.revisor.mn.gov/statutes/cite/124D.66",
	"title": "124D.66 ASSURANCE OF MASTERY PROGRAMS.",
	"text": "A district with a local process to review curriculum and instruction may provide an assurance of mastery program to eligible pupils.\nA pupil is eligible to receive services through an assurance of mastery program if the pupil has not demonstrated progress toward mastering the required graduation standards, after receiving instruction that was designed to enable the pupil to make progress toward mastering the required graduation standards in a regular classroom setting. A pupil also is eligible to receive services through an assurance of mastery program if the pupil, based on the professional judgment of a classroom teacher or a team of licensed professionals, demonstrates a need for alternative instructional strategies or interventions. To determine pupil eligibility, a district must use a process adopted by the school board to review curriculum and instruction, for the subjects and at the grade level at which the district uses the revenue.\n(a) Assurance of mastery programs may provide direct scientific, research-based instructional services and intervention to an eligible pupil, or a group of eligible pupils, under the following conditions in paragraphs (b) to (d).\n(b) Instruction may be provided at one or more grade levels from kindergarten to grade 8 and for students in grades 9 through 12 who were enrolled in grade 8 before the 2005-2006 school year and have failed the basic skills tests, or were enrolled in grade 8 in the 2005-2006 school year and later and who have failed the Minnesota Comprehensive Assessments (MCA-IIs) in reading, mathematics, or writing as required for high school graduation under section 120B.02. If an assessment of pupils' needs within a district demonstrates that the eligible pupils in grades kindergarten to grade 8 are being appropriately served, a district may serve eligible pupils in grades 9 to 12.\n(c) Instruction must be provided under the supervision of the eligible pupil's regular classroom teacher. Instruction may be provided by the eligible pupil's classroom teacher, by another teacher, by a team of teachers, or by an education assistant or aide. A special education teacher may provide instruction, but instruction that is provided under this section is not eligible for aid under section 125A.76.\n(d) The instruction that is provided must differ from the initial instruction the pupil received in the regular classroom setting. The instruction may differ by presenting different curriculum than was initially presented in the regular classroom or by presenting the same curriculum:\n(1) at a different rate or in a different sequence than it was initially presented;\n(2) using different teaching methods or techniques than were used initially; or\n(3) using different instructional materials than were used initially.",
	"repealed": false
}