{
	"id": "245A.13",
	"url": "https://www.revisor.mn.gov/statutes/cite/245A.13",
	"title": "245A.13 INVOLUNTARY RECEIVERSHIP FOR RESIDENTIAL OR NONRESIDENTIAL PROGRAMS.",
	"text": "(a) In addition to any other remedy provided by law, the commissioner may petition the district court in Ramsey County for an order directing the controlling individuals of a residential or nonresidential program licensed or certified by the commissioner to show cause why the commissioner should not be appointed receiver to operate the program. The petition to the district court must contain proof by affidavit that one or more of the following circumstances exists:\n(1) the commissioner has commenced proceedings to suspend or revoke the program's license or refused to renew the program's license;\n(2) there is a threat of imminent abandonment by the program or its controlling individuals;\n(3) the program has shown a pattern of failure to meet ongoing financial obligations such as failing to pay for food, pharmaceuticals, personnel costs, or required insurance;\n(4) the health, safety, or rights of the residents or persons receiving care from the program appear to be in jeopardy due to the manner in which the program may close, the program's financial condition, or violations of federal or state law or rules committed by the program; or\n(5) the commissioner has notified the program or its controlling individuals that the program's federal Medicare or Medicaid provider agreement will be terminated, revoked, canceled, or not renewed.\n(b) If the license holder, applicant, or controlling individual operates more than one program, the commissioner's petition must specify and be limited to the program for which it seeks receivership.\n(c) The order to show cause must be personally served on the program through its authorized agent or, in the event the authorized agent cannot be located, on any controlling individual for the program.\n(a) If the court finds that involuntary receivership is necessary as a means of protecting the health, safety, or rights of persons being served by the program, the court shall appoint the commissioner as receiver to operate the program. The commissioner as receiver may contract with another entity or group to act as the managing agent during the receivership period. The managing agent will be responsible for the day-to-day operations of the program subject at all times to the review and approval of the commissioner. A managing agent shall not:\n(1) be the license holder or controlling individual of the program;\n(2) have a financial interest in the program at the time of the receivership;\n(3) be otherwise affiliated with the program; or\n(4) have had a licensed program that has been ordered into receivership.\n(b) Notwithstanding state contracting requirements in chapter 16C, the commissioner shall establish and maintain a list of qualified persons or entities with experience in delivering services and with winding down programs under chapter 245A, 245D, or 245G, or other service types licensed by the commissioner. The list shall be a resource for selecting a managing agent, and the commissioner may update the list at any time.\n(a) A receiver appointed pursuant to this section shall, within 18 months after the receivership order, determine whether to close the program or to make other provisions with the intent to keep the program open. If the receiver determines that program closure is appropriate, the commissioner shall provide for the orderly transfer of individuals served by the program to other programs or make other provisions to protect the health, safety, and rights of individuals served by the program.\n(b) During the receivership, the receiver or the managing agent shall correct or eliminate deficiencies in the program that the commissioner determines endanger the health, safety, or welfare of the persons being served by the program unless the correction or elimination of deficiencies at a residential program involves major alteration in the structure of the physical plant. If the correction or elimination of the deficiencies at a residential program requires major alterations in the structure of the physical plant, the receiver shall take actions designed to result in the immediate transfer of persons served by the residential program. During the period of the receivership, the receiver and the managing agent shall operate the residential or nonresidential program in a manner designed to preserve the health, safety, rights, adequate care, and supervision of the persons served by the program.\n(c) The receiver or the managing agent may make contracts and incur lawful expenses.\n(d) The receiver or the managing agent shall use the building, fixtures, furnishings, and any accompanying consumable goods in the provision of care and services to the clients during the receivership period. The receiver shall take action as is reasonably necessary to protect or conserve the tangible assets or property during receivership.\n(e) The receiver or the managing agent shall collect incoming payments from all sources and apply them to the cost incurred in the performance of the functions of the receivership, including the fee set under subdivision 4. No security interest in any real or personal property comprising the program or contained within it, or in any fixture of the physical plant, shall be impaired or diminished in priority by the receiver or the managing agent.\n(f) The receiver has authority to hire, direct, manage, and discharge any employees of the program, including management-level staff for the program.\n(g) The commissioner, as the receiver appointed by the court, may hire a managing agent to work on the commissioner's behalf to operate the program during the receivership. The managing agent is entitled to a reasonable fee. The receiver and managing agent shall be liable only in an official capacity for injury to persons and property by reason of the conditions of the program. The receiver and managing agent shall not be personally liable, except for gross negligence or intentional acts. The commissioner shall assist the managing agent in carrying out the managing agent's duties.\nThe provisions contained in section 245A.12, subdivision 6, shall also apply to receiverships ordered according to this section.\nThe provisions contained in section 245A.12, subdivision 7, also apply to receiverships ordered according to this section.\nOccupation of the physical plant under an involuntary receivership shall be governed by paragraphs (a) and (b).\n(a) The physical plant owned by a controlling individual of the program or related party must be made available for the use of the program throughout the receivership period. The court shall determine a fair monthly rental for the physical plant, taking into account all relevant factors necessary to meet required arm's-length obligations of controlling individuals such as mortgage payments, real estate taxes, and special assessments. The rental fee must be paid by the receiver to the appropriate controlling individuals or related parties for each month that the receivership remains in effect. No payment made to a controlling individual or related party by the receiver or the managing agent or any state agency during a period of the receivership shall include any allowance for profit or be based on any formula that includes an allowance for profit.\n(b) If the owner of the physical plant of a program is not a related party, the court shall order the controlling individual to continue as the lessee of the property during the receivership period. Rental payments during the receivership period shall be made to the owner of the physical plant by the commissioner or the managing agent on behalf of the controlling individual.\nA receiver appointed under an involuntary receivership or the managing agent is entitled to a reasonable fee as determined by the court.\nAn involuntary receivership terminates 18 months after the date on which it was ordered or at any other time designated by the court or when any of the following events occurs:\n(1) the commissioner determines that the program's license or certification application should be granted or should not be suspended or revoked;\n(2) a new license or certification is granted to the program;\n(3) the commissioner determines that all persons residing in a residential program have been provided with alternative residential programs or that all persons receiving services in a nonresidential program have been referred to other programs; or\n(4) the court determines that the receivership is no longer necessary because the conditions which gave rise to the receivership no longer exist.\n(a) If it appears from the petition filed under subdivision 1, from an affidavit or affidavits filed with the petition, or from testimony of witnesses under oath if the court determines it necessary, that there is probable cause to believe that an emergency exists in a residential or nonresidential program, the court shall issue a temporary order for appointment of a receiver within two days after receipt of the petition.\n(b) Notice of the petition must be served on the authorized agent of the program that is subject to the receivership petition or, if the authorized agent is not immediately available for service, on at least one of the controlling individuals for the program. A hearing on the petition must be held within five days after notice is served unless the authorized agent or other controlling individual consents to a later date. After the hearing, the court may continue, modify, or terminate the temporary order.\nFor any program receiving Medicaid funds and ordered into receivership, the commissioner of human services may review rates of a residential or nonresidential program that has needs or deficiencies documented by the Department of Health; the Department of Children, Youth, and Families; or the Department of Human Services. If the commissioner of human services determines that a review of the rate established under sections 256B.5012 and 256B.5013 is needed, the commissioner shall:\n(1) review the order or determination that cites the deficiencies or needs; and\n(2) determine the need for additional staff, additional annual hours by type of employee, and additional consultants, services, supplies, equipment, repairs, or capital assets necessary to satisfy the needs or deficiencies.\nUpon review of rates under subdivision 7, the commissioner may adjust the program's payment rate. The commissioner shall review the circumstances, together with the program's most recent income and expense report, to determine whether or not the deficiencies or needs can be corrected or met by reallocating program staff, costs, revenues, or any other resources including investments. If the commissioner determines that any deficiency cannot be corrected or the need cannot be met with the payment rate currently being paid, the commissioner shall determine the payment rate adjustment by dividing the additional annual costs established during the commissioner's review by the program's actual client days from the most recent income and expense report or the estimated client days in the projected receivership period. The payment rate adjustment remains in effect during the period of the receivership or until another date set by the commissioner. Upon the subsequent sale, closure, or transfer of the program, the commissioner may recover amounts that were paid as payment rate adjustments under this subdivision. This recovery shall be determined through a review of actual costs and client days in the receivership period. The costs the commissioner finds to be allowable shall be divided by the actual client days for the receivership period. This rate shall be compared to the rate paid throughout the receivership period, with the difference multiplied by client days, being the amount to be repaid to the commissioner. Allowable costs shall be determined by the commissioner as those ordinary, necessary, and related to client care by prudent and cost-conscious management. The buyer or transferee shall repay this amount to the commissioner within 60 days after the commissioner notifies the buyer or transferee of the obligation to repay. This provision does not limit the liability of the seller to the commissioner pursuant to section 256B.0641.\nThe commissioner may adjust Medicaid rates and use Medicaid funds, including but not limited to waiver funds, and the medical assistance account and funds for receivership cash flow, receivership administrative fees, and accounting purposes, to the extent permitted by the state's approved Medicaid plan.\nThe commissioner may use the accounts and funds that would have been available for the room and board, services, and program costs of persons in the program for costs, cash flow, and accounting purposes related to the receivership.\nNo controlling individual of a program placed into receivership under this section may apply for or receive a license or certification to operate a residential or nonresidential program for five years from the commencement of the receivership period. This subdivision does not apply to programs that are owned or operated by controlling individuals that were in existence before the date of the receivership agreement, and that have not been placed into receivership.",
	"repealed": false
}