{
	"id": "62Q.18",
	"url": "https://www.revisor.mn.gov/statutes/cite/62Q.18",
	"title": "62Q.18 PORTABILITY OF COVERAGE.",
	"text": "For purposes of this section:\n(1) \"continuous coverage\" has the meaning given in section 62L.02, subdivision 9;\n(2) \"guaranteed issue\" means:\n(i) for individual health plans, that a health plan company shall not decline an application by an individual for any individual health plan offered by that health plan company, including coverage for a dependent of the individual to whom the health plan has been or would be issued; and\n(ii) for group health plans, that a health plan company shall not decline an application by a group for any group health plan offered by that health plan company and shall not decline to cover under the group health plan any person eligible for coverage under the group's eligibility requirements, including persons who become eligible after initial issuance of the group health plan; and\n(3) \"large employer\" means an entity that would be a small employer, as defined in section 62L.02, subdivision 26, except that the entity has more than 50 current employees, based upon the method provided in that subdivision for determining the number of current employees.\n[Repealed, 1995 c 234 art 4 s 4]\n[Repealed, 1995 c 234 art 4 s 4]\n[Repealed, 1995 c 234 art 4 s 4]\n[Repealed, 1995 c 234 art 4 s 4]\n[Repealed, 1995 c 234 art 4 s 4]\nEffective July 1, 1994, no health plan company shall offer, sell, issue, or renew any group health plan that does not, with respect to individuals who maintain continuous coverage and who qualify under the group's eligibility requirements:\n(1) make coverage available on a guaranteed issue basis;\n(2) give full credit for previous continuous coverage against any applicable preexisting condition limitation or preexisting condition exclusion; and\n(3) with respect to a group health plan offered, sold, issued, or renewed to a large employer, impose preexisting condition limitations or preexisting condition exclusions except to the extent that would be permitted under chapter 62L if the group sponsor were a small employer as defined in section 62L.02, subdivision 26.\nTo the extent that this subdivision conflicts with chapter 62L, chapter 62L governs, regardless of whether the group sponsor is a small employer as defined in section 62L.02, except that for group health plans issued to groups that are not small employers, this subdivision's requirement that the individual have maintained continuous coverage applies. An individual who has maintained continuous coverage, but would be considered a late entrant under chapter 62L, may be treated as a late entrant in the same manner under this subdivision as permitted under chapter 62L.\n[Repealed, 1995 c 234 art 4 s 4]\n[Repealed, 1995 c 234 art 4 s 4]\nNo health plan company shall offer, sell, or issue any health plan that does not make coverage available on a guaranteed issue basis in accordance with the Affordable Care Act.",
	"repealed": false
}