{
	"id": "473.665",
	"url": "https://www.revisor.mn.gov/statutes/cite/473.665",
	"title": "473.665 BONDS, ISSUANCE.",
	"text": "In anticipation of the receipt by the corporation of payments by cities herein provided for, appropriations, rents, and profits, and of income from any other source, and for the purpose of securing funds as needed for the payment of the cost of property acquired, airports constructed and purchased, and other purposes herein authorized, the corporation is hereby authorized to issue its bonds in an aggregate principal amount not exceeding $125,000,000, bearing interest at a rate not to exceed five percent per annum, payable semiannually. Notwithstanding any provision to the contrary included within the charter of either city or any general or special law of the state of Minnesota they may be issued and sold without a vote upon said question by electors of either city.\nSuch bonds shall be of such date, denominations, place of payment, form, and details as may be determined by such corporation, not inconsistent with the provisions of sections 473.601 to 473.679. They shall mature serially, the first installment to fall due in not more than three years and the last in not more than 30 years from their date, and no annual maturing installment shall exceed by five times the amount of the smallest annual maturing installment; provided, that the amount of such installments of principal may be such that the increase thereof from year to year shall approximately equal the decrease from year to year in the interest of the bonds remaining unpaid. Any bond may reserve the right of its redemption and prepayment at a date or dates fixed therein at par and accrued interest or at such premium and upon such notice as shall be determined by the corporation prior to the issuance of the bond.\nThe bonds shall be signed by the chair, attested by the secretary and countersigned by the treasurer, of the corporation. The interest coupons to be thereto attached shall be executed and authenticated by the printed, engraved or lithographed facsimile signatures of the chair and secretary. The signatures of at least one of the officers signing the bonds shall be manual but those of the others may be printed, engraved or lithographed facsimiles. The validity of bonds or coupons so executed shall remain unimpaired by the fact that one or more of such officers shall have ceased to be in office before their delivery to the purchaser or shall not have been in office on the formal date of the bonds. Section 475.60, in so far as applicable, shall apply to the negotiation and sale of the bonds. They shall not impose any personal liability upon any member of the corporation.\nThe bonds shall be secured by pledge of the full faith, credit, and resources of the cities in and for which the corporation has been created. The corporation is hereby authorized to pledge such full faith, credit, and resources, and specific consent thereto by each city shall be conclusively presumed from the appointment of commissioners by the council thereof. They shall be paid from tax levies as hereinafter provided, and from earnings of the corporation, or may be secured by mortgage or deed of trust on any of the property owned by the corporation. As to bonds negotiated and sold independent of the original $15,000,000 authorization plus $5,000,000, however, the proceeds derived therefrom shall be used by the corporation only for the acquisition of lands, if acquisition of additional lands be necessary, and the construction upon lands, either to be acquired or already acquired, of such revenue producing airport facilities as will be, in the considered judgment of the commissioners of the corporation, self-liquidating over the useful life of such facilities; and such facilities shall be covered by such contracts or by such charges as such commissioners shall establish for the use thereof as will, in the considered judgment of such commissioners, make such facilities self-liquidating; and before the negotiation and sale of any such bonds, such commissioners shall by resolution find, determine and declare that the facilities for which the bonds are to be issued will to the best of their judgment be self-liquidating. The corporation may in like manner issue and sell bonds for the purpose of refunding any bonds theretofore issued in accordance with this section which by their terms are prepayable at the time of such refunding; and such refunding bonds shall not be included in computing the foregoing limits on amounts of bonds issuable by the corporation.\nThe corporation, upon issuing any bonds under the provisions of this section, shall, before the issuance thereof, levy for each year, until the principal and interest are paid in full, a direct annual tax on all the taxable property of the cities in and for which the corporation has been created in an amount not less than five percent in excess of the sum required to pay the principal and interest thereof, when and as such principal and interest matures. After any of such bonds have been delivered to purchasers, such tax shall be irrepealable until all such indebtedness is paid, and after the issuance of such bonds no further action of the corporation shall be necessary to authorize the extensions, assessments, and collection of such tax. The secretary of the corporation shall forthwith furnish a certified copy of such levy to the county auditor or county auditors of the county or counties in which the cities in and for which the corporation has been created are located, together with full information regarding the bonds for which the tax is levied, and such county auditor or such county auditors, as the case may be, shall enter the same in the register provided for in section 475.62, or a similar register, and shall extend and assess the tax so levied. If both cities are located wholly within one county, the county auditor thereof shall annually extend and assess the amount of the tax so levied. If the cities are located in different counties, the county auditor of each such county shall annually extend and assess such portion of the tax levied as the net tax capacity of the taxable property located wholly within the city in such county bears to the total net tax capacity of the taxable property within both cities. Any surplus resulting from the excess levy herein provided for shall be transferred to a sinking fund after the principal and interest for which the tax was levied and collected has been paid; provided, that the corporation may, on or before October 15 in any year, by appropriate action, cause its secretary to certify to the county auditor, or auditors, the amount on hand and available in its treasury from earnings, or otherwise, including the amount in the sinking fund, which it will use to pay principal or interest or both on each specified issue of its bonds, and the county auditor or auditors shall reduce the levy for that year, herein provided for by that amount. The amount of funds so certified shall be set aside by the corporation, and be used for no other purpose than for the payment of the principal and interest of the bonds. All taxes hereunder shall be collected and remitted to the corporation by the county treasurer or county treasurers, in accordance with the provisions of law governing the collection of other taxes, and shall be used solely for the payment of the bonds where due.\nThis section shall not be construed as limiting the power of the corporation to levy taxes to pay its bonds issued hereunder but such corporation shall have the authority and it shall be its duty to levy any taxes necessary to provide revenue to pay such bonds.\nThe treasurer may destroy all redeemed bonds and coupons issued by the commission which have been on file in the treasurer's office for more than six years.",
	"repealed": false
}