{
	"id": "473.405",
	"url": "https://www.revisor.mn.gov/statutes/cite/473.405",
	"title": "473.405 POWERS.",
	"text": "The Metropolitan Council has the powers and duties prescribed by this section and sections 473.407 to 473.449 and all powers necessary or convenient to discharge its duties.\nMS 1992 [Repealed, 1994 c 628 art 3 s 209]\nThe council may for transit purposes acquire property, franchises, easements, or property rights or interests of any kind by condemnation proceedings pursuant to chapter 117. Except as provided in subdivision 9, the council may take possession of any property for which condemnation proceedings have been commenced at any time after the filing of the petition describing the property in the proceedings. The council may contract with an operator or other persons for the use by the operator or person of any property under the council's control.\nThe council may engineer, construct, equip, and operate transit and paratransit systems, projects, or any parts thereof, including road lanes or rights-of-way, terminal facilities, maintenance and garage facilities, ramps, parking areas, and any other facilities useful for or related to any public transit or paratransit system or project. The council may sell or lease naming rights with regard to light rail transit stations and apply revenues from sales or leases to light rail transit operating costs.\nThe council may acquire by purchase, lease, gift, or condemnation proceedings any existing public transit system or any part thereof, including all or any part of the plant, equipment, shares of stock, property, real, personal, or mixed, rights in property, reserve funds, special funds, franchises, licenses, patents, permits and papers, documents and records belonging to any operator of a public transit system within the metropolitan area, and may in connection therewith assume any or all liabilities of any operator of a public transit system. The council may take control of and operate a system immediately following the filing and approval of the initial petition for condemnation, if the council, in its discretion, determines this to be necessary, and may take possession of all right, title and other powers of ownership in all properties and facilities described in the petition. Control must be taken by resolution which is effective upon service of a copy on the condemnee and the filing of the resolution in the condemnation action. In the determination of the fair value of the existing public transit system, there must not be included any value attributable to expenditures for improvements made by the former Metropolitan Transit Commission or council.\nMS 1992 [Repealed, 1994 c 628 art 3 s 209]\nMS 1992 [Repealed, 1994 c 628 art 3 s 209]\nMS 1992 [Repealed, 1994 c 628 art 3 s 209]\nThe fact that property is owned by or is in charge of a public agency or a public service corporation organized for a purpose specified in section 301B.01, or is already devoted to a public use or to use by the corporation or was acquired therefor by condemnation may not prevent its acquisition by the council by condemnation, but if the property is in actual public use or in actual use by the corporation for any purpose of interest or benefit to the public, the taking by the council by condemnation may not be authorized unless the court finds and determines that there is greater public necessity for the proposed use by the council than for the existing use.\nAny state department or other agency of the state government or any county, municipality, or other public agency may sell, lease, grant, transfer, or convey to the council, with or without consideration, any facilities or any part or parts thereof or any real or personal property or interest therein which may be useful to the council for any authorized purpose. In any case where the construction of a facility has not been completed, the public agency concerned may also transfer, sell, assign, and set over to the council, with or without consideration, any existing contract for the construction of the facilities.\nMS 1992 [Repealed, 1994 c 628 art 3 s 209]\nNotwithstanding any of the other provisions of this section and sections 473.407 to 473.449, the council may, in lieu of directly operating any public transit system or any part thereof, enter into contracts for management services. The contracts may provide for compensation, incentive fees, the employment of personnel, the services provided, and other terms and conditions that the council deems proper. The contracts must provide that the compensation of personnel who work full time or substantially full time providing management or other services for the council is public data under chapter 13.\nThe council may not permit a contract manager to supervise or manage internal audit activities. Internal audit activity must be supervised and managed directly by the council. The council shall advertise for bids and select contracts for management services through competitive bidding. The term of the contract may not be longer than two years. The contract must include clear operating objectives, stating the service policies and goals of the council in terms of the movement of various passenger groups, and performance criteria, by means of which success in achieving the operating objectives can be measured. The council shall consider and determine the feasibility and desirability of having all its transit management services provided internally by employees of the council.\nThe employees of any public transit system operated pursuant to the provisions of this subdivision for the purpose of resolving any dispute arising under any existing or new collective bargaining agreement relating to the terms or conditions of their employment, may either engage in a concerted refusal to work or to invoke the processes of final and binding arbitration as provided by chapter 572, subject to any applicable provisions of the agreement not inconsistent with law.\nMS 1992 [Repealed, 1994 c 628 art 3 s 209]\nMS 1992 [Repealed, 1994 c 628 art 3 s 209]\nThe council may plan for and assist in the relocation of individuals, families, business concerns, nonprofit organizations, and others displaced by operations of the council, and may make relocation payments in accordance with federal regulations.",
	"repealed": false
}