{
	"id": "298.46",
	"url": "https://www.revisor.mn.gov/statutes/cite/298.46",
	"title": "298.46 EXPLORATORY DRILLING FOR IRON ORE.",
	"text": "It is hereby declared to be in the public interest of this state as a whole, and in particular with respect to counties or other political subdivisions, to encourage the location of all deposits of iron ore hitherto unknown to such political subdivisions, that may be susceptible of economic exploitation.\nWhen in the opinion of the duly constituted authorities of a taxing district there are in existence reserves of unmined iron ore located in such district, these authorities may petition the commissioner of Iron Range resources and rehabilitation for authority to petition the county assessor to verify the existence of such reserves and to ascertain the value thereof by drilling in a manner consistent with established engineering and geological exploration methods, in order that such taxing district may be able to forecast in a proper manner its future economic and fiscal potentials. The commissioner of Iron Range resources and rehabilitation may grant the authority to petition only after consultation with the advisory board.\nIf the fee owner of the land on which the unmined iron ore is believed to be located, or the owner of a mineral interest therein, refuses to permit the county assessor to ascertain the value of unmined iron ore believed to be located on such land, the county attorney, acting in the name of the county may institute proceedings under chapter 117, for the express purpose of being granted an easement which would permit the county assessor to verify whether or not such land does, in fact, contain reserves of unmined iron ore.\nWhen the county assessor has verified the existence of reserves of iron ore and has ascertained the value of such reserves, or in the alternative has failed to locate any reserves susceptible of being economically exploited, the assessor shall notify the county attorney, and the county attorney shall then, by appropriate means, request the district court to discharge the easement secured for the purpose stated above.\nThe cost of such exploration or drilling plus any damages to the property which may be assessed by the district court shall be paid by the commissioner of Iron Range resources and rehabilitation from amounts appropriated to the commissioner of Iron Range resources and rehabilitation under section 298.22. The commissioner of Iron Range resources and rehabilitation shall be reimbursed for one-half of the amounts thus expended. Such reimbursement shall be made by the taxing districts in the proportion that each such taxing district's levy on the property involved bears to the total levy on such property. Such reimbursement shall be made to the commissioner of Iron Range resources and rehabilitation in the manner provided by section 298.221.\nIf any taxing district refuses to pay its share of the reimbursement as provided in subdivision 5, the county auditor is hereby authorized to reduce payments required to be made by the county to such taxing district under other provisions of law. Thereafter the auditor shall draw a warrant, which shall be deposited with the state treasury in accordance with section 298.221, to the credit of the commissioner of Iron Range resources and rehabilitation.\nThe provisions of this section shall not apply in the Boundary Waters Canoe Area.",
	"repealed": false
}