{
	"id": "142G.52",
	"url": "https://www.revisor.mn.gov/statutes/cite/142G.52",
	"title": "142G.52 UNIVERSAL PARTICIPATION REQUIRED.",
	"text": "(a) All MFIP caregivers, except caregivers who meet the criteria in subdivision 2, must develop an individualized employment plan that identifies the activities the participant is required to participate in and the required hours of participation.\n(b) Participants who meet the eligibility requirements in section 142G.75, subdivision 3, must develop a family stabilization services plan that meets the requirements in section 142G.75, subdivision 4.\n(c) Minor caregivers and caregivers who are less than age 20 who have not completed high school or obtained a commissioner of education-selected high school equivalency certification must develop an education plan that meets the requirements in section 142G.57.\n(d) Participants with a family violence waiver must develop an employment plan that meets the requirements in section 142G.56, which cover the provisions in section 142G.75, subdivision 4.\n(e) All other participants must develop an employment plan that meets the requirements of section 142G.56, subdivision 2, and contains allowable work activities, as defined in section 142G.50, subdivision 11. The employment plan must include, at a minimum, the number of participation hours required under section 142G.51, subdivision 1.\n(a) A participant who has a natural born child who is less than 12 months of age who meets the criteria in this subdivision is not required to participate in employment services until the child reaches 12 months of age. To be eligible for this exemption, the assistance unit must not have already used a total of 12 months under the previously allowed \"child under 12 weeks\" or \"child under age one\" exemptions. The 12 months of exemption are available only once in a caregiver's lifetime. In a two-parent household, only one parent is allowed to claim this exemption in any one month.\n(b) The provision in paragraph (a) ends the first full month after the child reaches 12 months of age. The participant must meet with an employment services job counselor the month after the month the child reaches 12 months of age.\nA parent who meets the criteria under subdivision 1 and who receives benefits under chapter 268B is not required to participate in employment services.\n[See Note.]",
	"repealed": false
}