{
	"id": "244.18",
	"url": "https://www.revisor.mn.gov/statutes/cite/244.18",
	"title": "244.18 CORRECTIONAL FEES; SCHEDULE, COLLECTION, AND USE.",
	"text": "(a) For purposes of this section, the terms defined in this subdivision have the meanings given them.\n(b) \"Correctional fees\":\n(1) effective August 1, 2027, means fees charged or contracted for by a probation agency or the commissioner of corrections for court-ordered or community-provided correctional services, including but not limited to drug testing, electronic home monitoring, treatment, and programming; and\n(2) effective August 1, 2023, through July 31, 2027, include fees for the following correctional services:\n(i) community service work placement and supervision;\n(ii) restitution collection;\n(iii) supervision;\n(iv) court-ordered investigations;\n(v) any other court-ordered service;\n(vi) postprison supervision or other form of release; and\n(vii) supervision or other probation-related services provided by a probation agency or by the Department of Corrections for individuals supervised by the commissioner of corrections.\n(c) \"Probation\" has the meaning given in section 609.02, subdivision 15.\n(d) \"Probation agency\" means a probation agency, including a Tribal Nation, organized under section 244.19 or chapter 401.\nA probation agency or the commissioner of corrections may establish a schedule of correctional fees to charge individuals under the supervision and control of the agency or the commissioner, including individuals on supervised release, to defray costs associated with correctional services. The correctional fees on an agency's and the commissioner's schedule must be reasonably related to defendants' abilities to pay and the actual cost of correctional services.\n(a) The chief executive officer of a probation agency or the commissioner may impose and collect a correctional fee from individuals under the supervision and control of the agency or the commissioner. The probation agency or commissioner may collect the fee at any time while the individual is under sentence or after the sentence has been discharged.\n(b) A probation agency may not impose a fee under this section on an individual under the agency's supervision and control if:\n(1) the individual is supervised by the commissioner; and\n(2) the commissioner imposes and collects a fee under this section.\n(c) The agency or the commissioner may use any available civil means of debt collection to collect a correctional fee.\nThe chief executive officer of a probation agency or the commissioner must waive a correctional fee for an individual under the agency's or commissioner's supervision and control if the officer or commissioner determines that:\n(1) the individual does not have the ability to pay the fee;\n(2) the prospects for payment are poor; or\n(3) there are extenuating circumstances justifying a waiver.\n(b) Instead of waiving a fee, the chief executive officer or commissioner may:\n(1) require the individual to perform community work service in lieu of paying the fee; or\n(2) credit the individual's involvement in programming at a rate established by the chief executive officer or commissioner.\nIf a defendant has been ordered by a court to pay restitution, the defendant must pay the restitution before paying a correctional fee. However, if the defendant is making reasonable payments to satisfy the restitution obligation, the probation agency or commissioner may simultaneously collect a correctional fee, subject to subdivision 4.\n(a) Except as provided under paragraph (b), clause (1), for a probation agency and the Department of Corrections, correctional fees must be used by the agency or the department to pay the costs of local correctional services but must not be used to supplant existing local funding for local correctional services.\n(b) Correctional fees must be deposited as follows:\n(1) correctional fees collected by Department of Corrections agents providing felony supervision under section 244.20 go to the general fund; and\n(2) all other correctional fees collected by Department of Corrections agents and probation agents go to the county or Tribal Nation treasurer in the county or Tribal Nation where supervision is provided, as applicable under section 244.19, subdivision 1f.\n(a) By January 15 each year, the commissioner must submit an annual report on implementing the commissioner's duties under this section to the chairs and ranking minority members of the senate and house of representatives committees and divisions with jurisdiction over criminal justice funding and policy. At a minimum, the report must include information on the types of correctional services for which fees were imposed, the aggregate amount of fees imposed, and the amount of fees collected.\n(b) This subdivision expires August 1, 2027.\n(a) The commissioner may authorize providers of sex offender treatment to charge and collect treatment co-pays from all offenders in their treatment program, with a co-pay assessed to each offender based on a fee schedule approved by the commissioner.\n(b) Fees collected under this subdivision must be used by the treatment provider to fund the cost of treatment.\n(a) By August 1, 2025, each probation agency must provide to the commissioner a written plan for phasing out supervision fees for individuals under the agency's supervision and control, and the commissioner must review and approve the plan by August 1, 2027. By August 1, 2027, the commissioner must develop a written plan for phasing out supervision fees for individuals under the commissioner's supervision and control.\n(b) A copy of an approved plan must be provided to all individuals under the supervision and control of the agency or the commissioner and in a language and manner that each individual can understand.\n(c) Supervision fees must not be increased from August 1, 2023, through July 31, 2027.\n(d) This subdivision expires August 1, 2027.",
	"repealed": false
}