{
	"id": "297A.82",
	"url": "https://www.revisor.mn.gov/statutes/cite/297A.82",
	"title": "297A.82 AIRCRAFT; FLIGHT EQUIPMENT; PAYMENT OF TAXES; EXEMPTIONS.",
	"text": "An aircraft must not be registered or licensed in this state unless the applicant presents proof that the sales or use tax imposed by this chapter has been paid or that the transaction is exempt from the sales and use tax. The exemption for an occasional sale under section 297A.67, subdivision 23, or 297A.68, subdivision 25, does not apply to the sale or purchase of an aircraft.\nIf an aircraft is purchased from a dealer holding a valid sales and use tax permit under this chapter, the applicant shall present proof that the tax has been paid to the dealer.\nIf an aircraft is purchased from a person who is not the holder of a valid sales and use tax permit under this chapter, the purchaser shall pay the tax prior to registering or licensing the aircraft in this state.\n(a) The following transactions are exempt from the tax imposed in this chapter to the extent provided.\n(b) The purchase or use of aircraft previously registered in Minnesota by a corporation or partnership is exempt if the transfer constitutes a transfer within the meaning of section 351 or 721 of the Internal Revenue Code.\n(c) The sale to or purchase, storage, use, or consumption by a licensed aircraft dealer of an aircraft for which a commercial use permit has been issued pursuant to section 360.654 is exempt, if the aircraft is resold while the permit is in effect.\n(d) Air flight equipment when sold to, or purchased, stored, used, or consumed by airline companies, as defined in section 270.071, subdivision 4, is exempt. For purposes of this subdivision, \"air flight equipment\" includes airplanes and parts necessary for the repair and maintenance of such air flight equipment, and flight simulators, but does not include aircraft with a maximum takeoff weight of less than 30,000 pounds.\n(e) Sales of, and the storage, distribution, use, or consumption of aircraft, as defined in section 360.511 and approved by the Federal Aviation Administration, and which the seller delivers to a purchaser outside Minnesota or which, without intermediate use, is shipped or transported outside Minnesota by the purchaser are exempt, but only if the purchaser is not a resident of Minnesota and provided that the aircraft is not thereafter returned to a point within Minnesota, except in the course of interstate commerce or isolated and occasional use, and will be registered in another state or country upon its removal from Minnesota. This exemption applies even if the purchaser takes possession of the aircraft in Minnesota and uses the aircraft in the state exclusively for training purposes for a period not to exceed ten days prior to removing the aircraft from this state.\n(f) The sale or purchase of the following items that relate to aircraft operated under Federal Aviation Regulations, Parts 91 and 135, and associated installation charges: equipment and parts necessary for repair and maintenance of aircraft; and equipment and parts to upgrade and improve aircraft.\nTax revenue, including interest and penalties, collected from the sale or purchase of an aircraft taxable under this chapter must be deposited in the state airports fund established in section 360.017. For purposes of this subdivision, \"revenue\" does not include the revenue, including interest and penalties, generated by the sales tax imposed under section 297A.62, subdivision 1a, which must be deposited as provided under article XI, section 15, of the Minnesota Constitution.\nIf the purchase of an aircraft is exempt under this chapter, the commissioner shall issue a certificate that no sales or use tax is due and owing in respect to the transaction.\n(a) A sale of aircraft and parts for the repair of aircraft purchased by a nonprofit, incorporated flying club or association utilized solely by the corporation by leasing the aircraft to shareholders of the corporation is exempt as property purchased for resale. The leasing of the aircraft to the shareholders by the flying club or association is taxable as a retail sale.\n(b) A lease of aircraft utilized by a lessee for leasing to others, whether or not the lessee also utilizes the aircraft for charter service or for flight instruction if no separate charge is made for aircraft rental, is exempt as a purchase for resale. However, a proportionate share of the lease payment reflecting use for flight instruction or charter service is taxable under section 297A.63.\nNotwithstanding subdivisions 1 to 4, the commissioner may enter into an agreement with the commissioner of transportation whereby, upon approval of both commissioners, the commissioner of transportation will collect the sales tax on aircraft from persons required to register or license aircraft in this state. For purposes of collecting the tax, the commissioner of transportation shall act as agent of the commissioner of revenue and shall be subject to all rules not inconsistent with the provisions of this chapter, that may be prescribed by the commissioner.",
	"repealed": false
}