{
	"id": "299J.02",
	"url": "https://www.revisor.mn.gov/statutes/cite/299J.02",
	"title": "299J.02 DEFINITIONS.",
	"text": "The definitions in this section apply to sections 299J.01 to 299J.17.\n\"Commissioner\" means the commissioner of public safety.\n\"Director\" means the director of the Office of Pipeline Safety.\n\"Emergency\" means a condition that poses a clear and immediate danger to life or health or that threatens a significant loss of property.\n\"Emergency release\" means a release that poses a clear and immediate danger to life or health or that threatens a significant loss of property.\n\"Emergency responder\" means a fire department or company, a law enforcement official or office, an ambulance or other emergency rescue service, or the Division of Emergency Management created by section 12.04, subdivision 1.\n\"Gas\" has the meaning given it in Code of Federal Regulations, title 49, section 192.3.\n\"Hazardous liquid\" means \"hazardous liquid\" and \"highly volatile liquid\" as defined in Code of Federal Regulations, title 49, section 195.2.\n\"LNG\" or \"liquefied natural gas\" means natural gas or synthetic gas having as its major constituent methane that has been changed to a liquid or semisolid.\n\"LNG facility\" means a pipeline facility that is used for liquefying or solidifying natural gas or synthetic gas or transferring, storing, or vaporizing liquefied natural gas.\n\"Local governmental unit\" means a county, town, or statutory or home rule charter city.\n\"Person\" means an individual, corporation, partnership, association, or other business entity or a trustee, receiver, assignee, or personal representative of any of them.\n\"Pipeline\" means:\n(1) pipe with a nominal diameter of six inches or more, located in the state, that is used to transport hazardous liquids, but does not include pipe used to transport a hazardous liquid by gravity, and pipe used to transport or store a hazardous liquid within a refining, storage, or manufacturing facility; or\n(2) pipe operated at a pressure of more than 275 pounds per square inch that carries gas.\n\"Pipeline operator\" means a person who owns or operates a pipeline or LNG facility.\n\"Release\" means a spilling, leaking, pumping, pouring, emitting, emptying, discharging, injecting, leaching, dumping, disposing, flowing, or any other uncontrolled escape of a hazardous liquid or gas from a pipeline or gas from a LNG facility.",
	"repealed": false
}