{
	"id": "103E.227",
	"url": "https://www.revisor.mn.gov/statutes/cite/103E.227",
	"title": "103E.227 IMPOUNDING, REROUTING, AND DIVERTING DRAINAGE SYSTEM WATERS.",
	"text": "(a) To conserve and make more adequate use of our water resources or to incorporate wetland or water quality enhancing elements as authorized by section 103E.011, subdivision 5, a person, public or municipal corporation, governmental subdivision, the state or a department or agency of the state, the commissioner of natural resources, and the United States or any of its agencies, may petition to impound, reroute, or divert drainage system waters for beneficial use.\n(b) If the drainage system is under the jurisdiction of a county drainage authority, the petition must be filed with the auditor of the county. If the drainage system is under the jurisdiction of a joint county drainage authority, the petition must be filed with the county having the largest area of property in the drainage system, where the primary drainage system records are kept, and a copy of the petition must be submitted to the auditor of each of the other counties participating in the joint county drainage authority. If the system is under the jurisdiction of a watershed district, the petition must be filed with the secretary of the district. The auditor of an affected county or the secretary of a watershed district must make a copy of the petition available to the public.\n(c) The petition must contain the location of the installation, concept plans for the proposed project, and a map that identifies the areas likely to be affected by the project.\n(d) The petition shall identify the sources of funds to be used to secure the necessary land rights and to construct the project and the amount and rationale for any drainage system funds requested.\n(e) The petitioner or drainage authority must also acquire a public-waters-work permit or a water-use permit from the commissioner of natural resources if required under chapter 103G.\n(a) Upon filing the petition, the petitioners shall file a bond as provided in section 103E.202.\n(b) A bond is not required if the petition is filed by the state, a state agency or department, the commissioner of natural resources, the United States or any of its agencies, a soil and water conservation district, a watershed district, or a municipality.\n(a) After receiving the petition and bond, if required, the drainage authority must appoint an engineer to investigate the effect of the proposed installation and file a report of findings.\n(b) After filing of the engineer's report, notice must be given and a public hearing held as provided in section 103E.261.\n(c) If at the hearing it appears from the engineer's report and other evidence presented that the project will be of a public or private benefit and that it will not impair the utility of the drainage system or deprive affected landowners of its benefit, the drainage authority shall make an order modifying the drainage system, to include the amount, if any, of drainage system funds approved for the project at the discretion of the drainage authority, and issue an order authorizing the project.\nBefore installing or constructing the project, the petitioner or drainage authority shall obtain all required permits and all necessary rights-of-way and flowage easements from owners of land to be affected by it.\nThe order of the drainage authority modifying the drainage system must identify the parties responsible for construction, operation, and maintenance of the drainage system modification and the amount, if any, of drainage system funds for the project. If the part of the drainage system located within the project boundaries is in need of repairs, the petitioner's engineer shall estimate the cost at the time of petition of these separable repairs. The drainage authority shall consider the separable repair costs that will be avoided as a result of the petitioned project, as well as any other benefits of the project to the drainage system, when determining whether or how much to contribute to the petitioned project.",
	"repealed": false
}