{
	"id": "142B.01",
	"url": "https://www.revisor.mn.gov/statutes/cite/142B.01",
	"title": "142B.01 DEFINITIONS.",
	"text": "The terms used in this chapter have the meanings given them in this section.\nWith the exception of subdivision 3, \"annual\" or \"annually\" means prior to or within the same month of the subsequent calendar year.\nFor the purposes of family child care under sections 142B.70 to 142B.72 and 142B.74 and family child foster care training, \"annual\" or \"annually\" means each calendar year.\n\"Applicant\" means an individual, organization, or government entity, as defined in section 13.02, subdivision 7a, that is subject to licensure under this chapter and that has applied for but not yet been granted a license under this chapter.\n\"Authorized agent\" means the controlling individual designated by the license holder responsible for communicating with the commissioner of children, youth, and families on all matters related to this chapter and on whom service of all notices and orders must be made pursuant to section 142B.10, subdivision 1.\n\"Child\" means a person who has not reached age 18.\n\"Commissioner\" means the commissioner of children, youth, and families or the commissioner's designated representative including county agencies and private agencies.\n(a) \"Controlling individual\" means an owner of a program or service provider licensed under this chapter and the following individuals, if applicable:\n(1) each officer of the organization, including the chief executive officer and chief financial officer;\n(2) the individual designated as the authorized agent under section 142B.10, subdivision 1, paragraph (b);\n(3) the individual designated as the compliance officer under section 256B.04, subdivision 21, paragraph (g);\n(4) each managerial official whose responsibilities include the direction of the management or policies of a program;\n(5) the individual designated as the primary provider of care for a special family child care program under section 142B.41, subdivision 4, paragraph (d); and\n(6) the president and treasurer of the board of directors of a nonprofit corporation.\n(b) Controlling individual does not include:\n(1) a bank, savings bank, trust company, savings association, credit union, industrial loan and thrift company, investment banking firm, or insurance company unless the entity operates a program directly or through a subsidiary;\n(2) an individual who is a state or federal official, or state or federal employee, or a member or employee of the governing body of a political subdivision of the state or federal government that operates one or more programs, unless the individual is also an officer, owner, or managerial official of the program; receives remuneration from the program; or owns any of the beneficial interests not excluded in this subdivision;\n(3) an individual who owns less than five percent of the outstanding common shares of a corporation:\n(i) whose securities are exempt under section 80A.45, clause (6); or\n(ii) whose transactions are exempt under section 80A.46, clause (2);\n(4) an individual who is a member of an organization exempt from taxation under section 290.05, unless the individual is also an officer, owner, or managerial official of the program or owns any of the beneficial interests not excluded in this subdivision. This clause does not exclude from the definition of controlling individual an organization that is exempt from taxation; or\n(5) an employee stock ownership plan trust, or a participant or board member of an employee stock ownership plan, unless the participant or board member is a controlling individual according to paragraph (a).\n(c) For purposes of this subdivision, \"managerial official\" means an individual who has the decision-making authority related to the operation of the program, and the responsibility for the ongoing management of or direction of the policies, services, or employees of the program. A site director who has no ownership interest in the program is not considered to be a managerial official for purposes of this definition.\n\"County agency\" means the agency designated by the county board of commissioners, human services boards, local social services agencies or multicounty local social services agencies, or departments where those have been established under the law.\n\"Cradleboard\" means a board or frame on which an infant is secured using blankets or other material, such as fabric or leather sides, and laces and often has a frame extending to protect the infant's head. The infant is always placed with the infant's head facing outward, and the infant remains supervised in the cradleboard while sleeping or being carried.\n\"Drop-in child care program\" means a nonresidential program of child care in which children participate on a onetime only or occasional basis up to a maximum of 90 hours per child, per month. A drop-in child care program must be licensed under Minnesota Rules governing child care centers. A drop-in child care program must meet one of the following requirements to qualify for the rule exemptions specified in section 142B.41, subdivision 6:\n(1) the drop-in child care program operates in a child care center which houses no child care program except the drop-in child care program;\n(2) the drop-in child care program operates in the same child care center but not during the same hours as a regularly scheduled ongoing child care program with a stable enrollment; or\n(3) the drop-in child care program operates in a child care center at the same time as a regularly scheduled ongoing child care program with a stable enrollment but the program's activities, except for bathroom use and outdoor play, are conducted separately from each other.\nFor purposes of child care centers, \"experience\" means paid or unpaid employment:\n(1) caring for children as a teacher, assistant teacher, aide, or student intern:\n(i) in a licensed child care center, a licensed family day care or group family day care, or a Tribally licensed child care program in any United States state or territory; or\n(ii) in a public or nonpublic school;\n(2) caring for children as a staff person or unsupervised volunteer in a certified, license-exempt child care center under chapter 142C; or\n(3) providing direct contact services in a home or residential facility serving children with disabilities that requires a background study under section 245C.03.\n(a) For the purposes of family day care and group family day care licensing under this chapter, the following terms have the meanings given them in this subdivision.\n(b) \"Newborn\" means a child between birth and six weeks old.\n(c) \"Infant\" means a child who is at least six weeks old but less than 12 months old.\n(d) \"Toddler\" means a child who is at least 12 months old but less than 24 months old, except that for purposes of specialized infant and toddler family and group family day care, \"toddler\" means a child who is at least 12 months old but less than 30 months old.\n(e) \"Preschooler\" means a child who is at least 24 months old up to school age.\n(f) \"School age\" means a child who is at least five years of age, but is younger than 11 years of age.\n\"Foster family setting\" has the meaning given in Minnesota Rules, part 2960.3010, subpart 23, and includes settings licensed by the commissioner of children, youth, and families or the commissioner of corrections.\n\"Individual who is related\" means a spouse, a parent, a birth or adopted child or stepchild, a stepparent, a stepbrother, a stepsister, a niece, a nephew, an adoptive parent, a grandparent, a sibling, an aunt, an uncle, or a legal guardian.\n\"License\" means a certificate issued by the commissioner under section 142B.10 authorizing the license holder to provide a specified program for a specified period of time and in accordance with the terms of the license and the rules of the commissioner.\n\"License holder\" means an individual, organization, or government entity that is legally responsible for the operation of the program or service, and has been granted a license by the commissioner under this chapter and the rules of the commissioner.\n\"Nonresidential program\" means care, supervision, rehabilitation, training, or habilitation of a child provided outside the child's home and provided for fewer than 24 hours a day, including child care programs.\n\"Organization\" means a domestic or foreign corporation, nonprofit corporation, limited liability company, partnership, limited partnership, limited liability partnership, association, voluntary association, and any other legal or commercial entity. For purposes of this chapter, organization does not include a government entity.\n\"Owner\" means an individual or organization that has a direct or indirect ownership interest of five percent or more in a program licensed under this chapter. For purposes of this subdivision, \"direct ownership interest\" means the possession of equity in capital, stock, or profits of an organization, and \"indirect ownership interest\" means a direct ownership interest in an entity that has a direct or indirect ownership interest in a licensed program. For purposes of this chapter, \"owner of an employee stock ownership plan\" means the president and treasurer of the entity. A government entity or nonprofit corporation that is issued a license under this chapter shall be designated the owner.\n\"Parent cooperative\" means a nonprofit group child care program that is governed by a board that meets regularly and makes all continuing operational decisions about the program. At least 70 percent of the board membership must be parent-users of the program.\n\"Private agency\" means an organization, other than a county agency, or a court with jurisdiction, that places persons who cannot remain in their own homes in residential programs, foster care, or adoptive homes. A private agency is designated to perform the commissioner's licensing functions under section 142B.30.\n\"Residential program\" means a program that provides 24-hour-a-day care, supervision, food, or lodging to a child or youth outside of the child or youth's home, including foster care.\n\"Respite care services\" means temporary services provided to a person due to the absence or need for relief of the primary caregiver, the person's family member, or legal representative who is the primary caregiver and principally responsible for the care and supervision of the person. Respite care services are those that provide the level of supervision and care that is necessary to ensure the health and safety of the person. Respite care services do not include services that are specifically directed toward the training and habilitation of the person.\n\"School-age child,\" for programs licensed or required to be licensed as a child care center, means a child who is at least of sufficient age to have attended the first day of kindergarten, or is eligible to enter kindergarten within the next four months, but is younger than 13 years of age.\n\"School-age child care program\" means a program licensed or required to be licensed as a child care center, serving more than ten children with the primary purpose of providing child care for school age children.\n(a) For purposes of licensed child care centers, \"supervision\" means when a program staff person:\n(1) is accountable for the child's care;\n(2) can intervene to protect the health and safety of the child; and\n(3) is within sight and hearing of the child at all times except as described in paragraphs (b) to (e).\n(b) When an infant is placed in a crib room to sleep, supervision occurs when a program staff person is within sight or hearing of the infant. When supervision of a crib room is provided by sight or hearing, the center must have a plan to address the other supervision components.\n(c) When a single school-age child uses the restroom within the licensed space, supervision occurs when a program staff person has knowledge of the child's activity and location and checks on the child at least every five minutes. When a school-age child uses the restroom outside the licensed space, including but not limited to field trips, supervision occurs when staff accompany children to the restroom.\n(d) When a school-age child leaves the classroom but remains within the licensed space to deliver or retrieve items from the child's personal storage space, supervision occurs when a program staff person has knowledge of the child's activity and location and checks on the child at least every five minutes.\n(e) When a single preschooler uses an individual, private restroom within the classroom with the door closed, supervision occurs when a program staff person has knowledge of the child's activity and location, can hear the child, and checks on the child at least every five minutes.\n\"Youth\" means a child as defined in section 260C.007, subdivision 4, and includes individuals under 21 years of age who are in foster care pursuant to section 260C.451.",
	"repealed": false
}