{
	"id": "582.03",
	"url": "https://www.revisor.mn.gov/statutes/cite/582.03",
	"title": "582.03 PURCHASER MAY PAY TAXES AND OTHER EXPENSES DUE.",
	"text": "The holder of any sheriff's certificate of sale, from a foreclosure by advertisement or action of a mortgage or lien or execution, or the holder of any certificate of redemption as a junior creditor during the period of redemption, may pay and claim the following on redemption: any taxes or assessments on which any penalty would otherwise accrue, and any costs of a hazard insurance policy for the holder's interest in the mortgaged premises incurred for the period of holding the sheriff's certificate, any costs incurred when an order to reduce a mortgagor's redemption period under section 582.032 is entered, including costs and disbursements awarded under section 582.032, subdivision 9, any fees paid to the county recorder, registrar of titles, or sheriff to obtain or record the certificates of sale or redemption or notices of intention to redeem, any reasonable fees paid to licensed real estate brokers for broker price opinions or to licensed appraisers for appraisals, any deed tax paid to file a certificate of redemption, reasonable attorney fees incurred after the foreclosure sale not to exceed one-half of the amount authorized by section 582.01, any costs incurred under section 582.031, and any interest or installment of principal upon any prior or superior mortgage, lien, or contract for deed in default or that becomes due during the period of redemption. In all such cases, the costs so paid and claimed due, with interest, shall be a part of the sum required to be paid to redeem from such sale. No other costs, fees, interest, or other amount may be added to the amount necessary to redeem.\nAny payments made and claimed due under subdivision 1 shall be proved by the affidavit of the holder of the sheriff's certificate or its agent or attorney, itemizing each of the allowable costs and describing the premises. The affidavit must be filed with the sheriff of the county in which the sale was held at any time prior to expiration of the mortgagor's redemption period. Upon written request by the sheriff, the holder of the sheriff's certificate or certificate of redemption shall provide an affidavit of allowable costs to the sheriff within seven days of the date of the request by the sheriff. If the mortgagor does not redeem within seven days after the affidavit is filed, the holder of the sheriff's certificate may file a supplemental affidavit if additional allowable costs are incurred during the redemption period. If the holder of the sheriff's certificate or certificate of redemption fails to respond to the sheriff's request within seven days, the sheriff may calculate a redemption amount pursuant to section 580.23, subdivision 1, and issue a certificate of redemption for that amount. If the time allowed to redeem is less than seven days from the expiration of the redemption period, the sheriff shall make a reasonable effort to request the affidavit of allowable costs in writing from the holder of the sheriff's certificate, its agent, or attorney before issuing a certificate of redemption. If the affidavit of allowable costs is not provided more than one business day before the expiration of the redemption period, at any time one business day or less before the expiration of the redemption period, the sheriff may calculate a redemption amount pursuant to section 580.23, subdivision 1, and issue a certificate of redemption for that amount. The amount calculated by the sheriff, absent malfeasance by the sheriff, binds the holder of the sheriff's certificate even if the amount calculated by the sheriff is less than the actual amount due.\nAt any time within one year after the expiration of the mortgagor's redemption period, the redeeming party, heirs, or assigns may recover from the holder of the sheriff's certificate three times the amount of any sums declared as costs or disbursements on the affidavit of allowable costs but not actually paid by the holder, or three times the amount of any sums determined to exceed a reasonable cost for the declared item where the excess has been retained by the lender, unless the disputed amounts are paid to the redeeming party, heirs, or assigns prior to entry of judgment.",
	"repealed": false
}