{
	"id": "383A.602",
	"url": "https://www.revisor.mn.gov/statutes/cite/383A.602",
	"title": "383A.602 DEFINITIONS.",
	"text": "The definitions in this section apply to sections 383A.601 to 383A.604.\n\"Conservation specifications\" means management procedures, techniques, and methods to control soil erosion and sedimentation.\n\"District\" means the soil and water conservation district operating under chapter 103C.\n\"Land disturbance activity\" means land change that may result in soil erosion from water or wind and the movement of sediments into or upon waters or lands of Ramsey County, including clearing, grading, excavating, transporting, and filling of land. Land disturbance activity does not mean:\n(1) minor land disturbance activities such as home gardens and individual home landscaping, repairs, and maintenance work;\n(2) construction, installation, maintenance of electric and telephone utility lines or individual service connection to the utility lines;\n(3) septic tank lines or drainage fields unless included in an overall plan for a land disturbance activity relating to construction of a building to be served by the septic tank system;\n(4) tilling, planting, or harvesting of agricultural, horticultural, or silvicultural crops;\n(5) preparation for single-family residences separately built, unless in conjunction with multiple construction in subdivision development;\n(6) disturbance of land areas of less than 10,000 square feet for commercial or noncommercial uses, except that the governing body of the statutory or home rule charter city, town, or organization may reduce this exception to a smaller area of disturbed land or qualify the conditions under which this exception applies;\n(7) installation of fence, sign, telephone, and electric poles and other kinds of posts or poles; and\n(8) emergency work to protect life, limb, or property and emergency repairs.\n\"Organization\" means a watershed management organization as defined in section 103B.205 that has more than 25 percent of its area within Ramsey County.",
	"repealed": false
}