{
	"id": "123B.63",
	"url": "https://www.revisor.mn.gov/statutes/cite/123B.63",
	"title": "123B.63 CAPITAL PROJECT REFERENDUM.",
	"text": "A district may create a capital project referendum account as a separate account in its general fund or its building construction fund. All proceeds from the capital project levy must be deposited in the capital project referendum account in its general fund. The portion of the proceeds to be used for building construction must be transferred to the capital project referendum account in its building construction fund. Interest income attributable to the capital project referendum account must be credited to the account.\nMoney in the capital project referendum account must be used only for the purposes specified in section 126C.10, subdivision 14, for operating capital revenue, including the costs of acquisition and betterment for a project that has been reviewed under section 123B.71 and has been approved according to subdivision 3.\n(a) A district may levy the local tax rate approved by a majority of the electors voting on the question to provide funds for an approved project. The election must take place no more than five years before the estimated date of commencement of the project. The referendum must be held on a date authorized by section 205A.05, subdivision 1a. A district must meet the requirements of section 123B.71 for projects funded under this section. If a review and comment is required under section 123B.71, subdivision 8, a referendum for a project not receiving a positive review and comment by the commissioner must be approved by at least 60 percent of the voters at the election.\n(b) The referendum may be called by the school board and may be held:\n(1) separately, before an election for the issuance of obligations for the project under chapter 475; or\n(2) in conjunction with an election for the issuance of obligations for the project under chapter 475; or\n(3) notwithstanding section 475.59, as a conjunctive question authorizing both the capital project levy and the issuance of obligations for the project under chapter 475. Any obligations authorized for a project may be issued within five years of the date of the election.\n(c) The ballot must provide a general description of the proposed project, state the estimated total cost of the project, state whether the project has received a positive or negative review and comment from the commissioner, state the maximum amount of the capital project levy as a percentage of net tax capacity, state the amount that will be raised by that local tax rate in the first year it is to be levied, and state the maximum number of years that the levy authorization will apply.\nThe ballot must contain a textual portion with the information required in this section and a question stating substantially the following:\n\"Shall the capital project levy proposed by the board of .......... School District No. .......... be approved?\"\nIf approved, the amount provided by the approved local tax rate applied to the net tax capacity for the year preceding the year the levy is certified may be certified for the number of years, not to exceed ten, approved.\n(d) If the district proposes a new capital project to begin at the time the existing capital project expires and at the same maximum tax rate, the general description on the ballot may state that the capital project levy is being renewed and that the tax rate is not being increased from the previous year's rate. An election to renew authority under this paragraph may be called at any time that is otherwise authorized by this subdivision. The ballot notice required under section 275.60 may be modified to read:\n\"BY VOTING YES ON THIS BALLOT QUESTION, YOU ARE VOTING TO RENEW AN EXISTING CAPITAL PROJECTS REFERENDUM THAT IS SCHEDULED TO EXPIRE.\"\n(e) In the event a conjunctive question proposes to authorize both the capital project levy and the issuance of obligations for the project, appropriate language authorizing the issuance of obligations must also be included in the question.\n(f) The district must notify the commissioner of the results of the referendum.\nAny funds remaining in the capital project referendum account that are not applied to the payment of the costs of the approved project before its final completion must be transferred to the district's debt redemption fund.",
	"repealed": false
}