{
	"id": "325F.89",
	"url": "https://www.revisor.mn.gov/statutes/cite/325F.89",
	"title": "325F.89 DEFAULT.",
	"text": "An agreement of the parties to a rental-purchase agreement with respect to default is enforceable only to the extent that one of the following apply:\n(1) the lessee both fails to renew an agreement and also fails to return the property or make arrangements for its return as provided in the agreement; or\n(2) the prospect of payment, performance, or return of the property is materially impaired due to a breach of the rental-purchase agreement, with the burden of establishing the prospect of material impairment on the lessor.\nIf a lessee has been in default for three business days, the lessor may give the lessee a default notice and request surrender of the property as provided under subdivision 3. Mailing written notice to the last known address of the lessee meets the requirement of giving written notice under subdivision 3.\nThe first default notice and a subsequent default notice that is sent more than 12 months after sending the last written notice must be in writing and conspicuously state the following:\n(1) the name, address, and telephone number of the lessor to whom payment is to be made;\n(2) a brief identification of the transaction;\n(3) the lessee's right to cure the default;\n(4) the amount of payment and date by which payment must be made to cure the default;\n(5) a statement of the lessee's reinstatement rights as provided under section 325F.90; and\n(6) a request to voluntarily surrender the property if the payment is not made.\nA subsequent default notice given within the 12 months after a written default notice may be given orally and constitutes proper notice under this section.\nA lessor may not bring a court action to recover the property until seven days after a proper default notice has been given.\nThis section does not prohibit a lessee from voluntarily surrendering possession of the property or the lessor from enforcing a past due obligation which the lessee may have at any time after default.\nIf the lessee cures the default by taking the action required in the default notice, a breach of the agreement is considered as not having occurred.",
	"repealed": false
}