{
	"id": "216B.2403",
	"url": "https://www.revisor.mn.gov/statutes/cite/216B.2403",
	"title": "216B.2403 CONSUMER-OWNED UTILITIES; ENERGY CONSERVATION AND OPTIMIZATION.",
	"text": "This section applies to:\n(1) a cooperative electric association that provides retail service to more than 5,000 members;\n(2) a municipality that provides electric service to more than 1,000 retail customers; and\n(3) a municipality with more than 1,000,000,000 cubic feet in annual throughput sales to natural gas retail customers.\n(a) Each individual consumer-owned electric utility subject to this section has an annual energy-savings goal equivalent to 1.5 percent of gross annual retail energy sales and each individual consumer-owned natural gas utility subject to this section has an annual energy-savings goal equivalent to one percent of gross annual retail energy sales, to be met with a minimum of energy savings from energy conservation improvements equivalent to at least 0.90 percent of the consumer-owned utility's gross annual retail energy sales. The balance of energy savings toward the annual energy-savings goal may be achieved only by the following consumer-owned utility activities:\n(1) energy savings from additional energy conservation improvements;\n(2) electric utility infrastructure projects, as defined in section 216B.1636, subdivision 1, that result in increased efficiency greater than would have occurred through normal maintenance activity;\n(3) net energy savings from efficient fuel-switching improvements that meet the criteria under subdivision 8, which may contribute up to 0.60 percent of the goal; or\n(4) subject to department approval, demand-side natural gas or electric energy displaced by use of waste heat recovered and used as thermal energy, including the recovered thermal energy from a cogeneration or combined heat and power facility.\n(b) The energy-savings goals specified in this section must be calculated based on weather-normalized sales averaged over the most recent three years. A consumer-owned utility may elect to carry forward energy savings in excess of 1.5 percent for a year to the next three years, except that energy savings from electric utility infrastructure projects may be carried forward for five years. A particular energy savings can only be used to meet one year's goal.\n(c) A consumer-owned utility subject to this section is not required to make energy conservation improvements that are not cost-effective, even if the improvement is necessary to attain the energy-savings goal. A consumer-owned utility subject to this section must make reasonable efforts to implement energy conservation improvements that exceed the minimum level established under this subdivision if cost-effective opportunities and funding are available, considering other potential investments the consumer-owned utility intends to make to benefit customers during the term of the plan filed under subdivision 3.\n(a) By June 1, 2022, and at least every three years thereafter, each consumer-owned utility must file with the commissioner an energy conservation and optimization plan that describes the programs for energy conservation, efficient fuel-switching, load management, and other measures the consumer-owned utility intends to offer to achieve the utility's energy savings goal.\n(b) A plan's term may extend up to three years. A multiyear plan must identify the total energy savings and energy savings resulting from energy conservation improvements that are projected to be achieved in each year of the plan. A multiyear plan that does not, in each year of the plan, meet both the minimum energy savings goal from energy conservation improvements and the total energy savings goal of 1.5 percent, or lower goals adjusted by the commissioner under paragraph (k), must:\n(1) state why each goal is projected to be unmet; and\n(2) demonstrate how the consumer-owned utility proposes to meet both goals on an average basis over the duration of the plan.\n(c) A plan filed under this subdivision must provide:\n(1) for existing programs, an analysis of the cost-effectiveness of the consumer-owned utility's programs offered under the plan, using a list of baseline energy- and capacity-savings assumptions developed in consultation with the department; and\n(2) for new programs, a preliminary analysis upon which the program will proceed, in parallel with further development of assumptions and standards.\n(d) The commissioner must evaluate a plan filed under this subdivision based on the plan's likelihood to achieve the energy-savings goals established in subdivision 2. The commissioner may make recommendations to a consumer-owned utility regarding ways to increase the effectiveness of the consumer-owned utility's energy conservation activities and programs under this subdivision. The commissioner may recommend that a consumer-owned utility implement a cost-effective energy conservation or efficient fuel-switching program suggested by an outside source such as a political subdivision, nonprofit corporation, or community organization.\n(e) Beginning June 1, 2023, and every June 1 thereafter, each consumer-owned utility must file: (1) an annual update identifying the status of the plan filed under this subdivision, including: (i) total expenditures and investments made to date under the plan; and (ii) any intended changes to the plan; and (2) a summary of the annual energy-savings achievements under a plan. An annual filing made in the last year of a plan must contain a new plan that complies with this section.\n(f) When evaluating the cost-effectiveness of a consumer-owned utility's energy conservation programs, the consumer-owned utility and the commissioner must consider the costs and benefits to ratepayers, the utility, participants, and society. The commissioner must also consider the rate at which the consumer-owned utility is increasing energy savings and expenditures on energy conservation, and lifetime energy savings and cumulative energy savings.\n(g) A consumer-owned utility may annually spend and invest up to ten percent of the total amount spent and invested on energy conservation, efficient fuel-switching, or load management improvements on research and development projects that meet the applicable definition of energy conservation, efficient fuel-switching, or load management improvement.\n(h) A generation and transmission cooperative electric association or municipal power agency that provides energy services to consumer-owned utilities may file a plan under this subdivision on behalf of the consumer-owned utilities to which the association or agency provides energy services and may make investments, offer conservation programs, and otherwise fulfill the energy-savings goals and reporting requirements of this subdivision for those consumer-owned utilities on an aggregate basis.\n(i) A consumer-owned utility is prohibited from spending for or investing in energy conservation improvements that directly benefit a large energy facility or a large electric customer facility the commissioner has exempted under section 216B.241, subdivision 1a.\n(j) The energy conservation and optimization plan of a consumer-owned utility may include activities to improve energy efficiency in the public schools served by the utility. These activities may include programs to:\n(1) increase the efficiency of the school's lighting and heating and cooling systems;\n(2) recommission buildings;\n(3) train building operators; and\n(4) provide opportunities to educate students, teachers, and staff regarding energy efficiency measures implemented at the school.\n(k) A consumer-owned utility may request that the commissioner adjust the consumer-owned utility's minimum goal for energy savings from energy conservation improvements under subdivision 2, paragraph (a), for the duration of the plan filed under this subdivision. The request must be made by January 1 of the year when the consumer-owned utility must file a plan under this subdivision. The request must be based on:\n(1) historical energy conservation improvement program achievements;\n(2) customer class makeup;\n(3) projected load growth;\n(4) an energy conservation potential study that estimates the amount of cost-effective energy conservation potential that exists in the consumer-owned utility's service territory;\n(5) the cost-effectiveness and quality of the energy conservation programs offered by the consumer-owned utility; and\n(6) other factors the commissioner and consumer-owned utility determine warrant an adjustment.\nThe commissioner must adjust the energy savings goal to a level the commissioner determines is supported by the record, but must not approve a minimum energy savings goal from energy conservation improvements that is less than an average of 0.95 percent per year over the consecutive years of the plan's duration, including the year the minimum energy savings goal is adjusted.\n(l) A consumer-owned utility filing a conservation and optimization plan that includes an efficient fuel-switching program must, as part of the filing, demonstrate that the requirements of subdivision 8 are met.\n(a) Except as otherwise provided, a consumer-owned utility that the commissioner determines falls short of the minimum energy savings goal from energy conservation improvements established in subdivision 2, paragraph (a), for three consecutive years during which the utility has annually spent on energy conservation improvements less than 1.5 percent of the utility's gross operating revenues for an electric utility or less than 0.5 percent of the utility's gross operating revenues for a natural gas utility, must spend no less than the following amounts for energy conservation improvements:\n(1) for a municipality, 0.5 percent of the municipality's gross operating revenues from the sale of gas and 1.5 percent of the municipality's gross operating revenues from the sale of electricity, excluding gross operating revenues from electric and gas service provided in Minnesota to large electric customer facilities; and\n(2) for a cooperative electric association, 1.5 percent of the association's gross operating revenues from service provided in the state, excluding gross operating revenues from service provided in Minnesota to large electric customers facilities indirectly through a distribution cooperative electric association.\n(b) The commissioner may not impose the spending requirement under this subdivision if the commissioner has determined that the utility has followed the commissioner's recommendations, if any, provided under subdivision 3, paragraph (d).\n(c) Upon request of a consumer-owned utility, the commissioner may reduce the amount or duration of the spending requirement imposed under this subdivision, or both, if the commissioner determines that the consumer-owned utility's failure to maintain the minimum energy savings goal is the result of:\n(1) a natural disaster or other emergency that is declared by the executive branch through an emergency executive order that affects the consumer-owned utility's service area;\n(2) a unique load distribution experienced by the consumer-owned utility; or\n(3) other factors that the commissioner determines justifies a reduction.\n(d) Unless the commissioner reduces the duration of the spending requirement under paragraph (c), the spending requirement under this subdivision remains in effect until the consumer-owned utility has met the minimum energy savings goal for three consecutive years.\n(a) A consumer-owned utility subject to this section must provide energy conservation programs to low-income households. The commissioner must evaluate a consumer-owned utility's plans under this section by considering the consumer-owned utility's historic spending on energy conservation programs directed to low-income households, the rate of customer participation in and the energy savings resulting from those programs, and the number of low-income persons residing in the consumer-owned utility's service territory. A municipal utility that furnishes natural gas service must spend at least 0.2 percent of the municipal utility's most recent three-year average gross operating revenue from residential customers in Minnesota on energy conservation programs for low-income households. A consumer-owned utility that furnishes electric service must spend at least 0.2 percent of the consumer-owned utility's gross operating revenue from residential customers in Minnesota on energy conservation programs for low-income households. The requirement under this paragraph applies to each generation and transmission cooperative association's aggregate gross operating revenue from the sale of electricity to residential customers in Minnesota by all of the association's member distribution cooperatives.\n(b) To meet all or part of the spending requirements of paragraph (a), a consumer-owned utility may contribute money to the energy and conservation account established in section 216B.241, subdivision 2a. An energy conservation optimization plan must state the amount of contributions the consumer-owned utility plans to make to the energy and conservation account. Contributions to the account must be used for energy conservation programs serving low-income households, including renters, located in the service area of the consumer-owned utility making the contribution. Contributions must be remitted to the commissioner by February 1 each year.\n(c) The commissioner must establish energy conservation programs for low-income households funded through contributions to the energy and conservation account under paragraph (b). When establishing energy conservation programs for low-income households, the commissioner must consult political subdivisions, utilities, and nonprofit and community organizations, including organizations providing energy and weatherization assistance to low-income households. The commissioner must record and report expenditures and energy savings achieved as a result of energy conservation programs for low-income households funded through the energy and conservation account in the report required under section 216B.241, subdivision 1c, paragraph (f). The commissioner may contract with a political subdivision, nonprofit or community organization, public utility, municipality, or consumer-owned utility to implement low-income programs funded through the energy and conservation account.\n(d) A consumer-owned utility may petition the commissioner to modify the required spending under this subdivision if the consumer-owned utility and the commissioner were unable to expend the amount required for three consecutive years.\n(e) The commissioner must develop and establish guidelines for determining the eligibility of multifamily buildings to participate in energy conservation programs provided to low-income households. Notwithstanding the definition of low-income household in section 216B.2402, a consumer-owned utility or association may apply the most recent guidelines published by the department for purposes of determining the eligibility of multifamily buildings to participate in low-income programs. The commissioner must convene a stakeholder group to review and update these guidelines by August 1, 2021, and at least once every five years thereafter. The stakeholder group must include but is not limited to representatives of public utilities; municipal electric or gas utilities; electric cooperative associations; multifamily housing owners and developers; and low-income advocates.\n(f) Up to 15 percent of a consumer-owned utility's spending on low-income energy conservation programs may be spent on preweatherization measures. A consumer-owned utility is prohibited from claiming energy savings from preweatherization measures toward the consumer-owned utility's energy savings goal.\n(g) The commissioner must, by order, establish a list of preweatherization measures eligible for inclusion in low-income energy conservation programs no later than March 15, 2022.\n(h) A Healthy AIR (Asbestos Insulation Removal) account is established as a separate account in the special revenue fund in the state treasury. A consumer-owned utility may elect to contribute money to the Healthy AIR account to provide preweatherization measures for households eligible for weatherization assistance from the state weatherization assistance program in section 216C.264. Remediation activities must be executed in conjunction with federal weatherization assistance program services. Money contributed to the account by a consumer-owned utility counts toward: (1) the minimum low-income spending requirement under paragraph (a); and (2) the cap on preweatherization measures under paragraph (f). Money in the account is annually appropriated to the commissioner of commerce to pay for Healthy AIR-related activities.\n(i) This paragraph applies to a consumer-owned utility that supplies electricity to a low-income household whose primary heating fuel is supplied by an entity other than a public utility. Any spending on space and water heating energy conservation improvements and efficient fuel-switching by the consumer-owned utility on behalf of the low-income household may be applied to the consumer owned utility's spending requirement under paragraph (a). To the maximum extent possible, a consumer-owned utility providing services under this paragraph must offer the services in conjunction with weatherization services provided under section 216C.264.\nThe commission must allow a cooperative electric association subject to rate regulation under section 216B.026 to recover expenses resulting from: (1) a plan under this section; and (2) assessments and contributions to the energy and conservation account under section 216B.241, subdivision 2a.\n(a) A preweatherization measure or energy conservation improvement installed in a building under this section, excluding a system owned by a consumer-owned utility that is designed to turn off, limit, or vary the delivery of energy, is the exclusive property of the building owner, except to the extent that the improvement is subject to a security interest in favor of the consumer-owned utility in case of a loan to the building owner for the improvement.\n(b) A consumer-owned utility has no liability for loss, damage, or injury directly or indirectly caused by a preweatherization measure or energy conservation improvement, unless a consumer-owned utility is determined to have been negligent in purchasing, installing, or modifying a preweatherization measure or energy conservation improvement.\n(a) A fuel-switching improvement is deemed efficient if, applying the technical criteria established under section 216B.241, subdivision 1d, paragraph (e), the improvement, relative to the fuel being displaced:\n(1) results in a net reduction in the amount of source energy consumed for a particular use, measured on a fuel-neutral basis, using (i) the consumer-owned utility's or the utility's electricity supplier's annual system average efficiency, or (ii) if the utility elects, a seasonal, monthly, or more granular level of analysis for the electric utility system over the measure's life;\n(2) results in a net reduction of statewide greenhouse gas emissions, as defined in section 216H.01, subdivision 2, over the lifetime of the improvement. For an efficient fuel-switching improvement installed by an electric consumer-owned utility, the reduction in emissions must be measured using (i) the consumer-owned utility's or the utility's electricity supplier's annual average emissions factor, or (ii) if the utility elects, a seasonal, monthly, or more granular level of analysis for the electric utility system over the measure's life; and\n(3) is cost-effective, considering the costs and benefits from the perspective of the consumer-owned utility, participants, and society.\n(b) For purposes of this subdivision, \"source energy\" means the total amount of primary energy required to deliver energy services, adjusted for losses in generation, transmission, and distribution, and expressed on a fuel-neutral basis.\n(a) A consumer-owned utility must submit the filings required under this section to the department using the department's electronic filing system. The commissioner may approve an exemption from this requirement if an affected consumer-owned utility is unable to submit filings via the department's electronic filing system. All other interested parties must submit filings to the department via the department's electronic filing system whenever practicable but may also file by personal delivery or by mail.\n(b) The submission of a document to the department's electronic filing system constitutes service on the department. If a department rule requires service of a notice, order, or other document by the department, a consumer-owned utility, or an interested party upon persons on a service list maintained by the department, service may be made by personal delivery, mail, or electronic service. Electronic service may be made only to persons on the service list that have previously agreed in writing to accept electronic service at an email address provided to the department for electronic service purposes.\nThe commission or department may assess consumer-owned utilities subject to this section to carry out the purposes of section 216B.241, subdivisions 1d, 1e, and 1f. An assessment under this subdivision must be proportionate to a consumer-owned utility's gross operating revenue from sales of gas or electric service in Minnesota during the previous calendar year, as applicable. Assessments under this subdivision are not subject to the cap on assessments under section 216B.62 or any other law.",
	"repealed": false
}