{
	"id": "136A.69",
	"url": "https://www.revisor.mn.gov/statutes/cite/136A.69",
	"title": "136A.69 FEES.",
	"text": "(a) The office shall collect reasonable registration fees that are sufficient to recover, but do not exceed, its costs of administering the registration program. The office shall charge the fees listed in paragraphs (b) to (d) for new registrations.\n(b) A new school offering no more than one degree at each level during its first year must pay registration fees for each applicable level in the following amounts:\n(c) A new school that will offer more than one degree per level during its first year must pay registration fees in an amount equal to the fee for the first degree at each degree level under paragraph (b), plus fees for each additional nondegree program or degree as follows:\n(d) In addition to the fees under paragraphs (b) and (c), a fee of $600 must be paid for an initial application that: (1) has had four revisions, corrections, amendment requests, or application reminders for the same application or registration requirement; or (2) cumulatively has had six revisions, corrections, amendment requests, or application reminders for the same license application and the school seeks to continue with the application process with additional application submissions. If this fee is paid, the school may submit two final application submissions for review prior to application denial under section 136A.65, subdivision 8. This provision excludes from its scope nonrepetitive questions or clarifications initiated by the school before the submission of the application, initial interpretation questions or inquiries from the office regarding a completed application, and initial requests from the office for verification or validation of a completed application.\n(e) The annual renewal registration fee is $1,500.\n(f) In addition to the fee under paragraph (e), a fee of $600 must be paid for a renewal application that: (1) has had four revisions, corrections, amendment requests, or application reminders for the same application or registration requirement; or (2) cumulatively has had six revisions, corrections, amendment requests, or application reminders for the same license application and the school seeks to continue with the application process with additional application submissions. If this fee is paid, the school may submit two final application submissions for review prior to application denial under section 136A.65, subdivision 8. This provision excludes from its scope nonrepetitive questions or clarifications initiated by the school before the submission of the application, initial interpretation questions or inquiries from the office regarding a completed application, and initial requests from the office for verification or validation of a completed application.\n[Repealed, 2010 c 215 art 2 s 21]\nThe office processing fees for adding a degree or nondegree program are as follows:\nIf the office determines that a fact-finding visit or outside consultant is necessary to review, investigate, or evaluate any degree or nondegree program or the institution for statutory compliance with the Minnesota Private and Out-of-State Public Postsecondary Education Act, the office shall be reimbursed for the expenses incurred related to the review as follows:\n(1) $400 for the team base fee or for a paper review conducted by a consultant if the office determines that a fact-finding visit is not required;\n(2) $300 for each day or part thereof on site per team member; and\n(3) the actual cost of customary meals, lodging, and related travel expenses incurred by team members.\nThe fee for modification of any existing degree or nondegree program is $100 and is due if there is:\n(1) an increase or decrease of 25 percent or more from the original date of program approval, in clock hours, credit hours, or calendar length of an existing degree or nondegree program;\n(2) a change in academic measurement from clock hours to credit hours or vice versa; or\n(3) an addition or alteration of courses that represent a 25 percent change or more in the objectives, content, or methods of delivery.",
	"repealed": false
}