{
	"id": "144G.195",
	"url": "https://www.revisor.mn.gov/statutes/cite/144G.195",
	"title": "144G.195 FACILITY RELOCATION.",
	"text": "(a) Beginning March 15, 2025, an assisted living facility with a licensed resident capacity of five residents or fewer may operate under the licensee's current license if the facility is relocated with the approval of the commissioner of health during the period the current license is valid.\n(b) A licensee is not required to apply for a new license solely because the licensee receives approval to relocate a facility. The licensee's license for the relocated facility remains valid until the expiration date specified on the existing license. The commissioner of health must apply the licensing and survey cycle previously established for the facility's prior location to the facility's new location.\n(c) A licensee must notify the commissioner of health, on a form developed by the commissioner, of the licensee's intent to relocate the licensee's facility and submit a nonrefundable relocation fee of $3,905. The commissioner must deposit all relocation fees in the state treasury to be credited to the state government special revenue fund.\n(d) The licensee must obtain plan review approval for the building to which the licensee intends to relocate the facility and a certificate of occupancy from the commissioner of labor and industry or the commissioner of labor and industry's delegated authority for the building. Upon issuance of a certificate of occupancy, the commissioner of health must review and inspect the building to which the licensee intends to relocate the facility and approve or deny the license relocation within 30 calendar days.\n(e) A licensee may only relocate a facility within the geographic boundaries of the municipality in which the facility is currently located or within the geographic boundaries of a contiguous municipality.\n(f) A licensee may only relocate one time in any three-year period, except that the commissioner may approve an additional relocation within a three-year period upon a licensee's demonstration of an extenuating circumstance, including but not limited to the criteria outlined in section 256B.49, subdivision 28a, paragraph (c).\n(g) A licensee that receives approval from the commissioner to relocate a facility must provide each resident with a new assisted living contract and comply with the coordinated move requirements under section 144G.55.\n(h) A licensee denied approval by the commissioner of health to relocate a facility may continue to operate the facility in its current location, follow the requirements in section 144G.57 and close the facility, or notify the commissioner of health of the licensee's intent to relocate the facility to an alternative new location. If the licensee notifies the commissioner of the licensee's intent to relocate the facility to an alternative new location, paragraph (c) applies, including the timelines for approving or denying the license relocation for the alternative new location.\n(a) A licensee that receives approval from the commissioner of health under subdivision 1 to relocate a facility that is also enrolled with the Department of Human Services as a customized living setting to deliver 24-hour customized living services or customized living services to participants through the brain injury and community access for disability inclusion home and community-based services waiver plans and under section 256B.49 must inform the commissioner of human services of the licensee's intent to relocate.\n(b) If the licensee at the time of the intended relocation is providing customized living or 24-hour customized living services under the brain injury and community access for disability inclusion home and community-based services waiver plans and section 256B.49 to at least one individual, and the licensee intends to continue serving that individual in the new location, the licensee must inform the commissioner of human services of the licensee's intention to do so and meet the requirements specified under section 256B.49, subdivision 28a.\n[See Note.]",
	"repealed": false
}