{
	"id": "60B.25",
	"url": "https://www.revisor.mn.gov/statutes/cite/60B.25",
	"title": "60B.25 POWERS OF LIQUIDATOR.",
	"text": "The liquidator shall report to the court monthly, or at other intervals specified by the court, on the progress of the liquidation in whatever detail the court orders. The liquidator shall coordinate activities with those of each guaranty association having an interest in the liquidation and shall submit a report detailing how coordination will be achieved to the court for its approval within 30 days following appointment, or within the time which the court, in its discretion, may establish. Subject to the court's control, the liquidator may:\n(1) Appoint a special deputy to act under sections 60B.01 to 60B.61 and determine the deputy's compensation. The special deputy shall have all powers of the liquidator granted by this section. The special deputy shall serve at the pleasure of the liquidator.\n(2) Appoint or engage employees and agents, actuaries, accountants, appraisers, consultants, and other personnel deemed necessary to assist in the liquidation without regard to chapter 14.\n(3) Fix the compensation of persons under clause (2), subject to the control of the court.\n(4) Defray all expenses of taking possession of, conserving, conducting, liquidating, disposing of, or otherwise dealing with the business and property of the insurer. If the property of the insurer does not contain sufficient cash or liquid assets to defray the costs incurred, the liquidator may advance the costs so incurred out of the appropriation made to the Department of Commerce. Any amounts so paid shall be deemed expense of administration and shall be repaid for the credit of the Department of Commerce out of the first available money of the insurer.\n(5) Hold hearings, subpoena witnesses and compel their attendance, administer oaths, examine any person under oath and compel any person to subscribe to testimony after it has been correctly reduced to writing, and in connection therewith require the production of any books, papers, records, or other documents which the liquidator deems relevant to the inquiry.\n(6) Collect all debts and money due and claims belonging to the insurer, wherever located, and for this purpose institute timely action in other jurisdictions, in order to forestall garnishment and attachment proceedings against such debts; do such other acts as are necessary or expedient to collect, conserve, or protect its assets or property, including sell, compound, compromise, or assign for purposes of collection, upon such terms and conditions as the liquidator deems best, any bad or doubtful debts; and pursue any creditor's remedies available to enforce claims.\n(7) Conduct public and private sales of the property of the insurer in a manner prescribed by the court.\n(8) Use assets of the estate to transfer coverage obligations to a solvent assuming insurer, if the transfer can be arranged without prejudice to applicable priorities under section 60B.44.\n(9) Acquire, hypothecate, encumber, lease, improve, sell, transfer, abandon, or otherwise dispose of or deal with any property of the insurer at its market value or upon such terms and conditions as are fair and reasonable, except that no transaction involving property the market value of which exceeds $10,000 shall be concluded without express permission of the court. The liquidator may also execute, acknowledge, and deliver any deeds, assignments, releases, and other instruments necessary or proper to effectuate any sale of property or other transaction in connection with the liquidation. In cases where real property sold by the liquidator is located other than in the county where the liquidation is pending, the liquidator shall cause to be recorded with the county recorder for the county in which the property is located a certified copy of the order of appointment.\n(10) Borrow money on the security of the insurer's assets or without security and execute and deliver all documents necessary to that transaction for the purpose of facilitating the liquidation.\n(11) Enter into such contracts as are necessary to carry out the order to liquidate, and affirm or disavow any contracts to which the insurer is a party.\n(12) Continue to prosecute and institute in the name of the insurer or in the liquidator's own name any suits and other legal proceedings, in this state or elsewhere, and abandon the prosecution of claims the liquidator deems unprofitable to pursue further. If the insurer is dissolved under section 60B.23, the liquidator may apply to any court in this state or elsewhere for leave to be substituted for the insurer as plaintiff.\n(13) Prosecute any action which may exist in behalf of the creditors, members, policyholders, or shareholders of the insurer against any officer of the insurer, or any other person.\n(14) Remove any records and property of the insurer to the offices of the commissioner or to such other place as is convenient for the purposes of efficient and orderly execution of the liquidation.\n(15) Deposit in one or more banks in this state such sums as are required for meeting current administration expenses and dividend distributions.\n(16) Deposit with the State Board of Investment for investment pursuant to section 11A.24, all sums not currently needed, unless the court orders otherwise.\n(17) Record or file any necessary documents for record in the office of any county recorder or record office in this state or elsewhere where property of the insurer is located.\n(18) Assert all defenses available to the insurer as against third persons, including statutes of limitations, statutes of frauds, and the defense of usury. A waiver of any defense by the insurer after a petition for liquidation has been filed shall not bind the liquidator.\n(19) Exercise and enforce all the rights, remedies, and powers of any creditor, shareholder, policyholder, or member, including any power to avoid any transfer or lien that may be given by law and that is not included within sections 60B.30 and 60B.32.\n(20) Intervene in any proceeding wherever instituted that might lead to the appointment of a receiver or trustee, and act as the receiver or trustee whenever the appointment is offered.\n(21) Enter into agreements with any receiver or commissioner of any other state relating to the rehabilitation, liquidation, conservation, or dissolution of an insurer doing business in both states.\n(22) Collect from an insured any unpaid earned premium or retrospectively rated premium due the insurer based on the termination of coverage under section 60B.22. Premium on surety business is considered earned at inception if no policy term can be determined. All other premium will be considered earned and will be prorated over the determined policy term, regardless of any provision in the bond, guaranty, contract, or other agreement.\n(23) Exercise all powers now held or hereafter conferred upon receivers by the laws of this state not inconsistent with sections 60B.01 to 60B.61.\n(24) The enumeration in this section of the powers and authority of the liquidator is not a limitation, nor does it exclude the right to do such other acts not herein specifically enumerated or otherwise provided for as are necessary or expedient for the accomplishment of or in aid of the purpose of liquidation.\n(25) The power of the liquidator of a health maintenance organization includes the power to transfer coverage obligations to a solvent and voluntary health maintenance organization, insurer, or nonprofit health service plan, and to assign provider contracts of the insolvent health maintenance organization to an assuming health maintenance organization, insurer, or nonprofit health service plan permitted to enter into such agreements. The liquidator is not required to meet the notice requirements of section 62D.121. Transferees of coverage obligations or provider contracts shall have no liability to creditors or obligees of the health maintenance organization except those liabilities expressly assumed.",
	"repealed": false
}