{
	"id": "325E.046",
	"url": "https://www.revisor.mn.gov/statutes/cite/325E.046",
	"title": "325E.046 STANDARDS FOR LABELING BAGS, FOOD OR BEVERAGE PRODUCTS, AND PACKAGING.",
	"text": "A manufacturer, distributor, or wholesaler may not sell or offer for sale and any other person may not knowingly sell or offer for sale in this state a covered product labeled \"biodegradable,\" \"degradable,\" \"decomposable,\" or any form of those terms, or in any way imply that the covered product will break down, fragment, degrade, biodegrade, or decompose in a landfill or other environment, unless an ASTM standard specification is adopted for the term claimed and the product is certified as meeting the specification in compliance with the provisions of subdivision 2a.\n(a) A manufacturer, distributor, or wholesaler may not sell or offer for sale and any other person may not knowingly sell or offer for sale in this state a covered product labeled \"compostable\" unless, at the time of sale or offer for sale, the covered product:\n(1) meets the ASTM Standard Specification for Labeling of Plastics Designed to be Aerobically Composted in Municipal or Industrial Facilities (D6400) or its successor or the ASTM Standard Specification for Labeling of End Items that Incorporate Plastics and Polymers as Coatings or Additives with Paper and Other Substrates Designed to be Aerobically Composted in Municipal or Industrial Facilities (D6868) or its successor, and the covered product is labeled to reflect that it meets the specification;\n(2) is comprised of only wood without any coatings or additives; or\n(3) is comprised of only paper without any coatings or additives.\n(b) A covered product labeled \"compostable\" and meeting the criteria under paragraph (a) must be clearly and prominently labeled on the product, or on the product's smallest unit of sale, to reflect that it is intended for an industrial or commercial compost facility. The label required under this paragraph must be in a legible text size and font.\nBeginning January 1, 2026, a manufacturer, distributor, or wholesaler may not sell or offer for sale and any other person may not knowingly sell or offer for sale in this state a covered product labeled as \"biodegradable\" or \"compostable\" unless the covered product is certified as meeting the requirements of subdivision 1 or 2, as applicable, by an entity that:\n(1) is a nonprofit corporation;\n(2) as its primary focus of operation, promotes the production, use, and appropriate end of life for materials and products that are designed to fully biodegrade in specific biologically active environments such as industrial composting; and\n(3) is technically capable of and willing to perform analysis necessary to determine a product's compliance with subdivision 1 or 2, as applicable.\n(a) A person who violates this section is subject to a civil or administrative penalty of $100 for each prepackaged saleable unit sold or offered for sale up to a maximum of $5,000 and may be enjoined from those violations.\n(b) The attorney general may bring an action in the name of the state in a court of competent jurisdiction for recovery of civil penalties or for injunctive relief as provided in this subdivision. The attorney general may accept an assurance of discontinuance of acts in violation of this section in the manner provided in section 8.31, subdivision 2b.\n(c) The commissioner of the Pollution Control Agency may enforce this section under sections 115.071 and 116.072. The commissioner may coordinate with the commissioners of commerce and health in enforcing this section.\n(d) When requested by the commissioner of the Pollution Control Agency, a person selling or offering for sale a covered product labeled as \"compostable\" must furnish to the commissioner any information that the person may have or may reasonably obtain that is relevant to show compliance with this section.\nFor purposes of this section, the following terms have the meanings given:\n(1) \"ASTM\" has the meaning given in section 296A.01, subdivision 6;\n(2) \"covered product\" means a bag, food or beverage product, or packaging;\n(3) \"food or beverage product\" means a product that is used to wrap, package, contain, serve, store, prepare, or consume a food or beverage, such as plates, bowls, cups, lids, trays, straws, utensils, and hinged or lidded containers; and\n(4) \"packaging\" has the meaning given in section 115A.03, subdivision 22b.",
	"repealed": false
}