{
	"id": "245.4876",
	"url": "https://www.revisor.mn.gov/statutes/cite/245.4876",
	"title": "245.4876 QUALITY OF SERVICES.",
	"text": "Children's mental health services required by sections 245.487 to 245.4889 must be:\n(1) based, when feasible, on research findings;\n(2) based on individual clinical, cultural, and ethnic needs, and other special needs of the children being served;\n(3) delivered in a manner that improves family functioning when clinically appropriate;\n(4) provided in the most appropriate, least restrictive setting that meets the requirements in subdivision 1a, and that is available to the county board to meet the child's treatment needs;\n(5) accessible to all age groups of children;\n(6) appropriate to the developmental age of the child being served;\n(7) delivered in a manner that provides accountability to the child for the quality of service delivered and continuity of services to the child during the years the child needs services from the local system of care;\n(8) provided by qualified individuals as required in sections 245.487 to 245.4889;\n(9) coordinated with children's mental health services offered by other providers;\n(10) provided under conditions that protect the rights and dignity of the individuals being served; and\n(11) provided in a manner and setting most likely to facilitate progress toward treatment goals.\nA child must be provided with mental health services in the least restrictive setting that is appropriate to the needs and current condition of the individual child. For a child to receive mental health services in a residential treatment or acute care hospital inpatient setting, the family may not be required to demonstrate that services were first provided in a less restrictive setting and that the child failed to make progress toward or meet treatment goals in the less restrictive setting.\nA provider of services governed by this section must complete a diagnostic assessment of a client according to the standards of section 245I.10. Notwithstanding the required timelines for completing a diagnostic assessment in section 245I.10, a children's residential facility licensed under Minnesota Rules, chapter 2960, that provides mental health services to children must, within ten days of the client's admission: (1) complete the client's diagnostic assessment; or (2) review and update the client's diagnostic assessment with a summary of the child's current mental health status and service needs if a diagnostic assessment is available that was completed within 180 days preceding admission and the client's mental health status has not changed markedly since the diagnostic assessment.\nA provider of services governed by this section must complete an individual treatment plan for a client according to the standards of section 245I.10, subdivisions 7 and 8. A children's residential facility licensed according to Minnesota Rules, chapter 2960, is exempt from the requirements in section 245I.10, subdivisions 7 and 8. Instead, the facility must involve the child and the child's family in all phases of developing and implementing the individual treatment plan to the extent appropriate and must review the individual treatment plan every 90 days after intake.\nMS 2021 Supp [Expired, 1Sp2021 c 7 art 11 s 2]\nEach provider of emergency services, outpatient treatment, community support services, family community support services, day treatment services, screening under section 245.4885, professional home-based family treatment services, residential treatment facilities, acute care hospital inpatient treatment facilities, or regional treatment center services must inform each child with severe emotional disturbance, and the child's parent or legal representative, of the availability and potential benefits to the child of case management. The information shall be provided as specified in subdivision 5. If consent is obtained according to subdivision 5, the provider must refer the child by notifying the county employee designated by the county board to coordinate case management activities of the child's name and address and by informing the child's family of whom to contact to request case management. The provider must document compliance with this subdivision in the child's record. The parent or child may directly request case management even if there has been no referral.\n(a) Although sections 245.487 to 245.4889 require each county board, within the limits of available resources, to make the mental health services listed in those sections available to each child residing in the county who needs them, the county board shall not provide any services, either directly or by contract, unless consent to the services is obtained under this subdivision. The case manager assigned to a child with a severe emotional disturbance shall not disclose to any person other than the case manager's immediate supervisor and the mental health professional providing clinical supervision of the case manager information on the child, the child's family, or services provided to the child or the child's family without informed written consent unless required to do so by statute or under the Minnesota Government Data Practices Act. Informed written consent must comply with section 13.05, subdivision 4, paragraph (d), and specify the purpose and use for which the case manager may disclose the information.\n(b) The consent or authorization must be obtained from the child's parent unless: (1) the parental rights are terminated; or (2) consent is otherwise provided under sections 144.341 to 144.347; 253B.04, subdivision 1; 260C.148; 260C.151; and 260C.201, subdivision 1, the terms of appointment of a court-appointed guardian or conservator, or federal regulations governing substance use disorder services.\nEach provider of outpatient treatment, family community support services, day treatment services, emergency services, professional home-based family treatment services, residential treatment, or acute care hospital inpatient treatment must include the name and home address of each child for whom services are included on a bill submitted to a county, if the release of that information under subdivision 5 has been obtained and if the county requests the information. Each provider must try to obtain the consent of the child's family. Each provider must explain to the child's family that the information can only be released with the consent of the child's family and may be used only for purposes of payment and maintaining provider accountability. The provider shall document the attempt in the child's record.\nThe county board shall establish procedures to ensure that the names and addresses of children receiving mental health services and their families are disclosed only to:\n(1) county employees who are specifically responsible for determining county of financial responsibility or making payments to providers;\n(2) staff who provide treatment services or case management and their clinical supervisors; and\n(3) personnel of the welfare system or health care providers who have access to the data under section 13.46, subdivision 7.\nRelease of mental health data on individuals submitted under subdivisions 5 and 6, to persons other than those specified in this subdivision, or use of this data for purposes other than those stated in subdivisions 5 and 6, results in civil or criminal liability under section 13.08 or 13.09.",
	"repealed": false
}