{
	"id": "256B.0756",
	"url": "https://www.revisor.mn.gov/statutes/cite/256B.0756",
	"title": "256B.0756 HENNEPIN AND RAMSEY COUNTIES PILOT PROGRAM.",
	"text": "(a) The commissioner, upon federal approval of a new waiver request or amendment of an existing demonstration, may establish a pilot program in Hennepin County or Ramsey County, or both, to test alternative and innovative integrated health care delivery networks.\n(b) Individuals eligible for the pilot program shall be individuals who are eligible for medical assistance under section 256B.055 and who reside in Hennepin County or Ramsey County. The commissioner may identify individuals to be enrolled in the Hennepin County pilot program based on zip code in Hennepin County or whether the individuals would benefit from an integrated health care delivery network.\n(c) Individuals enrolled in the pilot program shall be enrolled in an integrated health care delivery network in their county of residence. The integrated health care delivery network in Hennepin County shall be a network, such as an accountable care organization or a community-based collaborative care network, created by or including Hennepin County Medical Center. The integrated health care delivery network in Ramsey County shall be a network, such as an accountable care organization or community-based collaborative care network, created by or including Regions Hospital.\n(d) In developing a payment system for the pilot programs, the commissioner shall establish a total cost of care for the recipients enrolled in the pilot programs that equals the cost of care that would otherwise be spent for these enrollees in the prepaid medical assistance program.\n(e) The commissioner shall apply to the federal government for, or as appropriate, cooperate with counties, providers, or other entities that are applying for any applicable grant or demonstration under the Patient Protection and Affordable Health Care Act, Public Law 111-148, or the Health Care and Education Reconciliation Act of 2010, Public Law 111-152, that would further the purposes of or assist in the creation of an integrated health care delivery network for the purposes of this subdivision, including, but not limited to, a global payment demonstration or the community-based collaborative care network grants.",
	"repealed": false
}