{
	"id": "473.387",
	"url": "https://www.revisor.mn.gov/statutes/cite/473.387",
	"title": "473.387 SPECIAL TRANSPORTATION MARKETS.",
	"text": "The legislature finds and declares that the limited public resources available to subsidize transit require increased efforts to concentrate service and funding on special sectors of the marketplace, so as to ensure a basic level of mobility for all persons in the metropolitan area. The purposes of the programs established by this section are to better target transit services and expenditures on transit dependent sectors of the market and to increase the efficiency and effectiveness and control the cost of transit services for persons who lack private means of transportation.\nThe council shall design and administer the programs under this section. The council may request proposals for projects to demonstrate methods of achieving the purposes of programs administered under this section. The council shall design or ensure the design of programs that will provide better access for the targeted service groups to places of employment and activity throughout the metropolitan area, using regular route transit, paratransit, taxis, car or van pools, or other means of conveyance. The council may organize the services by providing to individuals, directly or indirectly, reduced fares or passes on public transit or vouchers to be used to purchase transportation; by contracting with public and private providers; by arrangements with government agencies, civic and community organizations or nonprofit groups providing assistance to the targeted service groups; by arrangements with prospective employers, with employment, education, retail, medical, or other activity centers, or with local governments; or by any other methods designed to improve service and reduce costs to the targeted service groups.\nThe council shall establish a program and policies to increase the availability and utility of public transit services and reduce transportation costs for persons who are seeking employment and who lack private means of transportation.\nThe council shall establish a program and policies to reduce transportation costs for persons who are, because of limited incomes, age, disability, or other reasons, especially dependent on public transit for common mobility. Data on applicants and users of council programs under this subdivision are classified as private data on individuals under section 13.72, subdivision 20.",
	"repealed": false
}