{
	"id": "446A.15",
	"url": "https://www.revisor.mn.gov/statutes/cite/446A.15",
	"title": "446A.15 BOND FUND.",
	"text": "The authority may establish a special fund or funds for the security of one or more or all series of its bonds. The funds must be known as debt service reserve funds. The authority may pay into each debt service reserve fund:\n(1) any money appropriated by the state only for the purposes of the fund;\n(2) the proceeds of sale of bonds to the extent provided in the resolution or indenture authorizing the issuance of them;\n(3) funds directed to be transferred by the authority to the debt service reserve fund; and\n(4) other money made available to the authority from any other source only for the purpose of the fund.\nExcept as provided in this section, the money credited to each debt service reserve fund must be used only for the payment of the principal of bonds of the authority as they mature, the purchase of the bonds, the payment of interest on them, or the payment of any premium required when the bonds are redeemed before maturity. Money in a debt service reserve fund must not be withdrawn at a time and in an amount that reduces the amount of the fund to less than the amount the authority determines to be reasonably necessary for the purposes of the fund. However, money may be withdrawn to pay principal or interest due on bonds secured by the fund if other money of the authority is not available.\nMoney in a debt service reserve fund not required for immediate use may be invested in accordance with section 446A.04, subdivision 16, paragraph (b).\nIf the authority establishes a debt service reserve fund for the security of any series of bonds, it shall not issue additional bonds that are similarly secured if the amount of any of the debt service reserve funds at the time of issuance does not equal or exceed the minimum amount required by the resolution creating the fund, unless the authority deposits in each fund at the time of issuance, from the proceeds of the bonds, or otherwise, an amount that when added together with the amount then in the fund will be at least the minimum amount required.\nTo the extent consistent with the resolutions and indentures securing outstanding bonds, the authority may at the close of a fiscal year transfer to any other fund or account from any debt service reserve fund any excess in that reserve fund over the amount determined by the authority to be reasonably necessary for the purpose of the reserve fund.\nMS 2006 [Repealed, 2007 c 96 art 1 s 16]",
	"repealed": false
}