{
	"id": "358.65",
	"url": "https://www.revisor.mn.gov/statutes/cite/358.65",
	"title": "358.65 CERTIFICATE OF NOTARIAL ACT.",
	"text": "A notarial act must be evidenced by a certificate. The certificate must:\n(1) be executed contemporaneously with the performance of the notarial act;\n(2) be signed and dated by the notarial officer and, if the notarial officer is a notary public, be signed in the same manner as on file with the commissioning officer or agency;\n(3) identify the jurisdiction in which the notarial act is performed;\n(4) contain the title of office of the notarial officer; and\n(5) if the officer is a notary public, indicate the date of expiration, if any, of the officer's commission.\nIf a notarial act regarding a tangible record is performed by a notary public, an official stamp must be affixed to the certificate. If a notarial act is performed regarding a tangible record by a notarial officer other than a notary public and the certificate contains the information specified in subdivision 1, clauses (2), (3), and (4), an official stamp may be affixed to or embossed on the certificate. If the notarial act regarding an electronic record is performed by a notarial officer and the certificate contains the information specified in subdivision 1, clauses (2), (3), and (4), an official stamp may be attached to or logically associated with the certificate.\nA certificate of a notarial act is sufficient if it meets the requirements of subdivisions 1 and 2 and:\n(1) is in a short form set forth in section 358.66;\n(2) is in a form otherwise permitted by the law of this state;\n(3) is in a form permitted by the law applicable in the jurisdiction in which the notarial act was performed; or\n(4) sets forth the actions of the notarial officer and the actions are sufficient to meet the requirements of the notarial act as provided in sections 358.55, 358.56, and 358.57 or law of this state other than sections 358.51 to 358.76.\nBy executing a certificate of a notarial act, a notarial officer certifies that the officer has complied with the requirements and made the determinations specified in sections 358.54, 358.55, and 358.56.\nA notarial officer may not affix the officer's signature to, or logically associate it with, a certificate until the notarial act has been performed.\nIf a notarial act is performed regarding a tangible record, a certificate must be part of, or securely attached to, the record. If a notarial act is performed regarding an electronic record, the certificate must be affixed to, or logically associated with, the electronic record. If the commissioning officer or agency has established standards pursuant to section 358.73 for attaching, affixing, or logically associating the certificate, the process must conform to the standards.",
	"repealed": false
}