{
	"id": "349.1635",
	"url": "https://www.revisor.mn.gov/statutes/cite/349.1635",
	"title": "349.1635 LINKED BINGO GAME PROVIDER LICENSE.",
	"text": "No person may do any of the following without having first obtained a license from the board:\n(1) provide the means to link prizes in a linked bingo game;\n(2) provide linked bingo game prize management;\n(3) provide the linked bingo system; or\n(4) provide linked bingo paper sheets to an organization.\nThe board may issue a license to a linked bingo game provider or to a manufacturer licensed under section 349.163 who meets the qualifications of this chapter and the rules promulgated by the board. The application shall be on a form prescribed by the board. The license is valid for two years and the fee for a linked bingo game provider license is $5,000 per year.\nAn applicant for a linked bingo game provider license must attach to its application:\n(1) evidence of a bond in the principal amount of not less than $100,000 payable to the state of Minnesota conditioned on the payment of all linked bingo prizes and any other money due and payable under this chapter;\n(2) detailed plans and specifications for the operation of the linked bingo game and the linked bingo system, along with a proposed fee schedule for the cost of providing services and equipment to licensed organizations which may not exceed 15 percent of gross profits, unless a higher percentage, not to exceed 20 percent, is authorized by the board. The fee schedule must incorporate costs paid to distributors for services provided under subdivision 5; and\n(3) any other information required by the board by rule.\n(a) Except for services associated exclusively with a linked bingo game, a linked bingo game provider may not participate or assist in the conduct of lawful gambling by an organization. No linked bingo game provider or employee, representative, agent, affiliate, or other employee of a linked bingo game provider may:\n(1) hold any financial or managerial interest in a premises leased for the conduct of bingo;\n(2) also be licensed as a distributor or hold any financial or managerial interest in a distributor;\n(3) sell or lease linked bingo game equipment to any person not licensed as an organization;\n(4) purchase gambling equipment to be used exclusively in a linked bingo game from any person not licensed as a manufacturer under section 349.163;\n(5) provide a lessor of gambling premises or an appointed official any compensation, gift, gratuity, premium, or contribution; and\n(6) provide an employee or agent of the organization any compensation, gift, gratuity, premium, or other thing of value greater than $25 per organization in a calendar year.\n(b) A linked bingo provider may provide to an organization for use at a premises where lawful gambling is conducted by the licensed organization, marketing, promotional, or point-of-sale items or materials for the promotion of lawful gambling, provided the total value of the items or materials provided to the organization does not exceed $250 per year. Any marketing, promotional, or point-of-sale items and materials used for the promotion of lawful gambling may not include items normally purchased by the lessor of a premises in the lessor's business.\n(c) Employees of the board and the Division of Alcohol and Gambling Enforcement may inspect the books, records, inventory, and business premises of a licensed linked bingo game provider without notice during the normal business hours of the linked bingo game provider. The board may charge a linked bingo game provider for the actual cost of conducting scheduled or unscheduled inspections of the licensee's facilities.\n(a) A linked bingo game provider must contract with licensed distributors for linked bingo game services including, but not limited to, the solicitation of agreements with licensed organizations, and installation, repair, or maintenance of the linked bingo game system.\n(b) A distributor may not charge a fee to licensed organizations for services authorized and rendered under paragraph (a).\n(c) A linked bingo game provider may not contract with any distributor on an exclusive basis.\n(d) A linked bingo game provider may refuse to contract with a licensed distributor if the linked bingo game provider demonstrates that the licensed distributor is not capable of performing the services under the contract.\n(a) A linked bingo game provider that surrenders, withdraws, or otherwise terminates its license must submit to the board, in writing, a termination plan. Termination of a license may occur due to revocation or denial of the license by the board, or by the linked bingo game provider voluntarily quitting its business. Termination plans must be approved by the executive director.\n(b) The license termination plan must include the reconciliation and refund of all unredeemed prize pool contributions to organizations and the disposal of equipment.\n(c) The linked bingo game provider or its designated agent must keep all invoices and other required documentation related to the sale or disposal of gambling equipment for 3-1/2 years after the license has been terminated.",
	"repealed": false
}