{
	"id": "125A.45",
	"url": "https://www.revisor.mn.gov/statutes/cite/125A.45",
	"title": "125A.45 INTERAGENCY DISPUTE PROCEDURE.",
	"text": "(a) A dispute between a school board and a county board that is responsible for implementing the provisions of section 125A.29 regarding early identification, child and family assessment, service coordination, and IFSP development and implementation must be resolved according to this subdivision when the dispute involves services provided to children and families eligible under the Individuals with Disabilities Education Act, United States Code, title 20, section 1471 et seq. (Part C, Public Law 108-446).\n(b) A dispute occurs when the school board and county board are unable to agree as to who is responsible to coordinate, provide, pay for, or facilitate payment for services from public and private sources.\n(c) Written and signed disputes must be filed with the local primary agency.\n(d) The local primary agency must attempt to resolve the matter with the involved school board and county board and may request mediation from the commissioner of the state lead agency for this purpose.\n(e) When interagency disputes have not been resolved within 30 calendar days, the local primary agency must request the commissioner of the state lead agency to review the matter with the commissioners of education, health, and human services and make a decision. The commissioner must provide a consistent process for reviewing those procedures. The commissioners' decision is binding subject to the right of an aggrieved party to appeal to the state court of appeals.\n(f) The local primary agency must ensure that eligible children and their families receive early intervention services during resolution of a dispute. While a local dispute is pending, the local primary agency must either assign financial responsibility to an agency or pay for the service from the early intervention account under section 125A.35. If in resolving the dispute, it is determined that the assignment of financial responsibility was inappropriate, the responsibility for payment must be reassigned to the appropriate agency and the responsible agency must make arrangements for reimbursing any expenditures incurred by the agency originally assigned financial responsibility.",
	"repealed": false
}