{
	"id": "352.98",
	"url": "https://www.revisor.mn.gov/statutes/cite/352.98",
	"title": "352.98 HEALTH CARE SAVINGS PLAN.",
	"text": "This section must be administered by the executive director of the system with the advice and consent of the board of directors. The executive director shall establish a plan or plans, known as health care savings plans, through which an officer or employee of the state or of a political subdivision, including officers or employees covered by a plan or fund specified in chapter 353D, 354B, 354D, 424A, or section 356.20, subdivision 2, may save to cover health care costs. For purposes of this section, a volunteer firefighter is an employee. The executive director shall make available one or more trusts, including a governmental trust or governmental trusts, authorized under the Internal Revenue Code to be eligible for tax-preferred or tax-free treatment through which employers and employees can save to cover health care costs.\n(a) The executive director shall administer the plan and contract with public and private entities to provide investment services, record keeping, benefit payments, and other functions necessary for the administration of the plan.\n(b) As specified in section 356.645, the State Board of Investment shall determine an appropriate selection of investment options that shall be offered by the health care savings plan.\n(a) Contributions to the plan must be defined in a personnel policy or in a collective bargaining agreement of a public employer or political subdivision. The executive director may offer different types of trusts permitted under the Internal Revenue Code to best meet the needs of different employer units.\n(b) Contributions to the plan by or on behalf of the participant must be held in trust for reimbursement of eligible health-related expenses for participants and their dependents following termination from public employment or in other circumstances set forth in the plan document. The executive director shall maintain a separate account of the contributions made by or on behalf of each participant and the earnings thereon. The executive director shall make available a limited range of investment options, and each participant may direct the investment of the accumulations in the participant's account among the investment options made available by the executive director.\n(c) This section does not obligate a public employer to meet and negotiate in good faith with the exclusive bargaining representative of any public employee group regarding an employer contribution to a postretirement or active employee health care savings plan authorized by this section and section 356.24, subdivision 1, clause (7). It is not the intent of the legislature to authorize the state to incur new funding obligations for the costs of retiree health care or the costs of administering retiree health care plans or accounts.\nThe executive director shall reimburse participants at least quarterly for eligible health-related expenses, as allowable by federal and state law, until the participant exhausts the accumulation in the participant's account. If a participant dies prior to exhausting the participant's account balance, the participant's spouse or dependents are eligible to be reimbursed for health care expenses from the account until the account balance is exhausted. If an account balance remains after the death of a participant and all of the participant's legal dependents, the remainder of the account must be paid to the participant's beneficiaries or, if none, to a living person or persons named by the personal representative of the estate. The person or persons named must use the account for reimbursement of allowable health care expenses.\nThe executive director is authorized to charge fees to participants to cover the ongoing cost of operating the plan. The fees must be deposited in an administrative fee account. On January 1, following the end of the prior fiscal year, the executive director shall estimate the amount needed to cover plan expenses, record keeping costs, and custodial fees for the new fiscal year. If the balance of the administrative fee account is in excess of this amount, the excess must revert to participant accounts, or plan fees must be reduced to eliminate the excess, or the executive director may use a combination of both approaches to eliminate the excess.\n[Repealed, 2007 c 133 art 2 s 13]\nNothing in this section prohibits employers from contracting with private entities to provide for health care reimbursement plans.\nAssets in a health care savings plan account described in this section must be used for the reimbursement of health care expenses and are not assignable or subject to execution, levy, attachment, garnishment, or other legal process, except as provided in section 518.58, 518.581, or 518A.53.",
	"repealed": false
}