{
	"id": "115A.552",
	"url": "https://www.revisor.mn.gov/statutes/cite/115A.552",
	"title": "115A.552 OPPORTUNITY TO RECYCLE.",
	"text": "Counties shall ensure that residents, including residents of single and multifamily dwellings, have an opportunity to recycle. At least one recycling center shall be available in each county. Opportunity to recycle means availability of recycling and curbside pickup or collection centers for recyclable materials at sites that are convenient for persons to use. Counties shall also provide for the recycling of problem materials and major appliances. Counties shall assess the operation of existing and proposed recycling centers and shall give due consideration to those centers in ensuring the opportunity to recycle. To the extent practicable, the costs incurred by a county for collection, storage, transportation, and recycling of major appliances must be collected from persons who discard the major appliances.\nAn opportunity to recycle must include:\n(1) a local recycling center in the county and sites for collecting recyclable materials that are located in areas convenient for persons to use them;\n(2) curbside pickup, centralized drop-off, or a local recycling center for at least four broad types of recyclable materials in cities with a population of 5,000 or more persons; and\n(3) monthly pickup of at least four broad types of recyclable materials in cities of the first and second class and cities with 5,000 or more population in the metropolitan area.\n(a) Each county shall provide information on how, when, and where materials may be recycled, including a promotional program that publishes notices at least once every three months and encourages source separation of residential, commercial, industrial, and institutional materials.\n(b) The commissioner shall develop materials for counties to use in providing information on and promotion of recycling.\n(c) The commissioner shall provide technical assistance to counties to help counties implement recycling programs.\nEach county shall encourage building owners and managers, business owners and managers, and collectors of commercial mixed municipal solid waste to provide appropriate recycling services and opportunities to generators of commercial, industrial, and institutional solid waste in the county.",
	"repealed": false
}