{
	"id": "181.81",
	"url": "https://www.revisor.mn.gov/statutes/cite/181.81",
	"title": "181.81 DISMISSAL FOR AGE; PROHIBITION; EXCEPTIONS; REMEDIES.",
	"text": "(a) It is unlawful for any private sector employer to refuse to hire or employ, or to discharge, dismiss, reduce in grade or position, or demote any individual on the grounds that the individual has reached an age of less than 70, except in cases where federal statutes or rules or other state statutes, not including special laws compel or specifically authorize such action. Nothing in this section shall prohibit compulsory retirement of employees who have attained 70 years of age or more; provided further that nothing in this section shall prohibit compulsory retirement of an employee who has attained at least 65 years of age and who for the two-year period immediately before retirement is employed in an executive or a high policy-making position if that employee is entitled to an immediate nonforfeitable annual retirement benefit from a pension, profit sharing, savings or deferred compensation plan of an employer, or any combination of these benefits which totals in the aggregate at least $27,000. If the retirement benefit is in a form other than a straight life annuity, the equivalent annualized payment value of the benefit shall be actuarially determined according to rules promulgated by the commissioner of labor and industry. Pilots and flight crew members shall not be subject to the provisions of this section or section 363A.20, subdivision 9, but shall be retired from this employment pursuant to standards contained in regulations promulgated by the Federal Aviation Administration for airline pilots and flight officers and are subject to the bona fide occupational requirements for these employees as promulgated by the Federal Aviation Administration.\n(b) Every employer shall post in a conspicuous place a notice written or approved by the commissioner of labor and industry stating that the mandatory retirement age is age 70. Employment shall continue for as long as the employee desires or until the employer demonstrates that the employee no longer can meet the bona fide requirements, consistently applied, for the job or position or until the employee reaches the compulsory retirement age established by the employer. When an employer intends to terminate an employee who is 65 years of age or older earlier than age 70 on the ground that the employee no longer can meet the bona fide requirements for the job or position the employer shall give the employee 30 days' notice of that intention.\n(c) If there exists a date on which the accrual of pension benefits or credits, or the contributions therefor by the employee or the employer, or the employee's employment related health and welfare benefits or insurance coverages are diminished or eliminated by virtue of the employee attaining a certain age, the employer shall notify the employee of the changes at least 90 but not more than 120 days prior to the effective date of the change. This section, in and of itself, shall not be construed to require any change in the employer contribution levels of any pension or retirement plan, or to require any employer to increase an employer's or employee's payments for the provision of insurance benefits contained in any employee benefit or insurance plan.\n(d) The definitions of \"employer\" and \"employee\" in section 363A.03 apply to this section.\n(a) The commissioner of labor and industry shall advise any inquiring parties, employee or employer, of their rights and duties under this section and to the extent practicable their rights and duties under any applicable provisions of law governing retirement or other benefits. Further, the commissioner may attempt to conciliate any disputes between employees and employers over the application of or alleged violations of this section.\n(b) Any party aggrieved by a violation of this section may bring suit for redress in the district court wherein the violation occurred or in the district court wherein the employer is located. If a violation is found the court in granting relief may enjoin further violations and may include in its award reinstatement or compensation for any period of unemployment resulting from the violation together with actual and reasonable attorney fees, and other costs incurred by the plaintiff.\n(c) When an action is commenced alleging a violation of this section the plaintiff may in the same action allege a violation of chapter 363A, and seek relief under that chapter if all the procedural requirements of chapter 363A have been met. Alternatively, when a charge is filed or an action commenced alleging a violation of chapter 363A, the plaintiff may in the same action allege a violation of this section and seek relief under this section. In either case, when determining whether or not a violation of chapter 363A, has occurred the court shall incorporate the substantive requirements of this section into any duties and rights specified by chapter 363A.",
	"repealed": false
}