{
	"id": "576.25",
	"url": "https://www.revisor.mn.gov/statutes/cite/576.25",
	"title": "576.25 APPOINTMENT OF RECEIVERS; RECEIVERSHIP NOT A TRUST.",
	"text": "A receiver may be appointed under this chapter whether or not the motion for appointment of a receiver is combined with, or is ancillary to, an action seeking a money judgment.\nExcept where judgment for failure to answer may be had without application to the court, a limited receiver may be appointed before judgment to protect any party to an action who demonstrates an apparent right to property that is the subject of the action and is in the possession of an adverse party, and that the property or its rents and profits are in danger of loss or material impairment.\nA limited or general receiver may be appointed in a judgment or after judgment to carry the judgment into effect, to preserve property pending an appeal, or when an execution has been returned unsatisfied and the judgment debtor refuses to apply the property in satisfaction of the judgment.\nIn addition to those situations specifically provided for in statute, a limited or general receiver may be appointed when a corporation or other entity is dissolved, insolvent, in imminent danger of insolvency, or has forfeited its corporate rights and in like cases of the property within the state of foreign corporations and other entities.\n(a) A limited receiver shall be appointed at any time after the commencement of mortgage foreclosure proceedings under chapter 580 or 581 and before the end of the period for redemption, if the mortgage being foreclosed:\n(1) secures an original principal amount of $100,000 or more or is a lien upon residential real estate containing more than four dwelling units; and\n(2) is not a lien upon property that was entirely homesteaded, residential real estate containing four or fewer dwelling units where at least one unit is homesteaded; or agricultural property.\nThe foreclosing mortgagee or the purchaser at foreclosure sale may at any time bring an action in the district court of the county in which the mortgaged property or any part thereof is located for the appointment of a receiver; provided, however, if the foreclosure is by action under chapter 581, a separate action need not be filed.\n(b) The court shall appoint a receiver upon a showing that the mortgagor has breached a covenant contained in the mortgage relating to any of the following:\n(1) application of tenant security deposits as required by section 504B.178;\n(2) payment when due of prior or current real estate taxes or special assessments with respect to the mortgaged property or the periodic escrow for the payment of the taxes or special assessments;\n(3) payment when due of premiums for insurance of the type required by the mortgage or the periodic escrow for the payment of the premiums; or\n(4) keeping of the covenants required of a landlord or licensor pursuant to section 504B.161, subdivision 1.\n(c) The receiver shall be or shall retain an experienced property manager.\n(d) The receiver shall collect the rents, profits, and all other income of any kind. The receiver, after providing for payment of its reasonable fees and expenses, shall, to the extent possible and in the order determined by the receiver to preserve the value of the mortgaged property:\n(1) manage the mortgaged property so as to prevent waste;\n(2) execute contracts and leases within the period of the receivership, or beyond the period of the receivership if approved by the court;\n(3) pay the expenses listed in paragraph (b), clauses (1) to (3);\n(4) pay all expenses for normal maintenance of the mortgaged property; and\n(5) perform the terms of any assignment of rents that complies with section 559.17, subdivision 2.\n(e) The purchaser at a foreclosure sale shall have the right, at any time and without limitation as provided in section 582.03, to advance money to the receiver to pay any or all of the expenses that the receiver should otherwise pay if cash were available from the mortgaged property. Sums so advanced, with interest, shall be a part of the sum required to be paid to redeem from the sale. The sums shall be proved by the affidavit of the purchaser, an agent, or attorney, stating the expenses and describing the mortgaged property. The affidavit shall be furnished to the sheriff in the manner of expenses claimed under section 582.03.\n(f) Any sums collected that remain in the possession of the receiver at the termination of the receivership shall, in the event the termination of the receivership is due to the reinstatement of the mortgage debt or redemption of the mortgaged property by the mortgagor, be paid to the mortgagor; and in the event termination of the receivership occurs at the end of the period of redemption without redemption by the mortgagor or any other party entitled to redeem, interest accrued upon the sale price pursuant to section 580.23 or 581.10 shall be paid to the purchaser at the foreclosure sale. Any net sum remaining shall be paid to the mortgagor, except if the receiver was enforcing an assignment of rents that complies with section 559.17, subdivision 2, in which case any net sum remaining shall be paid pursuant to the terms of the assignment.\n(g) This subdivision applies to all mortgages executed on or after August 1, 1977, and to amendments or modifications thereto, and to amendments or modifications made on or after August 1, 1977, to mortgages executed before August 1, 1977, if the amendment or modification is duly recorded and is for the principal purpose of curing a default.\nA receiver may be appointed in other cases as are provided by law, or in accord with existing practice, except as otherwise prescribed.\nThe court may appoint a receiver upon a motion with notice to the respondent, to all other parties in the action, and to parties in interest and other persons as the court may require. Notice shall also be given to any judgment creditor who is seeking the appointment of a receiver in any other action. A motion to appoint a general receiver shall be treated as a dispositive motion. The court may appoint a receiver ex parte or on shortened notice on a temporary basis if it is clearly shown that an emergency exists requiring the immediate appointment of a receiver. In that event, the court shall set a hearing as soon as practicable and at the subsequent hearing, the burdens of proof shall be as would be applicable to a motion made on notice that is not expedited.\nThe order appointing the receiver or subsequent order shall describe the receivership property with particularity appropriate to the circumstances. If the order does not so describe the receivership property, until further order of the court, the receiver shall have control over all of the respondent's nonexempt property.\nThe order appointing the receiver does not create a trust.",
	"repealed": false
}