{
	"id": "299C.80",
	"url": "https://www.revisor.mn.gov/statutes/cite/299C.80",
	"title": "299C.80 INDEPENDENT USE OF FORCE INVESTIGATIONS UNIT.",
	"text": "(a) As used in this section, the following terms have the meanings provided.\n(b) \"Law enforcement agency\" has the meaning given in section 626.84, subdivision 1, paragraph (f).\n(c) \"Officer-involved death\" means the death of another that results from a peace officer's use of force while the officer is on duty or off duty but performing activities that are within the scope of the officer's law enforcement duties.\n(d) \"Peace officer\" has the meaning given in section 626.84, subdivision 1, paragraph (c).\n(e) \"Superintendent\" means the superintendent of the Bureau of Criminal Apprehension.\n(f) \"Unit\" means the independent Use of Force Investigations Unit.\nThe superintendent shall form an independent Use of Force Investigations Unit within the Bureau of Criminal Apprehension to conduct officer-involved death investigations. The superintendent, in consultation with the commissioner of public safety, shall select a special agent in charge of the unit.\n(a) The unit shall investigate all criminal sexual conduct cases:\n(1) involving peace officers, including criminal sexual conduct cases involving chief law enforcement officers; and\n(2) where a member of the Minnesota National Guard is the victim, the accused is a member of the Minnesota National Guard, and the incident occurred in Minnesota.\n(b) The unit shall assist the agency investigating an alleged sexual assault of a member of the Minnesota National Guard by another member of the Minnesota National Guard that occurred in a jurisdiction outside of the state, if the investigating agency requests assistance from the unit.\n(c) The unit may also investigate conflict of interest cases involving peace officers.\nThe unit shall employ peace officers and staff to conduct investigations and the superintendent shall develop and implement policies and procedures to ensure no conflict of interest exists with agents assigned to investigate a particular incident. The superintendent may permit bureau resources not directly assigned to this unit to be used to assist the unit in fulfilling the duties assigned in this section.\nWhen a peace officer employed by the Bureau of Criminal Apprehension is the subject of an officer-involved death investigation, the investigation shall be conducted by an investigatory agency selected by the county attorney in the jurisdiction where the alleged offense took place.\nAs provided for in chapter 13, the superintendent must make all inactive investigative data for officer-involved death investigations that are public under section 13.82, subdivision 7, or other applicable law available on the bureau's website within 30 days of the end of the last criminal appeal of a subject of an investigation. By February 1 of each year, the superintendent shall report to the commissioner, the governor, and the chairs and ranking minority members of the legislative committees with jurisdiction over public safety finance and policy the following information about the unit: the number of investigations initiated; the number of incidents investigated; the outcomes or current status of each investigation; the charging decisions made by the prosecuting authority of incidents investigated by the unit; the number of plea agreements reached in incidents investigated by the unit; and any other information relevant to the unit's mission.\nMS 2022 [Repealed, 2023 c 52 art 5 s 80]",
	"repealed": false
}