{
	"id": "469.1831",
	"url": "https://www.revisor.mn.gov/statutes/cite/469.1831",
	"title": "469.1831 NEIGHBORHOOD REVITALIZATION PROGRAM; FIRST CLASS CITY.",
	"text": "(a) For the purposes of this section, the following terms have the meanings given them.\n(b) \"Neighborhood action plan\" means the plan developed with the participation of neighborhood residents under subdivision 6.\n(c) \"Neighborhood revitalization program\" or \"program\" means the program developed under subdivision 5.\n(d) \"Neighborhood revitalization program money\" or \"program money\" means the money derived from tax increments required to be expended on the program under section 469.1781, paragraph (b).\nA city of the first class may establish a neighborhood revitalization program authorizing the expenditure of neighborhood revitalization program money. The activities of a program must preserve and enhance within the neighborhood private and public physical infrastructure, public health and safety, economic vitality, the sense of community, and social benefits.\nA neighborhood revitalization program may provide for expenditure of program money for the following purposes:\n(1) to eliminate blighting influences by acquiring and clearing or rehabilitating properties that the city finds have caused or will cause a decline in the value of properties in the area or will increase the probability that properties in the area will be allowed to physically deteriorate;\n(2) to assist in the development of industrial properties that provide employment opportunities paying a livable income to the residents of the neighborhood and that will not adversely affect the overall character of the neighborhood;\n(3) to acquire, develop, construct, physically maintain, rehabilitate, renovate, or replace neighborhood commercial and retail facilities necessary to maintain neighborhood vitality;\n(4) to eliminate health hazards through the removal of hazardous waste and pollution and return of land to productive use, if the responsible party is unavailable or unable to pay for the cost;\n(5) to rehabilitate existing housing and encourage homeownership;\n(6) to construct new housing, where appropriate;\n(7) to rehabilitate and construct new low-income, affordable rental housing;\n(8) to remove vacant and boarded up houses; and\n(9) to rehabilitate or construct community-based nonprofit and public facilities necessary to carry out the purpose of the program.\n(a) Neighborhood revitalization program money may only be expended in accordance with the program for a purpose listed in subdivision 3 or this subdivision. Program money may not be used in those project areas of the city where the city determines that private investment will be sufficient to provide for development and redevelopment of the project area without public sector assistance, except in cases where program money is being used to remove or rehabilitate structurally substandard or obsolete buildings. Revenues derived from tax increments may only be expended for the purposes otherwise permitted by law, except that notwithstanding any law to the contrary, the city must pay at least the following amount of program money, including revenues derived from tax increments: (1) 15 percent to the school district, (2) 7.5 percent to the county, and (3) 7.5 percent for social services. Payment must be made to the county and school district within 15 days after the city receives the distribution of increment revenues, provided that the payment for calendar year 1990 may be made at any time during the year. Payment to the county for social services delivery shall be paid only after approval of program and spending plans under paragraph (b). Payment to the school district for education programs and services shall be paid only after approval of program and spending plans under paragraph (b).\n(b) The money distributed to the county in a calendar year must be deducted from the county's levy limit for the following calendar year. In calculating the county's levy limit base for later years, the amount deducted must be treated as a local government aid payment.\nThe city must notify the commissioner of education of the amount of the payment made to the school district for the year. The commissioner shall deduct from the school district's state education aid payments one-half of the amount received by the school district.\nThe program money paid to the school district by the city less any amount of state aid deducted by the commissioner must be expended for additional education programs and services in accordance with the program. The amounts expended by the school district may not replace existing services.\nThe money for social services must be paid to the county for the cost of the provision of social services under the plan, as approved by the policy board and the county board.\n(c) The city must expend on housing programs and related purposes as provided by the program at least 75 percent of the program money, after deducting the payments to the school district and county.\n(d) Notwithstanding any other provisions of law to the contrary, for a city of the first class qualifying under section 469.1781, paragraph (a), program money and money described in Laws 1990, chapter 604, article 7, section 29, as amended, may be expended anywhere within the city by the authority for a purpose permitted by this section for any political subdivision without compliance with section 469.175, subdivision 4, and such money shall be deemed to be expended for a purpose that is a permitted project under section 469.176 and for a purpose that is permitted under section 469.176 for the district from which the increment was received.\n(a) The neighborhood revitalization program must be developed based on the following general principles:\n(1) the social needs of neighborhood residents, particularly lower income residents, must be addressed to provide a safe and healthy environment for neighborhood residents, provide for the self-sufficiency of families, and increase the economic and social stability of neighborhoods;\n(2) the children residing in the neighborhoods must be given the opportunity for a quality education and the needs of each neighborhood must be addressed individually wherever possible; and\n(3) the physical structure of the neighborhoods must be enhanced by providing safe and suitable housing and infrastructure to increase the desirability of neighborhoods as places to live.\n(b) The neighborhood revitalization program must include the following:\n(1) the identification of the neighborhoods that require assistance through the program;\n(2) a strategy of the citizen participation required under subdivision 6;\n(3) the neighborhood action plans required under subdivision 6;\n(4) the activities of participating organizations undertaken to address the general principles; and\n(5) an evaluation of the success of the neighborhood action plans.\n(a) The neighborhood revitalization program must be developed with the process outlined in this subdivision.\n(b) The program must include the preparation and implementation of neighborhood action plans. The city must organize neighborhoods to prepare and implement the neighborhood action plans. The neighborhoods must include the participation of, whenever possible, all populations and interests in each neighborhood including renters, homeowners, people of color, business owners, representatives of neighborhood institutions, youth, and the elderly. The neighborhood action plan must be submitted to the policy board established under paragraph (c). The city must provide available resources, information, and technical assistance to prepare the neighborhood action plans.\n(c) Each city that develops a program must establish a policy board whose membership includes members of the city council, county board, school board, and citywide library and park board where they exist appointed by the respective governing bodies; the mayor or designee of the mayor; and a representative from the city's house of representatives delegation and a representative from the city's state senate delegation appointed by the respective delegation. The policy board may also include representatives of citywide community organizations, neighborhood organizations, business owners, labor, and neighborhood residents. The elected officials and appointed members of the library board who are members of the policy board may appoint the other members of the board.\n(d) The policy board shall review, modify where appropriate, and approve, in whole or in part, the neighborhood action plans and forward its recommendations for final action to the governing bodies represented on the policy board. The governing bodies shall review, modify where appropriate, and give final approval, in whole or in part, to those actions over which they have programmatic jurisdiction.\n(e) Except for the legislative appointees, each of the governmental units and groups named in paragraph (c) may, by resolution or agreement of its governing body, become a member of the policy board. The nongovernmental organizations and persons named in paragraph (c) shall provide members of the policy board upon invitation by the governmental members of the policy board. The member to represent a nongovernmental organization shall be a member of the policy board only upon resolution or agreement of the governing body of the member's organization. Upon the resolution or agreement of two or more governmental bodies or governmental boards, the policy board shall be a joint powers board under section 471.59, except that no power may be exercised under section 471.59, subdivision 11. The policy board may:\n(1) sue and be sued. All defenses and limitations available to municipalities under chapter 466 and other laws, shall apply to the policy board, its members, director, and other staff members;\n(2) hire, retain, discipline, and terminate a director to direct its activities and accomplish its program. The director may hire necessary staff subject to authorization by the board;\n(3) enter into contracts, leases, purchases, or other documents evidencing its undertakings. No contract, lease, or purchase or other document may be entered into unless funds have been appropriated or otherwise made available to the policy board;\n(4) adopt bylaws for its own governance;\n(5) enter into agreements with governmental units and governing boards, and nongovernmental organizations represented on the policy board for services required to fulfill the policy boards' purposes;\n(6) accept gifts, donations, and appropriations from governmental or nongovernmental sources and apply for grants from them;\n(7) review activities to determine whether the expenditure of program money and other money is in compliance with the neighborhood plans adopted by the policy board and approved by the governing bodies having jurisdiction over the program, and report its findings prior to October 1 of each year to all of the governmental units, agencies, and nongovernmental organizations represented on the policy board; and\n(8) prepare annually an administrative budget for the ensuing year, estimating its expenditures and estimated revenues, and forward its proposed budget to the governmental units and agencies and nongovernmental organizations for appropriate action.\nThe policy board must periodically review the activities funded with program money to determine if the expenditure of the program money is in compliance with the neighborhood revitalization program.\nThe city of Minneapolis shall ensure that all planning districts in the city are allowed to participate in its neighborhood revitalization program.",
	"repealed": false
}