{
	"id": "171.06",
	"url": "https://www.revisor.mn.gov/statutes/cite/171.06",
	"title": "171.06 APPLICATION FOR LICENSE, PERMIT, IDENTIFICATION CARD; FEES.",
	"text": "Every application for a Minnesota identification card, including an enhanced identification card, or for a driver's license, including an instruction permit, a provisional license, a noncompliant driver's license, a REAL ID driver's license, and an enhanced driver's license, must be made in a format approved by the department. Every application must be accompanied by payment of the proper fee. All applicants must sign the application and declare, under penalty of perjury, that the information and documentation presented in the application is true and correct. All applications requiring evidence of legal presence in the United States or United States citizenship must be signed in the presence of the person authorized to accept the application, or the signature on the application may be verified by a notary public.\n[See Note.]\n(a) The fees for a license and Minnesota identification card are as follows:\n(b) In addition to each fee required in paragraph (a), the commissioner must collect a surcharge of $2.25. Surcharges collected under this paragraph must be credited to the driver and vehicle services technology account under section 299A.705.\n(c) Notwithstanding paragraph (a), an individual who holds a provisional license and has a driving record free of (1) convictions for a violation of section 169A.20, 169A.33, 169A.35, sections 169A.50 to 169A.53, or section 171.177, (2) convictions for crash-related moving violations, and (3) convictions for moving violations that are not crash related, has a $3.50 credit toward the fee for any classified under-21 driver's license. \"Moving violation\" has the meaning given it in section 171.04, subdivision 1.\n(d) In addition to the driver's license fee required under paragraph (a), the commissioner must collect an additional $4 processing fee from each new applicant or individual renewing a license with a school bus endorsement to cover the costs for processing an applicant's initial and biennial physical examination certificate. The department must not charge these applicants any other fee to receive or renew the endorsement.\n(e) In addition to the fee required under paragraph (a), a driver's license agent may charge and retain a filing fee as provided under section 171.061, subdivision 4.\n(f) In addition to the fee required under paragraph (a), the commissioner must charge a filing fee at the same amount as a driver's license agent under section 171.061, subdivision 4. Revenue collected under this paragraph must be deposited in the driver and vehicle services operating account under section 299A.705.\n(g) An application for a Minnesota identification card, instruction permit, provisional license, or driver's license, including an application for renewal, must contain a provision that allows the applicant to add to the fee under paragraph (a), a $2 donation for the purposes of public information and education on anatomical gifts under section 171.075.\n[See Note.]\n(a) In addition to the appropriate fee under subdivision 2, the fee for a motorcycle endorsement on a driver's license is:\n(1) $26.50 for an initial endorsement or a duplicate license obtained for the purpose of adding the endorsement; and\n(2) $17 for each license renewal with the endorsement.\n(b) The additional fee must be paid into the state treasury and credited as follows:\n(1) $19 of the additional fee under paragraph (a), clause (1), and $11 of the additional fee under paragraph (a), clause (2), to the motorcycle safety account, which is hereby created in the special revenue fund; and\n(2) the remainder to the general fund.\n(c) All application forms prepared by the commissioner for motorcycle endorsements must clearly state the amount of the total fee that is dedicated to the motorcycle safety account.\nNever effective. See Laws 1991 c 291 art 19 s 11\nFor an applicant who is a veteran with a total service-connected disability, the commissioner must not impose:\n(1) a license or endorsement fee, including fees and surcharges specified under:\n(i) subdivisions 2 and 2a; and\n(ii) section 171.02, subdivision 3;\n(2) a filing fee under subdivision 2 or section 171.061, subdivision 4; or\n(3) a fee for an identification card under section 171.07, subdivision 3 or 3a.\n(a) An application must:\n(1) state the full name, date of birth, sex, and either (i) the residence address of the applicant, or (ii) designated address under section 5B.05;\n(2) contain a description of the applicant, including the applicant's height in feet and inches, weight in pounds, eye color, and sex; the applicant's driving privileges; and the applicant's ability to operate a motor vehicle with safety;\n(3) state:\n(i) the applicant's Social Security number; or\n(ii) if the applicant does not have a Social Security number and is applying for a Minnesota identification card, instruction permit, or class D provisional or driver's license, that the applicant elects not to specify a Social Security number;\n(4) contain a notification to the applicant of the availability of a living will/health care directive designation on the license under section 171.07, subdivision 7;\n(5) include a method for the applicant to:\n(i) request a veteran designation on the license under section 171.07, subdivision 15, and the driving record under section 171.12, subdivision 5a;\n(ii) indicate a desire to make an anatomical gift under subdivision 3b, paragraph (e);\n(iii) as applicable, designate document retention as provided under section 171.12, subdivision 3c;\n(iv) indicate emergency contacts as provided under section 171.12, subdivision 5b;\n(v) indicate the applicant's race and ethnicity;\n(vi) indicate caretaker information as provided under section 171.12, subdivision 5c; and\n(vii) indicate a temporary mailing address separate from the applicant's residence address listed on the identification card or license; and\n(6) meet the requirements under section 201.161, subdivision 3.\n(b) Applications must be accompanied by satisfactory evidence demonstrating:\n(1) identity, date of birth, and any legal name change if applicable; and\n(2) for drivers' licenses and Minnesota identification cards that meet all requirements of the REAL ID Act:\n(i) principal residence address in Minnesota, including application for a change of address, unless the applicant provides a designated address under section 5B.05;\n(ii) Social Security number, or related documentation as applicable; and\n(iii) lawful status, as defined in Code of Federal Regulations, title 6, section 37.3.\n(c) An application for an enhanced driver's license or enhanced identification card must be accompanied by:\n(1) satisfactory evidence demonstrating the applicant's full legal name and United States citizenship; and\n(2) a photographic identity document.\n(d) An application form must not provide for identification of (1) the accompanying documents used by an applicant to demonstrate identity, or (2) except as provided in paragraphs (b) and (c), the applicant's citizenship, immigration status, or lawful presence in the United States. The commissioner and a driver's license agent must not inquire about an applicant's citizenship, immigration status, or lawful presence in the United States, except as provided in paragraphs (b) and (c).\n(e) A Minnesota driver's license or identification card must be issued only to an individual who has a residence address in the state at the time of the application. Applications for an enhanced driver's license or enhanced identification card must include proof of residency in accordance with section 171.063, subdivision 6. An individual may only have one residence address where the individual is domiciled at any particular time. The residence address of the individual is presumed to continue until the contrary is shown. The applicant must provide the following information about the residence address: residence number, street name, street type, directional, city or town, state, and zip code.\n(f) If an applicant designates a temporary mailing address under paragraph (a), clause (5), item (vii), the commissioner must use the temporary mailing address in lieu of the applicant's residence address for delivery of the driver's license or identification card. The commissioner must send all other correspondence to the applicant's residence address. Nothing in this paragraph or paragraph (a), clause (5), item (vii), may be construed to modify or remove proof of residency requirements at the time of application for an initial driver's permit, driver's license, or identification card.\n[See Note.]\nMS 2022 [Repealed, 2023 c 68 art 5 s 55]\n(a) The commissioner must develop summary information on identity document options. The summary information must be available on the department's website and at every location where a person may apply for an enhanced, REAL ID compliant, or noncompliant driver's license or identification card.\n(b) The summary information must, at a minimum, include:\n(1) each available type of driver's license and Minnesota identification card, including a noncompliant license or identification card, an enhanced driver's license, and an enhanced identification card;\n(2) the official purposes of and limitations on use for each type of driver's license and Minnesota identification card; and\n(3) an overview of data shared outside the state, including through electronic validation or verification systems, as part of the application and issuance of each type.\n(c) The commissioner must ensure that the summary information is available to driver's license and identification card applicants. Renewal notifications mailed to driver's license and identification card holders must include the website address that displays the summary information.\n(d) An applicant for an enhanced or noncompliant license or identification card must sign an acknowledgment that the applicant understands the limitations on use of the license or card.\n(e) If the applicant does not indicate a desire to make an anatomical gift when the application is made, the applicant must be offered a donor document in accordance with section 171.07, subdivision 5. The application must contain statements sufficient to comply with the requirements of the Darlene Luther Revised Uniform Anatomical Gift Act, chapter 525A, so that execution of the application or donor document will make the anatomical gift as provided in section 171.07, subdivision 5, for those indicating a desire to make an anatomical gift. The application must be accompanied by information describing Minnesota laws regarding anatomical gifts and the need for and benefits of anatomical gifts, and the legal implications of making an anatomical gift, including the law governing revocation of anatomical gifts. The commissioner shall distribute a notice that must accompany all applications for and renewals of a driver's license or Minnesota identification card. The notice must be prepared in conjunction with a Minnesota organ procurement organization that is certified by the federal Department of Health and Human Services and must include:\n(1) a statement that provides a fair and reasonable description of the organ donation process, the care of the donor body after death, and the importance of informing family members of the donation decision; and\n(2) a telephone number in a certified Minnesota organ procurement organization that may be called with respect to questions regarding anatomical gifts.\n(f) The application must be accompanied also by information containing relevant facts relating to:\n(1) the effect of alcohol on driving ability;\n(2) the effect of mixing alcohol with drugs;\n(3) the laws of Minnesota relating to operation of a motor vehicle while under the influence of alcohol or a controlled substance; and\n(4) the levels of alcohol-related fatalities and accidents in Minnesota and of arrests for alcohol-related violations.\n(g) The commissioner must provide information on the department's website about the option for an applicant to designate a temporary mailing address. The information on the department's website must:\n(1) be easily accessible and address frequently asked questions;\n(2) detail the department's requirements for the use of a temporary mailing address;\n(3) compare the use of a temporary mailing address to the use of an applicant's residence address; and\n(4) clarify that a driver's license or identification card will not be delivered to a forwarded mail address.\n[See Note.]\n[Repealed, 1997 c 250 s 17]\n[Repealed, 1979 c 150 s 2]\n(a) By applying for an original, duplicate, or renewal instruction permit, provisional driver's license, driver's license, enhanced driver's license, commercial driver's license, state identification card, or enhanced identification card, an applicant under the age of 26, who is a United States citizen or resident, consents to registration in compliance with the requirements of the Military Selective Service Act, United States Code, title 50, appendix, section 453. The application form must state that submission of the application constitutes consent to registration with the selective service system, if required by federal law.\n(b) The commissioner shall forward to the selective service system in an electronic format the necessary personal information required for registration of an applicant described in paragraph (a). If the applicant is under the age of 18, and the license or card to be issued will expire after the applicant's 18th birthday, then the commissioner shall forward the necessary information to the selective service system when the applicant reaches the age of 18.\n(a) The commissioner must establish a process for an eligible individual to apply remotely for a driver's license or Minnesota identification card, whether through a website or other means, or a combination, as provided in this subdivision.\n(b) The commissioner may issue or reinstate an expired driver's license or Minnesota identification card and may renew a driver's license or Minnesota identification card for an eligible individual who does not apply in-person if:\n(1) the applicant submits documentation to demonstrate eligibility, as prescribed by the commissioner;\n(2) there is not a material change to the applicant's name, date of birth, signature, and driver's license or identification number since the most recent driver's license or Minnesota identification card issuance;\n(3) the application is not for a different type or class of driver's license or Minnesota identification card, as identified in sections 171.019, subdivision 2, and 171.02, subdivision 2;\n(4) one of the following requirements is met:\n(i) the commissioner has a previous photograph of the applicant on file that was taken within the last five years or in conjunction with the most recent issuance; or\n(ii) for a noncompliant license or identification card, the applicant submits a photograph that meets the requirements of sections 171.07 and 171.071, Minnesota Rules, part 7410.1810, subpart 1, and any other technical requirements established by the commissioner, which may include but are not limited to background color, lighting and visibility standards, and electronic file size;\n(5) for a driver's license, the commissioner has a record that the applicant has undergone an examination of the applicant's eyesight within the last two years, or the applicant submits a vision examination certificate that:\n(i) has been completed within the last two years;\n(ii) is signed by a licensed physician or an optometrist, including one who holds a similar license in a jurisdiction outside the United States; and\n(iii) is in a form as prescribed by the commissioner;\n(6) for an expired driver's license or Minnesota identification card:\n(i) expiration was within the past five years;\n(ii) expiration was due to driver's license or identification card issuance by another jurisdiction; and\n(iii) the application includes surrender or invalidation of a valid driver's license or identification card issued by another jurisdiction; and\n(7) the most recent issuance, reinstatement, or renewal was not performed under this subdivision.\n(c) A person who applies for a driver's license or Minnesota identification card under this subdivision is not required to:\n(1) take a knowledge examination;\n(2) take a road examination to demonstrate ability to exercise ordinary and reasonable control in the operation of a motor vehicle; and\n(3) appear in-person for an updated photograph upon return to Minnesota or release from incarceration, as appropriate.\n(d) For purposes of this subdivision, \"eligible individual\" means:\n(1) a person serving outside Minnesota in active military service, as defined in section 190.05, subdivision 5, in any branch or unit of the armed forces of the United States;\n(2) a person serving outside Minnesota as a volunteer in the Peace Corps;\n(3) a person who is an employee of a federal department or agency who is assigned to foreign service outside of the United States;\n(4) a person residing outside of Minnesota because the person is a spouse, domestic partner, or dependent under age 26 of a person in clause (1), (2), or (3); or\n(5) a person who applies for renewal and is serving a sentence of longer than six months in a Minnesota jail or correctional facility that has no existing agreement on renewals with the commissioner.\n(a) A person who applies for a noncompliant driver's license or identification card:\n(1) must declare the applicant's residence address in Minnesota; and\n(2) is not required to demonstrate United States citizenship or lawful presence in the United States.\n(b) Minnesota Rules, part 7410.0410, or any successor rule, does not apply for a noncompliant driver's license or identification card.\n(c) Nothing in this section allows the commissioner to issue a commercial driver's license to an applicant who does not demonstrate proof of citizenship or immigration status if required by federal law.\nMS 2023 Supp [Repealed, 2024 c 104 art 1 s 110]\nMS 2023 Supp [Repealed, 2024 c 104 art 1 s 110]\nMS 2023 Supp [Repealed, 2024 c 104 art 1 s 110]",
	"repealed": false
}