{
	"id": "604.18",
	"url": "https://www.revisor.mn.gov/statutes/cite/604.18",
	"title": "604.18 INSURANCE STANDARD OF CONDUCT.",
	"text": "For purposes of this section, the following terms have the meanings given them.\n(a) \"Insurance policy\" means a written agreement between an insured and an insurer that obligates an insurer to pay proceeds directly to an insured. Insurance policy does not include provisions of a written agreement obligating an insurer to defend an insured, reimburse an insured's defense expenses, provide for any other type of defense obligation, or provide indemnification for judgments or settlements. Insurance policy does not include:\n(1) coverage for workers' compensation insurance under chapter 176;\n(2) a written agreement of a health carrier, as defined in section 62A.011;\n(3) a contract issued by a nonprofit health service plan corporation regulated under chapter 62C that provides only dental coverage;\n(4) a written agreement authorized under section 60A.06, subdivision 1, clause (4) or (6), or 64B.16, subdivision 1; or\n(5) a written agreement issued pursuant to section 67A.191.\n(b) \"Insured\" means a person who, or an entity which, qualifies as an insured under the terms of an insurance policy on which a claim for coverage is made. An insured does not include any person or entity claiming a third-party beneficiary status under an insurance policy.\n(c) \"Insurer\" means every insurer, corporation, business trust, or association engaged in insurance as a principal licensed or authorized to transact insurance under section 60A.06, but for purposes of this section an insurer does not include a political subdivision providing self-insurance or a pool of political subdivisions under section 471.981, subdivision 3. The term does not include the Joint Underwriting Association operating under chapter 62F or 62I.\n(a) The court may award as taxable costs to an insured against an insurer amounts as provided in subdivision 3 if the insured can show:\n(1) the absence of a reasonable basis for denying the benefits of the insurance policy; and\n(2) that the insurer knew of the lack of a reasonable basis for denying the benefits of the insurance policy or acted in reckless disregard of the lack of a reasonable basis for denying the benefits of the insurance policy.\n(b) A violation of this section shall not be the basis for any claim or award under chapter 325D or 325F.\n(c) An insurer does not violate this subdivision by conducting or cooperating with a timely investigation into arson or fraud.\n(a) In addition to prejudgment and postjudgment interest and costs and disbursements allowed under law, the court may award an insured the following taxable costs for a violation of subdivision 2:\n(1) an amount equal to one-half of the proceeds awarded that are in excess of an amount offered by the insurer at least ten days before the trial begins or $250,000, whichever is less; and\n(2) reasonable attorney fees actually incurred to establish the insurer's violation of this section.\nAttorney fees may be awarded only if the fees sought are separately accounted for by the insured's attorney and are not duplicative of the fees for the insured's attorney otherwise expended in pursuit of proceeds for the insured under the insurance policy. Attorney fees must not exceed $100,000.\n(b) An insured may not also recover punitive or exemplary damages or attorney fees under section 8.31 for a violation of this section.\n(a) Upon commencement of a civil action by an insured against an insurer, the complaint must not seek a recovery under this section. After filing the suit, a party may make a motion to amend the pleadings to claim recovery of taxable costs under this section. The motion must allege the applicable legal basis under this section for awarding taxable costs under this section, and must be accompanied by one or more affidavits showing the factual basis for the motion. The motion may be opposed by the submission of one or more affidavits showing there is no factual basis for the motion. At the hearing, if the court finds prima facie evidence in support of the motion, the court may grant the moving party permission to amend the pleadings to claim taxable costs under this section.\n(b) An award of taxable costs under this section shall be determined by the court in a proceeding subsequent to any determination by a fact finder of the amount an insured is entitled to under the insurance policy, and shall be governed by the procedures set forth in Minnesota General Rules of Practice, Rule 119.\n(c) An award of taxable costs under this section is not available in any claim that is resolved or confirmed by arbitration or appraisal.\n(d) The following are not admissible in any proceeding that seeks taxable costs under this section:\n(1) findings or determinations made in arbitration proceedings conducted under section 65B.525 or rules adopted under that section;\n(2) allegations involving, or results of, investigations, examinations, or administrative proceedings conducted by the Department of Commerce;\n(3) administrative bulletins or other informal guidance published or disseminated by the Department of Commerce; and\n(4) provisions under chapters 59A to 79A and rules adopted under those sections are not admissible as standards of conduct.\n(e) A claim for taxable costs under this section may not be assigned. This paragraph does not affect the assignment of rights not established in this section.\nA licensed insurance producer is not liable under this section for errors, acts, or omissions attributed to the insurer that appointed the producer to transact business on its behalf, except to the extent the producer has caused or contributed to the error, act, or omission.",
	"repealed": false
}