{
	"id": "144.1464",
	"url": "https://www.revisor.mn.gov/statutes/cite/144.1464",
	"title": "144.1464 SUMMER HEALTH CARE INTERNS.",
	"text": "The commissioner of health, through a contract with a nonprofit organization as required by subdivision 4, shall award grants, within available appropriations, to hospitals, clinics, nursing facilities, assisted living facilities, and home care providers to establish a secondary and postsecondary summer health care intern program. The purpose of the program is to expose interested secondary and postsecondary pupils to various careers within the health care profession.\n(a) The commissioner, through the organization under contract, shall award grants to hospitals, clinics, nursing facilities, assisted living facilities, and home care providers that agree to:\n(1) provide secondary and postsecondary summer health care interns with formal exposure to the health care profession;\n(2) provide an orientation for the secondary and postsecondary summer health care interns;\n(3) pay one-half the costs of employing the secondary and postsecondary summer health care intern;\n(4) interview and hire secondary and postsecondary pupils for a minimum of six weeks and a maximum of 12 weeks; and\n(5) employ at least one secondary student for each postsecondary student employed, to the extent that there are sufficient qualifying secondary student applicants.\n(b) In order to be eligible to be hired as a secondary summer health intern by a hospital, clinic, nursing facility, assisted living facility, or home care provider, a pupil must:\n(1) intend to complete high school graduation requirements and be between the junior and senior year of high school; and\n(2) be from a school district in proximity to the facility.\n(c) In order to be eligible to be hired as a postsecondary summer health care intern by a hospital or clinic, a pupil must:\n(1) intend to complete a health care training program or a two-year or four-year degree program and be planning on enrolling in or be enrolled in that training program or degree program; and\n(2) be enrolled in a Minnesota educational institution or be a resident of the state of Minnesota; priority must be given to applicants from a school district or an educational institution in proximity to the facility.\n(d) Hospitals, clinics, nursing facilities, assisted living facilities, and home care providers awarded grants may employ pupils as secondary and postsecondary summer health care interns, if they agree to pay the intern, during the period before disbursement of state grant money, with money designated as the facility's 50 percent contribution towards internship costs.\nThe commissioner, through the organization under contract, shall award separate grants to hospitals, clinics, nursing facilities, assisted living facilities, and home care providers meeting the requirements of subdivision 2. The grants must be used to pay one-half of the costs of employing secondary and postsecondary pupils in a hospital, clinic, nursing facility, assisted living facility, or home care setting during the course of the program. No more than 50 percent of the participants may be postsecondary students, unless the program does not receive enough qualified secondary applicants per fiscal year. No more than five pupils may be selected from any secondary or postsecondary institution to participate in the program and no more than one-half of the number of pupils selected may be from the seven-county metropolitan area.\nThe commissioner shall contract with a statewide, nonprofit organization representing facilities at which secondary and postsecondary summer health care interns will serve, to administer the grant program established by this section. Grant funds that are not used in one fiscal year may be carried over to the next fiscal year. The organization awarded the grant shall provide the commissioner with any information needed by the commissioner to evaluate the program, in the form and at the times specified by the commissioner.",
	"repealed": false
}