{
	"id": "142A.606",
	"url": "https://www.revisor.mn.gov/statutes/cite/142A.606",
	"title": "142A.606 NORTHSTAR ADOPTION ASSISTANCE ELIGIBILITY.",
	"text": "(a) To be eligible for Northstar adoption assistance under this section, a child must:\n(1) be determined to be a child with special needs under subdivision 2;\n(2) meet the applicable citizenship and immigration requirements in subdivision 3;\n(3)(i) meet the criteria in section 473 of the Social Security Act; or\n(ii) have had foster care payments paid on the child's behalf while in out-of-home placement through the county social service agency or tribal social service agency prior to the issuance of a court order transferring the child's guardianship to the commissioner or making the child a ward of the tribe; and\n(4) have a written, binding agreement under section 142A.608 among the adoptive parent, the financially responsible agency, or, if there is no financially responsible agency, the agency designated by the commissioner, and the commissioner established prior to finalization of the adoption.\n(b) In addition to the requirements in paragraph (a), an eligible child's adoptive parent or parents must meet the applicable background study requirements in subdivision 4.\n(c) A child who meets all eligibility criteria except those specific to title IV-E adoption assistance shall receive adoption assistance paid through funds other than title IV-E.\n(d) A child receiving Northstar kinship assistance payments under section 142A.605 is eligible for Northstar adoption assistance when the criteria in paragraph (a) are met and the child's legal custodian is adopting the child.\n(a) A child is considered a child with special needs under this section if the requirements in paragraphs (b) to (g) are met.\n(b) There must be a determination that the child must not or should not be returned to the home of the child's parents as evidenced by:\n(1) a court-ordered termination of parental rights;\n(2) a petition to terminate parental rights;\n(3) consent of the child's parent to adoption accepted by the court under chapter 260C or, in the case of a child receiving Northstar kinship assistance payments under section 142A.605, consent of the child's parent to the child's adoption executed under chapter 259;\n(4) in circumstances when tribal law permits the child to be adopted without a termination of parental rights, a judicial determination by a tribal court indicating the valid reason why the child cannot or should not return home;\n(5) a voluntary relinquishment under section 259.25 or, if relinquishment occurred in another state, the applicable laws in that state; or\n(6) the death of the legal parent or parents if the child has two legal parents.\n(c) There exists a specific factor or condition of which it is reasonable to conclude that the child cannot be placed with adoptive parents without providing adoption assistance as evidenced by:\n(1) a determination by the Social Security Administration that the child meets all medical or disability requirements of title XVI of the Social Security Act with respect to eligibility for Supplemental Security Income benefits;\n(2) a documented physical, mental, emotional, or behavioral disability not covered under clause (1);\n(3) a member of a sibling group being adopted at the same time by the same parent;\n(4) an adoptive placement in the home of a parent who previously adopted a sibling for whom they receive adoption assistance; or\n(5) documentation that the child is an at-risk child.\n(d) A reasonable but unsuccessful effort must have been made to place the child with adoptive parents without providing adoption assistance as evidenced by:\n(1) a documented search for an appropriate adoptive placement; or\n(2) a determination by the commissioner that a search under clause (1) is not in the best interests of the child.\n(e) The requirement for a documented search for an appropriate adoptive placement under paragraph (d), including the registration of the child with the state adoption exchange and other recruitment methods under paragraph (f), must be waived if:\n(1) the child is being adopted by a relative and it is determined by the child-placing agency that adoption by the relative is in the best interests of the child;\n(2) the child is being adopted by a foster parent with whom the child has developed significant emotional ties while in the foster parent's care as a foster child and it is determined by the child-placing agency that adoption by the foster parent is in the best interests of the child; or\n(3) the child is being adopted by a parent that previously adopted a sibling of the child, and it is determined by the child-placing agency that adoption by this parent is in the best interests of the child.\nFor an Indian child covered by the Indian Child Welfare Act, a waiver must not be granted unless the child-placing agency has complied with the placement preferences required by the Indian Child Welfare Act, United States Code, title 25, section 1915(a).\n(f) To meet the requirement of a documented search for an appropriate adoptive placement under paragraph (d), clause (1), the child-placing agency minimally must:\n(1) conduct a relative search as required by section 260C.221 and give consideration to placement with a relative, as required by section 260C.212, subdivision 2;\n(2) comply with the placement preferences required by the Indian Child Welfare Act when the Indian Child Welfare Act, United States Code, title 25, section 1915(a), applies;\n(3) locate prospective adoptive families by registering the child on the state adoption exchange, as required under section 259.75; and\n(4) if registration with the state adoption exchange does not result in the identification of an appropriate adoptive placement, the agency must employ additional recruitment methods prescribed by the commissioner.\n(g) Once the legally responsible agency has determined that placement with an identified parent is in the child's best interests and made full written disclosure about the child's social and medical history, the agency must ask the prospective adoptive parent if the prospective adoptive parent is willing to adopt the child without receiving adoption assistance under this section. If the identified parent is either unwilling or unable to adopt the child without adoption assistance, the legally responsible agency must provide documentation as prescribed by the commissioner to fulfill the requirement to make a reasonable effort to place the child without adoption assistance. If the identified parent is willing to adopt the child without adoption assistance, the parent must provide a written statement to this effect to the legally responsible agency and the statement must be maintained in the permanent adoption record of the legally responsible agency. For children under guardianship of the commissioner, the legally responsible agency shall submit a copy of this statement to the commissioner to be maintained in the permanent adoption record.\n(a) A child must be a citizen of the United States or otherwise eligible for federal public benefits according to the Personal Responsibility and Work Opportunity Reconciliation Act of 1996, as amended, in order to be eligible for the title IV-E adoption assistance program.\n(b) A child must be a citizen of the United States or meet the qualified alien requirements as defined in the Personal Responsibility and Work Opportunity Reconciliation Act of 1996, as amended, in order to be eligible for adoption assistance paid through funds other than title IV-E.\n(a) A background study must be completed on each prospective adoptive parent and all other adults residing in the home. A background study must meet the requirements of United States Code, title 42, section 671(a)(20). A study completed under section 245C.33 meets this requirement. If the prospective adoptive parent is a licensed child foster parent licensed under chapter 142B or by a Minnesota tribe, the background study previously completed for the purposes of child foster care licensure shall be used for the purpose of this section, provided that the background study meets all other requirements of this subdivision and the prospective adoptive parent is a licensed child foster parent at the time of the application for adoption assistance.\n(b) If the background study reveals:\n(1) a felony conviction at any time for:\n(i) child abuse or neglect;\n(ii) spousal abuse;\n(iii) a crime against a child, including child pornography; or\n(iv) a crime involving violence, including rape, sexual assault, or homicide, but not including other physical assault or battery; or\n(2) a felony conviction within the past five years for:\n(i) physical assault;\n(ii) battery; or\n(iii) a drug-related offense;\nthe adoptive parent is prohibited from receiving adoption assistance on behalf of an otherwise eligible child.\nThe commissioner must determine eligibility for:\n(1) a child under the guardianship of the commissioner who would otherwise remain in foster care;\n(2) a child who is not under the guardianship of the commissioner who meets title IV-E eligibility defined in section 473 of the Social Security Act and no state agency has legal responsibility for placement and care of the child;\n(3) a Minnesota child under tribal jurisdiction who would otherwise remain in foster care; and\n(4) an Indian child being placed in Minnesota who meets title IV-E eligibility defined in section 473 of the Social Security Act. The agency or entity assuming responsibility for the child is responsible for the nonfederal share of the adoption assistance payment.\nThe commissioner must not enter into an adoption assistance agreement with the following individuals:\n(1) a child's biological parent or stepparent;\n(2) a child's relative under section 260C.007, subdivision 26b or 27, with whom the child resided immediately prior to child welfare involvement unless:\n(i) the child was in the custody of a Minnesota county or tribal agency pursuant to an order under chapter 260C or equivalent provisions of tribal code and the agency had placement and care responsibility for permanency planning for the child; and\n(ii) the child is under guardianship of the commissioner of children, youth, and families according to the requirements of section 260C.325, subdivision 1 or 3, or is a ward of a Minnesota tribal court after termination of parental rights, suspension of parental rights, or a finding by the tribal court that the child cannot safely return to the care of the parent;\n(3) an individual adopting a child who is the subject of a direct adoptive placement under section 259.47 or the equivalent in tribal code;\n(4) a child's legal custodian or guardian who is now adopting the child, except for a relative custodian as defined in section 142A.602, subdivision 20, who is currently receiving Northstar kinship assistance benefits on behalf of the child; or\n(5) an individual who is adopting a child who is not a citizen or resident of the United States and was either adopted in another country or brought to the United States for the purposes of adoption.\n(a) The financially responsible agency shall prepare an adoption assistance eligibility determination for review and final approval by the commissioner. When there is no financially responsible agency, the adoption assistance eligibility determination must be completed by the agency designated by the commissioner. The eligibility determination must be completed according to requirements and procedures and on forms prescribed by the commissioner. The financially responsible agency and the commissioner shall make every effort to establish a child's eligibility for title IV-E adoption assistance. Documentation from a qualified expert for the eligibility determination must be provided to the commissioner to verify that a child meets the special needs criteria in subdivision 2. A child who is determined to be eligible for adoption assistance must have an adoption assistance agreement negotiated on the child's behalf according to section 142A.608.\n(b) Documentation from a qualified expert of a disability is limited to evidence deemed appropriate by the commissioner and must be submitted to the commissioner with the eligibility determination. Examples of appropriate documentation include, but are not limited to, medical records, psychological assessments, educational or early childhood evaluations, court findings, and social and medical history.\n(c) Documentation that the child is at risk of developing physical, mental, emotional, or behavioral disabilities must be submitted according to policies and procedures prescribed by the commissioner.\n(a) An adoption assistance agreement must terminate in any of the following circumstances:\n(1) the child has attained the age of 18, or up to age 21 when the child meets a condition for extension in subdivision 12;\n(2) the child has not attained the age of 18, but the commissioner determines the adoptive parent is no longer legally responsible for support of the child;\n(3) the commissioner determines the adoptive parent is no longer providing financial support to the child up to age 21;\n(4) the death of the child; or\n(5) the adoptive parent requests in writing the termination of the adoption assistance agreement.\n(b) An adoptive parent is considered no longer legally responsible for support of the child in any of the following circumstances:\n(1) parental rights to the child are legally terminated or a court accepted the parent's consent to adoption under chapter 260C;\n(2) permanent legal and physical custody or guardianship of the child is transferred to another individual;\n(3) death of the adoptive parent under subdivision 9;\n(4) the child enlists in the military;\n(5) the child gets married; or\n(6) the child is determined an emancipated minor through legal action.\nThe adoption assistance agreement ends upon death or termination of parental rights of both adoptive parents in the case of a two-parent adoption, or the sole adoptive parent in the case of a single-parent adoption. The child's adoption assistance eligibility may be continued according to subdivision 10.\n(a) The child maintains eligibility for title IV-E adoption assistance in a subsequent adoption if the following criteria are met:\n(1) the child is determined to be a child with special needs as outlined in subdivision 2; and\n(2) the subsequent adoptive parent resides in Minnesota.\n(b) If a child had a title IV-E adoption assistance agreement in effect prior to the death of the adoptive parent or dissolution of the adoption, and the subsequent adoptive parent resides outside of Minnesota, the commissioner is not responsible for determining whether the child meets the definition of special needs, entering into the adoption assistance agreement, and making any adoption assistance payments outlined in the new agreement unless a state agency in Minnesota has responsibility for placement and care of the child at the time of the subsequent adoption. If there is no state agency in Minnesota that has responsibility for placement and care of the child at the time of the subsequent adoption, the public child welfare agency in the subsequent adoptive parent's residence is responsible for determining whether the child meets the definition of special needs and entering into the adoption assistance agreement.\n(a) State-funded adoption assistance may be continued with the written consent of the commissioner to an individual who is a guardian appointed by a court for the child upon the death of both the adoptive parents in the case of a two-parent adoption, or the sole adoptive parent in the case of a single-parent adoption, unless the child is under the custody of a state agency.\n(b) Temporary assignment of adoption assistance may be approved by the commissioner for a maximum of six consecutive months from the death of the adoptive parent or parents under subdivision 9 and must adhere to the requirements and procedures prescribed by the commissioner. If, within six months, the child has not been adopted by a person agreed upon by the commissioner, or a court has not appointed a permanent legal guardian under section 260C.325, 524.5-313, or similar law of another jurisdiction, the adoption assistance must terminate.\n(c) Upon assignment of payments under this subdivision, assistance must be from funds other than title IV-E.\n(a) Under certain limited circumstances a child may qualify for extension of the adoption assistance agreement beyond the date the child attains age 18, up to the date the child attains the age of 21.\n(b) A request for extension of the adoption assistance agreement must be completed in writing and submitted, including all supporting documentation, by the adoptive parent to the commissioner at least 60 calendar days prior to the date that the current agreement will terminate.\n(c) A signed amendment to the current adoption assistance agreement must be fully executed between the adoptive parent and the commissioner at least ten business days prior to the termination of the current agreement. The request for extension and the fully executed amendment must be made according to the requirements and procedures prescribed by the commissioner, including documentation of eligibility, on forms prescribed by the commissioner.\n(d) If an agency is certifying a child for adoption assistance and the child will attain the age of 18 within 60 calendar days of submission, the request for extension must be completed in writing and submitted, including all supporting documentation, with the adoption assistance application.\n(e) A child who has attained the age of 16 prior to the finalization of the child's adoption is eligible for extension of the adoption assistance agreement up to the date the child attains age 21 if the child is:\n(1) dependent on the adoptive parent for care and financial support; and\n(2)(i) completing a secondary education program or a program leading to an equivalent credential;\n(ii) enrolled in an institution that provides postsecondary or vocational education;\n(iii) participating in a program or activity designed to promote or remove barriers to employment;\n(iv) employed for at least 80 hours per month; or\n(v) incapable of doing any of the activities described in items (i) to (iv) due to a medical condition where incapability is supported by documentation from an expert according to the requirements and procedures prescribed by the commissioner.\n(f) A child who has not attained the age of 16 prior to finalization of the child's adoption is eligible for extension of the adoption assistance agreement up to the date the child attains the age of 21 if the child is:\n(1) dependent on the adoptive parent for care and financial support; and\n(2)(i) enrolled in a secondary education program or a program leading to the equivalent; or\n(ii) possesses a physical or mental disability that impairs the capacity for independent living and warrants continuation of financial assistance as determined by the commissioner.\nEffective November 27, 2014, a child who meets the eligibility criteria for adoption assistance in subdivision 1 may have an adoption assistance agreement negotiated on the child's behalf according to section 142A.608, and the effective date of the agreement must be January 1, 2015, or the date of the court order finalizing the adoption, whichever is later. Except as provided under section 142A.609, subdivision 1, paragraph (c), the maximum rate schedule for the agreement must be determined according to section 142A.609 based on the age of the child on the date that the prospective adoptive parent or parents sign the agreement.\nThe commissioner may offer adoption assistance agreements under this chapter to a child with an adoption assistance agreement under chapter 259A executed on the child's behalf on or before November 26, 2014, according to the priorities outlined in section 142A.612, subdivision 7, paragraph (b). To facilitate transition into the Northstar Care for Children adoption assistance program, the commissioner has the authority to waive any Northstar Care for Children adoption assistance eligibility requirements for a child with an adoption assistance agreement under chapter 259A executed on the child's behalf on or before November 26, 2014. Agreements negotiated under this subdivision must be in accordance with the process in section 142A.612, subdivision 7. The maximum rate used in the negotiation process for an agreement under this subdivision must be as outlined in section 142A.612, subdivision 7.",
	"repealed": false
}