{
	"id": "270C.4451",
	"url": "https://www.revisor.mn.gov/statutes/cite/270C.4451",
	"title": "270C.4451 REFUND ANTICIPATION LOANS AND CHECKS; REQUIRED DISCLOSURES.",
	"text": "(a) All agreements to make, provide, or facilitate a refund anticipation loan or refund anticipation check must be in writing. No agreement may include a provision that directly or indirectly arranges for payment of or deduction from any portion of the refund anticipation loan or refund anticipation check for check cashing, credit insurance, attorney fees, or the collection of any debt owed to any party for any other good or service other than a debt owed to the facilitator for the repayment of a refund anticipation loan and tax preparation fees associated with the refund anticipation loan or refund anticipation check.\n(b) If a written agreement contains a mandatory arbitration clause, the tax preparer must provide a separate written notice to the client that:\n(1) arbitration is the exclusive means of dispute resolution for any dispute about the written agreement;\n(2) the client has the right to affirmatively opt out of the arbitration clause within 30 days of entering into an agreement; and\n(3) the client is not bound to arbitration if the claim or dispute involves a violation of this section or the client invokes the remedies provided in section 270C.445, subdivision 7.\nThe tax preparer must advise the client, both orally and in writing, of the process by which the client may exercise the right to opt out of the mandatory arbitration clause.\n(a) Before or at the same time a tax preparer offers to make or facilitate a refund anticipation loan to the client, the preparer must make the disclosures in subdivision 3. Before or at the same time a tax preparer offers or facilitates a refund anticipation check or refund transfer, the tax preparer must make the disclosures in subdivision 4.\n(b) The disclosures must be provided to a client in a written notice on a single sheet of paper, separate from any other document or writing.\n(c) All required statements must be in capital and small font type fonts, in a minimum of 14-point type, with at least a double space between each statement.\n(d) The notice must be signed and dated by the tax preparer and the client.\n(e) All required disclosures, notices, and statements must be provided in the client's primary language, if the tax preparer advertises in that language.\nThe disclosure required under subdivision 2 for a refund anticipation loan must contain:\n(1) a legend, centered at the top on the single sheet of paper, in bold, capital letters, and in 28-point type stating \"NOTICE\";\n(2) the following verbatim statements:\n(i) \"This is a loan. This is not your refund. The annual percentage rate (APR), based on the estimated payment period, is (fill in the estimated APR).\";\n(ii) \"Your refund will be used to repay the loan. As a result, the amount of your refund will be reduced by (fill in appropriate dollar amount) for fees, interest, and other charges.\";\n(iii) \"You have the right to cancel this transaction by returning the loan check or the amount of the loan in cash within one business day after you get the loan.\"; and\n(iv) \"You can get your refund in about two weeks if you file your return electronically and have the Internal Revenue Service send your refund to your own bank account.\"; and\n(3) if the client is subject to additional interest when a refund is delayed, the following verbatim statement must also be included in the notice: \"If you choose to take this loan and your refund is delayed, you may have to pay.\"\n(a) The disclosure required under subdivision 2 for a refund anticipation check must contain:\n(1) a legend, centered at the top on the single sheet of paper, in bold, capital letters, and in 28-point type stating \"NOTICE\";\n(2) the following verbatim statements:\n(i) \"You do not have to purchase a refund anticipation check (RAC) to get your tax refund.\";\n(ii) \"Generally the IRS can direct deposit your income tax refund to your personal bank account within 8 to 15 days after the IRS accepts your tax return for processing.\";\n(iii) \"If you choose to purchase a RAC, your tax return funds will generally be made available to you within 8 to 15 days.\";\n(iv) \"A RAC is not a loan.\";\n(v) \"The cost of the RAC is $ (fill in dollar amount).\";\n(vi) \"You can either pay for your RAC now or you can have it withheld from your refund.\"; and\n(vii) \"The cost of your tax return is not any more or any less if you purchase a RAC.\"\n(b) A tax preparer offering a refund anticipation check that uses a different product name, including but not limited to refund transfer, must substitute the product name for \"RAC\" in all the statements required under this subdivision.\n(a) A client may rescind a refund anticipation loan on or before the close of business on the next day of business following execution of the loan agreement or receipt of the proceeds of the loan by (1) providing written notification to the tax preparer of the rescission, and (2) either (i) returning the original check issued for the loan, or (ii) tendering the amount of the loan to the tax preparer.\n(b) The tax preparer may charge a fee for rescinding a refund anticipation loan only if an account has been established at a financial institution to electronically receive the refund and the financial institution has charged a fee to establish the account. The allowable fee the tax preparer may charge the client rescinding the refund anticipation loan may not exceed the fee charged to the tax preparer by the financial institution to establish the account.",
	"repealed": false
}