{
	"id": "144E.28",
	"url": "https://www.revisor.mn.gov/statutes/cite/144E.28",
	"title": "144E.28 CERTIFICATION OF EMT, AEMT, AND PARAMEDIC.",
	"text": "To be eligible for certification by the director as an EMT, AEMT, or paramedic, an individual shall:\n(1) successfully complete the United States Department of Transportation course, or its equivalent as approved by the director, specific to the EMT, AEMT, or paramedic classification;\n(2) pass the written and practical examinations approved by the director and administered by the director or their designee, specific to the EMT, AEMT, or paramedic classification; and\n(3) complete a director-approved application form.\nCertification expiration dates are as follows:\n(1) for initial certification granted between January 1 and June 30 of an even-numbered year, the expiration date is March 31 of the next even-numbered year;\n(2) for initial certification granted between July 1 and December 31 of an even-numbered year, the expiration date is March 31 of the second odd-numbered year;\n(3) for initial certification granted between January 1 and June 30 of an odd-numbered year, the expiration date is March 31 of the next odd-numbered year; and\n(4) for initial certification granted between July 1 and December 31 of an odd-numbered year, the expiration date is March 31 of the second even-numbered year.\nThe director may certify an individual who possesses a current National Registry of Emergency Medical Technicians certification from another jurisdiction if the individual submits a director-approved application form. The director certification classification shall be the same as the National Registry's classification. Certification shall be for the duration of the applicant's certification period in another jurisdiction, not to exceed two years.\nWhen the director finds that a person certified under this section has violated a provision or provisions of subdivision 5, it may do one or more of the following:\n(1) revoke the certification;\n(2) suspend the certification;\n(3) refuse to renew the certification;\n(4) impose limitations or conditions on the person's performance of regulated duties, including the imposition of retraining or rehabilitation requirements; the requirement to work under supervision; or the conditioning of continued practice on demonstration of knowledge or skills by appropriate examination or other review of skill and competence;\n(5) order the person to provide unremunerated professional service under supervision at a designated public hospital, clinic, or other health care institution; or\n(6) censure or reprimand the person.\n(a) The director may deny certification or take any action authorized in subdivision 4 against an individual who the director determines:\n(1) violates sections 144E.001 to 144E.33 or the rules adopted under those sections, or an order that the director issued or is otherwise authorized or empowered to enforce, or agreement for corrective action;\n(2) misrepresents or falsifies information on an application form for certification;\n(3) is convicted or pleads guilty or nolo contendere to any felony; any gross misdemeanor relating to assault, sexual misconduct, theft, or the illegal use of drugs or alcohol; or any misdemeanor relating to assault, sexual misconduct, theft, or the illegal use of drugs or alcohol;\n(4) is actually or potentially unable to provide emergency medical services with reasonable skill and safety to patients by reason of illness, use of alcohol, drugs, chemicals, or any other material, or as a result of any mental or physical condition;\n(5) engages in unethical conduct, including, but not limited to, conduct likely to deceive, defraud, or harm the public or demonstrating a willful or careless disregard for the health, welfare, or safety of the public;\n(6) maltreats or abandons a patient;\n(7) violates any state or federal controlled substance law;\n(8) engages in unprofessional conduct or any other conduct which has the potential for causing harm to the public, including any departure from or failure to conform to the minimum standards of acceptable and prevailing practice without actual injury having to be established;\n(9) provides emergency medical services under lapsed or nonrenewed credentials;\n(10) is subject to a denial, corrective, disciplinary, or other similar action in another jurisdiction or by another regulatory authority;\n(11) engages in conduct with a patient that is sexual or may reasonably be interpreted by the patient as sexual, or in any verbal behavior that is seductive or sexually demeaning to a patient;\n(12) makes a false statement or knowingly provides false information to the director or fails to cooperate with an investigation of the director as required by section 144E.30; or\n(13) fails to engage with the health professionals services program or diversion program required under section 144E.287 after being referred to the program, violates the terms of the program participation agreement, or leaves the program except upon fulfilling the terms for successful completion of the program as set forth in the participation agreement.\n(b) Before taking action under paragraph (a), the director shall give notice to an individual of the right to a contested case hearing under chapter 14. If an individual requests a contested case hearing within 30 days after receiving notice, the director shall initiate a contested case hearing according to chapter 14 and no disciplinary action shall be taken at that time.\n(c) The administrative law judge shall issue a report and recommendation within 30 days after closing the contested case hearing record. The director shall issue a final order within 30 days after receipt of the administrative law judge's report.\n(d) After six months from the director's decision to deny, revoke, place conditions on, or refuse renewal of an individual's certification for disciplinary action, the individual shall have the opportunity to apply to the director for reinstatement.\n(a) In addition to any other remedy provided by law, the director may temporarily suspend the certification of an individual after conducting a preliminary inquiry to determine whether the director believes that the individual has violated a statute or rule that the director is empowered to enforce and determining that the continued provision of service by the individual would create an imminent risk to public health or harm to others.\n(b) A temporary suspension order prohibiting an individual from providing emergency medical care shall give notice of the right to a preliminary hearing according to paragraph (d) and shall state the reasons for the entry of the temporary suspension order.\n(c) Service of a temporary suspension order is effective when the order is served on the individual personally or by certified mail, which is complete upon receipt, refusal, or return for nondelivery to the most recent address provided to the director for the individual.\n(d) At the time the director issues a temporary suspension order, the director shall schedule a hearing that shall begin within 60 days after issuance of the temporary suspension order or within 15 working days of the date of the director's receipt of a request for a hearing from the individual, whichever is sooner. The hearing shall be on the sole issue of whether there is a reasonable basis to continue, modify, or lift the temporary suspension. A hearing under this paragraph is not subject to chapter 14.\n(e) Evidence presented by the director or the individual may be in the form of an affidavit. The individual or individual's designee may appear for oral argument.\n(f) Within five working days of the hearing, the director shall issue its order and, if the suspension is continued, notify the individual of the right to a contested case hearing under chapter 14.\n(g) If an individual requests a contested case hearing within 30 days of receiving notice under paragraph (f), the director shall initiate a contested case hearing according to chapter 14. The administrative law judge shall issue a report and recommendation within 30 days after the closing of the contested case hearing record. The director shall issue a final order within 30 days after receipt of the administrative law judge's report.\n(a) Before the expiration date of certification, an applicant for renewal of certification as an EMT shall:\n(1) successfully complete a course in cardiopulmonary resuscitation that is approved by the director or the licensee's medical director;\n(2) take the United States Department of Transportation EMT refresher course and successfully pass the practical skills test portion of the course, or successfully complete 48 hours of continuing education in EMT programs that are consistent with the United States Department of Transportation National EMS Education Standards or its equivalent as approved by the director or as approved by the licensee's medical director and pass a practical skills test approved by the director and administered by an education program approved by the director. The cardiopulmonary resuscitation course and practical skills test may be included as part of the refresher course or continuing education renewal requirements; and\n(3) complete a director-approved application form.\n(b) Before the expiration date of certification, an applicant for renewal of certification as an AEMT or paramedic shall:\n(1) for an AEMT, successfully complete a course in cardiopulmonary resuscitation that is approved by the director or the licensee's medical director and for a paramedic, successfully complete a course in advanced cardiac life support that is approved by the director or the licensee's medical director;\n(2) successfully complete 48 hours of continuing education in emergency medical training programs, appropriate to the level of the applicant's AEMT or paramedic certification, that are consistent with the United States Department of Transportation National EMS Education Standards or its equivalent as approved by the director or as approved by the licensee's medical director. An applicant may take the United States Department of Transportation Emergency Medical Technician refresher course or its equivalent without the written or practical test as approved by the director, and as appropriate to the applicant's level of certification, as part of the 48 hours of continuing education. Each hour of the refresher course, the cardiopulmonary resuscitation course, and the advanced cardiac life-support course counts toward the 48-hour continuing education requirement; and\n(3) complete a director-approved application form.\n(c) Certification shall be renewed every two years.\n(d) If the applicant does not meet the renewal requirements under this subdivision, the applicant's certification expires.\n(a) Within four years of a certification expiration date, a person whose certification has expired under subdivision 7, paragraph (d), may have the certification reinstated upon submission of:\n(1) evidence to the director of training equivalent to the continuing education requirements of subdivision 7 or, for community paramedics, evidence to the director of training equivalent to the continuing education requirements of subdivision 9, paragraph (c); and\n(2) a director-approved application form.\n(b) If more than four years have passed since a certificate expiration date, an applicant must complete the initial certification process required under subdivision 1.\n(c) Beginning July 1, 2024, through December 31, 2025, and notwithstanding paragraph (b), a person whose certification as an EMT, AEMT, paramedic, or community paramedic expired more than four years ago but less than ten years ago may have the certification reinstated upon submission of:\n(1) evidence to the director of the training required under paragraph (a), clause (1). This training must have been completed within the 24 months prior to the date of the application for reinstatement;\n(2) a director-approved application form; and\n(3) a recommendation from an ambulance service medical director.\nThis paragraph expires December 31, 2025.\n(a) To be eligible for certification by the director as a community paramedic, an individual shall:\n(1) be currently certified as a paramedic and have two years of full-time service as a paramedic or its part-time equivalent;\n(2) successfully complete a community paramedic education program from a college or university that has been approved by the director or accredited by a director-approved national accreditation organization. The education program must include clinical experience that is provided under the supervision of an ambulance medical director, advanced practice registered nurse, physician assistant, or public health nurse operating under the direct authority of a local unit of government; and\n(3) complete a director-approved application form.\n(b) A community paramedic must practice in accordance with protocols and supervisory standards established by an ambulance service medical director in accordance with section 144E.265. A community paramedic may provide services as directed by a patient care plan if the plan has been developed by the patient's primary physician or by an advanced practice registered nurse or a physician assistant, in conjunction with the ambulance service medical director and relevant local health care providers. The care plan must ensure that the services provided by the community paramedic are consistent with the services offered by the patient's health care home, if one exists, that the patient receives the necessary services, and that there is no duplication of services to the patient.\n(c) A community paramedic is subject to all certification, disciplinary, complaint, renewal, and other regulatory requirements that apply to paramedics under this chapter. In addition to the renewal requirements in subdivision 7, a community paramedic must complete an additional 12 hours of continuing education in clinical topics approved by the ambulance service medical director.",
	"repealed": false
}