{
	"id": "260E.20",
	"url": "https://www.revisor.mn.gov/statutes/cite/260E.20",
	"title": "260E.20 AGENCY DUTIES REGARDING INVESTIGATION AND ASSESSMENT.",
	"text": "(a) The local welfare agency shall offer services to prevent future maltreatment, safeguarding and enhancing the welfare of the maltreated child, and supporting and preserving family life whenever possible.\n(b) If the report alleges a violation of a criminal statute involving maltreatment or child endangerment under section 609.378, the local law enforcement agency and local welfare agency shall coordinate the planning and execution of their respective investigation and assessment efforts to avoid a duplication of fact-finding efforts and multiple interviews. Each agency shall prepare a separate report of the results of the agency's investigation or assessment.\n(c) In cases of alleged child maltreatment resulting in death, the local agency may rely on the fact-finding efforts of a law enforcement investigation to make a determination of whether or not maltreatment occurred.\n(d) When necessary, the local welfare agency shall seek authority to remove the child from the custody of a parent, guardian, or adult with whom the child is living.\n(e) In performing any of these duties, the local welfare agency shall maintain an appropriate record.\n(f) In conducting a family assessment or investigation, the local welfare agency shall gather information on the existence of substance abuse and domestic violence.\n(g) If the family assessment or investigation indicates there is a potential for abuse of alcohol or other drugs by the parent, guardian, or person responsible for the child's care, the local welfare agency must coordinate a comprehensive assessment pursuant to section 245G.05.\n(h) The agency may use either a family assessment or investigation to determine whether the child is safe when responding to a report resulting from birth match data under section 260E.03, subdivision 23, paragraph (c). If the child subject of birth match data is determined to be safe, the agency shall consult with the county attorney to determine the appropriateness of filing a petition alleging the child is in need of protection or services under section 260C.007, subdivision 6, clause (16), in order to deliver needed services. If the child is determined not to be safe, the agency and the county attorney shall take appropriate action as required under section 260C.503, subdivision 2.\n(a) Upon receipt of a screened in report, the local welfare agency shall have face-to-face contact with the child reported to be maltreated and with the child's primary caregiver sufficient to complete a safety assessment and ensure the immediate safety of the child. When it is possible and the report alleges substantial child endangerment or sexual abuse, the local welfare agency is not required to provide notice before conducting the initial face-to-face contact with the child and the child's primary caregiver.\n(b) Except in a noncaregiver human trafficking assessment, the local welfare agency shall have face-to-face contact with the child and primary caregiver immediately after the agency screens in a report if sexual abuse or substantial child endangerment is alleged and within five calendar days of a screened in report for all other reports. If the alleged offender was not already interviewed as the primary caregiver, the local welfare agency shall also conduct a face-to-face interview with the alleged offender in the early stages of the assessment or investigation, except in a noncaregiver human trafficking assessment. Face-to-face contact with the child and primary caregiver in response to a report alleging sexual abuse or substantial child endangerment may be postponed for no more than five calendar days if the child is residing in a location that is confirmed to restrict contact with the alleged offender as established in guidelines issued by the commissioner, or if the local welfare agency is pursuing a court order for the child's caregiver to produce the child for questioning under section 260E.22, subdivision 5.\n(c) At the initial contact with the alleged offender, the local welfare agency or the agency responsible for assessing or investigating the report must inform the alleged offender of the complaints or allegations made against the individual in a manner consistent with laws protecting the rights of the person who made the report. The interview with the alleged offender may be postponed if it would jeopardize an active law enforcement investigation. In a noncaregiver human trafficking assessment, the local child welfare agency is not required to inform or interview the alleged offender.\n(d) The local welfare agency or the agency responsible for assessing or investigating the report must provide the alleged offender with an opportunity to make a statement, except in a noncaregiver human trafficking assessment. The alleged offender may submit supporting documentation relevant to the assessment or investigation.\n[See Note.]\n(a) The local welfare agency responsible for conducting a family assessment or investigation shall collect available and relevant information to determine child safety, risk of subsequent maltreatment, and family strengths and needs and share not public information with an Indian's Tribal social services agency without violating any law of the state that may otherwise impose a duty of confidentiality on the local welfare agency in order to implement the Tribal state agreement.\n(b) The local welfare agency or the agency responsible for investigating the report shall collect available and relevant information to ascertain whether maltreatment occurred and whether protective services are needed.\n(c) Information collected includes, when relevant, information regarding the person reporting the alleged maltreatment, including the nature of the reporter's relationship to the child and to the alleged offender, and the basis of the reporter's knowledge for the report; the child allegedly being maltreated; the alleged offender; the child's caretaker; and other collateral sources having relevant information related to the alleged maltreatment.\n(d) Information relevant to the assessment or investigation must be requested, and may include:\n(1) the child's sex and age; prior reports of maltreatment, including any maltreatment reports that were screened out and not accepted for assessment or investigation; information relating to developmental functioning; credibility of the child's statement; and whether the information provided under this clause is consistent with other information collected during the course of the assessment or investigation;\n(2) the alleged offender's age, a record check for prior reports of maltreatment, and criminal charges and convictions;\n(3) collateral source information regarding the alleged maltreatment and care of the child. Collateral information includes, when relevant: (i) a medical examination of the child; (ii) prior medical records relating to the alleged maltreatment or the care of the child maintained by any facility, clinic, or health care professional and an interview with the treating professionals; and (iii) interviews with the child's caretakers, including the child's parent, guardian, foster parent, child care provider, teachers, counselors, family members, relatives, and other persons who may have knowledge regarding the alleged maltreatment and the care of the child; and\n(4) information on the existence of domestic abuse and violence in the home of the child, and substance abuse.\n(e) Nothing in this subdivision precludes the local welfare agency, the local law enforcement agency, or the agency responsible for assessing or investigating the report from collecting other relevant information necessary to conduct the assessment or investigation.\n(f) Notwithstanding section 13.384 or 144.291 to 144.298, the local welfare agency has access to medical data and records for purposes of paragraph (d), clause (3).\nIf the report alleges medical neglect as defined in section 260C.007, subdivision 6, clause (5), the local welfare agency shall, in addition to its other duties under this section, immediately consult with designated hospital staff and with the parents of the infant to verify that appropriate nutrition, hydration, and medication are being provided; and shall immediately secure an independent medical review of the infant's medical charts and records and, if necessary, seek a court order for an independent medical examination of the infant.\nIf the report alleges maltreatment by a person who is not a parent, guardian, sibling, person responsible for the child's care functioning within the family unit, or a person who lives in the child's household and who has a significant relationship to the child, in a setting other than a facility as defined in section 260E.03, the local welfare agency may rely on the fact-finding efforts of the law enforcement investigation to determine if threatened injury or other maltreatment has occurred under section 260E.03, subdivision 12, if an alleged offender has minor children or lives with minors.",
	"repealed": false
}