{
	"id": "609.485",
	"url": "https://www.revisor.mn.gov/statutes/cite/609.485",
	"title": "609.485 ESCAPE FROM CUSTODY.",
	"text": "\"Escape\" includes departure without lawful authority and failure to return to custody following temporary leave granted for a specific purpose or limited period.\nWhoever does any of the following may be sentenced as provided in subdivision 4:\n(1) escapes while held pursuant to a lawful arrest, in lawful custody on a charge or conviction of a crime, or while held in lawful custody on an allegation or adjudication of a delinquent act;\n(2) transfers to another, who is in lawful custody on a charge or conviction of a crime, or introduces into an institution in which the latter is confined, anything usable in making such escape, with intent that it shall be so used;\n(3) having another in lawful custody on a charge or conviction of a crime, intentionally permits the other to escape;\n(4) escapes while in a facility designated under section 253B.18, subdivision 1, pursuant to a court commitment order after a finding of not guilty by reason of mental illness or mental deficiency of a crime against the person, as defined in section 253B.02, subdivision 4e. Notwithstanding section 609.17, no person may be charged with or convicted of an attempt to commit a violation of this clause;\n(5) escapes while in or under the supervision of a facility designated under section 246B.01, subdivision 2a; 246C.13; 253B.18, subdivision 1; 253D.07, subdivision 3; or Minnesota Statutes 1992, section 526.10;\n(6) escapes while on pass status or provisional discharge according to section 253B.18 or chapter 253D; or\n(7) escapes while a civilly committed sex offender in the Minnesota Sex Offender Program as defined in section 246B.01, subdivision 1a, or subject to a court hold order under chapter 253D.\nFor purposes of clauses (1) and (7), \"escapes while held in lawful custody\" or \"escapes while a civilly committed sex offender in the Minnesota Sex Offender Program\" includes absconding from electronic monitoring or removing an electronic monitoring device from the person's body.\nThis section does not apply to a person who is free on bail or who is on parole or probation, or subject to a stayed sentence or stayed execution of sentence, unless the person (1) has been taken into actual custody upon revocation of the parole, probation, or stay of the sentence or execution of sentence, (2) is in custody in a county jail or workhouse as a condition of a stayed sentence, or (3) is subject to electronic monitoring as a condition of parole, probation, or supervised release.\nA felony charge brought under subdivision 2, clause (4) shall be dismissed if the person charged voluntarily returns to the facility within 30 days after a reasonable effort has been made to provide written notice to the person that failure to return within 30 days may result in felony charges being filed.\n(a) Except as otherwise provided in subdivision 3a, whoever violates this section may be sentenced as follows:\n(1) if the person who escapes is in lawful custody for a felony, to imprisonment for not more than five years or to payment of a fine of not more than $10,000, or both;\n(2) if the person who escapes is in lawful custody after a finding of not guilty by reason of mental illness or mental deficiency of a crime against the person, as defined in section 253B.02, subdivision 4e, to imprisonment for not more than one year and one day or to payment of a fine of not more than $3,000, or both;\n(3) if the person who escapes is in lawful custody for a gross misdemeanor or misdemeanor, or if the person who escapes is in lawful custody on an allegation or adjudication of a delinquent act, to imprisonment for not more than 364 days or to payment of a fine of not more than $3,000, or both;\n(4) if the person who escapes is under civil commitment under section 253B.18, to imprisonment for not more than one year and one day or to payment of a fine of not more than $3,000, or both; or\n(5) if the person who escapes is under a court hold, civil commitment, or supervision under chapter 253D, Minnesota Statutes 2012, section 253B.185, or Minnesota Statutes 1992, section 526.10, to imprisonment for not more than five years or to payment of a fine of not more than $10,000, or both.\n(b) If the escape was a violation of subdivision 2, clause (1), (2), or (3), and was effected by violence or threat of violence against a person, the sentence may be increased to not more than twice those permitted in paragraph (a), clauses (1) and (3).\n(c) Unless a concurrent term is specified by the court, a sentence under this section shall be consecutive to any sentence previously imposed or which may be imposed for any crime or offense for which the person was in custody when the person escaped.\n(d) Notwithstanding paragraph (c), if a person who was committed to the commissioner of corrections under section 260B.198 escapes from the custody of the commissioner while 18 years of age, the person's sentence under this section shall commence on the person's 19th birthday or on the person's date of discharge by the commissioner of corrections, whichever occurs first. However, if the person described in this clause is convicted under this section after becoming 19 years old and after having been discharged by the commissioner, the person's sentence shall commence upon imposition by the sentencing court.\n(e) Notwithstanding paragraph (c), if a person who is in lawful custody on an allegation or adjudication of a delinquent act while 18 years of age escapes from a local juvenile correctional facility, the person's sentence under this section begins on the person's 19th birthday or on the person's date of discharge from the jurisdiction of the juvenile court, whichever occurs first. However, if the person described in this paragraph is convicted after becoming 19 years old and after discharge from the jurisdiction of the juvenile court, the person's sentence begins upon imposition by the sentencing court.\n(f) Notwithstanding paragraph (a), any person who escapes or absconds from electronic monitoring or removes an electric monitoring device from the person's body is guilty of a crime and shall be sentenced to imprisonment for not more than 364 days or to a payment of a fine of not more than $3,000, or both. A person in lawful custody for a violation of section 609.185, 609.19, 609.195, 609.20, 609.205, 609.2112, 609.2113, 609.2114, 609.221, 609.222, 609.223, 609.2231, 609.342, 609.343, 609.344, 609.345, 609.3451, or civil commitment under chapter 253D, or Minnesota Statutes 2012, section 609.21, and who escapes or absconds from electronic monitoring or removes an electronic monitoring device while under sentence may be sentenced to imprisonment for not more than five years or to a payment of a fine of not more than $10,000, or both.",
	"repealed": false
}