{
	"id": "62L.04",
	"url": "https://www.revisor.mn.gov/statutes/cite/62L.04",
	"title": "62L.04 COMPLIANCE REQUIREMENTS.",
	"text": "(a) Beginning July 1, 1993, health carriers participating in the small employer market must offer and make available on a guaranteed issue basis any health benefit plan that they offer, including both of the small employer plans provided in section 62L.05, to all small employers that satisfy the small employer participation and contribution requirements specified in this chapter. Compliance with these requirements is required as of the first renewal date of any small employer group occurring after July 1, 1993. For new small employer business, compliance is required as of the first date of offering occurring after July 1, 1993.\n(b) Compliance with these requirements is required as of the first renewal date occurring after July 1, 1994, with respect to employees of a small employer who had been issued individual coverage prior to July 1, 1993, administered by the health carrier on a group basis. Notwithstanding any other law to the contrary, the health carrier shall offer to terminate any individual coverage for employees of small employers who satisfy the small employer participation and contribution requirements specified in section 62L.03 and offer to replace it with a health benefit plan. If the employer elects not to purchase a health benefit plan, the health carrier must offer all covered employees and dependents the option of maintaining their current coverage, administered on an individual basis, or replacement individual coverage. Small employer and replacement individual coverage provided under this subdivision must be without application of underwriting restrictions, provided continuous coverage is maintained.\n(c) With respect to small employers having no fewer than 30 nor more than 49 current employees, all dates in this subdivision become July 1, 1995, and any reference to \"after\" a date becomes \"on or after\" July 1, 1995.\nA health carrier entering the small employer market after July 1, 1993, shall begin complying with the requirements of this chapter as of the first date of offering of a health benefit plan to a small employer. A health carrier entering the small employer market after July 1, 1993, is considered to be a member of the health coverage reinsurance association as of the date of the health carrier's initial offer of a health benefit plan to a small employer.",
	"repealed": false
}