{
	"id": "103C.101",
	"url": "https://www.revisor.mn.gov/statutes/cite/103C.101",
	"title": "103C.101 DEFINITIONS.",
	"text": "The definitions in this section apply to this chapter.\n\"Appropriate agencies\" means local, state, or federal agencies that possess expertise, involvement, or authority concerning the use and development of land and water resources, but does not include districts or the state board.\n\"District\" means a soil and water conservation district.\n\"District board\" means the board of supervisors of a soil and water conservation district.\n\"Due notice\" means notice published at least twice, with an interval of at least seven days between the two publication dates, in a legal newspaper, and by posting at three conspicuous places within an appropriate area. Posting must include, if possible, posting at public places where it is customary to post notices concerning county or municipal affairs. A hearing held pursuant to a notice at the time and place designated in the notice may be adjourned, from time to time, without renewing the notice for the adjourned dates.\n\"Federal\" means the United States, the Natural Resources Conservation Service of the United States Department of Agriculture, and agencies or instrumentalities, corporate or otherwise, of the United States.\n\"Government\" means the state or the United States, or an agency or instrumentality of the state or the United States.\n\"Land occupier\" means a person, corporation, or legal entity that holds title to or is in possession of land within a district as an owner, lessee, tenant, or otherwise.\n\"Nominating petition\" means a petition filed under section 103C.305, subdivision 2, to nominate candidates for the office of supervisor.\n\"Resident owner\" has the meaning given in section 103D.011, subdivision 25.\n\"Soil and water conservation district\" means a governmental subdivision organized under this chapter.\n\"Soil health\" means the continued capacity of soil to function as a vital living system that sustains plants, animals, and humans. Indicators of soil health include water infiltration capacity; organic matter content; water holding capacity; biological capacity to break down plant residue and other substances and to maintain soil aggregation; nutrient sequestration and cycling capacity; carbon sequestration; and soil resistance.\n\"State agency\" means a political subdivision, agency, or instrumentality, corporate or otherwise, of the state.\n\"State board\" means the Board of Water and Soil Resources.\n\"Supervisor\" means a member of a district board.\n\"Watershed project\" means a project that is approved and authorized to be carried out by the district in a watershed area in accordance with a watershed work plan.\n\"Watershed work plan\" means a plan for constructing works of improvement in a watershed area, including structural and land treatment measures for flood prevention or the conservation, development, utilization, and disposal of water that is developed by the district, with or without federal assistance.",
	"repealed": false
}