{
	"id": "60M.03",
	"url": "https://www.revisor.mn.gov/statutes/cite/60M.03",
	"title": "60M.03 COLLATERAL.",
	"text": "When collateral is accepted, the producer, surety, or bail bond agency must provide a written and numbered receipt to the depositor. The receipt must:\n(1) contain the date; depositor's name and address; bail bond agency's name and address; surety's name and address; defendant's name; bond amount; and cash amount or a detailed description of the collateral, if the collateral is not cash; and\n(2) be signed by:\n(i) the producer, surety, or bail bond agency; and\n(ii) the depositor.\n(a) Except as otherwise provided under paragraph (b), a producer or bail bond agency must transfer all cash and noncash collateral that the producer or bail bond agency receives to the surety.\n(b) A surety may, at the surety's discretion, permit: (1) a producer to transfer all cash and noncash collateral that the producer receives to the bail bond agency; and (2) the bail bond agency to retain possession and control over the cash and noncash collateral without transferring the cash and noncash collateral to the surety. If a surety exercises the surety's discretion under this paragraph, the bail bond agency assumes the surety's responsibilities and responsibilities under this section. A producer is prohibited from retaining possession or control of cash or noncash collateral beyond the time periods established in this section.\n(a) All cash collateral must be deposited into a cash collateral account maintained by a surety or bail bond agency as provided in subdivision 2, paragraph (b), within seven business days of the date the cash collateral is received.\n(b) All checks, money orders, wire transfers, or similar money transfer for collateral must be made payable to the bail bond agency and deposited into the surety's or bail bond agency's collateral account within ten business days of the date the payment was received.\n(c) When required by law, a bail bond agency or producer must: (1) file an IRS Form 8300 and informational notice; and (2) retain a copy of the filed IRS Form 8300 and informational notice in the bail bond agency's or producer's files.\nAt the surety's discretion, the surety or a bail bond agency may maintain a separate cash collateral trust account. A cash collateral trust account may be an interest-bearing account or a noninterest-bearing account. If the separate cash collateral trust account is an interest-bearing account, the interest earned is for the benefit of the depositor.\nThe surety is liable to return any cash or noncash collateral that a producer or bail bond agency collects, less any amounts owed under subdivision 9, paragraph (b), even if the collected collateral is not transferred to the surety.\n(a) A surety, bail bond agency, or producer is prohibited from collecting cash collateral in excess of the bond's penal sum.\n(b) A surety, bail bond agency, or producer is prohibited from using collateral for personal benefit or gain.\n(c) A surety, bail bond agency, or producer is prohibited from taking a quitclaim deed on real property as collateral for a bond.\n(a) A bail bond agency or producer must maintain a collateral log that includes:\n(1) the power of attorney number;\n(2) the principal's name;\n(3) the depositor's name;\n(4) the cash collateral amount, including whether the cash collateral is being held in an interest-bearing account;\n(5) if the collateral is noncash collateral, a detailed description of the collateral;\n(6) the date the collateral was taken; and\n(7) the dates the collateral was sent to the surety, returned to the depositor, liquidated, or applied to a loss or cost incurred by the producer, bail bond agency, or surety.\n(b) For purposes of paragraph (a), an indemnity agreement does not constitute collateral and is not required to be included in the collateral log. For purposes of paragraph (a), clause (7), the amount of a loss incurred must be listed separately from other costs in the collateral log.\n(a) A mortgage or deed of trust taken as collateral for a bond must name the surety as a mortgagee. At the discretion of the surety, a bail bond agency may be named as the mortgagee in lieu of the surety being named as the mortgagee.\n(b) A producer is prohibited from being named as a mortgagee for a mortgage or deed of trust taken as collateral for a bond.\n(a) A surety or bail bond agency that controls the collateral must return cash and noncash collateral to the depositor named in the collateral receipt within 21 days of the date the depositor provides the surety or bail bond agency with written proof that the bond has been discharged.\n(b) If the depositor owes the surety, bail bond agency, or producer a premium; is liable for a loss or expense related to a breach of the bond; or is liable pursuant to the terms of an indemnity or other agreement, the surety or bail bond agency may retain from the collateral all money required to satisfy the depositor's debts.\n(c) If all of the depositor's debts secured by collateral are satisfied, the surety or bail bond agency must provide documentation to release any liens, security interests, mortgages, or other security interests that were filed or obtained in relation to the collateral. The documentation must be provided within 21 days of the date the depositor provides the surety or bail bond agency with written proof that the bond has been discharged.\nIf a bond or indemnity agreement is breached and the surety, bail bond agency, or producer suffers a loss, the surety or bail bond agency that controls the collateral must send to the depositor written notice that notifies the depositor that the surety or bail bond agency intends to liquidate noncash collateral. The written notice must be sent by certified mail to the depositor's last known address at least 30 days before the date the surety or bail bond agency liquidates the noncash collateral.\nAny action taken to enforce or foreclose on cash or noncash collateral must comply with Minnesota law.\n(a) All collateral and related documentation held in trust by the surety or bail bond agency must be made available for immediate audit and inspection by the department.\n(b) All collateral and related documentation held in trust by the bail bond agency must be made available for immediate audit and inspection by the surety.",
	"repealed": false
}