{
	"id": "179A.20",
	"url": "https://www.revisor.mn.gov/statutes/cite/179A.20",
	"title": "179A.20 CONTRACTS.",
	"text": "The exclusive representative and the employer shall execute a written contract or memorandum of contract containing the terms of the negotiated agreement or interest arbitration decision and any terms established by law.\nNo provision of a contract shall be in conflict with:\n(1) the laws of Minnesota; or\n(2) rules promulgated under law, or municipal charters, ordinances, or resolutions, provided that the rules, charters, ordinances, and resolutions are consistent with this chapter.\nA contract may not obligate an employer to fund all or part of the cost of health care benefits for a former employee beyond the duration of the contract, subject to section 179A.20, subdivision 6. A personnel policy may not obligate an employer to fund all or part of health care benefits for a former employee beyond the duration of the policy. A policy may not extend beyond the termination of the contract of longest duration covering other employees of the employer or, if none, the termination of the budgetary cycle during which the policy is adopted.\nThe duration of the contract is negotiable but shall not exceed three years. Any contract between a school board and an exclusive representative of teachers shall be for a term of two years, beginning on July 1 of each odd-numbered year. A contract between a school board and an exclusive representative of teachers shall contain the teachers' compensation including fringe benefits for the entire two-year term and shall not contain a wage reopening clause or any other provision for the renegotiation of the teachers' compensation.\n(a) All contracts must include a grievance procedure providing for compulsory binding arbitration of grievances including all written disciplinary actions. If the parties cannot agree on the grievance procedure, they are subject to the grievance procedure adopted by the commissioner under section 179A.04, subdivision 3, paragraph (a), clause (8).\n(b) Notwithstanding any home rule charter to the contrary, after the probationary period of employment, any disciplinary action is subject to the grievance procedure and compulsory binding arbitration.\n(c) Employees covered by civil service systems created under chapter 43A, 44, 375, 387, 419, or 420, by a home rule charter under chapter 410, or by Laws 1941, chapter 423, may pursue a grievance through the procedure established under this section. When the grievance is also within the jurisdiction of appeals boards or appeals procedures created by chapter 43A, 44, 375, 387, 419, or 420, by a home rule charter under chapter 410, or by Laws 1941, chapter 423, the employee may proceed through the grievance procedure or the civil service appeals procedure, but once a written grievance or appeal has been properly filed or submitted by the employee or on the employee's behalf with the employee's consent the employee may not proceed in the alternative manner.\n(d) A teacher who elects a hearing before an arbitrator under section 122A.40, subdivision 15, or 122A.41, subdivision 13, or who elects or acquiesces to a hearing before the school board may not later proceed in the alternative manner nor challenge the termination or discharge through a grievance procedure required by this subdivision.\n(e) This section does not require employers or employee organizations to negotiate on matters other than terms and conditions of employment.\nUpon execution of the contract, the employer shall implement it in the form of an ordinance or resolution. If implementation of the contract requires adoption of a law, ordinance, or charter amendment, the employer shall make every reasonable effort to propose and secure the enactment of this law, ordinance, resolution, or charter amendment.\nDuring the period after contract expiration and prior to the date when the right to strike matures, and for additional time if the parties agree, the terms of an existing contract shall continue in effect and shall be enforceable upon both parties.",
	"repealed": false
}