{
	"id": "58B.02",
	"url": "https://www.revisor.mn.gov/statutes/cite/58B.02",
	"title": "58B.02 DEFINITIONS.",
	"text": "For purposes of this chapter, the following terms have the meanings given them.\n\"Borrower\" means a resident of this state who has received or agreed to pay a student loan or a person who shares responsibility with a resident for repaying a student loan.\n\"Commissioner\" means the commissioner of commerce.\n\"Financial institution\" means any of the following organized under the laws of this state, any other state, or the United States: a bank, bank and trust, trust company with banking powers, savings bank, savings association, or credit union.\n\"Nationwide Multistate Licensing System and Registry\" has the meaning given in section 58A.02, subdivision 8.\n\"Person in control\" means any member of senior management, including owners or officers, and other persons who directly or indirectly possess the power to direct or cause the direction of the management policies of an applicant or student loan servicer under this chapter, regardless of whether the person has any ownership interest in the applicant or student loan servicer. Control is presumed to exist if a person directly or indirectly owns, controls, or holds with power to vote ten percent or more of the voting stock of an applicant or student loan servicer or of a person who owns, controls, or holds with power to vote ten percent or more of the voting stock of an applicant or student loan servicer.\n\"Servicing\" means:\n(1) receiving any scheduled periodic payments from a borrower or notification of payments, and applying payments to the borrower's account pursuant to the terms of the student loan or of the contract governing servicing;\n(2) during a period when no payment is required on a student loan, maintaining account records for the loan and communicating with the borrower regarding the loan, on behalf of the loan's holder; and\n(3) interacting with a borrower, including activities to help prevent default on obligations arising from student loans, conducted to facilitate the requirements in clauses (1) and (2).\n\"Student loan\" means a government, commercial, or foundation extension of credit for actual costs paid for tuition and reasonable education and living expenses.\n\"Lender\" means an entity engaged in the business of securing, making, or extending student loans. Lender does not include, to the extent that state regulation is preempted by federal law:\n(1) a bank, savings banks, savings and loan association, or credit union;\n(2) a wholly owned subsidiary of a bank or credit union;\n(3) an operating subsidiary where each owner is wholly owned by the same bank or credit union;\n(4) the United States government, through Title IV of the Higher Education Act of 1965, as amended, and administered by the United States Department of Education;\n(5) an agency, instrumentality, or political subdivision of Minnesota;\n(6) a regulated lender organized under chapter 56, except that a regulated lender must file the annual report required for lenders under section 58B.03, subdivision 11; or\n(7) a person who is not in the business of making student loans and who makes no more than three student loans, with the person's own funds, during any 12-month period.\n\"Student loan servicer\" means any person, wherever located, responsible for the servicing of any student loan to any borrower, including a nonbank covered person, as defined in Code of Federal Regulations, title 12, section 1090.101, who is responsible for the servicing of any student loan to any borrower.",
	"repealed": false
}