{
	"id": "116J.682",
	"url": "https://www.revisor.mn.gov/statutes/cite/116J.682",
	"title": "116J.682 SMALL BUSINESS ASSISTANCE PARTNERSHIPS PROGRAM.",
	"text": "(a) For the purposes of this section, the terms in this subdivision have the meanings given.\n(b) \"Commissioner\" means the commissioner of employment and economic development.\n(c) \"Partner organizations\" or \"partners\" means:\n(1) nonprofit organizations or public entities, including higher education institutions, engaged in business development or economic development;\n(2) community development financial institutions;\n(3) community development corporations; and\n(4) Tribal economic development entities.\n(d) \"Small business\" has the meaning given in section 3 of the Small Business Act, United States Code, title 15, section 632.\n(e) \"Underserved populations and geographies\" means individuals who are Black, Indigenous, people of color, veterans, people with disabilities, people who are LGBTQ+, and low-income individuals and includes people from rural Minnesota.\nThe commissioner shall establish the small business assistance partnerships program to make grants to local and regional community-based organizations to provide small business development and technical assistance services to entrepreneurs and small business owners.\n(a) The commissioner shall make small business assistance partnerships grants to local and regional community-based organizations to provide small business development and technical assistance services to entrepreneurs and small business owners. The commissioner must prioritize applications that provide services to underserved populations and geographies.\n(b) Grantees shall use the grant funds to provide high-quality, free professional business development and technical assistance services that support the start-up, growth, and success of Minnesota's entrepreneurs and small business owners.\n(c) Grantees may use up to 15 percent of grant funds for expenses incurred while administering the grant, including but not limited to expenses related to technology, utilities, legal services, training, accounting, insurance, financial management, benefits, reporting, servicing of loans, and audits.\nBy January 31 of each year, partner organizations participating in the program must provide a report to the commissioner on the outcomes of the program, including but not limited to the number of entrepreneurs and small businesses served, number of hours of business assistance services provided, number of new businesses started, number of full-time equivalent jobs created and retained, and demographic and geographic details of the individuals being served.",
	"repealed": false
}