{
	"id": "152.27",
	"url": "https://www.revisor.mn.gov/statutes/cite/152.27",
	"title": "152.27 PATIENT REGISTRY PROGRAM ESTABLISHED.",
	"text": "The office shall establish a patient registry program to evaluate data on patient demographics, effective treatment options, clinical outcomes, and quality-of-life outcomes for the purpose of reporting on the benefits, risks, and outcomes regarding patients with a qualifying medical condition engaged in the therapeutic use of medical cannabis.\n(a) The office shall:\n(1) give notice of the program to health care practitioners in the state who are eligible to serve as health care practitioners and explain the purposes and requirements of the program;\n(2) allow each health care practitioner who meets or agrees to meet the program's requirements and who requests to participate, to be included in the registry program to collect data for the patient registry;\n(3) provide explanatory information and assistance to each health care practitioner in understanding the nature of therapeutic use of medical cannabis within program requirements;\n(4) create and provide a certification to be used by a health care practitioner for the practitioner to certify whether a patient has been diagnosed with a qualifying medical condition;\n(5) supervise the participation of the health care practitioner in conducting patient treatment and health records reporting in a manner that ensures stringent security and record-keeping requirements and that prevents the unauthorized release of private data on individuals as defined by section 13.02;\n(6) develop safety criteria for patients with a qualifying medical condition as a requirement of the patient's participation in the program, to prevent the patient from undertaking any task under the influence of medical cannabis that would constitute negligence or professional malpractice on the part of the patient; and\n(7) conduct research and studies based on data from health records submitted to the registry program and submit reports on intermediate or final research results to the legislature and major scientific journals. The office may contract with a third party to complete the requirements of this clause. Any reports submitted must comply with section 152.28, subdivision 2.\n(b) The office may add a delivery method under section 152.22, subdivision 6, upon a petition from a member of the public or the Cannabis Advisory Council under section 342.03 or as directed by law. If the office wishes to add a delivery method under section 152.22, subdivision 6, the office must notify the chairs and ranking minority members of the legislative policy committees having jurisdiction over health and public safety of the addition and the reasons for its addition, including any written comments received by the office from the public and any guidance received from the Cannabis Advisory Council under section 342.03, by January 15 of the year in which the office wishes to make the change. The change shall be effective on August 1 of that year, unless the legislature by law provides otherwise.\n(a) The office shall develop a patient application for enrollment into the registry program. The application shall be available to the patient and given to health care practitioners in the state who are eligible to serve as health care practitioners. The application must include:\n(1) the name, mailing address, and date of birth of the patient;\n(2) the name, mailing address, and telephone number of the patient's health care practitioner;\n(3) the name, mailing address, and date of birth of the patient's designated caregiver, if any, or the patient's parent, legal guardian, or spouse if the parent, legal guardian, or spouse will be acting as a caregiver;\n(4) a copy of the certification from the patient's health care practitioner that is dated within 90 days prior to submitting the application that certifies that the patient has been diagnosed with a qualifying medical condition; and\n(5) all other signed affidavits and enrollment forms required by the office under sections 152.22 to 152.37, including, but not limited to, the disclosure form required under paragraph (b).\n(b) The office shall develop a disclosure form and require, as a condition of enrollment, all patients to sign a copy of the disclosure. The disclosure must include:\n(1) a statement that, notwithstanding any law to the contrary, the office, or an employee of any state agency, may not be held civilly or criminally liable for any injury, loss of property, personal injury, or death caused by any act or omission while acting within the scope of office or employment under sections 152.22 to 152.37; and\n(2) the patient's acknowledgment that enrollment in the patient registry program is conditional on the patient's agreement to meet all of the requirements of sections 152.22 to 152.37.\n(a) Beginning July 1, 2024, the office shall establish an alternative certification procedure for veterans to enroll in the registry program.\n(b) The office may request that a patient who is a veteran and is seeking to enroll in the registry program submit to the office a copy of the patient's veteran identification card and an attestation that the veteran has been diagnosed with a qualifying medical condition listed in section 152.22, subdivision 14, clauses (1) to (19).\n(a) The office shall register a designated caregiver for a patient if the patient requires assistance in administering medical cannabis or obtaining medical cannabis from a distribution facility and the caregiver has agreed, in writing, to be the patient's designated caregiver. As a condition of registration as a designated caregiver, the office shall require the person to:\n(1) be at least 18 years of age;\n(2) agree to only possess the patient's medical cannabis for purposes of assisting the patient; and\n(3) agree that if the application is approved, the person will not be a registered designated caregiver for more than six registered patients at one time. Patients who reside in the same residence shall count as one patient.\n(b) Nothing in sections 152.22 to 152.37 shall be construed to prevent a person registered as a designated caregiver from also being enrolled in the registry program as a patient and possessing and using medical cannabis as a patient.\nA parent, legal guardian, or spouse of a patient may act as the caregiver to the patient without having to register as a designated caregiver. The parent, legal guardian, or spouse shall follow all of the requirements of parents, legal guardians, and spouses listed in sections 152.22 to 152.37. Nothing in sections 152.22 to 152.37 limits any legal authority a parent, legal guardian, or spouse may have for the patient under any other law.\n(a) After receipt of a patient's application and signed disclosure, the office shall enroll the patient in the registry program and issue the patient and patient's registered designated caregiver or parent, legal guardian, or spouse, if applicable, a registry verification. The office shall approve or deny a patient's application for participation in the registry program within 30 days after the office receives the patient's application. A patient's enrollment in the registry program shall only be denied if the patient:\n(1) does not have certification from a health care practitioner or, if the patient is a veteran, does not have the documentation requested by the office under subdivision 3a that the patient has been diagnosed with a qualifying medical condition;\n(2) has not signed and returned the disclosure form required under subdivision 3, paragraph (b), to the office;\n(3) does not provide the information required;\n(4) has previously been removed from the registry program for violations of section 152.30 or 152.33; or\n(5) provides false information.\n(b) The office shall give written notice to a patient of the reason for denying enrollment in the registry program.\n(c) Denial of enrollment into the registry program is considered a final decision of the office and is subject to judicial review under the Administrative Procedure Act pursuant to chapter 14.\n(d) A patient's enrollment in the registry program may only be revoked upon the death of the patient or if a patient violates a requirement under section 152.30 or 152.33.\n(e) The office shall develop a registry verification to provide to the patient, the health care practitioner identified in the patient's application, and to the manufacturer. The registry verification shall include:\n(1) the patient's name and date of birth;\n(2) the patient registry number assigned to the patient; and\n(3) the name and date of birth of the patient's registered designated caregiver, if any, or the name of the patient's parent, legal guardian, or spouse if the parent, legal guardian, or spouse will be acting as a caregiver.\nPatients and registered designated caregivers shall notify the commissioner of any address or name change within 30 days of the change having occurred. A patient or registered designated caregiver is subject to a $100 fine for failure to notify the commissioner of the change.",
	"repealed": false
}