{
	"id": "43A.18",
	"url": "https://www.revisor.mn.gov/statutes/cite/43A.18",
	"title": "43A.18 TOTAL COMPENSATION; COLLECTIVE BARGAINING AGREEMENTS; PLANS.",
	"text": "Except as provided in section 43A.01 and to the extent they are covered by a collective bargaining agreement, the compensation, terms and conditions of employment for all employees represented by an exclusive representative certified pursuant to chapter 179A shall be governed solely by the collective bargaining agreement executed by the parties.\nExcept as provided in section 43A.01, the compensation, terms and conditions of employment for all classified and unclassified employees, except unclassified employees in the legislative and judicial branches, who are not covered by a collective bargaining agreement and not otherwise provided for in chapter 43A or other law are governed solely by a plan developed by the commissioner. The Legislative Coordinating Commission shall review the plan under section 3.855, subdivision 2. The plan need not be adopted in accordance with the rulemaking provisions of chapter 14.\n(a) The commissioner shall identify individual positions or groups of positions in the classified and unclassified service in the executive branch as being managerial. The list must not include positions listed in subdivision 4.\n(b) The commissioner shall periodically prepare a plan for total compensation and terms and conditions of employment for employees of those positions identified as being managerial and whose salaries and benefits are not otherwise provided for in law or other plans established under this chapter. Before becoming effective those portions of the plan establishing compensation and terms and conditions of employment must be submitted to the Legislative Coordinating Commission under section 3.855, subdivisions 2 and 3.\n(c) Incumbents of managerial positions as identified under this subdivision must be excluded from any bargaining units under chapter 179A.\n(d) The management compensation plan must provide methods and levels of compensation for managers that will be generally comparable to those applicable to managers in other public and private employment. The plan must ensure that compensation within assigned salary ranges is related to level of performance. The plan must also provide a procedure for establishment of a salary rate for a newly created position and a new appointee to an existing position and for progression through assigned salary ranges. The employee benefits established under the provisions of the managerial plan may be extended to agency heads whose salaries are established in section 15A.0815 and to constitutional officers, judges of the Workers' Compensation Court of Appeals, and Tax Court judges.\nTotal compensation for unclassified managerial positions under section 43A.08, subdivision 1, clause (9), in the Board of Trustees of the Minnesota State Colleges and Universities not covered by a collective bargaining agreement must be determined by the Board of Trustees of the Minnesota State Colleges and Universities. Before submitting a compensation plan to the legislature and the Legislative Commission on Employee Relations, the Board of Trustees of the Minnesota State Colleges and Universities must submit the plan to the commissioner of management and budget for review and comment. The commissioner must complete the review within 14 days of its receipt. Compensation plans established under this subdivision must be approved by the legislature and the Legislative Commission on Employee Relations under section 3.855, before becoming effective.\nTotal compensation for unclassified positions under section 11A.04, clause (14), in the State Board of Investment must be determined by the State Board of Investment. Before submitting a compensation plan to the legislature and the Legislative Coordinating Commission, the State Board of Investment must submit the plan to the commissioner of management and budget for review and comment. The commissioner must complete the review within 14 days of its receipt. Compensation plans established under this subdivision must be approved by the legislature and the Legislative Coordinating Commission under section 3.855, before becoming effective.\n(a) Notwithstanding any other law to the contrary, terms and conditions of employment for employees listed in this subdivision must be set by appointing authorities within the limits of compensation plans that have been approved by the commissioner before becoming effective. Compensation plans established under paragraph (c) must be reviewed and approved, modified, or rejected by the legislature and the Legislative Coordinating Commission under section 3.855, subdivisions 2 and 3, before becoming effective.\n(b) Total compensation for employees who are not covered by a collective bargaining agreement in the offices of the governor, lieutenant governor, attorney general, secretary of state, and state auditor must be determined by the governor, lieutenant governor, attorney general, secretary of state, and state auditor, respectively.\n(c) Total compensation for unclassified positions not covered by a collective bargaining agreement in the Minnesota Office of Higher Education must be determined by the Minnesota Office of Higher Education.\nOn July 1 of each odd-numbered year the State Agricultural Society, the Enterprise Minnesota, Inc. board of directors, and the governing board of the Minnesota State High School League shall each submit a report to the Legislative Commission on Employee Relations on the total compensation plan for their employees.\n[Repealed, 1Sp2001 c 10 art 2 s 102]\nTotal compensation plans for unclassified employees of the legislature and of legislative commissions shall be determined by the legislature consistent with chapter 3, provided that insurance benefits for these employees and for legislators shall be determined by the Legislative Coordinating Commission, consistent with sections 43A.22 to 43A.30. Total compensation plans for unclassified employees of the judicial branch shall be determined by the appointing authority, unless other law provides a different method for establishing this compensation. Judicial branch compensation plans shall be consistent with sections 43A.22 to 43A.30.\nMembers of the Minnesota National Guard shall receive the pay and allowances prescribed by the armed forces of the United States for similar rank and time in service.\nIn preparing management negotiating positions for compensation which is established pursuant to subdivision 1, and in establishing, recommending and approving total compensation for any position within the plans covered in subdivisions 2, 3 and 4, the commissioner shall assure that:\n(a) compensation for positions in the classified and the unclassified service compare reasonably to one another;\n(b) compensation for state positions bears reasonable relationship to compensation for similar positions outside state service;\n(c) compensation for management positions bears reasonable relationship to compensation of represented employees managed;\n(d) compensation for positions within the classified service bears reasonable relationships among related job classes and among various levels within the same occupation; and\n(e) compensations bear reasonable relationships to one another within the meaning of this subdivision if compensation for positions which require comparable skill, effort, responsibility, and working conditions is comparable and if compensation for positions which require differing skill, effort, responsibility, and working conditions is proportional to the skill, effort, responsibility, and working conditions required.\nBefore the commissioner submits a proposed collective bargaining agreement, arbitration award, or compensation plan to the Legislative Coordinating Commission for review under section 3.855, the commissioner must post on a state website a summary covering employees of the Minnesota State Colleges and Universities and to compensation plans that must be submitted to the Legislative Coordinating Commission by other executive appointing authorities. The Minnesota State Colleges and Universities and other executive appointing authorities must submit information to the commissioner, at a time and in a manner specified by the commissioner, so the commissioner can post information relating to these appointing authorities on the web as required by this section.",
	"repealed": false
}