{
	"id": "116.92",
	"url": "https://www.revisor.mn.gov/statutes/cite/116.92",
	"title": "116.92 MERCURY EMISSIONS; REDUCTION.",
	"text": "A person may not sell mercury to another person in this state without providing a material safety data sheet, as defined in United States Code, title 42, section 11049, and requiring the purchaser to sign a statement that the purchaser:\n(1) will use the mercury only for a medical, dental, instructional, research, or manufacturing purpose; and\n(2) understands the toxicity of mercury and will appropriately store and use it and will not place, or allow anyone under the purchaser's control to place, the mercury in the solid waste stream or in a wastewater disposal system, as defined in section 115.01, subdivision 4.\nA person who uses mercury in any application may not place, or deliver the mercury to another person who places residues, particles, scrapings, or other materials that contain mercury in solid waste or wastewater, except for traces of materials that may inadvertently pass through a filtration system during a dental procedure.\n(a) A manufacturer or wholesaler may not sell and a retailer may not knowingly sell any of the following items in this state that contain mercury unless the item is labeled in a manner to clearly inform a purchaser or consumer that mercury is present in the item and that the item may not be placed in the garbage until the mercury is removed and reused, recycled, or otherwise managed to ensure that it does not become part of solid waste or wastewater:\n(1) a thermostat or thermometer;\n(2) an electric switch, individually or as part of another product, other than a motor vehicle;\n(3) an appliance;\n(4) a medical or scientific instrument;\n(5) an electric relay or other electrical device;\n(6) a fluorescent or high-intensity discharge lamp, individually or as part of another product; and\n(7) laboratory chemicals, reagents, fixatives, and electrodes.\n(b) Labeling of items in accordance with mercury product labeling plans approved by another state that is a member of the Interstate Mercury Education and Reduction Clearinghouse (IMERC) shall be considered to be in compliance with this section. The manufacturer shall provide a copy of the labeling plan to the agency and shall notify the agency if the approval is modified.\n(c) Manufacturers of products that contain a mercury-containing lamp not intended to be replaceable by the user or consumer shall meet the product labeling requirements of this section by placing the label on the product or in the care and use manual or product instructions.\n(a) When an item listed in this section is removed from service, the mercury in the item must be reused, recycled, or otherwise managed to ensure compliance with section 115A.932.\n(b) A person who is in the business of replacing or repairing an item listed in this section in households shall ensure, or deliver the item to a facility that will ensure, that the mercury contained in an item that is replaced or repaired is reused or recycled or otherwise managed in compliance with section 115A.932.\n(c) A person may not crush a motor vehicle unless the person has first made a good faith effort to remove all of the mercury switches in the motor vehicle.\n(d) An item managed according to the requirements of this section must be transported in a container designed to prevent the escape of mercury into the environment by volatilization or any other means.\n(a) The definitions in this paragraph apply to this subdivision:\n(1) \"contractor\" means a person engaged in the business of installing, servicing, or removing thermostats and other heating, ventilation, and air conditioning components, including a contractor removing thermostats in conjunction with renovation and demolition activities in accordance with Minnesota Rules, part 7035.0805;\n(2) \"qualified contractor\" means a contractor:\n(i) who employs seven or more service technicians or installers;\n(ii) who is located in an area outside of an urban area, as defined by the United States Census Bureau; or\n(iii) whose primary business consists of renovation and demolition activities;\n(3) \"retailer\" means a person who sells thermostats of any kind directly to homeowners or other end-users through any selling or distribution mechanism;\n(4) \"thermostat\" means a temperature control device that may contain elemental mercury in a sealed component that serves as a switch or temperature-sensing element and a sealed component that has been removed from a temperature control device; and\n(5) \"wholesaler\" means a person engaged in the distribution and wholesale sale of thermostats and other heating, ventilation, and air conditioning components to contractors who install heating, ventilation, and air conditioning components.\n(b) A manufacturer of thermostats that contain mercury or that may replace thermostats that contain mercury is responsible for the costs of collecting and managing the replaced mercury-containing thermostats to ensure that the thermostats do not become part of the solid waste stream.\n(c) A manufacturer of thermostats that contain mercury or that may replace thermostats that contain mercury shall, in addition to the requirements of subdivision 3, provide incentives for and sufficient information to purchasers and consumers of the thermostats for the purchasers or consumers to ensure that mercury in thermostats being removed from service is reused or recycled or otherwise managed in compliance with section 115A.932. A manufacturer that has complied with this subdivision is not liable for improper disposal by purchasers or consumers of thermostats.\n(d) A manufacturer of thermostats subject to this subdivision, or an organization of manufacturers of thermostats and its officers, members, employees, and agents, may participate in projects or programs to collect and properly manage waste thermostats. Any person who participates in a project or program is immune from liability under state law relating to antitrust, restraint of trade, unfair trade practices, and other regulation of trade or commerce for activities related to the collection and management of the thermostats under this subdivision.\n(e) A manufacturer of thermostats or organization of manufacturers of thermostats that participates in a thermostat collection and management program under this subdivision must report at least annually to the agency. The report must include:\n(1) a description of how the program operates;\n(2) a description of program components, including incentives provided under this subdivision, and an evaluation of the program components' effectiveness in promoting participation and recovery of thermostats;\n(3) eligibility criteria for program participants;\n(4) a list of program participants; and\n(5) the number of thermostats remitted by each program participant during the reporting period.\n(f) A wholesaler, qualified contractor, or retailer may participate as a collection site in a manufacturer's mercury thermostat collection and management program required under this subdivision. A wholesaler or retailer that participates as a collection site in a manufacturer's mercury thermostat collection and management program shall post prominent signs at the wholesaler's or retailer's business location regarding the collection and management of mercury thermostats.\n(a) A manufacturer of a displacement relay that contains mercury is responsible for the costs of collecting and managing its displacement relays to ensure that the relays do not become part of the solid waste stream.\n(b) A manufacturer of a displacement relay that contains mercury shall, in addition to the requirements of subdivision 3, provide incentives for, and sufficient information to, purchasers and consumers of the relay to ensure that the relay does not become part of the waste stream. A manufacturer that has complied with this subdivision is not liable for improper disposal by purchasers or consumers of its relays.\n(c) A manufacturer subject to this subdivision, or an organization of such manufacturers and its officers, members, employees, and agents, may participate in projects or programs to collect and properly manage waste displacement relays. Any person who participates in such a project or program is immune from liability under state law relating to antitrust, restraint of trade, unfair trade practices, and other regulation of trade or commerce for activities related to the collection and management of the relays under this subdivision.\n(d) For the purposes of this subdivision, a \"displacement relay\" means an electric flow control device having one or more poles that contain metallic mercury and a plunger which, when energized by a magnetic field, moves into a pool of mercury, displacing the mercury sufficiently to create a closed electrical circuit.\n(a) A manufacturer, wholesaler, or retailer may not sell or distribute at no cost a thermometer containing mercury that was manufactured after June 1, 2001.\n(b) Paragraph (a) does not apply to an electronic thermometer with a battery containing mercury if the battery is in compliance with section 325E.125.\n(c) A manufacturer is in compliance with this subdivision if the manufacturer:\n(1) has received an exclusion or exemption from a state that is a member of the Interstate Mercury Education and Reduction Clearinghouse (IMERC) for replacement parts when no alternative is available or for an application when no feasible alternative is available;\n(2) submits a copy of the approved exclusion or exemption to the commissioner; and\n(3) meets all of the requirements in the approved exclusion or exemption for the manufacturer's activities within the state.\n(a) A person who sells fluorescent or high-intensity discharge lamps that contain mercury to the owner or manager of an industrial, commercial, office, or multiunit residential building, or to any person who replaces or removes from service outdoor lamps that contain mercury, shall clearly inform the purchaser in writing on the invoice for the lamps, or in a separate writing, that the lamps contain mercury, a hazardous substance that is regulated by federal or state law and that they may not be placed in solid waste. This paragraph does not apply to a person who incidentally sells fluorescent or high-intensity discharge lamps at retail to the specified purchasers.\n(b) A person who contracts with the owner or manager of an industrial, commercial, office, or multiunit residential building, or with a person responsible for outdoor lighting, to remove from service fluorescent or high-intensity discharge lamps that contain mercury shall clearly inform, in writing, the person for whom the work is being done that the lamps being removed from service contain mercury and what the contractor's arrangements are for the management of the mercury in the removed lamps.\n(a) Any information regarding fluorescent and high-intensity discharge lamps containing mercury that is sent by a utility to a customer, present on a utility's website, or contained in a utility's print, radio, or video advertisement, must:\n(1) state that the lamps contain mercury;\n(2) state that mercury is harmful to the environment;\n(3) state that placing the lamps in garbage is illegal; and\n(4) provide a toll-free telephone number or website that customers can access to learn how to lawfully dispose of the lamps.\n(b) The information under paragraph (a) must be:\n(1) provided in a minimum of 12-point type in print or online media; and\n(2) provided in a manner that the ordinary consumer will understand that fluorescent and high-intensity discharge lamps contain mercury and must not be placed in garbage in Minnesota.\n(c) A television or radio advertisement regarding fluorescent and high-intensity discharge lamps containing mercury must prominently convey the information that the lamps contain mercury and must be recycled.\n(a) For purposes of this subdivision, the following terms have the meanings given:\n(1) \"compact fluorescent lamp\" means a compact low-pressure, mercury-containing, electric-discharge light source:\n(i) of any tube diameter or tube length;\n(ii) of any lamp size or shape for directional and nondirectional installations, including but not limited to PL, spiral, twin tube, triple twin, 2D, U-bend, and circular;\n(iii) in which a fluorescent coating transforms some of the ultraviolet energy generated by the mercury discharge into visible light;\n(iv) that has one base or end cap of any type, including but not limited to screw, bayonet, two pins, and four pins;\n(v) that is integrally ballasted or non-integrally ballasted; and\n(vi) that has light emission between a correlated color temperature of 1700K and 24000K and a Duv of +0.024 and -0.024 in the International Commission on Illumination (CIE) Uniform Color Space (CAM02-UCS);\n(2) \"linear fluorescent lamp\" means a low-pressure, mercury-containing, electric-discharge light source:\n(i) of any tube diameter, including but not limited to T5, T8, T10, and T12;\n(ii) with a tube length from 0.5 to 8.0 feet, inclusive;\n(iii) of any lamp shape, including but not limited to linear, U-bend, and circular;\n(iv) in which a fluorescent coating transforms some of the ultraviolet energy generated by the mercury discharge into visible light;\n(v) that has two bases or end caps of any type, including but not limited to single-pin, two-pin, and recessed double contact; and\n(vi) that has light emission between a correlated color temperature of 1700K and 24000K and a Duv of +0.024 and -0.024 in the CIE CAM02-UCS;\n(3) \"mercury vapor lamp\" means a high-intensity discharge lamp, including clear, phosphor-coated, and self-ballasted screw base lamps, in which the major portion of the light is produced by radiation from mercury typically operating at a partial vapor pressure in excess of 100,000 pascals;\n(4) \"mercury vapor lamp ballast\" means a device that is designed and marketed to start and operate mercury vapor lamps intended for general illumination by providing the necessary voltage and current; and\n(5) \"specialty application mercury vapor lamp ballast\" means a mercury vapor lamp ballast:\n(i) that is designed and marketed for operating mercury vapor lamps used in quality inspection, industrial processing, or scientific applications, including fluorescent microscopy and ultraviolet curing; and\n(ii) the label of which states \"For specialty applications only, not for general illumination\" and indicates the specific applications for which the ballast is designed.\n(b) Effective January 1, 2025, a person may not sell, offer for sale, or distribute in the state as a new manufactured product a screw- or bayonet-base type compact fluorescent lamp, a mercury vapor lamp, or a mercury vapor lamp ballast, whether sold separately, in a retrofit kit, or in a luminaire. Effective January 1, 2026, a person may not sell, offer for sale, or distribute in the state as a new manufactured product a pin-base type compact fluorescent lamp or a linear fluorescent lamp.\n(c) This subdivision does not apply to:\n(1) a lamp designed and marketed exclusively for image capture and projection, including for:\n(i) photocopying;\n(ii) printing, directly or in preprocessing;\n(iii) lithography;\n(iv) film and video projection; or\n(v) holography;\n(2) a lamp that has a high proportion of ultraviolet light emission and that:\n(i) has high ultraviolet content and ultraviolet power greater than two milliwatts per kilolumen;\n(ii) is for germicidal use, such as for destroying DNA, and emits a peak radiation of approximately 253.7 nanometers;\n(iii) is designed and marketed exclusively for disinfection or fly-trapping and from which:\n(A) the radiation power emitted between 250 and 315 nanometers represents at least five percent of the total radiation power emitted between 250 and 800 nanometers; or\n(B) the radiation power emitted between 315 and 400 nanometers represents at least 20 percent of the total radiation power emitted between 250 and 800 nanometers;\n(iv) is designed and marketed exclusively for generating ozone when the primary purpose is to emit radiation at approximately 185.1 nanometers;\n(v) is designed and marketed exclusively for coral zooxanthellae symbiosis and from which the radiation power emitted between 400 and 480 nanometers represents at least 40 percent of the total radiation power emitted between 250 and 800 nanometers; or\n(vi) is designed and marketed exclusively for use in a sunlamp product, as defined in Code of Federal Regulations, title 21, section 1040.20(b)(9) (2022);\n(3) specialty application mercury vapor lamp ballasts; or\n(4) a compact fluorescent lamp used to replace a lamp in a motor vehicle if the motor vehicle was manufactured on or before January 1, 2020.\n(d) Nothing in this section limits the ability of a utility to offer energy-efficient lighting, rebates, or lamp-recycling services or to claim energy savings resulting from such programs through the utility's energy conservation and optimization plans approved by the commissioner of commerce under section 216B.241 or an energy conservation and optimization plan filed by a consumer-owned utility under section 216B.2403.\nA person may not sell for resale or at retail in this state a toy or game that contains mercury, or an item of clothing or wearing apparel that is exempt from sales tax under section 297A.67, subdivision 8, that contains an electric switch that contains mercury.\nAfter June 30, 1997, mercury manometers for use on dairy farms may not be sold or installed, nor may mercury manometers in use on dairy farms be repaired. After December 31, 2000, all mercury manometers on dairy farms must be removed from use.\nAfter August 1, 2007, a person may not sell, offer for sale, distribute, install, or reinstall in the state a sphygmomanometer containing mercury.\nAfter August 1, 2007, a person may not sell, offer for sale, distribute, or use in the state an esophageal dilator, bougie tube, gastrointestinal tube, feeding tube, or similar device containing mercury.\nAfter August 1, 2007, a person may not sell, offer for sale, distribute, install, or reinstall in the state a product or device that uses a mercury switch to sense and control room temperature through communication with heating, ventilating, or air-conditioning equipment. This subdivision does not apply to a thermostat used to sense and control temperature as part of a manufacturing process.\n(a) After August 1, 2007, a person may not sell, offer for sale, or distribute in the state a mercury switch or mercury relay individually or as part of another product.\n(b) For the purposes of this subdivision:\n(1) \"mercury relay\" means a mercury-containing product or device that opens or closes electrical contacts to affect the operation of other devices in the same or another electrical circuit and includes, but is not limited to, mercury displacement relays, mercury wetted reed relays, and mercury contact relays; and\n(2) \"mercury switch\" means a mercury-containing product or device that opens or closes an electrical circuit or gas valve and includes, but is not limited to, mercury float switches actuated by rising or falling liquid levels, mercury tilt switches actuated by a change in the switch position, mercury pressure switches actuated by a change in pressure, mercury temperature switches actuated by a change in temperature, and mercury flame sensors. A mercury switch does not include a mercury-added thermostat or a mercury diostat.\n(c) A manufacturer shall be in compliance with this subdivision if:\n(1) it has received an exclusion or exemption from a state that is a member of the Interstate Mercury Education and Reduction Clearinghouse (IMERC) for replacement parts or for a use where no feasible alternative is available;\n(2) it submits a copy of the approved exclusion or exemption to the commissioner; and\n(3) it meets all of the requirements in the approved exclusion or exemption for its activities within the state.\nAfter January 1, 2008, a person may not sell, offer for sale, or distribute a new gas oven, range, or stove containing a mercury-containing switch that controls a gas valve in an oven or oven portion of a gas range or stove.\nAfter January 1, 2008, a person may not sell, offer for sale, or distribute in the state a mercury-containing device used for measuring atmospheric pressure or for measuring pressure of liquids and gases or a mercury-containing device used for measuring the temperature of extremely hot materials, individually or as part of another product.\nAfter January 1, 2008, a person may not sell, offer for sale, or distribute in the state for human use an over-the-counter pharmaceutical product containing mercury.\nAfter January 1, 2008, a person may not sell, offer for sale, or distribute in the state a cosmetic, toiletry, or fragrance product containing mercury.\nThe prohibitions in subdivisions 6 and 8b to 8g do not apply if a thermometer, switch, relay, or measuring device is used to replace a thermometer, switch, relay, or measuring device that is a component of an industrial measurement system or control system until the system is replaced or a nonmercury component for the system is available. The owner of the system shall notify the commissioner within 30 days of replacing the component and identify the replacement mercury component that was installed.\nA person may not sell, offer for sale, distribute, install, or use in the state a mercury-containing product or mercury-containing equipment that is used for balancing, dampening, or providing a weight or counterweight function.\n(a) A violation of subdivision 2 or 4, paragraph (a), by a generator of household hazardous waste, as defined in section 115A.96, or a violation of subdivision 8 by a person selling at retail, is not subject to enforcement under section 115.071, subdivision 3.\n(b) An administrative penalty imposed under section 116.072 for a violation of subdivision 2 or 4, paragraph (a), by a generator of household hazardous waste, as defined in section 115A.96, or for a violation of subdivision 8 by a person selling at retail, may not exceed $700.\nFor the purposes of this section, \"mercury-containing\" or \"containing mercury\" means that the product, component of a product, or chemical formulation contains intentionally added mercury.",
	"repealed": false
}