{
	"id": "142G.15",
	"url": "https://www.revisor.mn.gov/statutes/cite/142G.15",
	"title": "142G.15 OTHER ELIGIBILITY CONDITIONS.",
	"text": "The language of a court order that specifies joint legal or physical custody does not preclude a determination that a parent is absent. Absence must be determined based on the actual facts of the absence according to paragraphs (a) to (c).\n(a) When a minor child spends time in each of the parents' homes within a payment month, the minor child's home shall be considered the home in which the majority of the minor child's time is spent. When this time is exactly equal within a payment month, or when the parents alternately live in the minor child's home within a payment month, the minor child's home shall be with that parent who is applying for MFIP, unless the minor child's needs for the full payment month have already been met through the provision of assistance to the other parent for that month.\n(b) When the physical custody of a minor child alternates between parents for periods of at least one payment month, each parent shall be eligible for assistance for any full payment months the minor child's home is with that parent, except under the conditions in paragraph (c).\n(c) When a minor child's home is with one parent for the majority of time in each month for at least nine consecutive calendar months, and that minor child visits or vacations with the other parent under section 142G.13, the minor child's home remains with the first parent even when the stay with the second parent is for all or the majority of the months in the period of the temporary absence.\nTo receive assistance when a member of an assistance unit is on strike, or when an individual identified under section 142G.31, subdivisions 1 to 4, whose income and assets must be considered when determining the unit's eligibility is on strike, the assistance unit must have been receiving MFIP or have been eligible for MFIP on the day before the strike.\nThe county agency must count the striker's prestrike earnings as current earnings. A significant change cannot be invoked when a member of an assistance unit, or an individual identified under section 142G.31, subdivisions 1 to 4, is on strike. A member of an assistance unit, or an individual identified under section 142G.31, subdivisions 1 to 4, is not considered a striker when that person is not in the bargaining unit that voted for the strike and does not cross the picket line for fear of personal injury.",
	"repealed": false
}