{
	"id": "352.04",
	"url": "https://www.revisor.mn.gov/statutes/cite/352.04",
	"title": "352.04 STATE EMPLOYEES RETIREMENT FUND, CONTRIBUTIONS BY EMPLOYEE AND EMPLOYER.",
	"text": "There is created a special fund to be known as the general state employees retirement fund. In that fund, employee contributions, employer contributions, and other amounts authorized by law must be deposited.\n(a) The employee contribution to the fund must be equal to the following percent of salary:\n(b) These contributions must be made by deduction from salary as provided in subdivision 4.\n(c) Contribution increases under paragraph (a) must be paid starting the first day of the first full pay period after the effective date of the increase.\n(a) The employer contribution to the fund must be equal to the following percent of salary:\n(b) Contribution increases under paragraph (a) must be paid starting the first day of the first full pay period after the effective date of the increase.\nEach employing entity shall have employee contributions deducted from the salary of each employee covered by the system on every payroll abstract and shall approve one voucher payable to the commissioner of management and budget for the aggregate amount deducted on the payroll abstract. Deductions from salaries of employees paid directly by any employing entity must be made by the officer or employee authorized by law to pay the salaries. Any employing entity having authority to appoint any employee who receives fees as compensation or who receives compensation on federal payrolls shall collect as the required employee contribution the applicable amounts required in subdivision 2. Deductions from salary and amounts collected must be remitted to the director with a statement showing the amount of earnings or fees, and in the case of fees, the number of transactions, the amount of each of the deductions and collections, and the names of the employees on whose account they have been made.\nThe head of each department or agency shall have employer contributions made to the fund on a payroll abstract at the time an employee is paid salary in the amounts required by subdivision 3. These contributions must be charged as administrative costs. Each department shall pay these amounts from accounts and funds from which the department or agency receives its revenue, including appropriations from the general fund and from any other fund for the payment of salaries and in the same proportion as it pays the amounts of salaries.\nFor those of their employees who are covered by the system, the State Horticultural Society, the Disabled American Veterans, Department of Minnesota, Veterans of Foreign Wars, Department of Minnesota, the Minnesota Crop Improvement Association, the Minnesota Historical Society, the Armory Building Commission, the Minnesota Safety Council, the Metropolitan Council and any of its statutory boards, the employer of persons described in section 352.01, subdivision 2a, paragraph (a), clause (15), and any other agency employing employees covered by this system, respectively, shall also pay into the retirement fund the amount required by subdivision 3.\n[Repealed, 1973 c 221 s 11]\n(a) If an employing entity fails to take deductions past due for a period of 60 days or less from an employee's salary as provided in this section, those deductions must be taken on later payroll abstracts.\n(b) If an employing entity fails to take deductions past due for a period in excess of 60 days from an employee's salary as provided in this section, the employing entity, and not the employee, must pay on later payroll abstracts the employee and employer contributions and interest at the applicable annual rate or rates specified in section 356.59, subdivision 2, compounded annually, from the date the employee and employer contributions should have been deducted to the date payment of the total amount due is paid by the employing entity.\n(c) If an employing entity fails to take deductions past due for a period of 60 days or less and the employee is no longer in state service so that the required deductions cannot be taken from the salary of the employee, the employing entity must nevertheless pay the required employer contributions. If any employing entity fails to take deductions past due for a period in excess of 60 days and the employee is no longer in state service, the omitted contributions must be recovered under paragraph (b).\n(d) If an employee from whose salary required deductions were past due for a period of 60 days or less leaves state service before the payment of the omitted deductions and subsequently returns to state service, the unpaid amount is considered the equivalent of a refund. The employee accrues no right by reason of the unpaid amount, except that the employee may pay the amount of omitted deductions as provided in section 352.23.\n(a) Deductions taken from the salary of an employee for the retirement fund in excess of required amounts must, upon discovery and verification by the employing entity making the deduction, be refunded to the employee. Employer contributions made in excess of required amounts must be refunded or credited to the employing entity that made the contribution.\n(b) If a deduction for the retirement fund is taken from a salary payment, and the payment is canceled or the amount of the payment returned to the funds of the employing entity making the payment, the sum deducted, or the part of it required to adjust the deductions, must be refunded or credited to the employing entity if the employing entity applies for the refund on a form furnished by the director.\n(c) If erroneous employee deductions and employer contributions are caused by an error in plan coverage involving the plan and any other plans specified in section 356.637, that section applies. If the employee should have been covered by the plan governed by chapter 352D, 353D, 354B, or 354D, the employee deductions and employer contributions taken in error must be directly transferred to the applicable employee's account in the correct retirement plan, with interest at the applicable monthly rate or rates specified in section 356.59, subdivision 2, compounded annually, from the first day of the month following the month in which coverage should have commenced in the correct defined contribution plan until the end of the month in which the transfer occurs.\n[Repealed, 2Sp1981 c 1 s 8]\nMS 2016 [Repealed, 2018 c 211 art 17 s 3]\nThe general state employees retirement fund must be disbursed only for the purposes provided by law. The expenses of the system and any benefits provided by law must be paid from the general state employees retirement fund. The retirement allowances, retirement annuities, and disability benefits, as well as refunds of any sum remaining to the credit of a deceased retired employee or a disabled employee must be paid from the general state employees retirement fund. The amounts necessary to make the payments from the general state employees retirement fund are annually appropriated from that fund for those purposes.\nIn this section, \"employing entity\" means the entity that pays a state employee's salary and remits retirement contributions.",
	"repealed": false
}