{
	"id": "221.605",
	"url": "https://www.revisor.mn.gov/statutes/cite/221.605",
	"title": "221.605 COMPLIANCE BY CARRIER.",
	"text": "(a) Interstate carriers and private carriers engaged in interstate commerce shall comply with the federal motor carrier regulations in Code of Federal Regulations, title 49, parts 40, 382, 383, 387, and 390 through 398, which are incorporated by reference, and with the rules of the commissioner concerning inspections, vehicle and driver out-of-service restrictions and requirements, and vehicle, driver, and equipment checklists. For purposes of regulating commercial motor vehicles as defined in section 169.781, subdivision 1, the exemption provided in Code of Federal Regulations, title 49, section 396.11, paragraph (a), clause (5), applies in Minnesota only to driveaway-towaway operations.\n(b) An interstate carrier or private carrier engaged in interstate commerce who complies with federal regulations governing testing for controlled substances and alcohol is exempt from the requirements of sections 181.950 to 181.957 unless the carrier's drug testing program provides for testing for controlled substances in addition to those listed in Code of Federal Regulations, title 49, section 40.85. Persons subject to this section may test for drugs, in addition to those listed in Code of Federal Regulations, title 49, section 40.85, only in accordance with sections 181.950 to 181.957 and rules adopted under those sections.\nThe commissioner shall investigate the operations of carriers engaged in interstate commerce in Minnesota and their compliance with federal regulations, this chapter, and the rules of the commissioner, and may institute and prosecute proceedings in the proper district court for their enforcement.\nThe North American Standard Out-Of-Service Criteria developed and adopted by the Federal Highway Administration and the Commercial Vehicle Safety Alliance are adopted in Minnesota.\nNo interstate carrier or private carrier engaged in interstate commerce shall operate a commercial motor vehicle in Minnesota while a motor carrier out-of-service order issued by the Federal Motor Carrier Safety Administration under Code of Federal Regulations, title 49, part 385 or 386, is in effect.",
	"repealed": false
}