{
	"id": "122A.092",
	"url": "https://www.revisor.mn.gov/statutes/cite/122A.092",
	"title": "122A.092 TEACHER PREPARATION PROGRAMS.",
	"text": "The board must adopt rules to approve teacher preparation programs, including alternative teacher preparation programs under section 122A.2451, nonconventional programs, and Montessori teacher training programs.\nTeacher preparation programs must demonstrate the following to obtain board approval:\n(1) the program has implemented a research-based, results-oriented curriculum that focuses on the skills teachers need in order to be effective;\n(2) the program provides a student teaching program;\n(3) the program demonstrates effectiveness based on proficiency of graduates in demonstrating attainment of program outcomes;\n(4) the program includes a common core of teaching knowledge and skills. This common core shall meet the standards developed by the Interstate New Teacher Assessment and Support Consortium in its 1992 model standards for beginning teacher licensing and development. Amendments to standards adopted under this clause are subject to chapter 14. The Professional Educator Licensing and Standards Board shall report annually to the education committees of the legislature on the performance of teacher candidates on common core assessments of knowledge and skills under this clause during the most recent school year;\n(5) the program includes instruction on the knowledge and skills needed to provide appropriate instruction to English learners to support and accelerate their academic literacy, including oral academic language and achievement in content areas in a regular classroom setting; and\n(6) the program includes culturally competent training in instructional strategies consistent with section 120B.30, subdivision 8.\nThe board must adopt rules creating flexible, specialized teaching licenses, credentials, and other endorsement forms to increase students' participation in language immersion programs, world language instruction, career development opportunities, work-based learning, early college courses and careers, career and technical programs, Montessori schools, and project- and place-based learning, among other career and college readiness learning offerings.\nThe board must adopt rules requiring teacher educators to work directly with elementary or secondary school teachers in elementary or secondary schools to obtain periodic exposure to the elementary and secondary teaching environments.\n(a) A teacher preparation provider approved by the Professional Educator Licensing and Standards Board to prepare persons for classroom teacher licensure must include in its teacher preparation programs evidence-based best practices in reading, consistent with sections 120B.118 to 120B.124, including instruction on phonemic awareness, phonics, vocabulary development, reading fluency, and reading comprehension. Instruction on reading must enable the licensure candidate to teach reading in the candidate's content areas. Teacher candidates must be instructed in using students' native languages as a resource in creating effective differentiated instructional strategies for English learners developing literacy skills. A teacher preparation provider also must prepare early childhood and elementary teacher candidates for Tier 3 and Tier 4 teaching licenses under sections 122A.183 and 122A.184, respectively.\n(b) Board-approved teacher preparation programs for teachers of elementary education must require instruction in applying evidence-based, structured literacy reading instruction programs that:\n(1) teach students to read using foundational knowledge, practices, and strategies consistent with sections 120B.118 to 120B.124, with emphasis on mastery of foundational reading skills so that students achieve continuous progress in reading; and\n(2) teach specialized instruction in reading strategies, interventions, and remediations that enable students of all ages and proficiency levels, including multilingual learners and students demonstrating characteristics of dyslexia, to become proficient readers.\n(c) Board-approved teacher preparation programs for teachers of elementary education, early childhood education, special education, and reading intervention must include instruction on dyslexia, as defined in section 125A.01, subdivision 2. Teacher preparation programs may consult with the Department of Education, including the dyslexia specialist under section 120B.122, to develop instruction under this paragraph. Instruction on dyslexia must be modeled on practice standards of the International Dyslexia Association, and must address:\n(1) the nature and symptoms of dyslexia;\n(2) resources available for students who show characteristics of dyslexia;\n(3) evidence-based instructional strategies for students who show characteristics of dyslexia, including the structured literacy approach; and\n(4) outcomes of intervention and lack of intervention for students who show characteristics of dyslexia.\n(d) Nothing in this section limits the authority of a school district to select a school's reading program or curriculum.\nAll preparation providers approved by the Professional Educator Licensing and Standards Board to prepare persons for classroom teacher licensure must include in their teacher preparation programs the knowledge and skills teacher candidates need to engage students with technology and deliver digital and blended learning and curriculum.\nA teacher preparation program may provide a year-long student teaching program that combines clinical opportunities with academic coursework and in-depth student teaching experiences to offer students:\n(1) ongoing mentorship;\n(2) coaching;\n(3) assessment;\n(4) help to prepare a professional development plan; and\n(5) structured learning experiences.\nThe approval of teacher preparation programs approved by the Board of Teaching before July 1, 2018, must remain in effect unless and until the Professional Educator Licensing and Standards Board denies approval or reapproves the program.\nA teacher preparation program is encouraged to include instruction for teacher candidates on ableism and disability justice, provided by a person with a disability and expertise related to ableism and disability justice.",
	"repealed": false
}