{
	"id": "168.105",
	"url": "https://www.revisor.mn.gov/statutes/cite/168.105",
	"title": "168.105 CLASSIC MOTORCYCLE REGISTRATION.",
	"text": "A \"classic motorcycle\" is a motorcycle that is at least 20 years old, original in appearance, and owned solely as a collector's item and used in a classic motorcycle club activity, exhibition, tour, parade, or similar use. A classic motorcycle may not be used for general transportation purposes.\n(a) A classic motorcycle must be taxed and registered by the vehicle owner submitting an affidavit to the commissioner stating (1) the name and address of the owner, (2) the name and address of the person from whom purchased, (3) the make of the classic motorcycle, (4) the year and number of the model, (5) the manufacturer's vehicle identification number, (6) that the motorcycle is owned and operated solely as a collector's item and will not be used for general transportation purposes, and (7) that the owner has one or more motor vehicles with regular plates.\n(b) When the commissioner is satisfied that the affidavit is true, correct, and complete and the owner has paid a $10 registration tax, the commissioner shall register the vehicle and issue special plates.\nThe commissioner shall issue plates of the same size as standard motorcycle plates and inscribed \"collector\" and \"Minnesota\" with the registration number or other combination of characters authorized under section 168.12, subdivision 2a, but without a date. The plates are valid without renewal as long as the classic motorcycle exists and may be issued for the applicant's use only for the classic motorcycle. The commissioner may revoke the plates for noncompliance with this subdivision.\nMS 1984 [Repealed, 1985 c 291 s 27]\n(a) Instead of being issued classic motorcycle plates, a classic motorcycle registered under this section may display original Minnesota plates issued in the same year as the model year of the motorcycle on which they are displayed. The number on the original plates must be provided to the commissioner.\n(b) Original Minnesota plates may not be used if the number on the original plate is identical to the number on a current collector's plate issued by the commissioner.\n(c) If the vehicle is not registered as a collector vehicle, the commissioner shall charge a fee in the amount specified for special plates under section 168.12, subdivision 5, for registering the number on the original plates.\nMS 2004 [Repealed, 1Sp2005 c 6 art 2 s 48]",
	"repealed": false
}