{
	"id": "609.117",
	"url": "https://www.revisor.mn.gov/statutes/cite/609.117",
	"title": "609.117 DNA ANALYSIS OF CERTAIN OFFENDERS REQUIRED.",
	"text": "If an offender has not already done so, the court shall order an offender to provide a biological specimen for the purpose of DNA analysis as defined in section 299C.155 when:\n(1) the court sentences a person charged with committing or attempting to commit a felony offense and the person is convicted of that offense or of any offense arising out of the same set of circumstances; or\n(2) the juvenile court adjudicates a person a delinquent child who is petitioned for committing or attempting to commit a felony offense and is adjudicated delinquent for that offense or any offense arising out of the same set of circumstances.\nThe biological specimen or the results of the analysis shall be maintained by the Bureau of Criminal Apprehension as provided in section 299C.155.\nThe commissioner of corrections or local corrections authority shall order a person to provide a biological specimen for the purpose of DNA analysis before completion of the person's term of imprisonment when the person has not provided a biological specimen for the purpose of DNA analysis and the person:\n(1) was initially charged with committing or attempting to commit a felony offense and was convicted of that offense or of any offense arising out of the same set of circumstances, or the person has a past felony conviction in this or any other state; or\n(2) is serving a term of imprisonment in this state under a reciprocal agreement although convicted in another state of committing or attempting to commit a felony offense or of any offense arising out of the same set of circumstances if the person was initially charged with committing or attempting to commit a felony offense. The commissioner of corrections or local corrections authority shall forward the sample to the Bureau of Criminal Apprehension.\nWhen the state accepts an offender from another state under the interstate compact authorized by section 243.1605, the acceptance is conditional on the offender providing a biological specimen for the purposes of DNA analysis as defined in section 299C.155, if the offender was initially charged with committing or attempting to commit a felony offense and was convicted of that offense or of any offense arising out of the same set of circumstances. The specimen must be provided under supervision of staff from the Department of Corrections or a Community Corrections Act county within 15 business days after the offender reports to the supervising agent. The cost of obtaining the biological specimen is the responsibility of the agency providing supervision.\n(a) Upon motion of a prosecuting authority, a court shall issue an order to show cause why an offender who should have been ordered or required to provide a biological specimen under this section but did not, should not now be ordered to provide one for the purposes of DNA analysis. This subdivision applies if the offender's sentence or supervision has expired. The prosecuting authority shall provide the court with an affidavit that:\n(1) identifies the offender by name and date of birth;\n(2) identifies the offender's last known address;\n(3) identifies the offender's charged offense, offense of conviction, and date of conviction; and\n(4) indicates that the Bureau of Criminal Apprehension database of biological specimens has been searched and the offender has not previously provided a biological specimen for DNA analysis under this chapter.\n(b) The order to show cause shall direct the offender to appear before the court within 30 days after the order is served. The prosecutor shall serve the order to show cause upon the offender in the same manner as a civil summons. The offender may avoid appearing before the court by appearing at a place and time designated in the order and voluntarily providing the specimen.\n(c) Upon the offender's appearance before the court, and after an opportunity to be heard, the court may issue an order directing the offender to provide the specimen.\n(d) If the offender has failed to provide the specimen or appear before the court and the prosecuting authority makes a sufficient showing that the offender was properly served with the order to show cause, the court may issue an order:\n(1) requiring the offender to submit the specimen within 30 days from the date of the order at a designated location;\n(2) including the designated location's address, telephone number, and regular hours of operation; and\n(3) authorizing, if the offender fails or refuses to comply with the order to provide a specimen, a peace officer to detain and bring the offender before the court as soon as practicable to show cause why the specimen should not be obtained.\n(e) The local corrections authority shall mail the order in paragraph (d) to the offender's last known address.",
	"repealed": false
}