{
	"id": "508.16",
	"url": "https://www.revisor.mn.gov/statutes/cite/508.16",
	"title": "508.16 FORM OF SUMMONS; SERVICE ON VARIOUS PARTIES; PUBLICATION.",
	"text": "The summons shall be subscribed by the court administrator, directed to the defendants, and require them to appear and answer the application of the applicant, within 20 days after the service of the summons, exclusive of the day of such service. It shall be served in the manner as provided by law for the service of a summons in civil actions in the district court, except as herein otherwise provided. It shall be served upon the state by delivering a copy thereof to the attorney general, a deputy attorney general or an assistant attorney general. The attorney general shall represent the state in these proceedings. In those cases where the attorney general deems it appropriate, the attorney general may transmit the matter to the county attorney of the county in which the land described therein is situated, and thereupon such county attorney shall appear in such proceeding, and represent the state therein. It shall be served upon a domestic corporation governed by chapter 302A whose charter has terminated by dissolution, expiration, or otherwise, by delivering a copy of it to a person, known to the applicant, who held office in the corporation at the time of dissolution and can be found in the state or, if no officer known to the applicant can be found in the state, by publishing the summons in a newspaper printed and published in the county where the application is filed, once each week for three consecutive weeks. It shall be served upon all persons not personally served who are not residents of the state or who cannot be found therein, and upon domestic corporations not governed by chapter 302A whose charter has terminated by dissolution, expiration, or otherwise more than three years prior to the commencement of the action, and upon unknown successors in interests of such corporations, and upon \"all other persons or parties unknown claiming any right, title, estate, lien, or interest in the real estate described in the application herein\" by publishing the same in a newspaper printed and published in the county wherein the application is filed, once each week for three consecutive weeks; provided, if the order for summons or a supplemental order of the court, filed before, during or after the publication of the summons, shall so direct, the summons may be personally served without the state upon any one or more of the defendants who are nonresidents of the state or who cannot be found therein, in like manner and with like effect as such service in a summons in a civil action in the district court; and provided further, that any nonresident defendant, natural or corporate, who can be found in the state of Minnesota and can be personally served therein, may be served personally. The court administrator shall also, at least 20 days before the entry of the decree which shall be entered in the matter, send a copy of the summons by mail to all defendants not served personally who are not residents of the state, and whose place of address is known to applicant or stated in the application, or in the order directing the issuance of the summons. The certificate of the court administrator that the court administrator has mailed the summons, as herein provided, shall be conclusive evidence thereof. Other or further notice of the application for registration may be given in such manner and to such persons as the court or any judge thereof may direct. The summons shall be served at the expense of the applicant and proof of the service shall be made in the same manner as in civil actions. The summons shall be substantially in the following form:\nSUMMONS IN APPLICATION FOR REGISTRATION OF LAND\nState of Minnesota\nss.\nCounty of ..................\nDistrict Court ................ Judicial District.\nIn the matter of the application of (name of applicant) to register the title to the following described real estate situated in ..................... county, Minnesota, namely: (description of land)\n....................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................\nApplicant,\nvs\n(names of defendants) and \"all other persons or parties unknown claiming any right, title, estate, lien or interest in the real estate described in the application herein.\"\nDefendants.\nTHE STATE OF MINNESOTA TO THE ABOVE NAMED DEFENDANTS:\nYou are hereby summoned and required to answer the application of the applicant in the above entitled proceeding and to file your answer to the said application in the office of the court administrator of said court, in said county, within 20 days after service of this summons upon you exclusive of the day of such service, and, if you fail to answer the application within the time aforesaid, the applicant in this proceeding will apply to the court for the relief demanded therein.\nWitness ................. court administrator of said court, and the seal thereof, at ..................., in said county, this ............. day of ..............., ..........\n(Seal)\nWhen the summons has been served, the court acquires jurisdiction of the subject matter of the proceeding, and of all persons who have, or may have, any right, title, interest, or estate in the real estate described in the application, or any lien or charge upon or against it. By the phrase in the summons \"all other persons or parties unknown claiming any right, title, estate, lien, or interest in the real estate described in the application herein,\" all the world are made parties defendant, and shall be bound and concluded by the decree. Any person claiming any right, title, estate, or interest in or lien upon the land who has been served shall be bound by the decree without regard to the nature of the right, title, estate, or interest in or lien upon the land asserted by the person or described in the application, report of the examiner, summons, or otherwise, it being the public policy of the state of Minnesota to give effect to the decree of registration as set forth in section 508.22 as to any such person.",
	"repealed": false
}