{
	"id": "60A.235",
	"url": "https://www.revisor.mn.gov/statutes/cite/60A.235",
	"title": "60A.235 STANDARDS FOR DETERMINING WHETHER CONTRACTS ARE HEALTH PLAN CONTRACTS OR STOP LOSS CONTRACTS.",
	"text": "The purpose of this section is to establish a standard for the determination of whether an insurance policy or other evidence or coverage should be treated as a policy of accident and sickness insurance or a stop loss policy for the purpose of the regulation of the business of insurance. The laws regulating the business of insurance in Minnesota impose distinctly different requirements upon accident and sickness insurance policies and stop loss policies. In particular, the regulation of accident and sickness insurance in Minnesota includes measures designed to reform the health insurance market, to minimize or prohibit selective rating or rejection of employee groups or individual group members based upon health conditions, and to provide access to affordable health insurance coverage regardless of preexisting health conditions. The health care reform provisions enacted in Minnesota will only be effective if they are applied to all insurers and health carriers who in substance, regardless of purported form, engage in the business of issuing health insurance coverage to employees of an employee group. This section applies to insurance companies and health carriers and the policies or other evidence of coverage that they issue. This section does not apply to employers or the benefit plans they establish for their employees.\nFor purposes of this section, the terms defined in this subdivision have the meanings given.\n(a) \"Attachment point\" means the claims amount incurred by an insured group beyond which the insurance company or health carrier incurs a liability for payment.\n(b) \"Direct coverage\" means coverage under which an insurance company or health carrier assumes a direct obligation to an individual, under the policy or evidence of coverage, with respect to health care expenses incurred by the individual or a member of the individual's family.\n(c) \"Expected claims\" means the amount of claims that, in the absence of a stop loss policy or other insurance or evidence of coverage, are projected to be incurred by an employer-sponsored plan covering health care expenses.\n(d) \"Expected plan claims\" means the expected claims less the projected claims in excess of the specific attachment point, adjusted to be consistent with the employer's aggregate contract period.\n(e) \"Health plan\" means a health plan as defined in section 62A.011 and includes group coverage regardless of the size of the group.\n(f) \"Health carrier\" means a health carrier as defined in section 62A.011.\n(a) An insurance company or health carrier issuing or renewing an insurance policy or other evidence of coverage, that provides coverage to an employer for health care expenses incurred under an employer-sponsored plan provided to the employer's employees, retired employees, or their dependents, shall issue the policy or evidence of coverage as a health plan if the policy or evidence of coverage:\n(1) has a specific attachment point for claims incurred per individual that is lower than $20,000; or\n(2) has an aggregate attachment point that is lower than 110 percent of expected claims.\n(b) An insurer shall determine the number of persons in a group, for the purposes of this section, on a consistent basis, at least annually. Where the insurance policy or evidence of coverage applies to a contract period of more than one year, the dollar amounts set forth in paragraph (a), clause (1), must be multiplied by the length of the contract period expressed in years.\n(c) A policy or evidence of coverage issued by an insurance company or health carrier that provides direct coverage of health care expenses of an individual including a policy or evidence of coverage administered on a group basis is a health plan regardless of whether the policy or evidence of coverage is denominated as stop loss coverage.\nAn insurer shall file with the commissioner annually on or before March 15, an actuarial certification certifying that the insurer is in compliance with this section and section 60A.236. The certification shall be in a form and manner, and shall contain information, specified by the commissioner. A copy of the certification shall be retained by the insurer at its principal place of business.\n(a) An insurance company or health carrier that is required to issue a policy or evidence of coverage as a health plan under this section shall, even if the policy or evidence of coverage is denominated as stop loss coverage, comply with all the laws of this state that apply to the health plan, including, but not limited to, chapters 62A, 62C, 62D, 62E, 62L, and 62Q.\n(b) With respect to an employer who had been issued a policy or evidence of coverage denominated as stop loss coverage before August 1, 2009, compliance with this section is required as of the first renewal date occurring on or after August 1, 2009, and applies to policies issued or renewed on or after that date.",
	"repealed": false
}