{
	"id": "126C.63",
	"url": "https://www.revisor.mn.gov/statutes/cite/126C.63",
	"title": "126C.63 DEFINITIONS.",
	"text": "As used in sections 126C.63 to 126C.72, the terms defined in this section shall have the meanings given them.\n\"District\" means any school district defined in the Education Code.\n\"Indebtedness\" or \"debt\" means the net debt of any district computed according to section 475.51, subdivision 4, excluding loans made under sections 126C.61 to 126C.72.\n\"Debt service fund\" means the aggregate of all funds maintained by a district which are appropriated to payment of principal of and interest on its debts as required by chapter 475.\n\"Levy\" means a district's net debt service levy after the reduction of debt service equalization aid under section 123B.53, subdivision 6. For taxes payable in 2003 and later, each district's maximum effort debt service levy for purposes of subdivision 8, must be reduced by an equal number of percentage points if the commissioner of management and budget determines that the levy reduction will not result in a payment from the general fund in the state treasury according to section 16A.641, as would be required under section 126C.72, subdivision 3. A district's levy that is adjusted under this section must not be reduced below 25 percent of the district's adjusted net tax capacity.\n\"Debt service levy\" means the levy for all debt service fund purposes in accordance with chapter 475.\n\"Required debt service levy\" means the total dollar amount needed to be included in the taxes levied by the district in any year for payment of interest and principal falling due on its debts prior to collection of the next ensuing year's debt service levy excluding levies for bonds issued after the later of (1) November 30, 2016, or (2) three years after the date of the district's receipt of a capital loan from the state, and excluding the debt service levy for obligations under sections 123B.595, 123B.61, and 123B.62.\n\"Maximum effort debt service levy\" means the lesser of:\n(1) a levy in whichever of the following amounts is applicable in any district granted a capital loan after January 1, 2002, a levy in total dollar amount computed at a rate of 33.59 percent of adjusted net tax capacity for taxes payable in 2002 and thereafter; or\n(2) the unpaid balance on the district's capital loan after deducting the amount to be paid on the district's capital loan in December of the year in which the levy is certified.\n\"Adjusted net tax capacity\" means, as of any date, the net tax capacity of all taxable property most recently determined by the commissioner of revenue in accordance with the provisions of sections 127A.48 and 273.1325. \"Market value\" means the value of all taxable property in the district on which its net debt limit is based as provided in section 475.53, subdivision 4.\n\"Fund\" means the \"maximum effort school loan fund.\"\n\"School loan bonds\" means bonds issued by the state under section 126C.72 to support the fund and to refund bonds or certificates of indebtedness previously issued for that purpose.\n\"Net proceeds\" of bonds means the amounts received upon their sale less expenses incident to their issuance, sale, and delivery and the amount required to pay and redeem any bonds or certificates of indebtedness refunded thereby.\n\"Year\" means the school year ending on and including June 30 in each calendar year.",
	"repealed": false
}