{
	"id": "502.87",
	"url": "https://www.revisor.mn.gov/statutes/cite/502.87",
	"title": "502.87 REVOCATION AND RELEASE OF A POWER OF APPOINTMENT.",
	"text": "(a) A power of appointment is irrevocable unless the donor reserves the right to revoke it.\n(b) An exercise of power of appointment is irrevocable whenever:\n(1) the donor of a special power manifests an intent that the exercise of the special power be irrevocable; or\n(2) the donee does not manifest in the instrument exercising the power an intent to reserve a power of revocation.\n(c) If the donee in exercising a power reserves a power to revoke the appointment, but does not expressly reserve a power to reappoint, upon the exercise of the power of revocation, the donee may reappoint.\n(d) An instrument exercising a power of appointment is affected by fraud in the same manner as a deed or will executed by an owner or by a trustee of property.\n(a) Any power of appointment, whether exercisable only by deed, only by will, or by either deed or will, and whether general or special, exclusive or nonexclusive, is releasable, either with or without consideration, by written instrument signed by the donee of the power and delivered as provided in paragraph (c).\n(b) A releasable power of appointment may be released with respect to all or any part of the appointive property and may also be released in a manner as to reduce or limit the appointees, or classes of appointees, in whose favor the power is exercisable.\n(c) A release may be delivered to any of the following persons in the order provided:\n(1) any person specified for this purpose in the instrument creating the power;\n(2) if no person is specified as provided in clause (1), any trustee of the property subject to the power; or\n(3) if no person is specified as provided in clause (1) or serving as trustee as provided in clause (2), any person, other than the donee, who might be adversely affected by an exercise of the power.\n(d) In addition to the provisions of paragraph (c), a release may be delivered to the county clerk of the county in which the donee resides or has a place of business or in which the instrument creating the power is filed, to be duly filed by the clerk upon the payment of the fees due for the filing or, if the power was created by will, to the clerk of the probate court having jurisdiction over the estate of the donor.\n(e) This section applies to releases delivered on or after January 1, 2016.",
	"repealed": false
}