{
	"id": "216B.17",
	"url": "https://www.revisor.mn.gov/statutes/cite/216B.17",
	"title": "216B.17 COMPLAINT INVESTIGATION AND HEARING.",
	"text": "On the commission's own motion or upon a complaint made against any public utility by the governing body of any political subdivision, by another public utility, by the department, by any 50 consumers of a particular utility, or by a complainant under section 216B.172 that any of the rates, tolls, tariffs, charges, or schedules or any joint rate or any regulation, measurement, practice, act, or omission affecting or relating to the production, transmission, delivery, or furnishing of natural gas or electricity or any service in connection therewith is in any respect unreasonable, insufficient, or unjustly discriminatory, or that any service is inadequate or cannot be obtained, the commission shall proceed, with notice, to make such investigation as it may deem necessary. The commission may dismiss any complaint without a hearing if in its opinion a hearing is not in the public interest.\nThe commission shall, prior to any formal hearing, notify the public utility complained of that a complaint has been made, and ten days after the notice has been given the commission may proceed to set a time and place for a hearing and an investigation as provided in this section.\nThe commission shall give the public utility and the complainant ten days' notice of the time and place when and where the hearing will be held and the matters to be considered and determined. Both the public utility and complainant are entitled to be heard and to be represented by counsel. A hearing under this section is not a contested case under chapter 14.\nNotice shall also be given to the governing bodies of affected municipalities and counties, and to any other persons the commission shall deem necessary.\nThe notice provided for in subdivisions 2 and 3 may be combined but if combined the notice shall not be less than ten days.\nThe commission shall have the power to hear, determine, and adjust complaints made against any municipally owned gas or electric utility with respect to rates and services upon petition of ten percent of the nonresident consumers of the municipally owned utility or 25 such nonresident consumers whichever is less. The hearing of the complaints shall be governed by this section.\nFor the purposes of this section, public utility shall include cooperative electric associations with respect to service standards and practices only.\nSection 14.60 shall be applicable to all contested cases before the commission.\nIf after making an investigation under subdivision 1 and holding a hearing under this section, the commission finds that all significant factual issues raised have not been resolved to its satisfaction:\n(1) for investigations concerning the reasonableness of rates of a public utility, if the commission is unable to resolve the complaint with the utility, the commission may order the utility to initiate a rate proceeding under section 216B.16, provided, however, that the utility must be allowed at least 120 days after the date of the commission's order to initiate the proceeding; and\n(2) for investigations of other matters, the commission shall order that a contested case proceeding be conducted under chapter 14.\n(a) The commission has authority under this section to investigate, upon complaint or on its own motion, conduct by or on behalf of a telecommunications carrier, telephone company, or cable communications system provider that impacts public utility or cooperative electric association infrastructure. If the commission finds that the conduct damaged or unreasonably interfered with the function of the infrastructure, the commission may take any action authorized under sections 216B.52 to 216B.61 with respect to the provider.\n(b) For purposes of this subdivision:\n(1) \"telecommunications carrier\" has the meaning given in section 237.01, subdivision 6;\n(2) \"telephone company\" has the meaning given in section 237.01, subdivision 7; and\n(3) \"cable communications system provider\" means an owner or operator of a cable communications system, as defined in section 238.02, subdivision 3.",
	"repealed": false
}