{
	"id": "62Q.81",
	"url": "https://www.revisor.mn.gov/statutes/cite/62Q.81",
	"title": "62Q.81 ESSENTIAL HEALTH BENEFIT PACKAGE REQUIREMENTS.",
	"text": "(a) Health plan companies offering individual and small group health plans must include the essential health benefits package required under section 1302(a) of the Affordable Care Act and as described in this subdivision.\n(b) The essential health benefits package means coverage that:\n(1) provides essential health benefits as outlined in the Affordable Care Act;\n(2) limits cost-sharing for such coverage in accordance with the Affordable Care Act, as described in subdivision 2; and\n(3) subject to subdivision 3, provides bronze, silver, gold, or platinum level of coverage in accordance with the Affordable Care Act.\nIf a health plan company offers health plans in any level of coverage specified under section 1302(d) of the Affordable Care Act, as described in subdivision 1, paragraph (b), clause (3), the health plan company shall also offer coverage in that level to individuals who have not attained 21 years of age as of the beginning of a policy year.\nA health plan company that does not provide an individual or small group health plan in the bronze, silver, gold, or platinum level of coverage, as described in subdivision 1, paragraph (b), clause (3), shall be treated as meeting the requirements of section 1302(d) of the Affordable Care Act with respect to any policy year if the health plan company provides a catastrophic plan that meets the requirements of section 1302(e) of the Affordable Care Act.\nFor purposes of this section, \"essential health benefits\" has the meaning given under section 1302(b) of the Affordable Care Act and includes:\n(1) ambulatory patient services;\n(2) emergency services;\n(3) hospitalization;\n(4) laboratory services;\n(5) maternity and newborn care;\n(6) mental health and substance use disorder services, including behavioral health treatment;\n(7) pediatric services, including oral and vision care;\n(8) prescription drugs;\n(9) preventive and wellness services and chronic disease management;\n(10) rehabilitative and habilitative services and devices; and\n(11) additional essential health benefits included in the EHB-benchmark plan, as defined under the Affordable Care Act, and preventive items and services, as defined under section 62Q.46, subdivision 1, paragraph (a).\nThis section does not apply to a dental plan described in section 1311(d)(2)(B)(ii) of the Affordable Care Act.\n(a) A health plan company that offers individual health plans must ensure that, in each geographic area the health plan company services, no fewer than one silver plan and one gold plan the health plan company offers apply a predeductible, flat-dollar amount co-payment structure to the entire drug benefit, including all tiers.\n(b) A health plan company that offers small group health plans must ensure that, in each geographic area the health plan company services, no fewer than one silver plan and one gold plan the health plan company offers apply a predeductible, flat-dollar amount co-payment structure to the entire drug benefit, including all tiers.\n(c) The highest allowable co-payment for the highest cost drug tier for health plans offered pursuant to this subdivision must be no greater than 1/12 of the plan's out-of-pocket maximum for an individual.\n(d) The flat-dollar amount co-payment tier structure for prescription drugs under this subdivision must be graduated and proportionate.\n(e) All individual and small group health plans offered pursuant to this subdivision must be:\n(1) clearly and appropriately named to aid the purchaser in the selection process;\n(2) marketed in the same manner as other health plans offered by the health plan company; and\n(3) offered for purchase to any individual or small group.\n(f) This subdivision does not apply to catastrophic plans, grandfathered plans, large group health plans, health savings accounts, qualified high deductible health benefit plans, limited health benefit plans, or short-term limited-duration health insurance policies.\n(g) A health plan company or a pharmacy benefit manager, as defined in section 62W.02, subdivision 15, must not delay or divide payment to a pharmacy or pharmacy provider, as defined in section 62W.02, subdivision 14, because of the co-payment structure of a health plan offered pursuant to this subdivision.\n(h) Health plan companies must meet the requirements in this subdivision separately for plans offered through MNsure under chapter 62V and plans offered outside of MNsure.\n(i) Notwithstanding section 62A.65, subdivision 2, a health plan company may discontinue offering a health plan under this subdivision if, three years after the date the silver or gold health plan is initially offered, the silver or gold health plan has fewer than 75 enrollees enrolled in the plan. A health plan company discontinuing a plan under this paragraph must only discontinue the silver or gold health plan that has fewer than 75 enrollees and:\n(1) provide notice of the plan's discontinuation in writing, in a form prescribed by the commissioner, to each individual enrolled in the plan at least 90 calendar days before the date the coverage is discontinued;\n(2) offer on a guaranteed issue basis to each individual enrolled the option to purchase an individual health plan currently being offered by the health plan company for individuals in that geographic rating area. An enrollee who does not select an option must be automatically enrolled in the individual health plan closest in actuarial value to the enrollee's current plan; and\n(3) act uniformly without regard to any health status-related factor of enrolled individuals or dependents of enrolled individuals who may become eligible for coverage.\n(j) A health plan company must annually report to the commissioner, as specified by the commissioner, the total enrollment in silver and gold plans under this subdivision.\n(a) A health plan company that offers individual health plans must ensure that no less than one individual health plan at each level of coverage described in subdivision 1, paragraph (b), clause (3), that the health plan company offers in each geographic rating area the health plan company serves conforms to the standard plan parameters determined by the commissioner under paragraph (e).\n(b) An individual health plan offered under this subdivision must be:\n(1) clearly and appropriately labeled as standard plans to aid the purchaser in the selection process;\n(2) marketed as standard plans and in the same manner as other individual health plans offered by the health plan company; and\n(3) offered for purchase to any individual.\n(c) This subdivision does not apply to catastrophic plans, grandfathered plans, small group health plans, large group health plans, health savings accounts, qualified high deductible health benefit plans, limited health benefit plans, or short-term limited-duration health insurance policies.\n(d) Health plan companies must meet the requirements in this subdivision separately for plans offered through MNsure under chapter 62V and plans offered outside of MNsure.\n(e) The commissioner of commerce, in consultation with the commissioner of health, must annually determine standard plan parameters, including but not limited to cost-sharing structure and covered benefits, that comprise a standard plan in Minnesota.\n(f) Notwithstanding section 62A.65, subdivision 2, a health plan company may discontinue offering a health plan under this subdivision if, three years after the date the plan is initially offered, the plan has fewer than 75 enrollees. A health plan company discontinuing a health plan under this paragraph may discontinue a health plan that has fewer than 75 enrollees if it:\n(1) provides notice of the plan's discontinuation in writing, in a form prescribed by the commissioner, to each enrollee of the plan at least 90 calendar days before the date the coverage is discontinued;\n(2) offers on a guaranteed issue basis to each enrollee the option to purchase an individual health plan currently being offered by the health plan company for individuals in that geographic rating area. An enrollee who does not select an option shall be automatically enrolled in the individual health plan closest in actuarial value to the enrollee's current plan; and\n(3) acts uniformly without regard to any health status-related factor of an enrollee or an enrollee's dependents who may become eligible for coverage.",
	"repealed": false
}