{
	"id": "360.067",
	"url": "https://www.revisor.mn.gov/statutes/cite/360.067",
	"title": "360.067 AIRPORT ZONING PERMIT, VARIANCE; ADMINISTRATIVE AGENT.",
	"text": "(a) Airport zoning regulations adopted under sections 360.011 to 360.076 may require that a permit be obtained before a new structure or use may be constructed or established and before an existing use or structure may be substantially changed or substantially altered or repaired. In any event, all regulations shall provide that before a nonconforming structure or tree may be replaced, substantially altered or repaired, rebuilt, allowed to grow higher, or replanted, a permit must be secured from the administrative agency authorized to administer and enforce the regulations, authorizing the replacement, change, or repair. No permit shall be granted that would allow the establishment or creation of an airport hazard or permit a nonconforming structure or tree or nonconforming use to be made or become higher or become a greater hazard to air navigation than it was when the applicable regulation was adopted or than it is when the application for a permit is made.\n(b) Whenever the administrative agency determines that a nonconforming use or nonconforming structure or tree has been abandoned or more than 80 percent torn down, deteriorated, or decayed: (1) no permit shall be granted that would allow the structure or tree to exceed the applicable height limit or otherwise deviate from the zoning regulations; and (2), whether application is made for a permit under this subdivision or not, the agency may by appropriate action compel the owner of the nonconforming structure or tree, at the owner's expense, to lower, remove, reconstruct, or equip the object as may be necessary to conform to the regulations. If the owner of the nonconforming structure or tree neglects or refuses to comply with the order for ten days after notice of the order, the agency may proceed to have the object lowered, removed, reconstructed, or equipped and assess the cost and expense upon the object of the land where it is or was located. Unless an assessment is paid within 90 days from the service of notice on the agent or owner of the object or land, the sum will bear interest at the rate of eight percent per annum until paid, and shall be collected in the same manner as are general taxes.\n(c) Except as provided in this subdivision, all applications for permits shall be granted.\nAny person desiring to erect any structure, or increase the height of any structure, or permit the growth of any tree, or otherwise use the person's property in violation of airport zoning regulations adopted under this chapter, may apply to the board of adjustment, hereinafter provided for, for a variance from the zoning regulations in question. If a person submits an application for a variance by certified mail to the members of the board and the board fails to grant or deny the variance within four months after the last member receives the application, the variance shall be deemed to be granted by the board. When the variance is granted by reason of the failure of the board to act on the variance, the person receiving the variance shall notify the board and the commissioner of transportation by certified mail that the variance has been granted. The applicant shall include a copy of the original application for the variance with this notice to the commissioner. The variance shall be effective 60 days after this notice is received by the commissioner subject to any action taken by the commissioner pursuant to section 360.063, subdivision 6. Such variances shall be allowed where a literal application or enforcement of the regulations would result in practical difficulty or unnecessary hardship and the relief granted would not be contrary to the public interest but do substantial justice and be in accordance with the spirit of the regulations and this chapter; provided, any variance may be allowed subject to any reasonable conditions that the board of adjustment may deem necessary to effectuate the purposes of Laws 1945, chapter 303.\nIn granting any permit or variance under this section, the administrative agency or board of adjustment may, if it deems such action advisable to effectuate the purposes of sections 360.011 to 360.076, and reasonable in the circumstances, so condition such permit or variance as to require the owner of the structure or tree in question to permit the municipality, at its own expense, to install, operate, and maintain thereon such markers and lights as may be necessary to indicate to flyers the presence of an airport hazard.\nIn the case of an airport owned or operated by the state, the state airport zoning board adopting the zoning regulations for such airport, or the commissioner of transportation in case the zoning regulations are adopted by the commissioner as provided herein, shall appoint a local governmental official of a governmental unit in which the airport hazard area is located as the administrative agent. The governmental official so appointed is hereby authorized and directed as part of official duties to exercise the powers and duties of the administrative agency as described in this section and section 360.069.\n(a) Notwithstanding subdivisions 1 and 2, a municipality, county, or joint airport zoning board may include in its custom airport zoning regulations adopted under section 360.0656 an option to permit construction of a structure, an increase or alteration of the height of a structure, or the growth of an existing tree without a variance from height restrictions if the Federal Aviation Administration has analyzed the proposed construction, alteration, or growth under Code of Federal Regulations, title 14, part 77, and has determined the proposed construction, alteration, or growth does not:\n(1) pose a hazard to air navigation;\n(2) require changes to airport or aircraft operations; or\n(3) require any mitigation conditions by the Federal Aviation Administration that cannot be satisfied by the landowner.\n(b) A municipality, county, or joint airport zoning board that permits an exception to height restrictions under this subdivision must require the applicant to file the Federal Aviation Administration's no hazard determination with the applicable zoning administrator. The applicant must obtain written approval of the zoning administrator before construction, alteration, or growth may occur. Failure of the administrator to respond within 60 days to a filing under this subdivision is deemed a denial. The Federal Aviation Administration's no hazard determination does not apply to requests for variation from land use, density, or any other requirement unrelated to the height of structures or the growth of trees.",
	"repealed": false
}