{
	"id": "469.54",
	"url": "https://www.revisor.mn.gov/statutes/cite/469.54",
	"title": "469.54 STATE VALUE CAPTURE.",
	"text": "(a) For purposes of this section, the following terms have the meanings given them.\n(b) \"Appropriation support payments\" means payments from the state to the city pursuant to subdivision 3.\n(c) \"Construction projects\" means expenditures for the constructing, furnishing, commissioning, and equipping of buildings, ancillary facilities, utilities, parking, and other improvements that are located within the district.\n(d) \"Expenditures\" means expenditures made by a private entity on construction projects, including, but not limited to:\n(1) planning, predesign, and design, including architectural, engineering, project management, and similar services;\n(2) legal, regulatory, and other compliance costs of the project;\n(3) land acquisition, demolition of existing improvements, and other site preparation costs;\n(4) construction costs, including all materials and supplies of the project; and\n(5) equipment, furnishings, and fixtures.\nExpenditures excludes supplies and other items with a useful life of less than a year that are not used or consumed in constructing improvements to real property or are otherwise chargeable to capital costs.\n(e) \"Qualified expenditures\" means the total expenditures under paragraph (d) since January 1, 2019, and certified under subdivision 2, and excludes any expenditures for which reimbursement is or will be sought under section 469.53.\nBy May 1 of any year, the city must certify to the commissioner the amount of qualified expenditures required under subdivision 3, paragraph (a). The certification must be made in the form that the commissioner prescribes and include any documentation of and supporting information regarding the qualified expenditures that the commissioner requires. By September 1 of the year in which a certification was submitted, the commissioner must confirm or revise the amount of the qualified expenditures.\n(a) Public financing for the construction of a parking structure for a medical business entity is not available until the commissioner determines that the medical business entity that would benefit from the parking structure to be financed has made at least $50,000,000 in qualified expenditures. The requirements of this paragraph apply to each medical entity individually. Upon certification of the required amount by either medical business entity, public financing for the construction of parking structures benefiting that entity is available.\n(b) No appropriation support payments shall be paid before July 1, 2021. The maximum appropriation support payment paid in fiscal year 2022 is $3,660,000. The maximum appropriation support payment in any subsequent fiscal year is limited to no more than $8,100,000, each subject to paragraph (e). The total amount of appropriation support payments made under this subdivision is limited to an amount sufficient to finance $97,720,000 of public infrastructure projects.\n(c) The city must use the appropriation support payments it receives under this subdivision for public infrastructure projects, including the cost to finance such projects. The city must maintain appropriate records to document the use of the funds under this requirement.\n(d) The commissioner must pay to the city the amount of appropriation support payments determined under this section for the year by September 1.\n(e) In lieu of directly receiving the appropriation support payments, the city may elect to have the state issue appropriation bonds as provided in section 16A.968 to finance up to $97,720,000 of public infrastructure projects. In the event the state issues appropriation bonds for these purposes, the amount of appropriation support payments in any year is reduced by an amount equal to the amount needed from the general fund under section 16A.968, subdivision 8.\n(a) By March 1 of the year following the year in which the parking facilities or structures are constructed within the district, the city must certify to the commissioner:\n(1) the total amount of revenue generated by the parking facilities and structures in the preceding year; and\n(2) the total amount necessary for operational and maintenance expenses of the facilities or structures in the current year.\n(b) By July 1 of each year thereafter, for a period of 25 years, the commissioner must confirm or revise the amounts as reported. An amount equal to 50 percent of the amount of revenue received by the city by the parking structures and facilities in the previous year that is greater than the amount necessary for operational and maintenance expenses of the facilities or structures in the current year must be paid by the city to the commissioner of employment and economic development by September 1 for deposit into the general fund.\nDuring the construction, installation, remodeling, and repairs of any public infrastructure project funded by appropriation support payments, laborers and mechanics at the site must be paid the prevailing wage rate as defined in section 177.42, subdivision 6, and the public infrastructure project is subject to the requirements of sections 177.30 and 177.41 to 177.44.\nNo aid may be paid under this section after fiscal year 2055.\nAn amount sufficient to pay the appropriation support payments authorized under this section to the city is appropriated to the commissioner from the general fund.",
	"repealed": false
}