{
	"id": "315.20",
	"url": "https://www.revisor.mn.gov/statutes/cite/315.20",
	"title": "315.20 CATHEDRALS.",
	"text": "A cathedral for which a constitution and statutes are adopted by the diocesan convention of a diocese in this state of the Protestant Episcopal Church in the United States of America may form a corporation, as follows:\nThe cathedral shall have a certificate prepared containing:\n(1) the name and location of the cathedral;\n(2) the persons who constitute the chapter of the cathedral, and their names, of which chapter the bishop of the diocese and the wardens and vestry members of the cathedral congregation shall be members; and\n(3) the date of the adoption by the diocesan convention of the constitution and statutes of the cathedral.\nThe certificate must be signed and acknowledged by the bishop of the diocese and by a majority of the members of the chapter, and recorded with the county recorder of the county where the cathedral is located.\nUpon the signing, acknowledging, and recording of the certificate with the county recorder of the county of its location, the cathedral becomes a corporation under the name in its certificate. Through its chapter, it may transact the business of the cathedral. In its corporate name, it may acquire or receive, by purchase, gift, grant, devise, or bequest, any property, real, personal, or mixed, and hold, sell, transfer, mortgage, convey, loan, let, or otherwise use the property for the use and benefit of the cathedral if the use does not contravene the laws and usages of the Protestant Episcopal church in the United States of America of this state. It may not divert any gift, grant, or bequest from the purpose specified in writing by the donor or devisor. It may not sell, convey, or mortgage its church or church site, except with the consent of the bishop, in writing, and when first authorized to do so at a meeting of the chapter called for that purpose, nor in contravention of the canons of the diocese or of the general convention of the Protestant Episcopal church in the United States of America.\nThe chapter of the cathedral shall be governed by the constitution and statutes which have been adopted for it by the diocesan convention and any amendments to them as provided in them.",
	"repealed": false
}