{
	"id": "62Q.03",
	"url": "https://www.revisor.mn.gov/statutes/cite/62Q.03",
	"title": "62Q.03 PROCESS FOR RISK ADJUSTMENT SYSTEM.",
	"text": "The purpose of risk adjustment is to reduce the effects of risk selection on health insurance premiums by making monetary transfers from health plan companies that insure lower risk populations to health plan companies that insure higher risk populations. Risk adjustment is needed to: achieve a more equitable, efficient system of health care financing; remove current disincentives in the health care system to insure and provide adequate access for high risk and special needs populations; promote fair competition among health plan companies on the basis of their ability to efficiently and effectively provide services rather than on the risk status of those in a given insurance pool; and help maintain the viability of health plan companies, by protecting them from the financial effects of enrolling a disproportionate number of high risk individuals. It is the commitment of the state to develop and implement a risk adjustment system. The risk adjustment system shall:\n(1) possess a reasonable level of accuracy and administrative feasibility, be adaptable to changes as methods improve, incorporate safeguards against fraud and manipulation, and shall neither reward inefficiency nor penalize for verifiable improvements in health status;\n(2) require participation by all health plan companies providing coverage in the individual, small group, and Medicare supplement markets;\n(3) address unequal distribution of risk between health plan companies, but shall not address the financing of public programs or subsidies for low-income people; and\n(4) be developed and implemented by the Risk Adjustment Association with joint oversight by the commissioners of health and commerce.\n[Repealed, 1995 c 234 art 2 s 36]\n[Repealed, 1995 c 234 art 2 s 36]\n[Repealed, 1995 c 234 art 2 s 36]\n[Repealed, 1995 c 234 art 2 s 36]\n(a) A separate risk adjustment system must be developed for state-run public programs, including medical assistance and MinnesotaCare. The system must be developed in accordance with the general risk adjustment methodologies described in this section, must include factors in addition to age and sex adjustment, and may include additional demographic factors, different targeted conditions, and/or different payment amounts for conditions. The risk adjustment system for public programs must attempt to reflect the special needs related to poverty, cultural, or language barriers and other needs of the public program population.\n(b) The commissioner of human services shall phase in risk adjustment according to the following schedule:\n(1) for the first contract year, no more than ten percent of reimbursements shall be risk adjusted; and\n(2) for the second contract year, no more than 30 percent of reimbursements shall be risk adjusted.\nA risk adjustment system may be developed for the Medicare supplement market. The Medicare supplement risk adjustment system may include a demographic component and may, but is not required to, include a condition-specific risk adjustment component.\nThe Minnesota Risk Adjustment Association is created on July 1, 1994, and may operate as a nonprofit unincorporated association, but is authorized to incorporate under chapter 317A.\nThe provisions of this chapter govern if the provisions of chapter 317A conflict with this chapter. The association may operate under the approved plan of operation and shall be governed in accordance with this chapter and may operate in accordance with chapter 317A. If the association incorporates as a nonprofit corporation under chapter 317A, the filing of the plan of operation meets the requirements of filing articles of incorporation.\nThe association, its transactions, and all property owned by it are exempt from taxation under the laws of this state or any of its subdivisions, including, but not limited to, income tax, sales tax, use tax, and property tax. The association may seek exemption from payment of all fees and taxes levied by the federal government. Except as otherwise provided in this chapter, the association is not subject to the provisions of chapters 14, 60A, and 62A. The association is not a public employer and is not subject to the provisions of chapters 179A and 353. The board of directors and health carriers who are members of the association are exempt from sections 325D.49 to 325D.66 in the performance of their duties as directors and members of the association. The Risk Adjustment Association is subject to the Open Meeting Law.\nThe association is established to develop and implement a private sector risk adjustment system.\nSubject to state oversight set forth in subdivision 10, the association shall:\n(1) develop and implement comprehensive risk adjustment systems for individual, small group, and Medicare supplement markets consistent with the provisions of this chapter;\n(2) submit a plan for the development of the risk adjustment system which identifies appropriate implementation dates consistent with the rating and underwriting restrictions of each market, recommends whether transfers attributable to risk adjustment should be required between the individual and small group markets, and makes other appropriate recommendations to the commissioners of health and commerce by November 5, 1995;\n(3) develop a combination of a demographic risk adjustment system and payments for targeted conditions;\n(4) test an ambulatory care groups (ACGs) and diagnostic cost groups (DCGs) system, and recommend whether such a methodology should be adopted;\n(5) fund the development and testing of the risk adjustment system;\n(6) recommend market conduct guidelines; and\n(7) develop a plan for assessing members for the costs of administering the risk adjustment system.\nThe association shall be governed according to the plan of operation as established in subdivision 8a.\nThe board shall submit a proposed plan of operation by August 15, 1995, to the commissioners of health and commerce for review. The commissioners of health and commerce shall have the authority to approve or reject the plan of operation.\nAmendments to the plan of operation may be made by the commissioners or by the directors of the association, subject to the approval of the commissioners.\nThe association members shall not have access to unaggregated data on individuals or health plan companies. The association shall develop, as a part of the plan of operation, procedures for ensuring that data is collected by an appropriate entity. The commissioners of health and commerce shall have the authority to audit and examine data collected by the association for the purposes of the development and implementation of the risk adjustment system. Data on individuals obtained for the purposes of risk adjustment development, testing, and operation are designated as private data. Data not on individuals which is obtained for the purposes of development, testing, and operation of risk adjustment are designated as nonpublic data, except that the proposed and approved plan of operation, the risk adjustment methodologies examined, the plan for testing, the plan of the risk adjustment system, minutes of meetings, and other general operating information are classified as public data. Nothing in this section is intended to prohibit the preparation of summary data under section 13.05, subdivision 7. The association, state agencies, and any contractors having access to this data shall maintain it in accordance with this classification. The commissioners of health and human services have the authority to collect data from health plan companies as needed for the purpose of developing a risk adjustment mechanism for public programs.\nThe association's activities shall be supervised by the commissioners of health and commerce. The commissioners shall provide specific oversight functions during the development and implementation phases of the risk adjustment system as follows:\n(1) the commissioners shall approve or reject the association's plan for testing risk adjustment methods, the methods to be used, and any changes to those methods;\n(2) the commissioners must have the right to attend and participate in all meetings of the association and its work groups or committees, except for meetings involving privileged communication between the association and its counsel as permitted under section 13D.05, subdivision 3, paragraph (b);\n(3) the commissioners shall approve any consultants or administrators used by the association;\n(4) the commissioners shall approve or reject the association's plan of operation; and\n(5) the commissioners shall approve or reject the plan for the risk adjustment system described in subdivision 7, clause (2).\nIf the commissioners reject any of the plans identified in clauses (1), (4), and (5), the directors shall submit for review an appropriate revised plan within 30 days.\n[Repealed, 1995 c 234 art 2 s 36]\nUpon its implementation, all health plan companies, as a condition of licensure, must participate in the risk adjustment system to be implemented under this section.",
	"repealed": false
}