{
	"id": "82.58",
	"url": "https://www.revisor.mn.gov/statutes/cite/82.58",
	"title": "82.58 LICENSING: APPLICATION.",
	"text": "An applicant for a real estate broker or real estate salesperson license shall be at least 18 years of age at the time of making application for said license.\n(a) An applicant for a license as a real estate broker or real estate salesperson shall make an application in the format prescribed by the commissioner. The application shall be accompanied by the license fee required by this chapter.\n(b) Each application for a real estate broker license or real estate salesperson license shall contain such information as required by the commissioner consistent with the administration of the provisions and purposes of this chapter.\n(c) The application for a real estate salesperson license shall give the applicant's legal name, age, residence address, and the name and place of business of the real estate broker on whose behalf the salesperson is to be acting.\n(d) The commissioner may require such further information as the commissioner deems appropriate to administer the provisions and further the purposes of this chapter.\n(e) In addition to the application for licensure, an applicant for a real estate salesperson license shall submit to the commissioner a copy of the course completion certificate for courses I, II, and III and passing examination results.\nAfter successful completion of the real estate broker's examination, an individual shall have one year from the date of the examination to apply for a broker's license, unless the individual is a salesperson who remains continuously active in the real estate field as a licensee. Failure to apply for the broker's license or to remain continuously active in the real estate field will necessitate a reexamination.\n(a) A business entity applying for a license shall have at least one responsible person individually licensed to act as broker for the brokerage. The business entity broker's license shall extend no authority to act as broker to any person other than the business entity. Each responsible person who intends to act as a broker shall obtain a license.\n(b) A business entity applying for a license shall have at least one responsible person individually licensed to act as broker for the business entity. Each responsible person who intends to act as a broker shall obtain a license.\n(c) An application for a business entity license shall be verified by a responsible person for the business entity.\n(d) A responsible person who ceases to act as broker for a business entity shall notify the commissioner upon said termination. The individual licenses of all salespersons acting on behalf of a brokerage are automatically ineffective upon the revocation or suspension of the license of the brokerage. The commissioner may suspend or revoke the license of a responsible person licensee without suspending or revoking the license of the business entity.\n(e) The application of all responsible persons of a business entity who intend to act as brokers on behalf of a business entity shall accompany the initial license application of the business entity. Responsible persons intending to act as brokers subsequent to the licensing of the business entity shall procure an individual real estate broker's license prior to acting in the capacity of a broker. No responsible person who maintains a salesperson's license may exercise any authority over any trust account administered by the broker nor may they be vested with any supervisory authority over the broker.\n(f) The business entity applicant shall make available upon request, such records and data required by the commissioner for enforcement of this chapter.\n(g) The commissioner may require further information, as the commissioner deems appropriate, to administer the provisions and further the purposes of this chapter.\nAn applicant who obtains an acceptable score on a salesperson's examination must file an application and obtain the license within one year of the date of successful completion of the examination or a second examination must be taken to qualify for the license.\n[Repealed, 2010 c 384 s 104]",
	"repealed": false
}