{
	"id": "256B.19",
	"url": "https://www.revisor.mn.gov/statutes/cite/256B.19",
	"title": "256B.19 DIVISION OF COST.",
	"text": "The state and county share of medical assistance costs not paid by federal funds shall be as follows:\n(1) beginning January 1, 1992, 50 percent state funds and 50 percent county funds for the cost of placement of severely emotionally disturbed children in regional treatment centers;\n(2) beginning January 1, 2003, 80 percent state funds and 20 percent county funds for the costs of nursing facility placements of persons with disabilities under the age of 65 that have exceeded 90 days. This clause shall be subject to chapter 256G and shall not apply to placements in facilities not certified to participate in medical assistance;\n(3) beginning July 1, 2004, 90 percent state funds and ten percent county funds for the costs of placements that have exceeded 90 days in intermediate care facilities for persons with developmental disabilities that have seven or more beds. This provision includes pass-through payments made under section 256B.5015; and\n(4) beginning July 1, 2004, when state funds are used to pay for a nursing facility placement due to the facility's status as an institution for mental diseases (IMD), the county shall pay 20 percent of the nonfederal share of costs that have exceeded 90 days. This clause is subject to chapter 256G.\nFor counties that participate in a Medicaid demonstration project under sections 256B.69 and 256B.71, the division of the nonfederal share of medical assistance expenses for payments made to prepaid health plans or for payments made to health maintenance organizations in the form of prepaid capitation payments, this division of medical assistance expenses shall be 95 percent by the state and five percent by the county of financial responsibility.\nIn counties where prepaid health plans are under contract to the commissioner to provide services to medical assistance recipients, the cost of court ordered treatment ordered without consulting the prepaid health plan that does not include diagnostic evaluation, recommendation, and referral for treatment by the prepaid health plan is the responsibility of the county of financial responsibility.\n[Repealed, 2002 c 277 s 34]\n[Repealed, 1Sp2001 c 9 art 2 s 76]\n[Repealed, 1Sp2017 c 6 art 4 s 67]\n[Repealed, 2009 c 79 art 8 s 86]\nParticipating local governmental entities that own the physical plant or are the license holders of nursing facilities receiving rate adjustments under section 256R.48, shall be responsible for paying the portion of nonfederal costs calculated under section 256R.48, paragraph (d). Payments of the nonfederal share shall be submitted to the commissioner by the 15th day of the month prior to payment to the nursing facility for that month's services. If any participating governmental entity obligated to pay an amount under this subdivision does not make timely payment of the monthly installment, the commissioner shall revoke participation under this subdivision and end payments determined under section 256R.48, to the participating nursing facility effective on the first day of the month for which timely payment was not received. In the event of revocation, the nursing facility may not bill, collect, or retain the amount allowed in section 256R.48, from private-pay residents for days of service on or after the first day of the month following the month in which the revocation occurred.\nFederal funds available for administrative purposes shall be distributed between the state and the county in the same proportion that expenditures were made, except as provided for in section 256.017.\nThe county shall ensure that only the least costly, most appropriate transportation and travel expenses are used. The state may enter into volume purchase contracts, or use a competitive bidding process, whenever feasible, to minimize the costs of transportation services. If the state has entered into a volume purchase contract or used the competitive bidding procedures of chapter 16C to arrange for transportation services, the county may be required to use such arrangements.\nIn counties where a pilot or demonstration project is operated under the medical assistance program, the state may pay 100 percent of the administrative costs for the pilot or demonstration project after June 30, 1990.\n(a) When the commissioner receives information that indicates that a MinnesotaCare program enrollee may be eligible for medical assistance, the commissioner may notify the appropriate local agency of that fact. The local agency must investigate eligibility for medical assistance and take appropriate action and notify the commissioner of that action within 90 days from the date notice is issued. If the person is eligible for medical assistance, the local agency must find eligibility retroactively to the date on which the person met all eligibility requirements.\n(b) When a prepaid health plan under a contract with the state to provide medical assistance services notifies the commissioner that an infant has been or will be born to an enrollee under the contract, the commissioner may notify the appropriate local agency of that fact. The local agency must investigate eligibility for medical assistance for the infant, take appropriate action, and notify the commissioner of that action within 90 days from the date notice is issued. If the infant would have been eligible on the date of birth, the local agency must establish eligibility retroactively to that month.\n(c) For MinnesotaCare program enrollees, if the local agency fails to comply with paragraph (a), the local agency is responsible for the entire cost of MinnesotaCare program services provided from the date the commissioner issues the notice until the date the local agency takes appropriate action on the case and notifies the commissioner of the action. For infants, if the local agency fails to comply with paragraph (b), the commissioner may determine eligibility for medical assistance for the infant for a period of two months, and the local agency shall be responsible for the entire cost of medical assistance services provided for that infant, in addition to a fee of $100 for processing the case. The commissioner shall deduct any obligation incurred under this paragraph from the amount due to the local agency under subdivision 1.\n[Repealed, 2014 c 262 art 2 s 18]",
	"repealed": false
}