{
	"id": "142G.37",
	"url": "https://www.revisor.mn.gov/statutes/cite/142G.37",
	"title": "142G.37 WORK PARTICIPATION CASH BENEFITS.",
	"text": "(a) Within 30 days of exiting the Minnesota family investment program with earnings, the county must assess eligibility for work participation cash benefits of $25 per month to assist in meeting the family's basic needs as the participant continues to move toward self-sufficiency. Payment begins effective the first of the month following exit or termination for MFIP participants.\n(b) To be eligible for work participation cash benefits, the participant shall not receive MFIP assistance during the month and the participant or participants must meet the following work requirements:\n(1) if the participant is a single caregiver and has a child under six years of age, the participant must be employed at least 87 hours per month;\n(2) if the participant is a single caregiver and does not have a child under six years of age, the participant must be employed at least 130 hours per month; or\n(3) if the household is a two-parent family, at least one of the parents must be employed 130 hours per month.\nWhenever a participant is terminated from MFIP and meets the other criteria in this section, work participation cash benefits are available for up to 24 consecutive months.\n(c) Expenditures on the program are maintenance of effort state funds under a separate state program for participants under paragraph (b), clauses (1) and (2). Expenditures for participants under paragraph (b), clause (3), are nonmaintenance of effort funds. Months in which a participant receives work participation cash benefits under this section do not count toward the participant's MFIP 60-month time limit.\n[See Note.]\n(a) Effective December 1, 2014, the work participation cash benefits program shall be suspended.\n(b) The commissioner of children, youth, and families may reinstate the work participation cash benefits program if the United States Department of Human Services determines that the state of Minnesota did not meet the federal TANF work participation rate and sends a notice of penalty to reduce Minnesota's federal TANF block grant authorized under title I of Public Law 104-193, the Personal Responsibility and Work Opportunity Reconciliation Act of 1996, and under Public Law 109-171, the Deficit Reduction Act of 2005.\n(c) The commissioner shall notify the chairs and ranking minority members of the legislative committees with jurisdiction over human services policy and finance of the potential penalty and the commissioner's plans to reinstate the work participation cash benefit program within 30 days of the date the commissioner receives notification that the state failed to meet the federal work participation rate.",
	"repealed": false
}