{
	"id": "282.019",
	"url": "https://www.revisor.mn.gov/statutes/cite/282.019",
	"title": "282.019 LAND SUBJECT TO HAZARDOUS SUBSTANCE OR PETROLEUM RELEASE.",
	"text": "When there is a release or threatened release of a hazardous substance, or pollutant or contaminant, as defined in section 115B.02, or of petroleum as defined in section 115C.02, in or on tax-forfeited land under the authority of a county or the commissioner of natural resources, the county or commissioner shall comply with the provisions of this section.\nWhen managing the land, the county or commissioner of natural resources shall:\n(1) cooperate with the Pollution Control Agency or the commissioner of agriculture, their employees, agents, and contractors, so that the response actions considered necessary under chapter 115B or 115C may be carried out on the property, including granting access to the property and refraining from actions that would interfere with investigation of or response to the release or threatened release;\n(2) refrain from actions that would significantly contribute to the release or threatened release; and\n(3) notify the Pollution Control Agency or the commissioner of agriculture in advance of actions necessary to manage the land which may affect the investigation of or response to the release or threatened release, and follow the direction of the agency when taking such actions.\nThe requirements of this subdivision also apply to a person managing the land under a lease or other similar arrangement with the county or commissioner of natural resources.\n(a) Before transfer of ownership of the land the county auditor, with the approval of the county board, shall:\n(1) prepare and file the affidavit required under section 282.0195;\n(2) set appropriate conditions on the transfer of the land to assure that the transferee and the transferee's successors will grant access for and cooperate with the completion of a response action taken or approved by the Pollution Control Agency or the commissioner of agriculture, including investigation of the release or threatened release, and implementation, operation, maintenance, and monitoring of response actions; and\n(3) set conditions on the use of the land by the transferee and the transferee's successors as required by the Pollution Control Agency to protect the public health and welfare and the environment, assure proper operation, maintenance, and monitoring of completed response actions, and comply with applicable federal and state laws, rules, and regulations.\n(b) The county board may set conditions on the transfer in addition to those under paragraph (a), including requiring the transferee to implement, maintain, operate, or monitor response actions approved by the Pollution Control Agency or the commissioner of agriculture.\nLand described in subdivision 1 may be sold by the county auditor under an alternative sale procedure under this subdivision if the county board determines that an alternate sale procedure will encourage the implementation of response actions needed to address a release in or on the land and will promote the return of the land to the tax rolls. The sale may be public or nonpublic, by sealed bid, negotiation, or other means. The county auditor shall give at least 30 days' written notice of the sale to the Pollution Control Agency and owners of land adjoining the land to be sold. Sale may be restricted to the owners of adjoining land. The land may not be sold for less than its appraised value unless the purchaser agrees to implement response actions approved by the Pollution Control Agency and shows that the appraised value does not adequately reflect the estimated response action costs. The notice of sale shall include the amount of an environmental lien or estimated expenses for cleanup or response actions.\n(a) Prior to or at the time of the forfeiture of any lands, the Pollution Control Agency or the commissioner of agriculture may file an environmental lien under section 514.672 to recover the expenses incurred under section 115B.17 or 115C.03 to respond to a release or threatened release on the land. The agency or the commissioner of agriculture shall provide a copy of the lien to the county assessor. A sale of the land after forfeiture does not discharge or free it from an environmental lien. If continuation of an environmental lien will prohibit the return of the tax-forfeited land to the tax rolls, the county board may request release or reduction of the lien from the Pollution Control Agency or the commissioner of agriculture as provided under section 514.672, subdivision 5.\n(b) When a parcel of tax-forfeited land has been benefited by response actions for which expenses were incurred by the Pollution Control Agency or the commissioner of agriculture under section 115B.17 or 115C.03, and no environmental lien was filed before or at the time of forfeiture, the Pollution Control Agency or the commissioner of agriculture shall certify to the county the expenses that have been incurred. Prior to sale of the parcel, the county board shall compare the amount of the certified expenses with the amount to which the value of the parcel has been enhanced by the response actions and may adjust the appraisal of the land accordingly, adding the expenses as a separate item to the appraisal of the land.",
	"repealed": false
}