{
	"id": "289A.40",
	"url": "https://www.revisor.mn.gov/statutes/cite/289A.40",
	"title": "289A.40 LIMITATIONS ON CLAIMS FOR REFUND.",
	"text": "Unless otherwise provided in this chapter, a claim for a refund of an overpayment of state tax must be filed within 3-1/2 years from the date prescribed for filing the return, plus any extension of time granted for filing the return, but only if filed within the extended time, or one year from the date of an order assessing tax under section 270C.33 or an order determining an appeal under section 270C.35, subdivision 8, or one year from the date of a return made by the commissioner under section 270C.33, subdivision 3, upon payment in full of the tax, penalties, and interest shown on the order or return made by the commissioner, whichever period expires later. Claims for refund, except for taxes under chapter 297A, filed after the 3-1/2 year period but within the one-year period are limited to the amount of the tax, penalties, and interest on the order or return made by the commissioner and to issues determined by the order or return made by the commissioner.\nIn the case of assessments under section 289A.38, subdivision 5 or 6, claims for refund under chapter 297A filed after the 3-1/2 year period but within the one-year period are limited to the amount of the tax, penalties, and interest on the order or return made by the commissioner that are due for the period before the 3-1/2 year period.\nIf the taxpayer meets the requirements for suspending the running of the time period to file a claim for refund under section 6511(h) of the Internal Revenue Code, the time period in subdivision 1 for the taxpayer to file a claim for an individual income tax refund is suspended.\nIf a claim relates to an overpayment because of a failure to deduct a loss due to a bad debt or to a security becoming worthless, the claim is considered timely if filed within seven years from the date prescribed for the filing of the return. A claim relating to an overpayment of taxes under chapter 297A must be filed within 3-1/2 years from the date when the bad debt was (1) written off as uncollectible in the taxpayer's books and records, and (2) either eligible to be deducted for federal income tax purposes or would have been eligible for a bad debt deduction for federal income tax purposes if the taxpayer were required to file a federal income tax return, or within one year from the date the taxpayer's federal income tax return is timely filed claiming the bad debt deduction, whichever period is later. The refund or credit is limited to the amount of overpayment attributable to the loss. \"Bad debt\" for purposes of this subdivision, has the same meaning as that term is used in United States Code, title 26, section 166, except that for a claim relating to an overpayment of taxes under chapter 297A the following are excluded from the calculation of bad debt: financing charges or interest; sales or use taxes charged on the purchase price; uncollectible amounts on property that remain in the possession of the seller until the full purchase price is paid; expenses incurred in attempting to collect any debt; and repossessed property. For purposes of reporting a payment received on previously claimed bad debt under chapter 297A, any payments made on a debt or account are applied first proportionally to the taxable price of the property or service and the sales tax on it, and secondly to interest, service charges, and any other charges.\nA refund or credit must be allowed for a net operating loss carryback to any taxable year authorized by section 290.095, or section 172 of the Internal Revenue Code, but the refund or credit is limited to the amount of overpayment arising from the carryback.\nA property tax refund claim under chapter 290A is not allowed if the initial claim is filed more than one year after the original due date for filing the claim.\nA claim for refund of taxes paid on a transaction not subject to tax under chapter 297A, where the purchaser may apply directly to the commissioner under section 289A.50, subdivision 2a, must be filed within 3-1/2 years from the 20th day of the month following the month of the invoice date for the purchase.\nA claim for refund for taxes paid under chapter 297A on capital equipment must be filed within 3-1/2 years from the 20th day of the month following the month of the invoice date for the purchase of the capital equipment. A claim for refund for taxes imposed on capital equipment under section 297A.63 must be filed within 3-1/2 years from the date prescribed for filing the return, or one year from the date of an order assessing tax under section 270C.33, upon payment in full of the tax, penalties, and interest shown on the order, whichever period expires later.",
	"repealed": false
}