{
	"id": "462C.03",
	"url": "https://www.revisor.mn.gov/statutes/cite/462C.03",
	"title": "462C.03 CITY HOUSING PLAN.",
	"text": "MS 1994 [Repealed, 1995 c 167 s 16]\nIn addition to the requirements provided in subdivisions 2 and 3, if applicable, each program to be developed and administered by a city under a housing plan shall, at a minimum, set forth:\n(a) a general description of the program;\n(b) a designation of the geographic location to which the program will be limited;\n(c) in the case of a program for single family housing, the number and qualifications of lenders eligible to participate in the program;\n(d) in the case of a program for single family housing, the estimated amount of mortgage or rehabilitation loans to be made or purchased in the program;\n(e) the estimated amounts and timing of the sale of revenue bonds required to finance the program, including the funding of appropriate reserves, and paying costs of issuance;\n(f) methods for monitoring the implementation by participants to insure that the program will be consistent with the plan and its objectives;\n(g) the portion, if any, of the state ceiling for qualified mortgage bonds needed for the program;\n(h) an analysis of how the program will meet the needs of low and moderate income families; and\n(i) for mortgage credit certificate programs the program shall additionally set forth, or contain as an exhibit, the following:\n(1) the range of credit certificate rates to be used and how the rates are assigned to certificate recipients;\n(2) the nonissued bond amount as that term is used in section 25(d)(2)(B) of the Internal Revenue Code of 1954, as amended through July 18, 1984;\n(3) the form used to elect under section 25(c)(2)(A)(ii) of the Internal Revenue Code of 1954, as amended through July 18, 1984;\n(4) the plan submitted to the secretary of the treasury pursuant to section 25(d)(3) of the Internal Revenue Code of 1954, as amended through July 18, 1984; and\n(5) how the city will ensure compliance with all of the requirements of section 25 of the Internal Revenue Code of 1954, as amended through July 18, 1984.\nEach single family housing program shall establish limits on gross income for persons and families to be served by the program. The adjusted gross income may not exceed the greater of (a) 110 percent of the median family income as estimated by the United States Department of Housing and Urban Development for the nonmetropolitan county or standard metropolitan statistical area, as the case may be, or (b) 100 percent of the income limits established by the Minnesota Housing Finance Agency in which the city is located; except as provided in subdivision 8. The Minnesota Housing Finance Agency shall provide the relevant income data to any city requesting the data.\nThe single family housing program shall establish maximum purchase prices or appraised values for single family housing eligible for mortgage loans in the program. The maximum purchase price allowable for each dwelling unit shall not exceed three times the income limit established for the program in subdivision 2, except that, for any program or portion of a program undertaken within a targeted area, the maximum purchase price for each dwelling unit shall not exceed four times the income limit established pursuant to subdivision 2.\nAny financial institution as defined in section 47.0151, doing business within the city which is an approved FHA/VA or FNMA/FHLMC lender shall be eligible for consideration for origination of single family housing loans in any city single family housing program. Other lenders may be eligible as provided in the program. Origination of loans in the single family program may not be limited to a single lender unless other eligible lenders are not interested in participating or the program clearly sets forth why a public purpose would be served by confining participation to one lender.\nMS 1994 [Repealed, 1995 c 167 s 16]\nLoans under a single family housing program may not be made to one developer or builder or restricted to housing provided by one developer or builder.\nFifty percent of the money available for loans for each single family housing program subject to the income limits established pursuant to subdivision 2, must be made available to persons and families with adjusted gross incomes of less than 90 percent of the program's income limits for a period of six months from the date when the money becomes available for the program.\nTwenty percent of the aggregate amount of all loans provided under all city housing programs included in the housing plan for single family housing may be provided without regard to income limits or net worth limits if: (a) the single family housing program is used to finance single family housing in a targeted area; or (b) the city has previously developed and administered a housing program for low and moderate income persons and families and the single family housing program will be used to further policies of economic integration, stability and revitalization of residential areas. No single family housing program shall be developed or administered pursuant to this subdivision if the single family housing program will contribute to urban sprawl. A housing program shall be deemed to contribute to urban sprawl if the housing program is to be used to finance single family housing in any previously unincorporated real property annexed by the city pursuant to chapter 414, within one year prior to the date of the resolution adopted pursuant to Laws 1979, Chapter 306.\nThe single family housing program may include limitations or prohibitions on the assumption of the loans or other terms which are inconsistent with section 47.20, subdivision 6 or 6a, for notes or bonds or other obligations issued by the city pursuant to section 462C.07.\nNotwithstanding any provision of this chapter, not more than 20 percent of the aggregate dollar amount of tax-exempt bond proceeds appropriated by any city within any calendar year to make or purchase loans providing single family housing or dwelling units for sale within multifamily housing developments described in section 462C.05, subdivision 3, shall be appropriated to provide single family housing for persons or families, including renters of the single family housing, whose gross income exceeds the limit in section 462C.03, subdivision 2. If 20 percent of the total amount of tax-exempt bond funds so appropriated by the city in any calendar year is expended for housing not within the limit, no additional funds may be expended pursuant to any other similar appropriation until the remaining 80 percent is expended for housing within the limit. Notwithstanding subdivision 2, the city may use taxable bond proceeds for single family housing for persons and families with adjusted gross incomes of up to 175 percent of the median family income as estimated by the United States Department of Housing and Urban Development for the nonmetropolitan county or standard metropolitan statistical area, whichever is appropriate.\nThe single family housing program may provide for loans for rehabilitation of single family housing or for the acquisition of rehabilitated housing. The single family housing program may also provide loans for acquisition of and the discharge of any lien or interest in and rehabilitation of single family housing if:\n(a) the mortgagor to whom the financing is provided is the first resident of the residence after completion of the rehabilitation;\n(b) there is a period of at least 20 years between the date on which the structure was first used and the date on which the physical work on the rehabilitation begins;\n(c) 75 percent or more of the existing external walls of the structure are retained in place as external walls in the rehabilitation process; and\n(d) the expenditures for the rehabilitation equal 25 percent or more of the mortgagor's \"adjusted basis\" (as determined pursuant to the Internal Revenue Code of 1954, as amended through December 31, 1981), in the residence, determined at the time of completion of the rehabilitation, or, if later, the date on which the mortgagor acquires the residence.",
	"repealed": false
}