{
	"id": "88.21",
	"url": "https://www.revisor.mn.gov/statutes/cite/88.21",
	"title": "88.21 RAILROADS; DUTIES; PENALTIES.",
	"text": "On having reason to believe that a certain locomotive caused a fire the commissioner may require the railroad company to forward to the commissioner at once a written report covering the inspection of the fire-protective appliances of such locomotive made next after the occurrence of the fire. Such written report shall be copied from the inspection book required to be kept by the railroad company under subdivision 6.\n(a) All railroad companies operating railroads within this state shall keep their right-of-way cleared of all combustible material and safely dispose of same within limits of their right-of-way, as the commissioner may direct.\n(b) This section shall not be construed to prevent or prohibit any railroad company from piling or keeping upon the right-of-way cross ties or other material necessary in the operation or maintenance of such railroad.\n(c) No railroad company or its employees shall leave a deposit of fire or live coals or hot ashes in the immediate vicinity of forest lands or lands likely to be overrun by fires, and whenever engineers, conductors, or train workers discover untended fires along the right-of-way, or in woodlands adjacent to the railroad, they shall report the same promptly by the most expeditious means available to the nearest station at which an operator is on duty, or to the first available section crew. In season of drought, railroad companies shall give particular instruction to their employees for the prevention and prompt extinguishment of fires, and they shall cause warning signs furnished by the commissioner of natural resources to be posted at their stations, and where a fire occurs along the line of the road, they shall concentrate such help and adopt such measures as shall be available to effectively extinguish it.\nThe commissioner of natural resources may permit the railroad to use devices and appliances for experimental purposes only by written permission during such limited periods and upon such terms and conditions as the commissioner may prescribe; this written permission shall be subject to revocation by the commissioner at any time, and such experimental devices or appliances shall not be permanently adopted unless authorized by law.\nExcept when the ground is covered with snow, no steam or internal combustion engine shall be operated in the vicinity of forest, brush, peat, or grass lands, unless and until the same is provided with a practical and efficient spark arrester device or its equivalent. The railroad company or other owners of such engine shall be held responsible for the good condition of spark arresters.\nAny locomotive inspector appointed by the commissioner is authorized to inspect any locomotive operated in the vicinity of forest, brush, peat, or grass lands, and to enter upon any property for such purpose when the inspector may deem it necessary in order to see that all the provisions of law relating to the subject matter are duly complied with. The inspector shall have access to the records of every person operating a railroad for any purpose, and authority to make copies thereof, showing the locations and movements of all locomotive engines within this state, and is authorized to use such methods as the inspector may deem advisable in making up records and substantiating the inspector's findings.\n(a) A record shall be kept of all examinations required by this section, in a book to be furnished, by every person operating a railroad for any purpose, showing:\n(1) the place and number of each engine inspected;\n(2) the date and hour of day of such inspection;\n(3) a detailed statement, signed by the employee making the same, of any and all repairs, replacements, or renewals made at any time on, or in connection with, spark arresters.\n(b) The book shall always be open for inspection by the commissioner or other authorized officer appointed by the commissioner. A record of all examinations required by this section which is contained in official inspection records of a railroad company, when such records are regularly required by other governmental authority, may constitute a proper record of examinations required by this section in the discretion of the commissioner.\nAny failure of the railroad company and its employees to comply with this section shall be a misdemeanor; and in addition thereto the railroad company shall be liable for all expenses and damages directly and proximately caused by or resulting from such failure of duty. The provisions of this section shall not relieve anyone from any duty or liability under any other law.\nAny person operating a railroad for any purpose shall make written report to the commissioner, in such form as the commissioner may prescribe, covering each fire in the open on or adjacent to the right-of-way of the railroad, within one week after the occurrence of the fire, unless such time shall be extended by written permission of the commissioner; provided, that the provisions of this subdivision shall not be construed to relieve any person from the duty of reporting such fire as required by any other law.",
	"repealed": false
}