{
	"id": "256R.06",
	"url": "https://www.revisor.mn.gov/statutes/cite/256R.06",
	"title": "256R.06 PRIVATE PAY RESIDENTS; REQUIRED PRACTICES.",
	"text": "(a) The total payment rate must not exceed the rate paid by private paying residents for similar services for the same period.\n(b) The medical assistance rate limitation in paragraph (a) shall not apply to retroactive adjustments to the total payment rate established under this chapter unless the facility was in violation of paragraph (a) prior to the retroactive rate adjustment.\n(a) A nursing facility is not eligible to receive medical assistance payments unless it refrains from charging private paying residents rates for similar services which exceed those which are approved by the state agency for medical assistance recipients as determined by the prospective desk audit rate. The nursing facility may (1) charge private paying residents a higher rate for a private room, and (2) charge for special services which are not included in the daily rate if medical assistance residents are charged separately at the same rate for the same services in addition to the daily rate paid by the commissioner.\n(b) Services covered by the payment rate must be the same regardless of payment source.\n(c) Special services, if offered, must:\n(1) be available to all residents in all areas of the nursing facility;\n(2) be charged separately at the same rate; and\n(3) not include services which must be provided by the nursing facility in order to comply with licensure or certification standards and that if not provided would result in a deficiency or violation by the nursing facility. Services beyond those required to comply with licensure or certification standards must not be charged separately as a special service if they were included in the payment rate for the previous reporting period.\n(d) Residents must be free to select or decline special services.\nA nursing facility that violates subdivision 2, 6, or 7 is subject to section 256R.04, subdivisions 7 and 8.\nA nursing facility that charges a private paying resident a rate in violation of subdivision 2 is subject to an action by the state of Minnesota or any of its subdivisions or agencies for civil damages. A private paying resident or the resident's legal representative has a cause of action for civil damages against a nursing facility that charges the resident rates in violation of subdivision 2. The damages awarded shall include three times the payments that result from the violation, together with costs and disbursements, including reasonable attorney fees or their equivalent. A private paying resident or the resident's legal representative, the state, subdivision or agency, or a nursing facility may request a hearing to determine the allowed rate or rates at issue in the cause of action. Within 15 calendar days after receiving a request for such a hearing, the commissioner shall request assignment of an administrative law judge under sections 14.48 to 14.56 to conduct the hearing as soon as possible or according to agreement by the parties. The administrative law judge shall issue a report within 15 calendar days following the close of the hearing. The prohibition set forth in subdivision 2 shall not apply to facilities licensed as boarding care facilities which are not certified as skilled or intermediate care facilities level I or II for reimbursement through medical assistance.\n(a) No increase in nursing facility rates for private paying residents shall be effective unless the nursing facility notifies the resident or person responsible for payment of the increase in writing 30 days before the increase takes effect. The notice must include the amount of the rate increase, the new payment rate, and the date the rate increase takes effect.\nA nursing facility may adjust its rates without giving the notice required by this subdivision when the purpose of the rate adjustment is to reflect a change in the case mix classification of the resident. The nursing facility shall notify private pay residents of any rate increase related to a change in case mix classifications in a timely manner after confirmation of the case mix classification change is received from the Department of Health.\nIf the state fails to set rates as required by section 256R.09, subdivision 1, the time required for giving notice is decreased by the number of days by which the state was late in setting the rates.\n(b) If the state does not set rates by the date required in section 256R.09, subdivision 1, or otherwise provides nursing facilities with retroactive notification of the amount of a rate increase, nursing facilities shall meet the requirement for advance notice by informing the resident or person responsible for payments, on or before the effective date of the increase, that a rate increase will be effective on that date. The requirements of paragraph (a) do not apply to situations described in this paragraph.\nIf the exact amount has not yet been determined, the nursing facility may raise the rates by the amount anticipated to be allowed. Any amounts collected from private pay residents in excess of the allowable rate must be repaid to private pay residents with interest at the rate used by the commissioner of revenue for the late payment of taxes and in effect on the date the rate increase is effective.\nAny nursing facility which has charged a resident a rate for a case mix classification upon admission which is in excess of the rate for the case mix classification established by the commissioner of health and effective on the date of admission, must refund the amount charged in excess of that rate. Refunds must be credited to the next monthly billing or refunded within 15 days of receipt of the case mix classification notice from the Department of Health. Failure to refund the excess charge is a violation of this section.\n(a) When a private pay resident who has not yet been screened by the preadmission screening team is admitted to a nursing facility or boarding care facility, the nursing facility or boarding care facility must notify the resident and the resident's spouse or health care agent of the following:\n(1) their right to retain certain resources under sections 256B.0575, 256B.058, 256B.059, 256B.0595, and 256B.14, subdivision 2; and\n(2) that the federal Medicare hospital insurance benefits program covers posthospital extended care services in a qualified skilled nursing facility for up to 100 days and that there are several limitations on this benefit. The resident and the resident's family or health care agent must be informed about all mechanisms to appeal limitations imposed under this federal benefit program.\n(b) This notice may be included in the nursing facility's or boarding care facility's admission agreement and must clearly explain what resources the resident and spouse may retain if the resident applies for medical assistance. The Department of Human Services must notify nursing facilities and boarding care facilities of changes in the determination of medical assistance eligibility that relate to resources retained by a resident and the resident's spouse.\n(c) The preadmission screening team has primary responsibility for informing all private pay applicants to a nursing facility or boarding care facility of the resources the resident and spouse may retain.",
	"repealed": false
}