{
	"id": "145.87",
	"url": "https://www.revisor.mn.gov/statutes/cite/145.87",
	"title": "145.87 HOME VISITING FOR PREGNANT WOMEN AND FAMILIES WITH YOUNG CHILDREN.",
	"text": "(a) The terms defined in this subdivision apply to this section and have the meanings given them.\n(b) \"Evidence-based home visiting program\" means a program that:\n(1) is based on a clear, consistent program or model that is research-based and grounded in relevant, empirically based knowledge;\n(2) is linked to program-determined outcomes and is associated with a national organization, institution of higher education, or national or state public health institute;\n(3) has comprehensive home visitation standards that ensure high-quality service delivery and continuous quality improvement;\n(4) has demonstrated significant, sustained positive outcomes; and\n(5) either:\n(i) has been evaluated using rigorous randomized controlled research designs and the evaluation results have been published in a peer-reviewed journal; or\n(ii) is based on quasi-experimental research using two or more separate, comparable client samples.\n(c) \"Evidence-informed home visiting program\" means a program that:\n(1) has data or evidence demonstrating effectiveness at achieving positive outcomes for pregnant women or young children; and\n(2) either:\n(i) has an active evaluation of the program; or\n(ii) has a plan and timeline for an active evaluation of the program to be conducted.\n(d) \"Health equity\" means every individual has a fair opportunity to attain the individual's full health potential and no individual is disadvantaged from achieving this potential.\n(e) \"Promising practice home visiting program\" means a program that has shown improvement toward achieving positive outcomes for pregnant women or young children.\n(a) The commissioner of health shall award grants to community health boards, nonprofit organizations, and Tribal nations to start up, sustain, or expand voluntary home visiting programs serving pregnant women or families with young children. Home visiting programs supported under this section shall provide voluntary home visits by early childhood professionals or health professionals, including but not limited to nurses, social workers, early childhood educators, and trained paraprofessionals. Grant money shall be used to:\n(1) establish, sustain, or expand evidence-based, evidence-informed, or promising practice home visiting programs that address health equity and utilize community-driven health strategies;\n(2) serve families with young children or pregnant women who have high needs or are high-risk, including but not limited to a family with low income, a parent or pregnant woman with a mental illness or a substance use disorder, or a parent or pregnant woman experiencing housing instability or domestic abuse; and\n(3) improve program outcomes in two or more of the following areas:\n(i) maternal and newborn health;\n(ii) school readiness and achievement;\n(iii) family economic self-sufficiency;\n(iv) coordination and referral for other community resources and supports;\n(v) reduction in child injuries, abuse, or neglect; or\n(vi) reduction in crime or domestic violence.\n(b) Grants awarded to evidence-informed and promising practice home visiting programs must include money to evaluate program outcomes for up to four of the areas listed in paragraph (a), clause (3).\n(a) In awarding grants, the commissioner shall give priority to community health boards, nonprofit organizations, and Tribal nations seeking to expand home visiting services with community or regional partnerships.\n(b) The commissioner shall allocate at least 75 percent of the grant money awarded each grant cycle to evidence-based home visiting programs that address health equity and up to 25 percent of the grant money awarded each grant cycle to evidence-informed or promising practice home visiting programs that address health equity and utilize community-driven health strategies.\nThe commissioner may provide training and technical assistance and administer and evaluate the program. The commissioner may contract for training, capacity-building support for grantees or potential grantees, technical assistance, and evaluation support.\nAppropriations dedicated to establishing, sustaining, or expanding evidence-based home visiting programs shall, for grants awarded on or after July 1, 2021, be awarded according to this section. This section shall not govern grant awards of federal funds for home visiting programs and shall not govern grant awards using state general fund appropriations dedicated to establishing or expanding nurse-family partnership home visiting programs.",
	"repealed": false
}