{
	"id": "609.2231",
	"url": "https://www.revisor.mn.gov/statutes/cite/609.2231",
	"title": "609.2231 ASSAULT IN THE FOURTH DEGREE.",
	"text": "(a) As used in this subdivision, \"peace officer\" means a person who is licensed under section 626.845, subdivision 1, and effecting a lawful arrest or executing any other duty imposed by law.\n(b) Whoever physically assaults a peace officer is guilty of a gross misdemeanor.\n(c) Whoever commits either of the following acts against a peace officer is guilty of a felony and may be sentenced to imprisonment for not more than three years or to payment of a fine of not more than $6,000, or both: (1) physically assaults the officer if the assault inflicts demonstrable bodily harm; or (2) intentionally throws or otherwise transfers bodily fluids or feces at or onto the officer.\nWhoever assaults any of the following persons and inflicts demonstrable bodily harm is guilty of a felony and may be sentenced to imprisonment for not more than two years or to payment of a fine of not more than $4,000, or both:\n(1) a member of a municipal or volunteer fire department or emergency medical services personnel unit in the performance of the member's duties; or\n(2) a physician, nurse, or other person providing health care services in a hospital emergency department.\nWhoever assaults and inflicts demonstrable bodily harm on an employee of the Department of Natural Resources who is engaged in forest fire activities is guilty of a gross misdemeanor.\nWhoever commits either of the following acts against an employee of a correctional facility as defined in section 241.021, subdivision 1i, against a prosecuting attorney as defined in section 609.221, subdivision 6, clause (4), against a judge as defined in section 609.221, subdivision 6, clause (5), or against a probation officer or other qualified person employed in supervising offenders while the person is engaged in the performance of a duty imposed by law, policy, or rule is guilty of a felony and may be sentenced to imprisonment for not more than two years or to payment of a fine of not more than $4,000, or both:\n(1) assaults the person and inflicts demonstrable bodily harm; or\n(2) intentionally throws or otherwise transfers bodily fluids or feces at or onto the person.\n(a) As used in this subdivision, \"secure treatment facility\" includes facilities listed in sections 253B.02, subdivision 18a, and 253D.02, subdivision 13.\n(b) Whoever, while committed under chapter 253D, Minnesota Statutes 2012, section 253B.185, or Minnesota Statutes 1992, section 526.10, commits either of the following acts against an employee or other individual who provides care or treatment at a secure treatment facility while the person is engaged in the performance of a duty imposed by law, policy, or rule is guilty of a felony and may be sentenced to imprisonment for not more than two years or to payment of a fine of not more than $4,000, or both:\n(1) assaults the person and inflicts demonstrable bodily harm; or\n(2) intentionally throws or otherwise transfers bodily fluids or feces at or onto the person.\n(c) Whoever, while committed under section 253B.18, or admitted under the provision of section 253B.10, subdivision 1, commits either of the following acts against an employee or other individual who supervises and works directly with patients at a secure treatment facility while the person is engaged in the performance of a duty imposed by law, policy, or rule, is guilty of a felony and may be sentenced to imprisonment for not more than two years or to payment of a fine of not more than $4,000, or both:\n(1) assaults the person and inflicts demonstrable bodily harm; or\n(2) intentionally throws or otherwise transfers urine, blood, semen, or feces onto the person.\n(d) The court shall commit a person convicted of violating paragraph (b) to the custody of the commissioner of corrections for not less than one year and one day. The court may not, on its own motion or the prosecutor's motion, sentence a person without regard to this paragraph. A person convicted and sentenced as required by this paragraph is not eligible for probation, parole, discharge, work release, or supervised release, until that person has served the full term of imprisonment as provided by law, notwithstanding the provisions of sections 241.26, 242.19, 243.05, 244.04, 609.12, and 609.135.\n(e) Notwithstanding the statutory maximum sentence provided in paragraph (b), when a court sentences a person to the custody of the commissioner of corrections for a violation of paragraph (b), the court shall provide that after the person has been released from prison, the commissioner shall place the person on conditional release for five years. The terms of conditional release are governed by sections 244.05 and 609.3455, subdivision 6, 7, or 8; and Minnesota Statutes 2004, section 609.109.\n(a) Whoever assaults another in whole or in substantial part because of the victim's or another's actual or perceived race, color, ethnicity, religion, sex, gender, sexual orientation, gender identity, gender expression, age, national origin, or disability as defined in section 363A.03, or because of the victim's actual or perceived association with another person or group of a certain actual or perceived race, color, ethnicity, religion, sex, gender, sexual orientation, gender identity, gender expression, age, national origin, or disability as defined in section 363A.03, may be sentenced to imprisonment for not more than 364 days or to payment of a fine of not more than $3,000, or both.\n(b) Whoever violates the provisions of paragraph (a) within five years of a previous conviction under paragraph (a) is guilty of a felony and may be sentenced to imprisonment for not more than one year and a day or to payment of a fine of not more than $3,000, or both.\nWhoever assaults a school official while the official is engaged in the performance of the official's duties, and inflicts demonstrable bodily harm, is guilty of a gross misdemeanor. As used in this subdivision, \"school official\" includes teachers, school administrators, and other employees of a public or private school.\nA person is guilty of a gross misdemeanor who:\n(1) assaults an agricultural inspector, occupational safety and health investigator, child protection worker, public health nurse, animal control officer, or probation or parole officer while the employee is engaged in the performance of a duty mandated by law, court order, or ordinance;\n(2) knows that the victim is a public employee engaged in the performance of the official public duties of the office; and\n(3) inflicts demonstrable bodily harm.\n(a) A person is guilty of a gross misdemeanor who:\n(1) assaults a community crime prevention group member while the member is engaged in neighborhood patrol;\n(2) should reasonably know that the victim is a community crime prevention group member engaged in neighborhood patrol; and\n(3) inflicts demonstrable bodily harm.\n(b) As used in this subdivision, \"community crime prevention group\" means a community group focused on community safety and crime prevention that:\n(1) is organized for the purpose of discussing community safety and patrolling community neighborhoods for criminal activity;\n(2) is designated and trained by the local law enforcement agency as a community crime prevention group; or\n(3) interacts with local law enforcement regarding community safety issues.\n(a) As used in this subdivision, \"vulnerable adult\" has the meaning given in section 609.232, subdivision 11.\n(b) Whoever assaults and inflicts demonstrable bodily harm on a vulnerable adult, knowing or having reason to know that the person is a vulnerable adult, is guilty of a gross misdemeanor.\nA person is guilty of a gross misdemeanor who:\n(1) assaults a reserve officer as defined in section 626.84, subdivision 1, paragraph (e), who is engaged in the performance of official public duties at the direction of, under the control of, or on behalf of a peace officer or supervising law enforcement officer or agency; and\n(2) should reasonably know that the victim is a reserve officer engaged in the performance of official public duties of the peace officer, or supervising law enforcement officer or agency.\n(a) A person is guilty of a gross misdemeanor who:\n(1) assaults an employee or contractor of a utility or the United States Postal Service while the employee or contractor is engaged in the performance of the employee's or contractor's duties;\n(2) should reasonably know that the victim is an employee or contractor of a utility or the postal service who is:\n(i) performing duties of the victim's employment; or\n(ii) fulfilling the victim's contractual obligations; and\n(3) inflicts demonstrable bodily harm.\n(b) As used in this subdivision, \"utility\" has the meaning given it in section 609.594, subdivision 1, clause (3).\n(a) A person is guilty of a gross misdemeanor if (1) the person assaults a transit operator, or intentionally throws or otherwise transfers bodily fluids onto a transit operator; and (2) the transit operator is acting in the course of the operator's duties and is operating a transit vehicle, aboard a transit vehicle, or otherwise responsible for a transit vehicle. A person convicted under this paragraph may be sentenced to imprisonment for not more than 364 days or to payment of a fine of not more than $3,000, or both.\n(b) For the purposes of this subdivision, \"transit operator\" means a driver or operator of a transit vehicle that is used to provide any of the following services:\n(1) public transportation, as defined in section 174.22, subdivision 7;\n(2) light rail transit service;\n(3) special transportation service under section 473.386, whether provided by the Metropolitan Council or by other providers under contract with the council; or\n(4) commuter rail service.",
	"repealed": false
}