{
	"id": "340A.508",
	"url": "https://www.revisor.mn.gov/statutes/cite/340A.508",
	"title": "340A.508 TAMPERING OR REFILLING BOTTLES.",
	"text": "It is unlawful for a person to sell, offer for sale, or keep for sale alcoholic beverages in a package or bottle which has been refilled or partly refilled.\nIt is unlawful for a person holding a retail intoxicating liquor license or a 3.2 percent malt liquor license, directly or indirectly through an agent, employee, or other person, to dilute or in any manner tamper with the contents of an original package or bottle so as to change its composition or alcoholic content while the contents are in the original package or bottle. Possession on the premises by a licensee of alcoholic beverages in the original package or bottle, differing in composition or alcoholic content from when it was received from the manufacturer or wholesaler from whom it was purchased, is prima facie evidence that the contents of the original package or bottle has been diluted, changed, or tampered with in violation of this section.\nThe commissioner may examine the contents of any container of alcoholic beverages on the premises of any licensee under this chapter or any municipal liquor store, for the purpose of determining the purity of the alcoholic beverages. The commissioner may remove any container, or remove all or part of the contents thereof, for the purpose of conducting tests of purity. The commissioner may order the removal from inventory of any container the contents of which fail to meet standards of purity established by rules adopted under this subdivision, and may order the disposal of the contents. The commissioner may adopt rules that (1) provide standards of purity for alcoholic beverages and procedures for testing for purity, and (2) govern the removal from inventory and disposal of alcoholic beverages that do not meet the commissioner's standards of purity.\nNothing in this section prohibits use by an on-sale intoxicating liquor licensee of a machine to premix and dispense frozen or iced cocktails, provided that the machine is emptied on a daily basis. A machine described in this subdivision need not be visible to the consuming public.\nMixed drinks or cocktails mixed on the premises that are not for immediate consumption may be consumed on the licensed premises subject to the requirements of this subdivision. For purposes of this subdivision, a \"mixed drink\" includes drinks commonly referred to as cocktails, and \"infused beverages\" are alcoholic beverages flavored through infusion with added ingredients. This subdivision requires that:\n(1) the mixed drinks or cocktails be stored, for no longer than 72 hours, in a labeled container in a quantity that does not exceed five gallons;\n(2) infused beverages may be stored in containers in a quantity not to exceed five gallons;\n(3) added flavors and other nonbeverage ingredients included in the mixed drinks or infused beverages shall not include hallucinogenic substances or added pure or supplemental caffeine or other added stimulants including but not limited to guarana, ginseng, and taurine; and\n(4) the licensee keep records as to when the contents in a particular container were mixed and the recipe, including brand names, used for that mixture.",
	"repealed": false
}