{
	"id": "80C.01",
	"url": "https://www.revisor.mn.gov/statutes/cite/80C.01",
	"title": "80C.01 DEFINITIONS.",
	"text": "As used in sections 80C.01 to 80C.22, the terms defined in this section have the meanings here given them.\n\"Advertisement\" means any written or printed communication or any communication by recorded telephone message, radio, television, picture or similar means published in connection with a sale of, or offer to sell, any franchise.\n\"Commissioner\" means the commissioner of commerce.\n(a) \"Franchise\" means (1) a contract or agreement, either express or implied, whether oral or written, for a definite or indefinite period, between two or more persons:\n(i) by which a franchisee is granted the right to engage in the business of offering or distributing goods or services using the franchisor's trade name, trademark, service mark, logotype, advertising, or other commercial symbol or related characteristics;\n(ii) in which the franchisor and franchisee have a community of interest in the marketing of goods or services at wholesale, retail, by lease, agreement, or otherwise; and\n(iii) for which the franchisee pays, directly or indirectly, a franchise fee; or\n(2) a contract, lease, or other agreement, either express or implied, whether oral or written, for a definite or indefinite period, between two or more persons, whereby the franchisee is authorized, permitted, or granted the right to market motor vehicle fuel at retail under the franchisor's trade name, trademark, service mark, logotype, or other commercial symbol or related characteristics owned or controlled by the franchisor; or\n(3) the sale or lease of any products, equipment, chattels, supplies, or services to the purchaser, other than the sale of sales demonstration equipment, materials or samples for a total price of $500 or less to any one person, for the purpose of enabling the purchaser to start a business and in which the seller:\n(i) represents that the seller, lessor, or an affiliate thereof will provide locations or assist the purchaser in finding locations for the use or operation of vending machines, racks, display cases, or similar devices, or currency operated amusement machines or devices, on premises neither owned or leased by the purchaser or seller; or\n(ii) represents that the seller will purchase any or all products made, produced, fabricated, grown, bred, or modified by the purchaser using, in whole or in part, the supplies, services, or chattels sold to the purchaser; or\n(iii) guarantees that the purchaser will derive income from the business which exceeds the price paid to the seller; or\n(4) an oral or written contract or agreement, either expressed or implied, for a definite or indefinite period, between two or more persons, under which a manufacturer, selling security systems through dealers or distributors in this state, requires regular payments from the distributor or dealer as royalties or residuals for products purchased and paid for by the dealer or distributor.\n(b) \"Franchise\" does not include any business which is operated under a lease or license on the premises of the lessor or licensor as long as such business is incidental to the business conducted by the lessor or licensor on such premises, including, without limitation, leased departments, licensed departments, and concessions.\n(c) \"Franchise\" does not include any contract, lease or other agreement whereby the franchisee is required to pay less than $100 on an annual basis, except those franchises identified in paragraph (a), clause (2).\n(d) \"Franchise\" does not include a contract, lease or other agreement between a new motor vehicle manufacturer, distributor, or factory branch and a franchisee whereby the franchisee is granted the right to market automobiles, motorcycles, trucks, truck-tractors, or self-propelled motor homes or campers if the foregoing are designed primarily for the transportation of persons or property on public highways.\n(e) \"Franchise\" does not include a contract, lease, or other agreement or arrangement between two or more air carriers, or between one or more air carriers and one or more foreign air carriers. The terms \"air carrier\" and \"foreign air carrier\" shall have the meanings assigned to them by the Federal Aviation Act, United States Code Appendix, title 49, sections 1301(3) and 1301(22), respectively.\n(f) For purposes of paragraph (a), clause (2), \"franchise\" does not include the marketing of motor vehicle fuel in circumstances where all the following are present:\n(1) the franchisor or an affiliate of the franchisor is not a refiner of motor vehicle fuel, diesel fuel, or gasoline;\n(2) the franchisor's trade name, trademark, service mark, logotype, or other commercial symbol or related characteristics is not used to identify the marketing premises generally, but only the gasoline dispensers, canopy, and gasoline price signage, provided, however, this circumstance is not changed by a voluntary decision by the retailer to identify the buildings on the premises in the manner selected by the retailer;\n(3) the franchisor does not impose any requirements or franchise fee on nonmotor vehicle fuel products or sales, provided this circumstance is not changed by a voluntary decision by the retailer to purchase nonmotor vehicle fuel products from the franchisor or an affiliate of the franchisor; and\n(4) the facility is not leased from the franchisor or affiliate of the franchisor.\n(g) For purposes of this chapter, a person who sells motor vehicle fuel at wholesale who does not own or control, or is not an affiliate of a person who owns or controls, the trademark, trade name, service mark, logotype, or other commercial symbol or related characteristics under which the motor vehicle fuel is sold at retail, is not a franchisor or a franchisee, and is not considered to be part of a franchise relationship.\n\"Franchisee\" means a person to whom a franchise is granted. Unless otherwise stated herein, franchisee shall also include subfranchisor.\n\"Franchisor\" means a person who grants a franchise or an area franchise.\n\"Area franchise\" means any contract or agreement between a franchisor and a subfranchisor whereby the subfranchisor is granted the right, for consideration given in whole or in part for such right, to sell or negotiate the sale of franchises in the name or in behalf of the franchisor. Unless specifically stated otherwise, \"franchise\" includes \"area franchise.\"\n\"Subfranchisor\" means a person to whom an area franchise is granted.\n\"Franchise fee\" means any fee or charge that a franchisee or subfranchisor is required to pay or agrees to pay for the right to enter into a business or to continue a business under a franchise agreement, including, but not limited to, the payment either in lump sum or by installments of an initial capital investment fee, any fee or charges based upon a percentage of gross or net sales whether or not referred to as royalty fees, any payment for goods or services, or any training fees or training school fees or charges; provided, however, that the following shall not be considered the payment of a franchise fee:\n(a) the purchase of goods or agreement to purchase goods at a bona fide wholesale price;\n(b) the purchase of goods or agreement to purchase goods on consignment, if the proceeds remitted by the franchisee from any such sale shall reflect only the bona fide wholesale price of such goods;\n(c) the repayment by the franchisee of a bona fide loan made to the franchisee from the franchisor;\n(d) the purchase of goods or agreement to purchase goods at a bona fide retail price subject to a bona fide commission or compensation plan that in substance reflects only a bona fide wholesale transaction;\n(e) the purchase, at their fair market value, of supplies or fixtures or agreement to so purchase supplies or fixtures necessary to enter into the business or to continue the business under the franchise agreement;\n(f) the purchase or lease, at the fair market value, of real property or agreement to so purchase or lease real property necessary to enter into the business or to continue the business under the franchise agreement.\n\"Fraud and deceit\" are not limited to common law fraud and deceit.\n\"Order\" means a consent, authorization, approval, prohibition or requirement, or other order applicable to a specific case, issued by the commissioner.\n\"Person\" means a natural person, corporation, partnership, trust, or other legal entity.\n\"Publish\" means publicly to issue or circulate by newspaper, mail, radio, or television, or otherwise to disseminate to or place before the public.\n\"Rule\" means any published rule adopted by the commissioner in accordance with chapter 14.\n\"Sale\" or \"sell\" includes every contract or agreement for the sale of, and every contract to sell or dispose of, a franchise or interest in a franchise for value.\n\"Offer\" or \"offer to sell\" includes every attempt to offer to dispose of, and every solicitation of an offer to buy, a franchise or interest in a franchise for value.\n\"Predecessor\" means any person or persons from whom the franchisor acquired, either directly or indirectly, assets constituting 30 percent or more of the franchisor's total assets immediately following the acquisition, during the five-year period preceding the date of the offering circular.\n\"Fractional franchise\" means any franchise relationship in which the franchisee or any of the principal officers or directors of the franchisee, have been in the type of business represented by the franchise relationship for more than two years and the parties anticipated, or should have anticipated, at the date of the agreement establishing the franchise relationship, that the sales arising from the relationship would represent no more than 20 percent of the dollar sales volume of the franchisee.\n\"Assist the purchaser in finding locations\" means to directly assist the purchaser in finding locations, or to refer the purchaser to any resource which assists in finding locations and is affiliated with the seller through common ownership, common control, a referral fee arrangement, or any other business relationship. \"Assist the purchaser in finding locations\" does not include providing to the purchaser a written list of resources which assist in finding locations, provided that none of the resources on the list are affiliated with the seller in any way.\n\"Affiliate\" means any person who controls, is controlled by, or is under common control with, any other person. The term includes, without limitation, partners, business entities with common ownership, principals of any business entity, and subsidiaries, parent companies, or holding companies of any person.\n\"Motor vehicle fuel\" means gasoline of a type distributed for use as a fuel in a self-propelled vehicle designed primarily for use on public streets, roads, and highways, but does not include diesel fuel or specialty fuel.\n\"Specialty fuel\" means a gasoline sold (1) by a refiner who directly or through an affiliate does not own, lease, or have any leasehold or other possessory rights to the marketing premises; and (2) under a trademark or trade name that is different from the trademark, trade name, service mark, logotype, or other commercial symbol used to identify the marketing premises generally.",
	"repealed": false
}