{
	"id": "349.161",
	"url": "https://www.revisor.mn.gov/statutes/cite/349.161",
	"title": "349.161 DISTRIBUTOR LICENSES.",
	"text": "(a) No person may:\n(1) sell, offer for sale, or furnish gambling equipment for use within the state other than for lawful gambling exempt or excluded from licensing, except to an organization licensed for lawful gambling;\n(2) sell, offer for sale, or furnish gambling equipment for use within the state without having obtained a distributor license or a distributor salesperson license under this section except that an organization authorized to conduct bingo by the board may loan bingo hard cards and devices for selecting bingo numbers to another organization authorized to conduct bingo and a linked bingo game provider may provide electronic bingo devices for linked electronic bingo games;\n(3) sell, offer for sale, or furnish gambling equipment for use within the state that is not purchased or obtained from a manufacturer or distributor licensed under this chapter; or\n(4) sell, offer for sale, or furnish gambling equipment for use within the state that has the same serial number as another item of gambling equipment of the same type sold or offered for sale or furnished for use in the state by that distributor.\n(b) No licensed distributor salesperson may sell, offer for sale, or furnish gambling equipment for use within the state without being employed by a licensed distributor or owning a distributor license.\n(c) No distributor or distributor salesperson may also be licensed as a linked bingo game provider under section 349.1635.\nThe board may issue licenses for the sale of gambling equipment to persons who meet the qualifications of this section if the board determines that a license is consistent with the purpose of sections 349.11 to 349.22. Applications must be on a form the board prescribes.\nMS 1992 [Repealed, 1994 c 633 art 5 s 99]\n(a) The annual fee for a distributor's license is $7,000.\n(b) The annual fee for a distributor salesperson license is $150.\n(a) No distributor, distributor salesperson, or other employee of a distributor, may also be a wholesale distributor of alcoholic beverages or an employee of a wholesale distributor of alcoholic beverages.\n(b) No distributor, distributor salesperson, or any representative, agent, affiliate, or other employee of a distributor, may: (1) be involved in the conduct of lawful gambling by an organization; (2) keep or assist in the keeping of an organization's financial records, accounts, and inventories; or (3) prepare or assist in the preparation of tax forms and other reporting forms required to be submitted to the state by an organization.\n(c) No distributor, distributor salesperson, or any representative, agent, affiliate, or other employee of a distributor may provide a lessor of gambling premises any compensation, gift, gratuity, premium, or other thing of value.\n(d) No distributor, distributor salesperson, or any representative, agent, affiliate, or other employee of a distributor may provide an employee or agent of the organization any compensation, gift, gratuity, premium, or other thing of value greater than $25 per organization in a calendar year.\n(e) No distributor, distributor salesperson, or any representative, agent, affiliate, or other employee of a distributor may participate in any gambling activity at any gambling site or premises where gambling equipment purchased or leased from that distributor or distributor salesperson is being used in the conduct of lawful gambling.\n(f) No distributor, distributor salesperson, or any representative, agent, affiliate, or other employee of a distributor may alter or modify any gambling equipment, except to add a \"last ticket sold\" prize sticker for a paper pull-tab game.\n(g) No distributor, distributor salesperson, or any representative, agent, affiliate, or other employee of a distributor may: (1) recruit a person to become a gambling manager of an organization or identify to an organization a person as a candidate to become gambling manager for the organization; or (2) identify for an organization a potential gambling location.\n(h) No distributor or distributor salesperson may purchase or lease gambling equipment for resale or lease to a person for use within the state from any person not licensed as a manufacturer under section 349.163, except for gambling equipment returned from an organization licensed under section 349.16, or exempt or excluded from licensing under section 349.166.\n(i) No distributor or distributor salesperson may sell gambling equipment, except gambling equipment identified as a promotional ticket, to any person for use in Minnesota other than (i) a licensed organization or organization excluded or exempt from licensing, or (ii) the governing body of an Indian tribe.\n(j) No distributor or distributor salesperson may sell or otherwise provide a paper pull-tab or tipboard deal with the symbol required by section 349.163, subdivision 5, paragraph (d), visible on the flare to any person other than in Minnesota to a licensed organization or organization exempt from licensing.\nMS 1992 [Repealed, 1994 c 633 art 5 s 99]\nMS 1992 [Repealed, 1994 c 633 art 5 s 99]\nLicensed distributors shall provide the board upon request with the names and home addresses of all employees. Each distributor and employee of a distributor must have in their possession a picture identification card approved by the board. No person other than an employee of a licensed distributor shall make any sales on behalf of a licensed distributor.\n(a) A licensed distributor that surrenders, withdraws, or otherwise terminates its license must submit to the board, in writing, a termination plan. Termination of a license may occur due to revocation or denial of the license by the board, or by the distributor voluntarily quitting its business. Termination plans must be approved by the executive director.\n(b) The termination plan must include a certified physical inventory in a format prescribed by the board. The certified physical inventory must also be submitted to the commissioner of revenue. The certified physical inventory must include the following information:\n(1) an inventory of all gambling equipment as of the date the form is prepared, including name, form number, bar code information, and quantity of all gambling equipment in the distributor's inventory; and\n(2) plans for disposal of all gambling equipment by the date of termination. After the date on which a license is terminated, it is illegal for a distributor to possess gambling equipment.\n(c) The distributor or its designated agent must keep all invoices and other required documentation related to the sale or disposal of equipment for 3-1/2 years after the license has been terminated.",
	"repealed": false
}