{
	"id": "428A.02",
	"url": "https://www.revisor.mn.gov/statutes/cite/428A.02",
	"title": "428A.02 ESTABLISHMENT OF SPECIAL SERVICE DISTRICT.",
	"text": "The governing body of a city may adopt an ordinance establishing a special service district. Only nonresidential and multiunit residential property located in the special service district may be subject to the charges imposed by the city on the special service district. Other types of property may be included within the boundaries of the special service district but are not subject to the levies or charges imposed by the city on the special service district. If 50 percent or more of the estimated market value of a parcel of property is classified under section 273.13 as commercial, industrial, or vacant land zoned or designated on a land use plan for commercial or industrial use, or public utility for the current assessment year, then the entire taxable market value of the property is subject to a service charge based on net tax capacity for purposes of sections 428A.01 to 428A.10. The ordinance shall describe with particularity the area within the city to be included in the district and the special services to be furnished in the district. The ordinance may not be adopted until after a public hearing has been held on the question. Notice of the hearing shall include the time and place of hearing, a map showing the boundaries of the proposed district, and a statement that all persons owning property in the proposed district that would be subject to a service charge will be given opportunity to be heard at the hearing. Within 30 days after adoption of the ordinance under this subdivision, the governing body shall send a copy of the ordinance to the commissioner of revenue.\nNotice of the hearing must be given by publication in at least two issues of the official newspaper of the city. The two publications must be two weeks apart and the hearing must be held at least three days after the last publication. Not less than ten days before the hearing, notice must also be mailed to the owner of each parcel within the area proposed to be included in the district. For the purpose of giving mailed notice, owners are those shown on the records of the county auditor. Other records may be used to supply the necessary information. For properties that are tax exempt or subject to taxation on a gross earnings basis in lieu of property tax and are not listed on the records of the county auditor, the owners must be ascertained by any practicable means and mailed notice given them. At the public hearing a person affected by the proposed district may testify on any issues relevant to the proposed district. The hearing may be adjourned from time to time and the ordinance establishing the district may be adopted at any time within six months after the date of the conclusion of the hearing by a vote of the majority of the governing body of the city.\nThe city may impose service charges under sections 428A.01 to 428A.10 that are reasonably related to the special services provided. Charges for service shall be as nearly as possible proportionate to the cost of furnishing the service, and may be fixed on the basis of the service directly rendered, or by reference to a reasonable classification of the types of premises to which service is furnished, or on any other equitable basis.\nBefore the ordinance is adopted or at the hearing at which it is to be adopted, any affected landowner may file a written objection with the city clerk asserting that the landowner's property should not be included in the district or should not be subjected to a service charge and objecting to:\n(1) the inclusion of the landowner's property in the district, for the reason that the property would not receive services that are not provided throughout the city to the same degree;\n(2) the levy of a service charge on the landowner's property, for the reason that the property is exempted under sections 428A.01 to 428A.10 or the special law under which the district was created; or\n(3) the fact that neither the landowner's property nor its use is benefited by the proposed special service.\nThe governing body shall make a determination on the objection within 30 days of its filing. Pending its determination, the governing body may delay adoption of the ordinance or it may adopt the ordinance with a reservation that the landowner's property may be excluded from the district or district service charges when the determination is made.\nWithin 30 days after the determination of the objection, any person aggrieved, who is not precluded by failure to object before or at the hearing, or whose failure to object is due to a reasonable cause, may appeal to the district court by serving a notice upon the mayor or city clerk. The notice shall be filed with the court administrator of the district court within ten days after its service. The city clerk shall furnish the appellant a certified copy of the findings and determination of the governing body. The court may affirm the action objected to or, if the appellant's objections have merit, modify or cancel it. If the appellant does not prevail upon the appeal, the costs incurred shall be taxed to the appellant by the court and judgment entered for them. All objections shall be deemed waived unless presented on appeal.",
	"repealed": false
}