{
	"id": "256.963",
	"url": "https://www.revisor.mn.gov/statutes/cite/256.963",
	"title": "256.963 PRIMARY CARE ACCESS INITIATIVE.",
	"text": "(a) The commissioner shall award a grant to implement in Hennepin and Ramsey Counties a web-based primary care access pilot project designed as a collaboration between private and public sectors to connect, where appropriate, a patient with a primary care medical home, and schedule patients into available community-based appointments as an alternative to nonemergency use of the hospital emergency room. The grantee must establish a program that diverts patients presenting at an emergency room for nonemergency care to more appropriate outpatient settings. The program must refer the patient to an appropriate health care professional based on the patient's health care needs and situation. The program must provide the patient with a scheduled appointment that is timely, with an appropriate provider who is conveniently located. If the patient is uninsured and potentially eligible for a Minnesota health care program, the program must connect the patient to a primary care provider, community clinic, or agency that can assist the patient with the application process. The program must also ensure that discharged patients are connected with a community-based primary care provider and assist in scheduling any necessary follow-up visits before the patient is discharged.\n(b) The program must not require a provider to pay a fee for accepting charity care patients or patients enrolled in a Minnesota public health care program.\nThe grantee must report to the commissioner on a quarterly basis the following information:\n(1) the total number of appointments available for scheduling by specialty;\n(2) the average length of time between scheduling and actual appointment;\n(3) the total number of patients referred and whether the patient was insured or uninsured; and\n(4) the total number of appointments resulting in visits completed and number of patients continuing services with the referring clinic.",
	"repealed": false
}