{
	"id": "50.146",
	"url": "https://www.revisor.mn.gov/statutes/cite/50.146",
	"title": "50.146 AUTHORIZED INVESTMENTS; CORPORATIONS.",
	"text": "In addition to other investments authorized by law, a savings bank may invest in the following:\n(a) The preferred stocks of any corporation organized under the laws of the United States or of any state, except banks, bank holding companies and trust companies, provided the net earnings of such corporation available for its fixed charges for five fiscal years next preceding the date of investment shall have averaged per year not less than 1-1/2 times the sum of its annual fixed interest charges, if any, its annual maximum contingent interest, if any, and its annual preferred dividend requirements; and during either of the last two years of such period, such net earnings shall have been not less than 1-1/2 times the sum of its fixed interest charges, if any, contingent interest, if any, and preferred dividend requirements for such year.\n(b) The common stocks of any corporation organized under the laws of the United States or of any state, except banks, bank holding companies and trust companies, provided such stocks are registered on a national securities exchange, and such corporation shall have earned and paid cash dividends on its common stocks in each year for a period of ten fiscal years next preceding the date of investment.\n(c) The stocks and bonds, notes, debentures or any other obligation of any corporation organized under the laws of the United States or of any state, except the stock of banks, bank holding companies and trust companies located in the Ninth Federal Reserve District, provided such investment shall be made with such prudence, discretion, and intelligence as will protect the safety of the principal of such investment as well as the income to be derived therefrom.\nNo investment shall be made by a savings bank pursuant to subdivision 1 in any corporation if the total amounts so invested by it exceeds an amount equal to 15 percent of its assets, or if the total investment in any one corporation exceeds (1) in amount, one-half of one percent of the assets of the savings bank, or (2) in number of shares, one percent of the total issued and outstanding shares of stock of such corporation, or if the total investment pursuant to the provisions of paragraph (c) of subdivision 1 exceeds an amount equal to three percent of the assets of the savings bank, nor shall any investment be made in any corporation with assets of less than ten million dollars.\nInvestments made pursuant to subdivision 1 shall be limited to savings banks organized under the laws of this state.",
	"repealed": false
}