{
	"id": "147A.35",
	"url": "https://www.revisor.mn.gov/statutes/cite/147A.35",
	"title": "147A.35 PHYSICIAN ASSISTANT LICENSURE COMPACT.",
	"text": "The physician assistant (PA) licensure compact is enacted into law and entered into with all other jurisdictions legally joining in it in the form substantially specified in this section.\nARTICLE I\nTITLE\nThis statute shall be known and cited as the physician assistant licensure compact.\nARTICLE II\nDEFINITIONS\nAs used in this compact, and except as otherwise provided, the following terms have the meanings given them.\n(a) \"Adverse action\" means any administrative, civil, equitable, or criminal action permitted by a state's laws that is imposed by a licensing board or other authority against a PA license, license application, or compact privilege such as license denial, censure, revocation, suspension, probation, monitoring of the licensee, or restriction on the licensee's practice.\n(b) \"Charter participating states\" means the states that enacted the compact prior to the commission convening.\n(c) \"Compact privilege\" means the authorization granted by a remote state to allow a licensee from another participating state to practice as a PA to provide medical services or other licensed activities to a patient located in the remote state under the remote state's laws and regulations.\n(d) \"Conviction\" means a finding by a court that an individual is guilty of a felony or misdemeanor offense through adjudication or entry of a plea of guilt or no contest to the charge by the offender.\n(e) \"Criminal background check\" means the submission of fingerprints or other biometric-based information for a license applicant for the purpose of obtaining that applicant's criminal history record information, as defined in Code of Federal Regulations, title 28, part 20, subpart 20.3, clause (d), from the state's criminal history record repository, as defined in Code of Federal Regulations, title 28, part 20, subpart 20.3, clause (f).\n(f) \"Data system\" means the repository of information about licensees, including but not limited to license status and adverse action, that is created and administered under the terms of this compact.\n(g) \"Executive committee\" means a group of directors and ex officio individuals elected or appointed pursuant to article VII, paragraph (f), clause (2).\n(h) \"Impaired practitioner\" means a PA whose practice is adversely affected by a health-related condition that impacts the PA's ability to practice.\n(i) \"Investigative information\" means information, records, and documents received or generated by a licensing board pursuant to an investigation.\n(j) \"Jurisprudence requirement\" means the assessment of an individual's knowledge of the laws and rules governing the practice of a PA in a state.\n(k) \"License\" means current authorization by a state, other than authorization pursuant to a compact privilege, for a PA to provide medical services, which would be unlawful without current authorization.\n(l) \"Licensee\" means an individual who holds a license from a state to provide medical services as a PA.\n(m) \"Licensing board\" means any state entity authorized to license and otherwise regulate PAs.\n(n) \"Medical services\" means health care services provided for the diagnosis, prevention, treatment, cure, or relief of a health condition, injury, or disease, as defined by a state's laws and regulations.\n(o) \"Model compact\" means the model for the PA licensure compact on file with the Council of State Governments or other entity as designated by the commission.\n(p) \"Participating state\" means a state that has enacted this compact.\n(q) \"PA\" means an individual who is licensed as a physician assistant in a state. For purposes of this compact, any other title or status adopted by a state to replace the term \"physician assistant\" shall be deemed synonymous with \"physician assistant\" and shall confer the same rights and responsibilities to the licensee under the provisions of this compact at the time of its enactment.\n(r) \"PA Licensure Compact Commission\" or \"compact commission\" or \"commission\" means the national administrative body created pursuant to article VII, paragraph (a).\n(s) \"Qualifying license\" means an unrestricted license issued by a participating state to provide medical services as a PA.\n(t) \"Remote state\" means a participating state where a licensee who is not licensed as a PA is exercising or seeking to exercise the compact privilege.\n(u) \"Rule\" means a regulation promulgated by an entity that has the force and effect of law.\n(v) \"Significant investigative information\" means investigative information that a licensing board, after an inquiry or investigation that includes notification and an opportunity for the PA to respond if required by state law, has reason to believe is not groundless and, if proven true, would indicate more than a minor infraction.\n(w) \"State\" means any state, commonwealth, district, or territory of the United States.\nARTICLE III\nSTATE PARTICIPATION IN THE COMPACT\n(a) To participate in this compact, a participating state must:\n(1) license PAs;\n(2) participate in the commission's data system;\n(3) have a mechanism in place for receiving and investigating complaints against licensees and license applicants;\n(4) notify the commission, in compliance with the terms of this compact and commission rules, of any adverse action against the licensee or license applicant and the existence of significant investigative information regarding a licensee or license applicant;\n(5) fully implement a criminal background check requirement, within a time frame established by commission rule, by its licensing board receiving the results of a criminal background check and reporting to the commission whether the license applicant has been granted a license;\n(6) fully comply with the rules of the compact commission;\n(7) utilize a recognized national examination such as the National Commission on Certification of Physician Assistants (NCCPA) physician assistant national certifying examination as a requirement for PA licensure; and\n(8) grant the compact privilege to a holder of a qualifying license in a participating state.\n(b) Nothing in this compact prohibits a participating state from charging a fee for granting the compact privilege.\nARTICLE IV\nCOMPACT PRIVILEGE\n(a) To exercise the compact privilege, a licensee must:\n(1) have graduated from a PA program accredited by the Accreditation Review Commission on Education for the Physician Assistant, Inc. or other programs authorized by commission rule;\n(2) hold current NCCPA certification;\n(3) have no felony or misdemeanor convictions;\n(4) have never had a controlled substance license, permit, or registration suspended or revoked by a state or by the United States Drug Enforcement Administration;\n(5) have a unique identifier as determined by commission rule;\n(6) hold a qualifying license;\n(7) have had no revocation of a license or limitation or restriction due to an adverse action on any currently held license;\n(8) if a licensee has had a limitation or restriction on a license or compact privilege due to an adverse action, two years must have elapsed from the date on which the license or compact privilege is no longer limited or restricted due to the adverse action;\n(9) if a compact privilege has been revoked or is limited or restricted in a participating state for conduct that would not be a basis for disciplinary action in a participating state in which the licensee is practicing or applying to practice under a compact privilege, that participating state shall have the discretion not to consider such action as an adverse action requiring the denial or removal of a compact privilege in that state;\n(10) notify the compact commission that the licensee is seeking the compact privilege in a remote state;\n(11) meet any jurisprudence requirement of a remote state in which the licensee is seeking to practice under the compact privilege and pay any fees applicable to satisfying the jurisprudence requirement; and\n(12) report to the commission any adverse action taken by any nonparticipating state within 30 days after the date the action is taken.\n(b) The compact privilege is valid until the expiration or revocation of the qualifying license unless terminated pursuant to an adverse action. The licensee must also comply with all of the requirements of paragraph (a) to maintain the compact privilege in a remote state. If the participating state takes adverse action against a qualifying license, the licensee shall lose the compact privilege in any remote state in which the licensee has a compact privilege until all of the following occur:\n(1) the license is no longer limited or restricted; and\n(2) two years have elapsed from the date on which the license is no longer limited or restricted due to the adverse action.\n(c) Once a restricted or limited license satisfies the requirements of paragraph (b), the licensee must meet the requirements of paragraph (a) to obtain a compact privilege in any remote state.\n(d) For each remote state in which a PA seeks authority to prescribe controlled substances, the PA shall satisfy all requirements imposed by such state in granting or renewing such authority.\nARTICLE V\nDESIGNATION OF THE STATE FROM WHICH LICENSEE IS APPLYING FOR COMPACT PRIVILEGE\nUpon a licensee's application for a compact privilege, the licensee must identify to the commission the participating state from which the licensee is applying, in accordance with applicable rules adopted by the commission, and subject to the following requirements:\n(1) the licensee must provide the commission with the address of the licensee's primary residence and thereafter shall immediately report to the commission any change in the address of the licensee's primary residence; and\n(2) the licensee must consent to accept service of process by mail at the licensee's primary residence on file with the commission with respect to any action brought against the licensee by the commission or a participating state, including a subpoena, with respect to any action brought or investigation conducted by the commission or a participating state.\nARTICLE VI\nADVERSE ACTIONS\n(a) A participating state in which a licensee is licensed shall have exclusive power to impose adverse action against the qualifying license issued by that participating state.\n(b) In addition to the other powers conferred by state law, a remote state shall have the authority, in accordance with existing state due process law, to do the following:\n(1) take adverse action against a PA's compact privilege in the state to remove a licensee's compact privilege or take other action necessary under applicable law to protect the health and safety of its citizens; and\n(2) issue subpoenas for both hearings and investigations that require the attendance and testimony of witnesses and the production of evidence. Subpoenas issued by a licensing board in a participating state for the attendance and testimony of witnesses or the production of evidence from another participating state shall be enforced in the latter state by any court of competent jurisdiction, according to the practice and procedure of that court applicable to subpoenas issued in proceedings pending before it. The issuing authority shall pay any witness fees, travel expenses, mileage, and other fees required by the service statutes of the state in which the witnesses or evidence are located.\n(c) Notwithstanding paragraph (b), clause (1), subpoenas may not be issued by a participating state to gather evidence of conduct in another state that is lawful in that other state, for the purpose of taking adverse action against a licensee's compact privilege or application for a compact privilege in that participating state.\n(d) Nothing in this compact authorizes a participating state to impose discipline against a PA's compact privilege or to deny an application for a compact privilege in that participating state for the individual's otherwise lawful practice in another state.\n(e) For purposes of taking adverse action, the participating state which issued the qualifying license shall give the same priority and effect to reported conduct received from any other participating state as it would if the conduct had occurred within the participating state which issued the qualifying license. In so doing, that participating state shall apply its own state laws to determine appropriate action.\n(f) A participating state, if otherwise permitted by state law, may recover from the affected PA the costs of investigations and disposition of cases resulting from any adverse action taken against that PA.\n(g) A participating state may take adverse action based on the factual findings of a remote state, provided that the participating state follows its own procedures for taking the adverse action.\n(h) Joint investigations:\n(1) in addition to the authority granted to a participating state by its respective state PA laws and regulations or other applicable state law, any participating state may participate with other participating states in joint investigations of licensees; and\n(2) participating states shall share any investigative, litigation, or compliance materials in furtherance of any joint or individual investigation initiated under this compact.\n(i) If an adverse action is taken against a PA's qualifying license, the PA's compact privilege in all remote states shall be deactivated until two years have elapsed after all restrictions have been removed from the state license. All disciplinary orders by the participating state which issued the qualifying license that impose adverse action against a PA's license shall include a statement that the PA's compact privilege is deactivated in all participating states during the pendency of the order.\n(j) If any participating state takes adverse action, it promptly shall notify the administrator of the data system.\nARTICLE VII\nESTABLISHMENT OF THE PA LICENSURE COMPACT COMMISSION\n(a) The participating states hereby create and establish a joint government agency and national administrative body known as the PA Licensure Compact Commission. The commission is an instrumentality of the compact states acting jointly, and is not an instrumentality of any one state. The commission shall come into existence on or after the effective date of the compact as set forth in article XI, paragraph (a).\n(b) Membership, voting, and meetings:\n(1) each participating state shall have and be limited to one delegate selected by that participating state's licensing board or, if the state has more than one licensing board, selected collectively by the participating state's licensing boards;\n(2) the delegate shall be:\n(i) a current PA, physician, or public member of a licensing board or PA council or committee; or\n(ii) an administrator of a licensing board;\n(3) any delegate may be removed or suspended from office as provided by the laws of the state from which the delegate is appointed;\n(4) the participating state board shall fill any vacancy occurring in the commission within 60 days;\n(5) each delegate shall be entitled to one vote on all matters voted on by the commission and shall otherwise have an opportunity to participate in the business and affairs of the commission;\n(6) a delegate shall vote in person or by such other means as provided in the bylaws. The bylaws may provide for delegates' participation in meetings by telecommunications, video conference, or other means of communication;\n(7) the commission shall meet at least once during each calendar year. Additional meetings shall be held as set forth in this compact and the bylaws; and\n(8) the commission shall establish by rule a term of office for delegates.\n(c) The commission shall have the following powers and duties:\n(1) establish a code of ethics for the commission;\n(2) establish the fiscal year of the commission;\n(3) establish fees;\n(4) establish bylaws;\n(5) maintain its financial records in accordance with the bylaws;\n(6) meet and take such actions as are consistent with the provisions of this compact and the bylaws;\n(7) promulgate rules to facilitate and coordinate implementation and administration of this compact. The rules shall have the force and effect of law and shall be binding in all participating states;\n(8) bring and prosecute legal proceedings or actions in the name of the commission, provided that the standing of any state licensing board to sue or be sued under applicable law shall not be affected;\n(9) purchase and maintain insurance and bonds;\n(10) borrow, accept, or contract for services of personnel, including but not limited to employees of a participating state;\n(11) hire employees and engage contractors, elect or appoint officers, fix compensation, define duties, grant such individuals appropriate authority to carry out the purposes of this compact, and establish the commission's personnel policies and programs relating to conflicts of interest, qualifications of personnel, and other related personnel matters;\n(12) accept any and all appropriate donations and grants of money, equipment, supplies, materials, and services, and receive, utilize, and dispose of the same, provided that at all times the commission shall avoid any appearance of impropriety or conflict of interest;\n(13) lease, purchase, accept appropriate gifts or donations of, or otherwise to own, hold, improve, or use, any property, real, personal, or mixed, provided that at all times the commission shall avoid any appearance of impropriety;\n(14) sell, convey, mortgage, pledge, lease, exchange, abandon, or otherwise dispose of any property real, personal, or mixed;\n(15) establish a budget and make expenditures;\n(16) borrow money;\n(17) appoint committees, including standing committees composed of members, state regulators, state legislators or their representatives, and consumer representatives, and such other interested persons as may be designated in this compact and the bylaws;\n(18) provide and receive information from, and cooperate with, law enforcement agencies;\n(19) elect a chair, vice chair, secretary, and treasurer and such other officers of the commission as provided in the commission's bylaws;\n(20) reserve for itself, in addition to those reserved exclusively to the commission under the compact, powers that the executive committee may not exercise;\n(21) approve or disapprove a state's participation in the compact based upon its determination as to whether the state's compact legislation departs in a material manner from the model compact language;\n(22) prepare and provide to the participating states an annual report; and\n(23) perform such other functions as may be necessary or appropriate to achieve the purposes of this compact consistent with the state regulation of PA licensure and practice.\n(d) Meetings of the commission:\n(1) all meetings of the commission that are not closed pursuant to this paragraph shall be open to the public. Notice of public meetings shall be posted on the commission's website at least 30 days prior to the public meeting;\n(2) notwithstanding clause (1), the commission may convene a public meeting by providing at least 24 hours' prior notice on the commission's website, and any other means as provided in the commission's rules, for any of the reasons it may dispense with notice of proposed rulemaking under article IX, paragraph (l);\n(3) the commission may convene in a closed, nonpublic meeting or nonpublic part of a public meeting to receive legal advice or to discuss:\n(i) noncompliance of a participating state with its obligations under this compact;\n(ii) the employment, compensation, discipline, or other matters, practices, or procedures related to specific employees, or other matters related to the commission's internal personnel practices and procedures;\n(iii) current, threatened, or reasonably anticipated litigation;\n(iv) negotiation of contracts for the purchase, lease, or sale of goods, services, or real estate;\n(v) accusing any person of a crime or formally censuring any person;\n(vi) disclosure of trade secrets or commercial or financial information that is privileged or confidential;\n(vii) disclosure of information of a personal nature where disclosure would constitute a clearly unwarranted invasion of personal privacy;\n(viii) disclosure of investigative records compiled for law enforcement purposes;\n(ix) disclosure of information related to any investigative reports prepared by or on behalf of, or for use of, the commission or other committee charged with responsibility of investigation or determination of compliance issues pursuant to this compact;\n(x) legal advice; or\n(xi) matters specifically exempted from disclosure by federal or participating states' statutes;\n(4) if a meeting, or portion of a meeting, is closed pursuant to clause (3), the chair of the meeting or the chair's designee shall certify that the meeting or portion of the meeting may be closed and shall reference each relevant exempting provision; and\n(5) the commission shall keep minutes that fully and clearly describe all matters discussed in a meeting and shall provide a full and accurate summary of actions taken, including a description of the views expressed. All documents considered in connection with an action shall be identified in such minutes. All minutes and documents of a closed meeting shall remain under seal, subject to release by a majority vote of the commission or order of a court of competent jurisdiction.\n(e) Financing of the commission:\n(1) the commission shall pay, or provide for the payment of, the reasonable expenses of its establishment, organization, and ongoing activities;\n(2) the commission may accept any and all appropriate revenue sources, donations, and grants of money, equipment, supplies, materials, and services;\n(3) the commission may levy on and collect an annual assessment from each participating state and may impose compact privilege fees on licensees of participating states to whom a compact privilege is granted, to cover the cost of the operations and activities of the commission and its staff. The cost of the operations and activities of the commission and its staff must be in a total amount sufficient to cover its annual budget as approved by the commission each year for which revenue is not provided by other sources. The aggregate annual assessment amount levied on participating states shall be allocated based upon a formula to be determined by commission rule:\n(i) a compact privilege expires when the licensee's qualifying license in the participating state from which the licensee applied for the compact privilege expires; and\n(ii) if the licensee terminates the qualifying license through which the licensee applied for the compact privilege before its scheduled expiration, and the licensee has a qualifying license in another participating state, the licensee shall inform the commission that it is changing the participating state through which it applies for a compact privilege to the other participating state and pay to the commission any compact privilege fee required by commission rule;\n(4) the commission shall not incur obligations of any kind prior to securing the funds adequate to meet the same, nor shall the commission pledge the credit of any of the participating states, except by and with the authority of the participating state; and\n(5) the commission shall keep accurate accounts of all receipts and disbursements. The receipts and disbursements of the commission shall be subject to the financial review and accounting procedures established under its bylaws. All receipts and disbursements of funds handled by the commission shall be subject to an annual financial review by a certified or licensed public accountant, and the report of the financial review shall be included in and become part of the annual report of the commission.\n(f) The executive committee:\n(1) the executive committee shall have the power to act on behalf of the commission according to the terms of this compact and commission rules;\n(2) the executive committee shall be composed of nine members as follows:\n(i) seven voting members who are elected by the commission from the current membership of the commission;\n(ii) one ex officio, nonvoting member from a recognized national PA professional association; and\n(iii) one ex officio, nonvoting member from a recognized national PA certification organization;\n(3) the ex officio members will be selected by their respective organizations;\n(4) the commission may remove any member of the executive committee as provided in its bylaws;\n(5) the executive committee shall meet at least annually;\n(6) the executive committee shall have the following duties and responsibilities:\n(i) recommend to the entire commission changes to the commission's rules or bylaws, changes to this compact legislation, fees paid by compact participating states such as annual dues, and any commission compact fee charged to licensees for the compact privilege;\n(ii) ensure compact administration services are appropriately provided, contractual or otherwise;\n(iii) prepare and recommend the budget;\n(iv) maintain financial records on behalf of the commission;\n(v) monitor compact compliance of participating states and provide compliance reports to the commission;\n(vi) establish additional committees as necessary;\n(vii) exercise the powers and duties of the commission during the interim between commission meetings, except for issuing proposed rulemaking or adopting commission rules or bylaws, or exercising any other powers and duties exclusively reserved to the commission by the commission's rules; and\n(viii) perform other duties as provided in commission's rules or bylaws;\n(7) all meetings of the executive committee at which it votes or plans to vote on matters in exercising the powers and duties of the commission shall be open to the public, and public notice of such meetings shall be given as public meetings of the commission are given; and\n(8) the executive committee may convene in a closed, nonpublic meeting for the same reasons that the commission may convene in a nonpublic meeting as set forth in paragraph (d), clause (3), and shall announce the closed meeting as the commission is required to under paragraph (d), clause (4), and keep minutes of the closed meeting as the commission is required to under paragraph (d), clause (5).\n(g) Qualified immunity, defense, and indemnification:\n(1) the members, officers, executive director, employees, and representatives of the commission shall be immune from suit and liability, both personally and in their official capacity, for any claim for damage to or loss of property or personal injury or other civil liability caused by or arising out of any actual or alleged act, error, or omission that occurred, or that the person against whom the claim is made had a reasonable basis for believing occurred, within the scope of commission employment, duties, or responsibilities, provided that nothing in this paragraph shall be construed to protect any such person from suit or liability for any damage, loss, injury, or liability caused by the intentional or willful or wanton misconduct of that person. The procurement of insurance of any type by the commission shall not in any way compromise or limit the immunity granted hereunder;\n(2) the commission shall defend any member, officer, executive director, employee, or representative of the commission in any civil action seeking to impose liability arising out of any actual or alleged act, error, or omission that occurred within the scope of commission employment, duties, or responsibilities, or that the person against whom the claim is made had a reasonable basis for believing occurred within the scope of commission employment, duties, or responsibilities, provided that nothing herein shall be construed to prohibit that person from retaining their own counsel at their own expense, and provided further that the actual or alleged act, error, or omission did not result from that person's intentional or willful or wanton misconduct;\n(3) the commission shall indemnify and hold harmless any member, officer, executive director, employee, or representative of the commission for the amount of any settlement or judgment obtained against that person arising out of any actual or alleged act, error, or omission that occurred within the scope of commission employment, duties, or responsibilities, or that such person had a reasonable basis for believing occurred within the scope of commission employment, duties, or responsibilities, provided that the actual or alleged act, error, or omission did not result from the intentional or willful or wanton misconduct of that person;\n(4) except as provided under paragraph (i), venue is proper and judicial proceedings by or against the commission shall be brought solely and exclusively in a court of competent jurisdiction where the principal office of the commission is located. The commission may waive venue and jurisdictional defenses in any proceedings as authorized by commission rules;\n(5) nothing herein shall be construed as a limitation on the liability of any licensee for professional malpractice or misconduct, which shall be governed solely by any other applicable state laws;\n(6) nothing herein shall be construed to designate the venue or jurisdiction to bring actions for alleged acts of malpractice, professional misconduct, negligence, or other such civil action pertaining to the practice of a PA. All such matters shall be determined exclusively by state law other than this compact;\n(7) nothing in this compact shall be interpreted to waive or otherwise abrogate a participating state's state action immunity or state action affirmative defense with respect to antitrust claims under the federal Sherman Act, Clayton Act, or any other state or federal antitrust or anticompetitive law or regulation; and\n(8) nothing in this compact shall be construed to be a waiver of sovereign immunity by the participating states or by the commission.\n(h) Notwithstanding paragraph (g), clause (1), the liability of the executive director, employees, or representatives of the interstate commission, acting within the scope of their employment or duties, may not exceed the limits of liability set forth under the constitution and laws of this state for state officials, employees, and agents. This paragraph expressly incorporates section 3.736, and neither expands nor limits the rights and remedies provided under that statute.\n(i) Except for a claim alleging a violation of this compact, a claim against the commission, its executive director, employees, or representatives alleging a violation of the constitution and laws of this state may be brought in any county where the plaintiff resides. Nothing in this paragraph creates a private right of action.\nARTICLE VIII\nDATA SYSTEM\n(a) The commission shall provide for the development, maintenance, and utilization of a coordinated database and reporting system containing licensure and adverse action information, and the reporting of significant investigative information on all licensed PAs and applicants denied a license in participating states.\n(b) Notwithstanding any other state law to the contrary, a participating state shall submit a uniform data set to the data system on all PAs to whom this compact is applicable, using a unique identifier, as required by the rules of the commission, including:\n(1) identifying information;\n(2) licensure data;\n(3) adverse actions against a license or compact privilege;\n(4) any denial of application for licensure and the reason or reasons for the denial, excluding the reporting of any criminal history record information where prohibited by law;\n(5) the existence of significant investigative information; and\n(6) other information that may facilitate the administration of this compact, as determined by the rules of the commission.\n(c) Significant investigative information pertaining to a licensee in any participating state shall only be available to other participating states.\n(d) The commission shall promptly notify all participating states of any reports it receives of any adverse action taken against a licensee or an individual applying for a license. This adverse action information shall be available to any other participating state.\n(e) Participating states contributing information to the data system may, in accordance with state or federal law, designate information that may not be shared with the public without the express permission of the contributing state. Notwithstanding any such designation, such information shall be reported to the commission through the data system.\n(f) Any information submitted to the data system that is subsequently expunged by federal law or the laws of the participating state contributing the information shall be removed from the data system upon reporting of such by the participating state to the commission.\n(g) The records and information provided to a participating state pursuant to this compact or through the data system, when certified by the commission or an agent thereof, shall constitute the authenticated business records of the commission and shall be entitled to any associated hearsay exception in any relevant judicial, quasi-judicial, or administrative proceedings in a participating state.\nARTICLE IX\nRULEMAKING\n(a) The commission shall exercise its rulemaking powers pursuant to the criteria set forth in this article and the rules adopted thereunder. Commission rules shall become binding as of the date specified by the commission for each rule.\n(b) The commission shall promulgate reasonable rules in order to effectively and efficiently implement and administer this compact and achieve its purposes. A commission rule shall be invalid and have no force or effect only if a court of competent jurisdiction holds that the rule is invalid because the commission exercised its rulemaking authority in a manner that is beyond the scope of the purposes of this compact, or the powers granted hereunder, or based upon another applicable standard of review.\n(c) The rules of the commission shall have the force of law in each participating state, provided however that where the rules of the commission conflict with the laws of the participating state that establish the medical services a PA may perform in the participating state, as held by a court of competent jurisdiction, the rules of the commission shall be ineffective in that state to the extent of the conflict.\n(d) If a majority of the legislatures of the participating states rejects a commission rule, by enactment of a statute or resolution in the same manner used to adopt the compact within four years of the date of adoption of the rule, then such rule shall have no further force and effect in any participating state or in any state applying to participate in the compact.\n(e) Rules or amendments to the rules shall be adopted at a regular or special meeting of the commission.\n(f) Prior to promulgation and adoption of a final rule or rules by the commission and at least 30 days in advance of the meeting at which the rule will be considered and voted upon, the commission shall file a notice of proposed rulemaking:\n(1) on the website of the commission or other publicly accessible platform;\n(2) to persons who have requested notice of the commission's notices of proposed rulemaking; and\n(3) in such other ways as the commission may specify by rule.\n(g) The notice of proposed rulemaking shall include:\n(1) the time, date, and location of the public hearing on the proposed rule;\n(2) the time, date, and location of the public hearing in which the proposed rule will be considered and voted upon;\n(3) the text of the proposed rule and the reason for the proposed rule;\n(4) a request for comments on the proposed rule from any interested person and the date by which written comments must be received; and\n(5) the manner in which interested persons may submit notice to the commission of their intention to attend the public hearing and any written comments.\n(h) Prior to adoption of a proposed rule, the commission shall allow persons to submit written data, facts, opinions, and arguments, which shall be made available to the public.\n(i) If the hearing is held via electronic means, the commission shall publish the mechanism for access to the electronic hearing:\n(1) all persons wishing to be heard at the hearing shall notify the commission of their desire to appear and testify at the hearing, not less than five business days before the scheduled date of the hearing, as directed in the notice of proposed rulemaking;\n(2) hearings shall be conducted in a manner providing each person who wishes to comment a fair and reasonable opportunity to comment orally or in writing;\n(3) all hearings shall be recorded. A copy of the recording and the written comments, data, facts, opinions, and arguments received in response to the proposed rulemaking shall be made available to a person on request; and\n(4) nothing in this section shall be construed as requiring a separate hearing on each rule. Proposed rules may be grouped for the convenience of the commission at hearings required by this article.\n(j) Following the public hearing, the commission shall consider all written and oral comments timely received.\n(k) The commission shall, by majority vote of all delegates, take final action on the proposed rule and shall determine the effective date of the rule, if adopted, based on the rulemaking record and the full text of the rule. The commission:\n(1) shall, if adopted, post the rule on the commission's website;\n(2) may adopt changes to the proposed rule provided the changes do not expand the original purpose of the proposed rule;\n(3) shall provide on its website an explanation of the reasons for substantive changes made to the proposed rule as well as reasons for substantive changes not made that were recommended by commenters; and\n(4) shall determine a reasonable effective date for the rule. Except for an emergency as provided in paragraph (l), the effective date of the rule shall be no sooner than 30 days after the commission issued the notice that it adopted the rule.\n(l) Upon determination that an emergency exists, the commission may consider and adopt an emergency rule with 24 hours' prior notice, without the opportunity for comment or hearing, provided that the usual rulemaking procedures provided in the compact and in this article shall be retroactively applied to the rule as soon as reasonably possible, in no event later than 90 days after the effective date of the rule. For the purposes of this provision, an emergency rule is one that must be adopted immediately by the commission in order to:\n(1) meet an imminent threat to public health, safety, or welfare;\n(2) prevent a loss of commission or participating state funds;\n(3) meet a deadline for the promulgation of a commission rule that is established by federal law or rule; or\n(4) protect public health and safety.\n(m) The commission or an authorized committee of the commission may direct revisions to a previously adopted commission rule for purposes of correcting typographical errors, errors in format, errors in consistency, or grammatical errors. Public notice of any revisions shall be posted on the website of the commission. The revision shall be subject to challenge by any person for a period of 30 days after posting. The revision may be challenged only on grounds that the revision results in a material change to a rule. A challenge shall be made as set forth in the notice of revisions and delivered to the commission prior to the end of the notice period. If no challenge is made, the revision will take effect without further action. If the revision is challenged, the revision may not take effect without the approval of the commission.\n(n) No participating state's rulemaking requirements shall apply under this compact.\nARTICLE X\nOVERSIGHT, DISPUTE RESOLUTION, AND ENFORCEMENT\n(a) Oversight:\n(1) the executive and judicial branches of state government in each participating state shall enforce this compact and take all actions necessary and appropriate to implement the compact;\n(2) venue is proper and judicial proceedings by or against the commission shall be brought solely and exclusively in a court of competent jurisdiction where the principal office of the commission is located. The commission may waive venue and jurisdictional defenses to the extent it adopts or consents to participate in alternative dispute resolution proceedings. Nothing herein shall affect or limit the selection or propriety of venue in any action against a licensee for professional malpractice, misconduct, or any such similar matter; and\n(3) the commission shall be entitled to receive service of process in any such proceeding regarding the enforcement or interpretation of the compact or the commission's rules and shall have standing to intervene in such a proceeding for all purposes. Failure to provide service of process to the commission shall render a judgment or order void as to the commission, this compact, or commission rules.\n(b) Default, technical assistance, and termination:\n(1) if the commission determines that a participating state has defaulted in the performance of its obligations or responsibilities under this compact or the commission rules, the commission shall:\n(i) provide written notice to the defaulting state and other participating states describing the default, the proposed means of curing the default, or any other action that the commission may take; and\n(ii) offer remedial training and specific technical assistance regarding the default;\n(2) if a state in default fails to cure the default, the defaulting state may be terminated from this compact upon an affirmative vote of a majority of the delegates of the participating states, and all rights, privileges, and benefits conferred by this compact may be terminated on the effective date of termination. A cure of the default does not relieve the offending state of obligations or liabilities incurred during the period of default;\n(3) termination of participation in this compact shall be imposed only after all other means of securing compliance have been exhausted. Notice of intent to suspend or terminate shall be given by the commission to the governor, the majority and minority leaders of the defaulting state's legislature, and the licensing board or boards of each of the participating states;\n(4) a state that has been terminated is responsible for all assessments, obligations, and liabilities incurred through the effective date of termination, including obligations that extend beyond the effective date of termination;\n(5) the commission shall not bear any costs related to a state that is found to be in default or that has been terminated from this compact, unless agreed upon in writing between the commission and the defaulting state;\n(6) the defaulting state may appeal its termination from the compact by the commission by petitioning the United States District Court for the District of Columbia or the federal district where the commission has its principal offices. The prevailing member shall be awarded all costs of such litigation, including reasonable attorney fees; and\n(7) upon the termination of a state's participation in the compact, the state shall immediately provide notice to all licensees within that state of such termination:\n(i) licensees who have been granted a compact privilege in that state shall retain the compact privilege for 180 days following the effective date of such termination; and\n(ii) licensees who are licensed in that state who have been granted a compact privilege in a participating state shall retain the compact privilege for 180 days, unless the licensee also has a qualifying license in a participating state or obtains a qualifying license in a participating state before the 180-day period ends, in which case the compact privilege shall continue.\n(c) Dispute resolution:\n(1) upon request by a participating state, the commission shall attempt to resolve disputes related to this compact that arise among participating states and between participating and nonparticipating states; and\n(2) the commission shall promulgate a rule providing for both mediation and binding dispute resolution for disputes, as appropriate.\n(d) Enforcement:\n(1) the commission, in the reasonable exercise of its discretion, shall enforce the provisions of this compact and rules of the commission;\n(2) if compliance is not secured after all means to secure compliance have been exhausted, by majority vote, the commission may initiate legal action in the United States District Court for the District of Columbia or the federal district where the commission has its principal offices against a participating state in default, to enforce compliance with the provisions of this compact and the commission's promulgated rules and bylaws. The relief sought may include both injunctive relief and damages. In the event judicial enforcement is necessary, the prevailing member shall be awarded all costs of such litigation, including reasonable attorney fees; and\n(3) the remedies herein shall not be the exclusive remedies of the commission. The commission may pursue any other remedies available under federal or state law.\n(e) Legal action against the commission:\n(1) a participating state may initiate legal action against the commission in the United States District Court for the District of Columbia or the federal district where the commission has its principal offices to enforce compliance with the provisions of the compact and the commission's rules. The relief sought may include both injunctive relief and damages. In the event judicial enforcement is necessary, the prevailing party shall be awarded all costs of such litigation, including reasonable attorney fees; and\n(2) no person other than a participating state shall enforce this compact against the commission.\nARTICLE XI\nDATE OF IMPLEMENTATION OF THE PA LICENSURE COMPACT COMMISSION\n(a) This compact shall come into effect on the date on which the compact statute is enacted into law in the seventh participating state.\n(b) On or after the effective date of the compact, the commission shall convene and review the enactment of each of the charter participating states to determine if the statute enacted by each charter participating state is materially different than the model compact. A charter participating state whose enactment is found to be materially different from the model compact shall be entitled to the default process set forth in article X, paragraph (b).\n(c) If any participating state later withdraws from the compact or its participation is terminated, the commission shall remain in existence and the compact shall remain in effect even if the number of participating states should be less than seven. Participating states enacting the compact subsequent to the commission convening shall be subject to the process set forth in article VII, paragraph (c), clause (21), to determine if their enactments are materially different from the model compact and whether they qualify for participation in the compact.\n(d) Any participating state enacting the compact subsequent to the seven initial charter participating states shall be subject to the process set forth in article VII, paragraph (c), clause (21), to determine if the state's enactment is materially different from the model compact and whether the state qualifies for participation in the compact.\n(e) All actions taken for the benefit of the commission or in furtherance of the purposes of the administration of the compact prior to the effective date of the compact or the commission coming into existence shall be considered to be actions of the commission unless specifically repudiated by the commission.\n(f) Any state that joins this compact shall be subject to the commission's rules and bylaws as they exist on the date on which this compact becomes law in that state. Any rule that has been previously adopted by the commission shall have the full force and effect of law on the day this compact becomes law in that state.\n(g) Any participating state may withdraw from this compact by enacting a statute repealing the same:\n(1) a participating state's withdrawal shall not take effect until 180 days after enactment of the repealing statute. During this 180-day period, all compact privileges that were in effect in the withdrawing state and were granted to licensees licensed in the withdrawing state shall remain in effect. If any licensee licensed in the withdrawing state is also licensed in another participating state or obtains a license in another participating state within the 180 days, the licensee's compact privileges in other participating states shall not be affected by the passage of the 180 days;\n(2) withdrawal shall not affect the continuing requirement of the state licensing board or boards of the withdrawing state to comply with the investigative and adverse action reporting requirements of this compact prior to the effective date of withdrawal; and\n(3) upon the enactment of a statute withdrawing a state from this compact, the state shall immediately provide notice of such withdrawal to all licensees within that state. Such withdrawing state shall continue to recognize all licenses granted pursuant to this compact for a minimum of 180 days after the date of such notice of withdrawal.\n(h) Nothing contained in this compact shall be construed to invalidate or prevent any PA licensure agreement or other cooperative arrangement between participating states or a participating state and a nonparticipating state that does not conflict with the provisions of this compact.\n(i) This compact may be amended by the participating states. No amendment to this compact shall become effective and binding upon any participating state until it is enacted materially in the same manner into the laws of all participating states, as determined by the commission.\nARTICLE XII\nCONSTRUCTION AND SEVERABILITY\n(a) This compact and the commission's rulemaking authority shall be liberally construed so as to effectuate the purposes of the compact and its implementation and administration. Provisions of the compact expressly authorizing or requiring the promulgation of rules shall not be construed to limit the commission's rulemaking authority solely for those purposes.\n(b) The provisions of this compact shall be severable and if any phrase, clause, sentence, or provision of this compact is held by a court of competent jurisdiction to be contrary to the constitution of any participating state, of a state seeking participation in the compact, or of the United States, or the applicability thereof to any government, agency, person, or circumstance is held to be unconstitutional by a court of competent jurisdiction, the validity of the remainder of this compact and the applicability thereof to any government, agency, person, or circumstance shall not be affected thereby.\n(c) Notwithstanding paragraph (b) or any provision of this article, the commission may deny a state's participation in the compact or, in accordance with the requirements of article X, paragraph (b), terminate a participating state's participation in the compact, if it determines that a constitutional requirement of a participating state is, or would be with respect to a state seeking to participate in the compact, a material departure from the compact. Otherwise, if this compact shall be held to be contrary to the constitution of any participating state, the compact shall remain in full force and effect as to the remaining participating states and in full force and effect as to the participating state affected as to all severable matters.\nARTICLE XIII\nBINDING EFFECT OF THE COMPACT\n(a) Nothing herein prevents the enforcement of any other law of a participating state that is not inconsistent with this compact.\n(b) Any laws in a participating state in conflict with this compact are superseded to the extent of the conflict.\n(c) All agreements between the commission and the participating states are binding in accordance with their terms.",
	"repealed": false
}