{
	"id": "84A.32",
	"url": "https://www.revisor.mn.gov/statutes/cite/84A.32",
	"title": "84A.32 DEPARTMENT TO MANAGE PROJECTS.",
	"text": "(a) The department shall manage and control each project approved and accepted under section 84A.31. The department may adopt and enforce rules for the purposes in section 84A.31, subdivision 1, for the prevention of forest fires in the projects, and for the sale of merchantable timber from lands acquired by the state in the projects when, in the opinion of the department, the timber may be sold and removed without damage to the purposes of the projects. Rules must not interfere with, destroy, or damage any privately owned property without just compensation being made to the owner of the private property by purchase or in lawful condemnation proceedings. The rules may relate to the care, preservation, protection, breeding, propagation, and disposition of any species of wildlife in the projects and the regulation, issuance, sale, and revocation of special licenses or special permits for hunting, fishing, camping, or other uses of these areas consistent with applicable state law.\n(b) The department may provide for the policing of each project as necessary for the proper development, use, and protection of the project, and of its purpose. The commissioner of natural resources may employ and designate individuals according to section 84.0835 to enforce laws governing the use of the projects.\n(c) Lands within the project are subject to these rules, whether owned by the state, or privately, consistent with the constitutional rights of the private owners or with applicable state law. The department may exclude from the operation of the rules any lands owned by private individuals upon which taxes are delinquent for three years or less. Rules must be published once in the official newspaper of each county affected and take effect 30 days after publication. They must also be posted on each of the four corners of each township of each project affected.\n(d) In the management, operation, and control of areas taken for afforestation, reforestation, flood control projects, and wild game and fishing reserves, nothing shall be done that will in any manner obstruct or interfere with the operation of ditches or drainage systems existing within the areas, or damage or destroy existing roads or highways within these areas or projects, unless the ditches, drainage systems, roads, or highways are first taken under the power of eminent domain and compensation made to the property owners and municipalities affected and damaged. Each area or project shall contribute from the funds of the project, in proportion of the state land within the project, for the construction and maintenance of roads and highways necessary within the areas and projects to give the settlers and private owners within them access to their land. The department may construct and maintain roads and highways within the areas and projects as it considers necessary.\n(a) The following funds must be paid to the state treasury and credited to the projects to which they pertain and are annually appropriated for its purposes:\n(1) the proceeds of certificates of indebtedness issued under sections 84A.31 to 84A.42;\n(2) money received from redemption as provided in sections 84A.33 to 84A.42;\n(3) money received as gifts to the state for the purpose of projects;\n(4) income from the operation, development, management, and use of projects, including fees received from the sale of birds, animals, fish, and plants from the projects, and the sale of all lands and timber on them owned by the state within the area, other than university, school, swamp, indemnity, or institutional lands, and state forests set apart under the Minnesota Constitution, article XI, section 11, and state lands acquired under the system of rural credit; and\n(5) state money transferred to the projects under state law.\n(b) Under sections 84A.31 to 84A.42, the total of all certificates of indebtedness issued must not exceed $750,000.",
	"repealed": false
}