{
	"id": "302A.651",
	"url": "https://www.revisor.mn.gov/statutes/cite/302A.651",
	"title": "302A.651 MERGER OR EXCHANGE WITH FOREIGN CORPORATION OR LIMITED LIABILITY COMPANY.",
	"text": "A domestic corporation may merge with, including a merger pursuant to section 302A.621, or participate in an exchange with a foreign corporation or limited liability company by following the procedures set forth in this section, if:\n(1) with respect to a merger, the merger is permitted by the laws of the jurisdiction under which the foreign corporation or limited liability company is incorporated or organized; and\n(2) with respect to an exchange, the corporation whose shares will be acquired is a domestic corporation, whether or not the exchange is permitted by the laws of the jurisdiction under which the foreign corporation or limited liability company is incorporated or organized.\nEach domestic corporation shall comply with the provisions of sections 302A.601 to 302A.651 with respect to the merger or exchange of shares of corporations and each foreign corporation or limited liability company shall comply with the applicable provisions of the laws under which it was incorporated or organized or by which it is governed.\nIf the surviving organization in a merger will be a domestic corporation, it shall comply with all the provisions of this chapter.\nIf the surviving organization in a merger will be a foreign corporation or limited liability company and will transact business in this state, it shall comply with the provisions of chapter 303 with respect to foreign corporations or chapter 322C with respect to foreign limited liability companies. In every case the surviving organization shall file with the secretary of state:\n(a) an agreement that it may be served with process in this state in a proceeding for the enforcement of an obligation of a constituent organization and in a proceeding for the enforcement of the rights of a dissenting shareholder of a constituent corporation against the surviving organization;\n(b) an irrevocable appointment of the secretary of state as its agent to accept service of process in any proceeding as provided in section 5.25, and an address to which process may be forwarded; and\n(c) an agreement that it will promptly pay to the dissenting shareholders of each domestic constituent corporation the amount, if any, to which they are entitled under section 302A.473.",
	"repealed": false
}