{
	"id": "116J.8745",
	"url": "https://www.revisor.mn.gov/statutes/cite/116J.8745",
	"title": "116J.8745 MICROENTERPRISE ENTREPRENEURIAL ASSISTANCE.",
	"text": "The commissioner of employment and economic development shall make grants to nonprofit organizations to provide technical assistance to individuals to support the startup and growth of self-employment and microbusinesses. Eligible businesses are microenterprises employing under five people plus the owner and requiring under $25,000 or no capital to start or expand the business.\nNonprofit organizations must apply for grants under this section following procedures established by the commissioner. To be eligible for a grant, an organization must demonstrate to the commissioner that it has the appropriate expertise. The commissioner shall give preference for grants to organizations that target nontraditional entrepreneurs such as women, members of a minority, low-income individuals, or persons seeking work who are currently on or recently removed from welfare assistance.\nAn application must include:\n(1) the local need for microenterprise support;\n(2) proposed criteria for business eligibility;\n(3) proposals for identifying and serving eligible businesses;\n(4) a description of technical assistance to be provided to eligible businesses;\n(5) proposals to coordinate technical assistance with financial assistance;\n(6) a demonstration of ability to collaborate with other agencies including educational and financial institutions; and\n(7) project goals identifying the number of eligible businesses to be assisted with the state funds awarded under the grant.\nGrant recipients must report to the commissioner by February 1 in each of the two years succeeding the year of receipt of the grant. The report must detail the number of customers served, the number of businesses started, stabilized, or expanded, the number of jobs created and retained, and business success rates. The commissioner shall report to the legislature on the microenterprise entrepreneurial assistance. The report shall contain an evaluation of the results, recommendations to continue or change the program, and a suggested level of funding.",
	"repealed": false
}