{
	"id": "504B.332",
	"url": "https://www.revisor.mn.gov/statutes/cite/504B.332",
	"title": "504B.332 SUMMONS AND COMPLAINT; HOW SERVED.",
	"text": "For purposes of this section, \"plaintiff\" includes the plaintiff's attorney, employees of the plaintiff's attorney, or any other agent of the plaintiff.\n(a) The summons and complaint must be served at least seven days before the date of the court appearance specified in section 504B.321, in the manner provided in subdivision 3 or 4.\n(b) If the plaintiff regularly uses electronic written communication to communicate with the defendant, the plaintiff must make a good faith attempt to communicate to the defendant that an eviction hearing has been scheduled at least seven days before the date of the court appearance specified in section 504B.321. This requirement is in addition to completing service in the manner provided in subdivision 3 or 4. The communication must have a time and date stamp, and include the date, time, and place of the hearing specified in the summons. The communication must be delivered by means of electronic written communication that the plaintiff regularly uses to communicate with the defendant or to the last known electronic address the plaintiff has used to communicate with the defendant, unless the parties do not communicate via any form of electronic written communication. The plaintiff must substantially comply with this paragraph.\n(a) If the defendant can be found in the county, the summons and complaint must be served in the manner provided for service of a civil action in district court.\n(b) If the defendant cannot be found in the county, the summons and complaint may be served at least seven days before the date of the court appearance by:\n(1) leaving a copy of the summons and complaint at the defendant's last usual place of abode with a person of suitable age and discretion residing there; or\n(2) if the defendant had no place of abode, by leaving a copy of the summons and complaint at the property described in the complaint with a person of suitable age and discretion occupying the premises.\n(c) At least three days before the date of the court appearance specified in section 504B.321, the plaintiff must file with the court an affidavit of personal or substitute service.\n(a) If attempts at personal or substitute service are unsuccessful, service of the summons and complaint may be made by mail and posting.\n(b) If service by mail and posting is used, the following steps must occur no later than seven days before the date of the court appearance specified in section 504B.321:\n(1) the plaintiff must mail a copy of the summons and complaint to the defendant at the defendant's last known address;\n(2) for residential evictions only, there must be at least two attempts at personal service. The personal service attempts must occur on different days at the last known address of the defendant and be done in the manner provided for service of a summons and complaint in a civil action in district court. At least one of the attempts must be made between the hours of 6:00 p.m. and 10:00 p.m. Failure to serve the defendant, after the plaintiff complies with this paragraph, is prima facie proof that attempts at personal or substitute service were unsuccessful and that the defendant cannot be found in the county;\n(3) the summons and complaint must be posted on the entry to the defendant's individual unit. If the defendant occupies a multiunit building, the summons and complaint must be posted on the door of the defendant's individual unit; and\n(4) at least three days before the date of the court appearance specified in section 504B.321, the plaintiff must file with the court affidavits stating:\n(i) the defendant cannot be found in the county, or that the plaintiff believes that the defendant is not in the state;\n(ii) a copy of the summons and complaint has been mailed to the defendant at the defendant's last known address at least seven days before the date of the court appearance specified in section 504B.321;\n(iii) compliance with subdivision 2, paragraph (b), by providing the date and manner by which the plaintiff attempted to communicate to the defendant in compliance with subdivision 2, paragraph (b), or stating that the plaintiff does not use electronic written communication to regularly communicate with the defendant and does not have an electronic address for the defendant;\n(iv) if applicable, how the requirements of clause (2) were met, including the dates and times of the attempts at service; and\n(v) the date and time the summons and complaint were posted on the entry to the defendant's individual unit.\nIf the defendant or the defendant's attorney does not appear in court on the date of the appearance, the trial shall proceed.",
	"repealed": false
}