{
	"id": "176.130",
	"url": "https://www.revisor.mn.gov/statutes/cite/176.130",
	"title": "176.130 TARGETED INDUSTRY FUND; LOGGERS.",
	"text": "For purposes of this section, the following terms have the meanings given them, except where the context clearly indicates a different meaning.\n(a) \"Commissioner\" means the commissioner of labor and industry, unless otherwise provided.\n(b) \"Logger\" means the following occupations:\n(1) timber fellers: those who employ chainsaws or other mechanical devices mounted on logging vehicles to fell or delimb trees;\n(2) buckers or chippers: those who cut trees into merchantable lengths with either chainsaws or heavier machinery, including slashers, harvesters, and processors;\n(3) skidders or forwarders: those who either drag logs or trees to roadside landings, or load and transport logs or short wood (fuel wood or pulp wood) to similar destinations; and\n(4) timber harvesters or processors: those who combine two or more of the operations listed in clauses (1) to (3).\n(c) \"Logging industry\" means loggers and employers of loggers.\n(d) \"Wood mill\" means the primary processors of wood or wood chips including, but not limited to, hard board manufacturers, wafer board or oriented strand board manufacturers, pulp and paper manufacturers, sawmills, and other primary manufacturers who do the initial processing of wood purchased from loggers.\n(e) \"Insurer\" means an insurance company that provides workers' compensation coverage for loggers, including the Minnesota assigned risk plan.\n(f) \"Qualified employer\" means a self-employed logger, or an employer of a logger, who has paid a premium for workers' compensation insurance coverage for the preceding calendar year and who has attended, or whose logger employees have attended, in the preceding calendar year, at least one safety seminar sponsored by or approved by the commissioner.\n(g) \"Rebate\" means amounts allocated and paid to qualified employers under subdivision 6.\nThe commissioner shall administer and enforce this section. Payments and reports required by this section must be made with forms provided by the commissioner. The commissioner shall collect all assessments and allocate the rebate as provided in this section.\nPurchasers of wood from the logging industry shall obtain from the logger a certification of compliance with the mandatory insurance requirements of this chapter, or reason for exemption, on a form prescribed by the commissioner. A purchaser includes, but is not limited to, dealers and jobbers buying from the logging industry to sell to wood mills, and wood mills that buy directly from the logging industry. Certificates obtained by the purchaser shall be submitted to the commissioner on request. The powers of inspection and enforcement pertaining to employers under section 176.184 shall be available with regard to purchasers under this section.\nThere is imposed an assessment, at the rate of 30 cents per cord of wood, for every cord or equivalent measurement of wood in excess of 5,000 cords, purchased or acquired in any calendar year, either inside or outside the state, by a wood mill located in Minnesota. This assessment must be paid by the wood mill to the commissioner on or before February 15 for the previous calendar year and may not, in any way, be recovered by the wood mill from the logging industry. All revenue collected from this assessment must be deposited in a separately maintained account in the special compensation fund for the payment of rebates under subdivision 6 and the loggers safety and education program under subdivision 11.\n(a) Each wood mill that purchases or acquires more than 5,000 cords or equivalent measurement of wood in a calendar year shall, on or before February 15, make and file with the commissioner a report setting forth the number of cords purchased or acquired in the preceding calendar year, and other information the commissioner may require for the proper administration of this section.\n(b) Each qualified employer shall, on or before February 15 each year, make and file with the commissioner a report setting forth the total amount of payroll paid to loggers in the preceding calendar year, together with proof of attendance at an approved safety seminar in the preceding calendar year, and other information the commissioner may require for the proper administration of this section. The commissioner may, for enforcement purposes, share reported payroll data for a particular employer with the workers' compensation insurer for that employer or with the workers' compensation insurance association.\nMoney collected under this section, less an amount as provided in subdivision 11, is appropriated to and, must be paid by the commissioner, on or before June 1 each year, directly to each qualified employer in a proportion equal to the proportion that the qualified employer's reported payroll dollars for loggers in the preceding calendar year is to the total reported payroll dollars for loggers from all qualified employers in the preceding calendar year. Payment under this section shall be made only to those qualified employers reporting within the time limits provided in subdivision 5, paragraph (b).\nThe commissioner or duly authorized employees may, at all reasonable hours, enter in and upon the premises of a wood mill or a qualified employer and examine books, papers, and records to determine whether the assessment has been properly paid or payroll properly reported.\nIf the assessment provided for in this chapter is not paid on or before February 15 of the year when due and payable, the commissioner may impose penalties as provided in section 176.129, subdivision 10, payable to the commissioner for deposit in the assigned risk safety account.\nAny person or entity that, for the purpose of evading payment of the assessment or avoiding the reimbursement, or any part of it, makes a false report under this section shall pay to the commissioner for deposit in the assigned risk safety account, in addition to the assessment, a penalty of 75 percent of the amount of the assessment. A person who knowingly makes or signs a false report, or who knowingly submits other false information, is guilty of a misdemeanor.\nThis section does not create an employer-employee relationship nor can it be used as a factor in determining the existence of an employer-employee relationship.\nThe commissioner shall establish or approve a safety and education program for Minnesota loggers. Funding for the program must be in the amount of $125,000 each calendar year provided from amounts collected in the previous calendar year pursuant to subdivision 4. If the amounts collected under subdivision 4 are less than $125,000 in any calendar year, funding for the safety and education program for the next calendar year must be the actual amount collected.",
	"repealed": false
}