{
	"id": "169.72",
	"url": "https://www.revisor.mn.gov/statutes/cite/169.72",
	"title": "169.72 TIRE SURFACE; METAL STUDS.",
	"text": "(a) Every solid rubber tire on a vehicle must have rubber on its entire traction surface at least one inch thick above the edge of the flange of the entire periphery.\n(b) No person shall operate or move on any highway any motor vehicle, trailer, or semitrailer, having any metal tire in contact with the roadway, except in case of emergency.\n(c) Except as provided in this section, no tire on a vehicle moved on a highway shall have on its periphery any block, stud, flange, cleat, or spike or any other protuberances of any material other than rubber which projects beyond the tread of the traction surface of the tire.\n(d) It is permissible to use any of the following on highways:\n(1) implements of husbandry with tires having protuberances which will not injure the highway;\n(2) tire chains of reasonable proportions upon any vehicle when required for safety because of snow, ice, or other conditions tending to cause a vehicle to skid; and\n(3) tires on a bicycle as provided in section 169.222, subdivision 6.\n(e) The commissioner and local authorities in their respective jurisdictions may, in their discretion, issue special permits authorizing the operation upon a highway of traction engines or tractors having movable tracks with transverse corrugations upon the periphery of such movable tracks or farm tractors or other farm machinery, the operation of which upon a highway would otherwise be prohibited under this chapter.\n[Repealed, 1973 c 378 s 3]\n[Repealed, 1996 c 310 s 1]\nNotwithstanding the provisions of subdivision 1, a person, operating a motor vehicle properly licensed and registered in another state or province of a foreign country which authorizes the use of tires with metal studs or wire embedded tires on its highways, may operate the motor vehicle with tires having metal type studs or with tires having wire embedded therein on the highways of this state while occasionally within the state, and such use while occasionally within the state is not unlawful; provided that, the metal type studs shall not exceed 5/16 of an inch in diameter inclusive of the stud casing with an average protrusion beyond the tread surface of not more than 7/64 of an inch, and the number of studs in a tire shall not exceed two percent of the total net contact area. Use of a vehicle in this state on more than 30 days in any consecutive six-month period is not occasionally. Except, a person whose regular place of employment is within the state or who is a student at an educational institution located within the state, shall not operate a vehicle, regardless of its place of registration, upon any highway within the state if such vehicle is equipped with tires which would be unauthorized were the vehicle registered in this state.\n(a) A rural mail carrier of the United States Postal Service may apply to the commissioner for a permit to operate a rural mail delivery vehicle with tires having metal studs. An applicant must submit with the application for the permit (1) verification that the applicant is employed as a United States postal carrier, (2) a map showing the applicant's mail delivery route, and (3) identification of the vehicle the applicant uses on that mail delivery route.\n(b) If the commissioner determines that (1) the applicant is employed as a United States postal carrier, and (2) less than 25 percent of the total mileage on the applicant's mail delivery route is paved, the commissioner may issue the permit. A permit under this subdivision is valid beginning November 1 of a calendar year and expires on April 15 of the following calendar year.\n(c) A permit under this subdivision authorizes the permit holder to operate a motor vehicle equipped with tires having metal studs that meet the limitations in subdivision 4, while (1) traveling between the permit holder's residence and a mail pickup station, and (2) delivering United States mail on the permit holder's delivery route as shown in the map accompanying the permit application. The permit is valid only for the vehicle identified in the permit.\n(d) The commissioner may amend a permit under this subdivision when (1) the permit holder submits evidence of a change in the permit holder's mail delivery route, or (2) the permit holder changes vehicles used in the route.\n(e) The commissioner may revoke a permit when the commissioner determines that (1) the vehicle named in the permit is or has been operated in violation of this subdivision or the terms of the permit, or (2) the commissioner determines that more than 25 percent of the total mileage of the permit holder's mail delivery route is paved.\n(f) Operation of a motor vehicle identified in a permit in violation of this subdivision or the terms of a permit issued under this subdivision is a misdemeanor.\n(g) A permit holder under this subdivision must remove tires having metal studs from the vehicle identified in the permit (1) by 12:01 a.m. on April 16 of each year, and (2) whenever the permit holder transfers ownership of the vehicle or ceases employment as a United States postal carrier.",
	"repealed": false
}