{
	"id": "51A.33",
	"url": "https://www.revisor.mn.gov/statutes/cite/51A.33",
	"title": "51A.33 WITHDRAWAL.",
	"text": "Any savings account member or authorized representative may at any time present a written application for withdrawal of all or any part of the member's savings accounts. Every application shall request immediate withdrawal of a stated amount in accordance with this section. Any member may cancel an application at any time in whole or in part by a writing. Every association shall pay or number, date, and file in the order of actual receipt every withdrawal application. Withdrawals shall be made in the order of actual receipt of applications, except as provided in this section. Upon receipt of a withdrawal request signed by the person or persons authorized to withdraw by the savings account contract or by operation of law, an association shall pay the amount stated thereon in the form of cash or one or more checks or similar instruments payable to the order of any person or to the order of others as directed, or transfer credits to the account or accounts of others in the institution as directed, but not in excess of the withdrawal value of the savings account or accounts, together with any earnings which may have been declared and may have accrued thereon for the current period. If an association so elects, it may at any time pay in full each and every application as presented. It shall not, however, pay some in full unless it pays every application on file in full, except by paying all applications on file on the rotation system prescribed in this section. The board of directors, however, shall have an absolute right to pay upon any application not exceeding $200 to any one savings account member in any one month in any order. No association can obligate itself to pay withdrawals on any plan other than as provided in sections 51A.01 to 51A.57. Savings account holders who have filed written applications for withdrawal shall remain savings account members so long as their applications remain on file. No earnings shall be declared upon that portion of an account which has been noticed for withdrawal, which for earnings purposes is required to be deducted from the latest previous additions to such account, so long as application is on file. The rotation system for payment of withdrawals is as follows: On the first day of each month, each application which has been on file since the first day of the preceding month and which is reached in order shall be paid $1,000 on account, or in full if the amount noticed for withdrawal or the unpaid balance of the application is less than $1,000. Each application for more than $1,000 so paid shall be deemed refiled as if filed on that day. Limited payment on the first day of each month and renumbering shall take place on the first day of each subsequent month as long as there are applications unpaid. At least one-third of the receipts of an association from its members during the preceding calendar month shall be applied on the first day of each month to the payment of applications which have been on file since the first day of the preceding month. Any association may apply to withdrawals an amount larger than one-third of the receipts, but cannot obligate itself to do so. When an application to withdraw is reached for payment as above provided, a written notice shall be sent to the applicant by mail at the last address recorded on the books, and unless the applicant shall apply in person or in writing for the withdrawal within 30 days from the date of the notice, no payment on account of the application shall be made and the application shall be canceled. In no event shall an association voluntarily or involuntarily delay or postpone the whole or partial payment of the value of any savings account pursuant to a written withdrawal application by a savings account member for a period exceeding 30 days following the receipt of the application without first securing written permission, in the case of an association the accounts of which are not insured by the federal savings and loan insurance corporation, from the commissioner, or in the case of an association the accounts of which are insured by the Federal Savings and Loan Insurance Corporation, from the corporation. If the association is under control of a conservator appointment pursuant to section 51A.45, subdivision 2, withdrawal shall be governed by the lawful rules and orders of the conservator.",
	"repealed": false
}