{
	"id": "116L.05",
	"url": "https://www.revisor.mn.gov/statutes/cite/116L.05",
	"title": "116L.05 FUNDING.",
	"text": "The board may use federal job training program moneys and is authorized to receive those funds.\nThe board may accept gifts and grants of any type from any source.\nThe Job Skills Partnership Board may use up to six percent of any funds it receives, regardless of the source, for activities authorized under section 116L.04, subdivision 2. The board may also use a portion of these funds to collect and disseminate information on the activities under section 116L.04, subdivision 2. The board must plan for the statewide dissemination of the results, curriculum, and supporting materials of these grant-funded projects.\n[Repealed, 1Sp2005 c 1 art 4 s 124]\nAfter March 1 of any fiscal year, the board may use workforce development funds for the purposes outlined in sections 116L.02 and 116L.04, or to provide incumbent worker training services under section 116L.18 if the following conditions have been met:\n(1) the board examines relevant economic indicators, including the projected number of layoffs for the remainder of the fiscal year and the next fiscal year, evidence of declining and expanding industries, the number of initial applications for and the number of exhaustions of unemployment benefits, job vacancy data, and any additional relevant information brought to the board's attention;\n(2) the board accounts for all allocations made in section 116L.17, subdivision 2;\n(3) based on the past expenditures and projected revenue, the board estimates future funding needs for services under section 116L.17 for the remainder of the current fiscal year and the next fiscal year;\n(4) the board determines there will be unspent funds after meeting the needs of dislocated workers in the current fiscal year and there will be sufficient revenue to meet the needs of dislocated workers in the next fiscal year; and\n(5) the board reports its findings in clauses (1) to (4) to the chairs of legislative committees with jurisdiction over the workforce development fund, to the commissioners of revenue and management and budget, and to the public.",
	"repealed": false
}