{
	"id": "256B.0571",
	"url": "https://www.revisor.mn.gov/statutes/cite/256B.0571",
	"title": "256B.0571 LONG-TERM CARE PARTNERSHIP PROGRAM.",
	"text": "For purposes of this section, the following terms have the meanings given them.\n[Repealed, 2006 c 282 art 17 s 37]\n\"Long-term care insurance\" means a policy described in section 62S.01.\n\"Medical assistance\" means the program of medical assistance established under section 256B.01.\n[Repealed, 2006 c 282 art 17 s 37]\n\"Partnership policy\" means a long-term care insurance policy that meets the criteria in sections 62S.23, subdivision 1, paragraph (b), and 62S.312 and was issued on or after July 1, 2006, or exchanged on or after July 1, 2006, under the provisions of section 62S.24, subdivision 8.\n\"Partnership program\" means the Minnesota partnership for long-term care program established under this section.\n\"Protected assets\" means assets or proceeds of assets that are protected from recovery under subdivisions 13 and 15.\n(a) The commissioner, in cooperation with the commissioner of commerce, shall establish the Minnesota partnership for long-term care program to provide for the financing of long-term care through a combination of private insurance and medical assistance.\n(b) An individual becomes eligible to participate in the partnership program by meeting the requirements of either clause (1) or (2):\n(1) the individual may qualify as a beneficiary of a partnership policy that meets the criteria under subdivision 6. To be eligible under this clause, the individual must be a Minnesota resident at the time coverage first became effective under the partnership policy; or\n(2) the individual may qualify as a beneficiary of a policy recognized under subdivision 17.\n[Repealed, 2008 c 326 art 1 s 47]\n(a) Upon request for medical assistance program payment of long-term care services by an individual who meets the requirements described in subdivision 8, the commissioner shall determine the individual's eligibility for medical assistance according to paragraphs (b) to (i).\n(b) After determining assets subject to the asset limit under section 256B.056, subdivision 3 or 3c, or 256B.057, subdivision 9 or 10, the commissioner shall allow the individual to designate assets to be protected from recovery under subdivisions 13 and 15 up to the dollar amount of the benefits utilized under the partnership policy as of the effective date of eligibility for medical assistance program payment of long-term care services. Benefits utilized under a long-term care insurance policy before July 1, 2006, do not count for the purpose of determining the amount of assets that can be designated. Designated assets shall be disregarded for purposes of determining eligibility for payment of long-term care services. The dollar amount of benefits utilized must be equal to the amount of claims paid by the issuer under the policy as verified by the issuer.\n(c) The individual shall identify the designated assets and the full fair market value of those assets and designate them as assets to be protected at the time of application for medical assistance payment of long-term care services. The full fair market value of real property or interests in real property shall be based on the most recent full assessed value for property tax purposes for the real property, unless the individual provides a complete professional appraisal by a licensed appraiser to establish the full fair market value. The extent of a life estate in real property shall be determined using the life estate table in the health care program's manual. Ownership of any asset in joint tenancy shall be treated as ownership as tenants in common for purposes of its designation as a disregarded asset. The unprotected value of any protected asset is subject to estate recovery according to subdivisions 13 and 15.\n(d) The right to designate assets to be protected is personal to the individual and ends when the individual dies, except as otherwise provided in subdivisions 13 and 15. It does not include the increase in the value of the protected asset and the income, dividends, or profits from the asset. It may be exercised by the individual or by anyone with the legal authority to do so on the individual's behalf. It shall not be sold, assigned, transferred, or given away.\n(e) As the individual continues to utilize benefits under a partnership policy after eligibility for medical assistance payment of long-term care services begins, the individual may designate, for additional protection, an increase in the value of protected assets and additional assets that become available during the individual's lifetime up to the amount of additional benefits utilized. The individual must make the designation in writing no later than ten days from the date the designation is requested by the county agency. The amount used for this purpose must reduce the unused amount of asset protection available to protect assets in the individual's estate from recovery under section 256B.15 or 524.3-1202, or otherwise.\n(f) This section applies only to estate recovery under United States Code, title 42, section 1396p, subsections (a) and (b), and does not apply to recovery authorized by other provisions of federal law, including, but not limited to, recovery from trusts under United States Code, title 42, section 1396p, subsection (d)(4)(A) and (C), or to recovery from annuities, or similar legal instruments, subject to section 6012, subsections (a) and (b), of the Deficit Reduction Act of 2005, Public Law 109-171.\n(g) An individual's protected assets owned by the individual's spouse who applies for payment of medical assistance long-term care services shall not be protected assets or disregarded for purposes of eligibility of the individual's spouse solely because they were protected assets of the individual.\n(h) Assets designated under this subdivision shall not be subject to penalty under section 256B.0595.\n(i) The commissioner shall otherwise determine the individual's eligibility for payment of long-term care services according to medical assistance eligibility requirements.\n[Repealed, 2010 c 310 art 4 s 5]\n[Repealed, 2006 c 282 art 17 s 37]\nAn issuer of a partnership policy must comply with Public Law 109-171, section 6021, including any federal regulations, as amended, adopted under that law.\n(a) Protected assets of the individual shall not be subject to recovery under section 256B.15 or 524.3-1201 for medical assistance or alternative care paid on behalf of the individual. Protected assets of the individual in the estate of the individual's surviving spouse shall not be liable to pay a claim for recovery of medical assistance paid for the predeceased individual that is filed in the estate of the surviving spouse under section 256B.15. Protected assets of the individual shall not be protected assets in the surviving spouse's estate by reason of the preceding sentence and shall be subject to recovery under section 256B.15 or 524.3-1201 for medical assistance paid on behalf of the surviving spouse.\n(b) The personal representative may protect the full fair market value of an individual's unprotected assets in the individual's estate in an amount equal to the unused amount of asset protection the individual had on the date of death. The personal representative shall apply the asset protection so that the full fair market value of any unprotected asset in the estate is protected. When or if the asset protection available to the personal representative is or becomes less than the full fair market value of any remaining unprotected asset, it shall be applied to partially protect one unprotected asset.\n(c) The asset protection described in paragraph (a) terminates with respect to an asset includable in the individual's estate under chapter 524 or section 256B.15:\n(1) when the estate distributes the asset; or\n(2) if the estate of the individual has not been probated within one year from the date of death.\n(d) If an individual owns a protected asset on the date of death and the estate is opened for probate more than one year after death, the state or a county agency may file and collect claims in the estate under section 256B.15, and no statute of limitations in chapter 524 that would otherwise limit or bar the claim shall apply.\n(e) Except as otherwise provided, nothing in this section shall limit or prevent recovery of medical assistance.\n(a) The commissioner, in cooperation with the commissioner of commerce, may alter the requirements of this section so as to be in compliance with forthcoming requirements of the federal Department of Health and Human Services and the National Association of Insurance Commissioners necessary to implement the long-term care partnership program requirements of Public Law 109-171, section 6021.\n(b) The commissioner shall submit a state plan amendment to the federal government to implement the long-term care partnership program in accordance with this section.\n(a) An individual's interest in real property shall not be subject to a medical assistance lien under sections 514.980 to 514.985 or a lien arising under section 256B.15 while and to the extent it is protected under subdivision 9. An individual's interest in real property that exceeds the value protected under subdivision 9 is subject to a lien for recovery.\n(b) Medical assistance liens under sections 514.980 to 514.985 or liens arising under section 256B.15 against an individual's interests in real property in the individual's estate that are designated as protected under subdivision 13, paragraph (b), shall be released to the extent of the dollar value of the protection applied to the interest.\n(c) If an interest in real property is protected from a lien for recovery of medical assistance paid on behalf of the individual under paragraph (a) or (b), no lien for recovery of medical assistance paid on behalf of that individual shall be filed against the protected interest in real property after it is distributed to the individual's heirs or devisees.\nAny individual or the personal representative of the individual's estate who asserts that an asset is a disregarded or protected asset under this section in connection with any determination of eligibility for benefits under the medical assistance program or any appeal, case, controversy, or other proceedings, shall have the initial burden of:\n(1) documenting and proving by clear and convincing evidence that the asset or source of funds for the asset in question was designated as disregarded or protected;\n(2) tracing the asset and the proceeds of the asset from that time forward; and\n(3) documenting that the asset or proceeds of the asset remained disregarded or protected at all relevant times.\nThe commissioner may enter into an agreement with any other state with a partnership program under United States Code, title 42, section 1396p(b)(1)(C), for reciprocal recognition of qualified long-term care insurance policies purchased under each state's partnership program. The commissioner shall notify the secretary of the United States Department of Health and Human Services if the commissioner declines to enter into a national reciprocal agreement.",
	"repealed": false
}