{
	"id": "256B.0701",
	"url": "https://www.revisor.mn.gov/statutes/cite/256B.0701",
	"title": "256B.0701 RECUPERATIVE CARE SERVICES.",
	"text": "(a) For purposes of this section, the following terms have the meanings given.\n(b) \"Provider\" means a recuperative care provider as defined by the standards established by the National Institute for Medical Respite Care.\n(c) \"Recuperative care\" means a model of care that prevents hospitalization or that provides postacute medical care and support services for recipients experiencing homelessness who are too ill or frail to recover from a physical illness or injury while living in a shelter or are otherwise unhoused but who are not sick enough to be hospitalized or remain hospitalized, or to need other levels of care.\nRecuperative care may be provided in any setting, including but not limited to homeless shelters, congregate care settings, single room occupancy settings, or supportive housing, so long as the provider of recuperative care or provider of housing is able to provide to the recipient within the designated setting, at a minimum:\n(1) 24-hour access to a bed and bathroom;\n(2) access to three meals a day;\n(3) availability to environmental services;\n(4) access to a telephone;\n(5) a secure place to store belongings; and\n(6) staff available within the setting to provide a wellness check as needed, but at a minimum, at least once every 24 hours.\nTo be eligible for recuperative care services, a recipient must:\n(1) not be a child;\n(2) be experiencing homelessness;\n(3) be in need of short-term acute medical care for a period of no more than 60 days;\n(4) meet clinical criteria, as established by the commissioner, that indicates that the recipient needs recuperative care; and\n(5) not have behavioral health needs that are greater than what can be managed by the provider within the setting.\nTotal payment rates for recuperative care consist of the recuperative care services rate and the recuperative care facility rate.\nThe recuperative care services rate is for the services provided to the recipient and must be a bundled daily per diem payment of at least $300 per day. Services provided within the bundled payment may include but are not limited to:\n(1) basic nursing care, including:\n(i) monitoring a patient's physical health and pain level;\n(ii) providing wound care;\n(iii) medication support;\n(iv) patient education;\n(v) immunization review and update; and\n(vi) establishing clinical goals for the recuperative care period and discharge plan;\n(2) care coordination, including:\n(i) initial assessment of medical, behavioral, and social needs;\n(ii) development of a care plan;\n(iii) support and referral assistance for legal services, housing, community social services, case management, health care benefits, health and other eligible benefits, and transportation needs and services; and\n(iv) monitoring and follow-up to ensure that the care plan is effectively implemented to address the medical, behavioral, and social needs;\n(3) basic behavioral needs, including counseling and peer support, that can be provided in the recuperative care setting; and\n(4) services provided by a community health worker as defined under section 256B.0625, subdivision 49.\n(a) The recuperative care facility rate is for facility costs and must be paid from state money in an amount equal to the MSA equivalent rate as defined in section 256I.03, subdivision 11a, at the time the recuperative care services were provided. The eligibility standards in chapter 256I do not apply to the recuperative care facility rate. The recuperative care facility rate is only paid when the recuperative care services rate is paid to a provider. Providers may opt to only receive the recuperative care services rate.\n(b) Before a recipient is discharged from a recuperative care setting, the provider must ensure that the recipient's medical condition is stabilized or that the recipient is being discharged to a setting that is able to meet that recipient's needs.\nIf a recipient requires care exceeding the 60-day limit described in subdivision 3, the provider may request in a format prescribed by the commissioner an extension to continue payments until the recipient is discharged.\n(a) The commissioner must submit an initial report on coverage of recuperative care services to the chairs and ranking minority members of the legislative committees having jurisdiction over health and human services finance and policy by February 1, 2025, and a final report by February 1, 2027. The reports must include but are not limited to:\n(1) a list of the recuperative care services in Minnesota and the number of recipients;\n(2) the estimated return on investment, including health care savings due to reduced hospitalizations;\n(3) follow-up information, if available, on whether recipients' hospital visits decreased since recuperative care services were provided compared to before the services were provided; and\n(4) any other information that can be used to determine the effectiveness of the program and its funding, including recommendations for improvements to the program.\n(b) This subdivision expires upon submission of the final report.",
	"repealed": false
}