{
	"id": "256B.0659",
	"url": "https://www.revisor.mn.gov/statutes/cite/256B.0659",
	"title": "256B.0659 PERSONAL CARE ASSISTANCE PROGRAM.",
	"text": "(a) For the purposes of this section, the terms defined in paragraphs (b) to (r) have the meanings given unless otherwise provided in text.\n(b) \"Activities of daily living\" means grooming, dressing, bathing, transferring, mobility, positioning, eating, and toileting.\n(c) \"Behavior,\" effective January 1, 2010, means a category to determine the home care rating and is based on the criteria found in this section. \"Level I behavior\" means physical aggression toward self, others, or destruction of property that requires the immediate response of another person.\n(d) \"Complex health-related needs,\" effective January 1, 2010, means a category to determine the home care rating and is based on the criteria found in this section.\n(e) \"Critical activities of daily living,\" effective January 1, 2010, means transferring, mobility, eating, and toileting.\n(f) \"Dependency in activities of daily living\" means a person requires assistance to begin and complete one or more of the activities of daily living.\n(g) \"Extended personal care assistance service\" means personal care assistance services included in a service plan under one of the home and community-based services waivers authorized under chapter 256S and sections 256B.092, subdivision 5, and 256B.49, which exceed the amount, duration, and frequency of the state plan personal care assistance services for participants who:\n(1) need assistance provided periodically during a week, but less than daily will not be able to remain in their homes without the assistance, and other replacement services are more expensive or are not available when personal care assistance services are to be reduced; or\n(2) need additional personal care assistance services beyond the amount authorized by the state plan personal care assistance assessment in order to ensure that their safety, health, and welfare are provided for in their homes.\n(h) \"Health-related procedures and tasks\" means procedures and tasks that can be delegated or assigned by a licensed health care professional under state law to be performed by a personal care assistant.\n(i) \"Instrumental activities of daily living\" means activities to include meal planning and preparation; basic assistance with paying bills; shopping for food, clothing, and other essential items; performing household tasks integral to the personal care assistance services; communication by telephone and other media; and traveling, including to medical appointments and to participate in the community. For purposes of this paragraph, traveling includes driving and accompanying the recipient in the recipient's chosen mode of transportation and according to the recipient's personal care assistance care plan.\n(j) \"Managing employee\" has the same definition as Code of Federal Regulations, title 42, section 455.\n(k) \"Qualified professional\" means a professional providing supervision of personal care assistance services and staff as defined in section 256B.0625, subdivision 19c.\n(l) \"Personal care assistance provider agency\" means a medical assistance enrolled provider that provides or assists with providing personal care assistance services and includes a personal care assistance provider organization, personal care assistance choice agency, class A licensed nursing agency, and Medicare-certified home health agency.\n(m) \"Personal care assistant\" or \"PCA\" means an individual employed by a personal care assistance agency who provides personal care assistance services.\n(n) \"Personal care assistance care plan\" means a written description of personal care assistance services developed by the personal care assistance provider according to the service plan.\n(o) \"Responsible party\" means an individual who is capable of providing the support necessary to assist the recipient to live in the community.\n(p) \"Self-administered medication\" means medication taken orally, by injection, nebulizer, or insertion, or applied topically without the need for assistance.\n(q) \"Service plan\" means a written summary of the assessment and description of the services needed by the recipient.\n(r) \"Wages and benefits\" means wages and salaries, the employer's share of FICA taxes, Medicare taxes, state and federal unemployment taxes, workers' compensation, mileage reimbursement, health and dental insurance, life insurance, disability insurance, long-term care insurance, uniform allowance, and contributions to employee retirement accounts.\n[See Note.]\n(a) The personal care assistance services eligible for payment include services and supports furnished to an individual, as needed, to assist in:\n(1) activities of daily living;\n(2) health-related procedures and tasks;\n(3) observation and redirection of behaviors; and\n(4) instrumental activities of daily living.\n(b) Activities of daily living include the following covered services:\n(1) dressing, including assistance with choosing, application, and changing of clothing and application of special appliances, wraps, or clothing;\n(2) grooming, including assistance with basic hair care, oral care, shaving, applying cosmetics and deodorant, and care of eyeglasses and hearing aids. Nail care is included, except for recipients who are diabetic or have poor circulation;\n(3) bathing, including assistance with basic personal hygiene and skin care;\n(4) eating, including assistance with hand washing and application of orthotics required for eating, transfers, and feeding;\n(5) transfers, including assistance with transferring the recipient from one seating or reclining area to another;\n(6) mobility, including assistance with ambulation, including use of a wheelchair. Mobility does not include providing transportation for a recipient;\n(7) positioning, including assistance with positioning or turning a recipient for necessary care and comfort; and\n(8) toileting, including assistance with helping recipient with bowel or bladder elimination and care including transfers, mobility, positioning, feminine hygiene, use of toileting equipment or supplies, cleansing the perineal area, inspection of the skin, and adjusting clothing.\n(c) Health-related procedures and tasks include the following covered services:\n(1) range of motion and passive exercise to maintain a recipient's strength and muscle functioning;\n(2) assistance with self-administered medication as defined by this section, including reminders to take medication, bringing medication to the recipient, and assistance with opening medication under the direction of the recipient or responsible party, including medications given through a nebulizer;\n(3) interventions for seizure disorders, including monitoring and observation; and\n(4) other activities considered within the scope of the personal care service and meeting the definition of health-related procedures and tasks under this section.\n(d) A personal care assistant may provide health-related procedures and tasks associated with the complex health-related needs of a recipient if the procedures and tasks meet the definition of health-related procedures and tasks under this section and the personal care assistant is trained by a qualified professional and demonstrates competency to safely complete the procedures and tasks. Delegation of health-related procedures and tasks and all training must be documented in the personal care assistance care plan and the recipient's and personal care assistant's files. A personal care assistant must not determine the medication dose or time for medication.\n(e) Effective January 1, 2010, for a personal care assistant to provide the health-related procedures and tasks of tracheostomy suctioning and services to recipients on ventilator support there must be:\n(1) delegation and training by a registered nurse, advanced practice registered nurse, licensed respiratory therapist, physician assistant, or physician;\n(2) utilization of clean rather than sterile procedure;\n(3) specialized training about the health-related procedures and tasks and equipment, including ventilator operation and maintenance;\n(4) individualized training regarding the needs of the recipient; and\n(5) supervision by a qualified professional who is a registered nurse.\n(f) Effective January 1, 2010, a personal care assistant may observe and redirect the recipient for episodes where there is a need for redirection due to behaviors. Training of the personal care assistant must occur based on the needs of the recipient, the personal care assistance care plan, and any other support services provided.\n(g) Instrumental activities of daily living under subdivision 1, paragraph (i).\n(a) Personal care assistance services are not eligible for medical assistance payment under this section when provided:\n(1) by the recipient's spouse, parent of a recipient under the age of 18, paid legal guardian, licensed foster provider, except as allowed under section 256B.0652, subdivision 10, or responsible party;\n(2) in order to meet staffing or license requirements in a residential or child care setting;\n(3) solely as a child care or babysitting service; or\n(4) without authorization by the commissioner or the commissioner's designee.\n(b) The following personal care services are not eligible for medical assistance payment under this section when provided in residential settings:\n(1) when the provider of home care services who is not related by blood, marriage, or adoption owns or otherwise controls the living arrangement, including licensed or unlicensed services; or\n(2) when personal care assistance services are the responsibility of a residential or program license holder under the terms of a service agreement and administrative rules.\n(c) Other specific tasks not covered under paragraph (a) or (b) that are not eligible for medical assistance reimbursement for personal care assistance services under this section include:\n(1) sterile procedures;\n(2) injections of fluids and medications into veins, muscles, or skin;\n(3) home maintenance or chore services;\n(4) homemaker services not an integral part of assessed personal care assistance services needed by a recipient;\n(5) application of restraints or implementation of procedures under section 245.825;\n(6) instrumental activities of daily living for children under the age of 18, except when immediate attention is needed for health or hygiene reasons integral to the personal care services and the need is listed in the service plan by the assessor; and\n(7) assessments for personal care assistance services by personal care assistance provider agencies or by independently enrolled registered nurses.\n(a) \"Assessment\" means a review and evaluation of a recipient's need for personal care assistance services conducted in person. Assessments for personal care assistance services shall be conducted by the county public health nurse or a certified public health nurse under contract with the county except when a long-term care consultation assessment is being conducted for the purposes of determining a person's eligibility for home and community-based waiver services including personal care assistance services according to section 256B.0911. During the transition to MnCHOICES, a certified assessor may complete the assessment defined in this subdivision. An in-person assessment must include: documentation of health status, determination of need, evaluation of service effectiveness, identification of appropriate services, service plan development or modification, coordination of services, referrals and follow-up to appropriate payers and community resources, completion of required reports, recommendation of service authorization, and consumer education. Once the need for personal care assistance services is determined under this section, the county public health nurse or certified public health nurse under contract with the county is responsible for communicating this recommendation to the commissioner and the recipient. An in-person assessment must occur at least annually or when there is a significant change in the recipient's condition or when there is a change in the need for personal care assistance services. A service update may substitute for the annual face-to-face assessment when there is not a significant change in recipient condition or a change in the need for personal care assistance service. A service update may be completed by telephone, used when there is no need for an increase in personal care assistance services, and used for two consecutive assessments if followed by a face-to-face assessment. A service update must be completed on a form approved by the commissioner. A service update or review for temporary increase includes a review of initial baseline data, evaluation of service effectiveness, redetermination of service need, modification of service plan and appropriate referrals, update of initial forms, obtaining service authorization, and ongoing consumer education. Assessments or reassessments must be completed on forms provided by the commissioner within 30 days of a request for home care services by a recipient or responsible party.\n(b) This subdivision expires when notification is given by the commissioner as described in section 256B.0911, subdivision 18.\n(a) An assessment as defined in subdivision 3a must be completed for personal care assistance services.\n(b) The following limitations apply to the assessment:\n(1) a person must be assessed as dependent in an activity of daily living based on the person's daily need or need on the days during the week the activity is completed for:\n(i) cuing and constant supervision to complete the task; or\n(ii) hands-on assistance to complete the task; and\n(2) a child may not be found to be dependent in an activity of daily living if because of the child's age an adult would either perform the activity for the child or assist the child with the activity. Assistance needed is the assistance appropriate for a typical child of the same age.\n(c) Assessment for complex health-related needs must meet the criteria in this paragraph. A recipient qualifies as having complex health-related needs if the recipient has one or more of the interventions that are ordered by a physician, advanced practice registered nurse, or physician assistant; specified in a personal care assistance care plan or assessment summary developed under section 256B.0911; and found in the following:\n(1) tube feedings requiring:\n(i) a gastrojejunostomy tube; or\n(ii) continuous tube feeding lasting longer than 12 hours per day;\n(2) wounds described as:\n(i) stage III or stage IV;\n(ii) multiple wounds;\n(iii) requiring sterile or clean dressing changes or a wound vac; or\n(iv) open lesions such as burns, fistulas, tube sites, or ostomy sites that require specialized care;\n(3) parenteral therapy described as:\n(i) IV therapy more than two times per week lasting longer than four hours for each treatment; or\n(ii) total parenteral nutrition (TPN) daily;\n(4) respiratory interventions, including:\n(i) oxygen required more than eight hours per day;\n(ii) respiratory vest more than one time per day;\n(iii) bronchial drainage treatments more than two times per day;\n(iv) sterile or clean suctioning more than six times per day;\n(v) dependence on another to apply respiratory ventilation augmentation devices such as BiPAP and CPAP; and\n(vi) ventilator dependence under section 256B.0652;\n(5) insertion and maintenance of catheter, including:\n(i) sterile catheter changes more than one time per month;\n(ii) clean intermittent catheterization, and including self-catheterization more than six times per day; or\n(iii) bladder irrigations;\n(6) bowel program more than two times per week requiring more than 30 minutes to perform each time;\n(7) neurological intervention, including:\n(i) seizures more than two times per week and requiring significant physical assistance to maintain safety; or\n(ii) swallowing disorders diagnosed by a physician, advanced practice registered nurse, or physician assistant and requiring specialized assistance from another on a daily basis; and\n(8) other congenital or acquired diseases creating a need for significantly increased direct hands-on assistance and interventions in six to eight activities of daily living.\n(d) An assessment of behaviors must meet the criteria in this paragraph. A recipient qualifies as having a need for assistance due to behaviors if the recipient's behavior requires assistance at least four times per week and shows one or more of the following behaviors:\n(1) physical aggression towards self or others, or destruction of property that requires the immediate response of another person;\n(2) increased vulnerability due to cognitive deficits or socially inappropriate behavior; or\n(3) increased need for assistance for recipients who are verbally aggressive or resistive to care so that the time needed to perform activities of daily living is increased.\n(a) The assessor, with the recipient or responsible party, shall review the assessment information and determine referrals for other payers, services, and community supports as appropriate.\n(b) The recipient must be referred for evaluation, services, or supports that are appropriate to help meet the recipient's needs including, but not limited to, the following circumstances:\n(1) when there is another payer who is responsible to provide the service to meet the recipient's needs;\n(2) when the recipient qualifies for assistance due to mental illness or behaviors under this section, a referral for a mental health diagnostic and functional assessment must be completed, or referral must be made for other specific mental health services or other community services;\n(3) when the recipient is eligible for medical assistance and meets medical assistance eligibility for a home health aide or skilled nurse visit;\n(4) when the recipient would benefit from an evaluation for another service; and\n(5) when there is a more appropriate service to meet the assessed needs.\n(c) The reimbursement rates for public health nurse visits that relate to the provision of personal care assistance services under this section and section 256B.0625, subdivision 19a, are:\n(1) $210.50 for a face-to-face assessment visit;\n(2) $105.25 for each service update; and\n(3) $105.25 for each request for a temporary service increase.\n(d) The rates specified in paragraph (c) must be adjusted to reflect provider rate increases for personal care assistance services that are approved by the legislature for the fiscal year ending June 30, 2000, and subsequent fiscal years. Any requirements applied by the legislature to provider rate increases for personal care assistance services also apply to adjustments under this paragraph.\n(e) Effective July 1, 2008, the payment rate for an assessment under this section and section 256B.0651 shall be reduced by 25 percent when the assessment is not completed on time and the service agreement documentation is not submitted in time to continue services. The commissioner shall reduce the amount of the claim for those assessments that are not submitted on time.\nThe service plan must be completed by the assessor with the recipient and responsible party on a form determined by the commissioner and include a summary of the assessment with a description of the need, authorized amount, and expected outcomes and goals of personal care assistance services. The recipient and the provider chosen by the recipient or responsible party must be given a copy of the completed service plan within ten working days of the assessment. The recipient or responsible party must be given information by the assessor about the options in the personal care assistance program to allow for review and decision making.\n(a) Each recipient must have a current personal care assistance care plan based on the service plan in subdivision 6 that is developed by the qualified professional with the recipient and responsible party. A copy of the most current personal care assistance care plan is required to be in the recipient's home and in the recipient's file at the provider agency.\n(b) The personal care assistance care plan must have the following components:\n(1) start and end date of the care plan;\n(2) recipient demographic information, including name and telephone number;\n(3) emergency numbers, procedures, and a description of measures to address identified safety and vulnerability issues, including a backup staffing plan;\n(4) name of responsible party and instructions for contact;\n(5) description of the recipient's individualized needs for assistance with activities of daily living, instrumental activities of daily living, health-related tasks, and behaviors; and\n(6) dated signatures of recipient or responsible party and qualified professional.\n(c) The personal care assistance care plan must have instructions and comments about the recipient's needs for assistance and any special instructions or procedures required, including whether or not the recipient has requested a personal care assistant of the same gender. The month-to-month plan for the use of personal care assistance services is part of the personal care assistance care plan. The personal care assistance care plan must be completed within the first week after start of services with a personal care provider agency and must be updated as needed when there is a change in need for personal care assistance services. A new personal care assistance care plan is required annually at the time of the reassessment.\nIf a recipient requests a personal care assistant of the same gender as the recipient, the personal care assistance agency must make a reasonable effort to fulfill the request.\nThe personal care assistance program requires communication with the recipient's physician, advanced practice registered nurse, or physician assistant about a recipient's assessed needs for personal care assistance services. The commissioner shall work with the state medical director to develop options for communication with the recipient's physician, advanced practice registered nurse, or physician assistant.\n(a) \"Responsible party\" means an individual who is capable of providing the support necessary to assist the recipient to live in the community.\n(b) A responsible party must be 18 years of age, actively participate in planning and directing of personal care assistance services, and attend all assessments for the recipient.\n(c) A responsible party must not be the:\n(1) personal care assistant;\n(2) qualified professional;\n(3) home care provider agency owner or manager;\n(4) home care provider agency staff unless staff who are not listed in clauses (1) to (3) are related to the recipient by blood, marriage, or adoption; or\n(5) county staff acting as part of employment.\n(d) A licensed family foster parent who lives with the recipient may be the responsible party as long as the family foster parent meets the other responsible party requirements.\n(e) A responsible party is required when:\n(1) the person is a minor according to section 524.5-102, subdivision 10;\n(2) the person is an incapacitated adult according to section 524.5-102, subdivision 6, resulting in a court-appointed guardian; or\n(3) the assessment according to subdivision 3a determines that the recipient is in need of a responsible party to direct the recipient's care.\n(f) There may be two persons designated as the responsible party for reasons such as divided households and court-ordered custodies. Each person named as responsible party must meet the program criteria and responsibilities.\n(g) The recipient or the recipient's legal representative shall appoint a responsible party if necessary to direct and supervise the care provided to the recipient. The responsible party must be identified at the time of assessment and listed on the recipient's service agreement and personal care assistance care plan.\n(a) A responsible party shall enter into a written agreement with a personal care assistance provider agency, on a form determined by the commissioner, to perform the following duties:\n(1) be available while care is provided in a method agreed upon by the individual or the individual's legal representative and documented in the recipient's personal care assistance care plan;\n(2) monitor personal care assistance services to ensure the recipient's personal care assistance care plan is being followed; and\n(3) review and sign personal care assistance time sheets after services are provided to provide verification of the personal care assistance services.\nFailure to provide the support required by the recipient must result in a referral to the county common entry point.\n(b) Responsible parties who are parents of minors or guardians of minors or incapacitated persons may delegate the responsibility to another adult who is not the personal care assistant during a temporary absence of at least 24 hours but not more than six months. The person delegated as a responsible party must be able to meet the definition of the responsible party. The responsible party must ensure that the delegate performs the functions of the responsible party, is identified at the time of the assessment, and is listed on the personal care assistance care plan. The responsible party must communicate to the personal care assistance provider agency about the need for a delegated responsible party, including the name of the delegated responsible party and contact numbers.\n(a) A personal care assistant must meet the following requirements:\n(1) be at least 18 years of age with the exception of persons who are 16 or 17 years of age with these additional requirements:\n(i) supervision by a qualified professional every 60 days; and\n(ii) employment by only one personal care assistance provider agency responsible for compliance with current labor laws;\n(2) be employed by a personal care assistance provider agency;\n(3) enroll with the department as a personal care assistant after clearing a background study. Except as provided in subdivision 11a, before a personal care assistant provides services, the personal care assistance provider agency must initiate a background study on the personal care assistant under chapter 245C, and the personal care assistance provider agency must have received a notice from the commissioner that the personal care assistant is:\n(i) not disqualified under section 245C.14; or\n(ii) disqualified, but the personal care assistant has received a set aside of the disqualification under section 245C.22;\n(4) be able to effectively communicate with the recipient and personal care assistance provider agency;\n(5) be able to provide covered personal care assistance services according to the recipient's personal care assistance care plan, respond appropriately to recipient needs, and report changes in the recipient's condition to the supervising qualified professional, physician, advanced practice registered nurse, or physician assistant;\n(6) not be a consumer of personal care assistance services;\n(7) maintain daily written records including, but not limited to, time sheets under subdivision 12;\n(8) effective January 1, 2010, complete standardized training as determined by the commissioner before completing enrollment. The training must be available in languages other than English and to those who need accommodations due to disabilities. Personal care assistant training must include successful completion of the following training components: basic first aid, vulnerable adult, child maltreatment, OSHA universal precautions, basic roles and responsibilities of personal care assistants including information about assistance with lifting and transfers for recipients, emergency preparedness, orientation to positive behavioral practices, fraud issues, and completion of time sheets. Upon completion of the training components, the personal care assistant must demonstrate the competency to provide assistance to recipients;\n(9) complete training and orientation on the needs of the recipient; and\n(10) be limited to providing and being paid for up to 310 hours per month of personal care assistance services regardless of the number of recipients being served or the number of personal care assistance provider agencies enrolled with. The number of hours worked per day shall not be disallowed by the department unless in violation of the law.\n(b) A legal guardian may be a personal care assistant if the guardian is not being paid for the guardian services and meets the criteria for personal care assistants in paragraph (a).\n(c) Persons who do not qualify as a personal care assistant include parents, stepparents, and legal guardians of minors; spouses; paid legal guardians of adults; family foster care providers, except as otherwise allowed in section 256B.0625, subdivision 19a; and staff of a residential setting.\n(d) Personal care assistance services qualify for the enhanced rate described in subdivision 17a if the personal care assistant providing the services:\n(1) provides covered services to a recipient who qualifies for ten or more hours per day of personal care assistance services; and\n(2) satisfies the current requirements of Medicare for training and competency or competency evaluation of home health aides or nursing assistants, as provided in the Code of Federal Regulations, title 42, section 483.151 or 484.36, or alternative state-approved training or competency requirements.\nThe personal care assistant for a recipient may be allowed to enroll with a different personal care assistant provider agency upon initiation of a new background study according to chapter 245C, if all of the following are met:\n(1) the commissioner determines that a change in enrollment or affiliation of the personal care assistant is needed in order to ensure continuity of services and protect the health and safety of the recipient;\n(2) the chosen agency has been continuously enrolled as a personal care assistance provider agency for at least two years;\n(3) the recipient chooses to transfer to the personal care assistance provider agency;\n(4) the personal care assistant has been continuously enrolled with the former personal care assistance provider agency since the last background study was completed; and\n(5) the personal care assistant continues to meet requirements of subdivision 11, excluding paragraph (a), clause (3).\n(a) Personal care assistance services for a recipient must be documented daily by each personal care assistant, on a time sheet form approved by the commissioner. All documentation may be web-based, electronic, or paper documentation. The completed form must be submitted on a monthly basis to the provider and kept in the recipient's health record.\n(b) The activity documentation must correspond to the personal care assistance care plan and be reviewed by the qualified professional.\n(c) The personal care assistant time sheet must be on a form approved by the commissioner documenting time the personal care assistant provides services in the home. The following criteria must be included in the time sheet:\n(1) full name of personal care assistant and individual provider number;\n(2) provider name and telephone numbers;\n(3) full name of recipient and either the recipient's medical assistance identification number or date of birth;\n(4) consecutive dates, including month, day, and year, and arrival and departure times with a.m. or p.m. notations;\n(5) signatures of recipient or the responsible party;\n(6) personal signature of the personal care assistant;\n(7) any shared care provided, if applicable;\n(8) a statement that it is a federal crime to provide false information on personal care service billings for medical assistance payments;\n(9) dates and location of recipient stays in a hospital, care facility, or incarceration; and\n(10) any time spent traveling, as described in subdivision 1, paragraph (i), including start and stop times with a.m. and p.m. designations, the origination site, and the destination site.\n[See Note.]\n(a) The qualified professional must work for a personal care assistance provider agency, meet the definition of qualified professional under section 256B.0625, subdivision 19c, clear a background study, and meet provider training requirements. Before a qualified professional provides services, the personal care assistance provider agency must initiate a background study on the qualified professional under chapter 245C, and the personal care assistance provider agency must have received a notice from the commissioner that the qualified professional:\n(1) is not disqualified under section 245C.14; or\n(2) is disqualified, but the qualified professional has received a set aside of the disqualification under section 245C.22.\n(b) The qualified professional shall perform the duties of training, supervision, and evaluation of the personal care assistance staff and evaluation of the effectiveness of personal care assistance services. The qualified professional shall:\n(1) develop and monitor with the recipient a personal care assistance care plan based on the service plan and individualized needs of the recipient;\n(2) develop and monitor with the recipient a monthly plan for the use of personal care assistance services;\n(3) review documentation of personal care assistance services provided;\n(4) provide training and ensure competency for the personal care assistant in the individual needs of the recipient; and\n(5) document all training, communication, evaluations, and needed actions to improve performance of the personal care assistants.\n(c) The qualified professional shall complete the provider training with basic information about the personal care assistance program approved by the commissioner. Newly hired qualified professionals must complete the training within six months of the date hired by a personal care assistance provider agency. Qualified professionals who have completed the required training as a worker from a personal care assistance provider agency do not need to repeat the required training if they are hired by another agency, if they have completed the training within the last three years. The required training must be available with meaningful access according to title VI of the Civil Rights Act and federal regulations adopted under that law or any guidance from the United States Health and Human Services Department. The required training must be available online or by electronic remote connection. The required training must provide for competency testing to demonstrate an understanding of the content without attending in-person training. A qualified professional is allowed to be employed and is not subject to the training requirement until the training is offered online or through remote electronic connection. A qualified professional employed by a personal care assistance provider agency certified for participation in Medicare as a home health agency is exempt from the training required in this subdivision. When available, the qualified professional working for a Medicare-certified home health agency must successfully complete the competency test. The commissioner shall ensure there is a mechanism in place to verify the identity of persons completing the competency testing electronically.\n(a) Effective January 1, 2010, all personal care assistants must be supervised by a qualified professional.\n(b) Through direct training, observation, return demonstrations, and consultation with the staff and the recipient, the qualified professional must ensure and document that the personal care assistant is:\n(1) capable of providing the required personal care assistance services;\n(2) knowledgeable about the plan of personal care assistance services before services are performed; and\n(3) able to identify conditions that should be immediately brought to the attention of the qualified professional.\n(c) The qualified professional shall evaluate the personal care assistant within the first 14 days of starting to provide regularly scheduled services for a recipient, or sooner as determined by the qualified professional, except for the personal care assistance choice option under subdivision 19, paragraph (a), clause (4). For the initial evaluation, the qualified professional shall evaluate the personal care assistance services for a recipient through direct observation of a personal care assistant's work. The qualified professional may conduct additional training and evaluation visits, based upon the needs of the recipient and the personal care assistant's ability to meet those needs. Subsequent visits to evaluate the personal care assistance services provided to a recipient do not require direct observation of each personal care assistant's work and shall occur:\n(1) at least every 90 days thereafter for the first year of a recipient's services;\n(2) every 120 days after the first year of a recipient's service or whenever needed for response to a recipient's request for increased supervision of the personal care assistance staff; and\n(3) after the first 180 days of a recipient's service, supervisory visits may alternate between unscheduled phone or Internet technology and in-person visits, unless the in-person visits are needed according to the care plan.\n(d) Communication with the recipient is a part of the evaluation process of the personal care assistance staff.\n(e) At each supervisory visit, the qualified professional shall evaluate personal care assistance services including the following information:\n(1) satisfaction level of the recipient with personal care assistance services;\n(2) review of the month-to-month plan for use of personal care assistance services;\n(3) review of documentation of personal care assistance services provided;\n(4) whether the personal care assistance services are meeting the goals of the service as stated in the personal care assistance care plan and service plan;\n(5) a written record of the results of the evaluation and actions taken to correct any deficiencies in the work of a personal care assistant; and\n(6) revision of the personal care assistance care plan as necessary in consultation with the recipient or responsible party, to meet the needs of the recipient.\n(f) The qualified professional shall complete the required documentation in the agency recipient and employee files and the recipient's home, including the following documentation:\n(1) the personal care assistance care plan based on the service plan and individualized needs of the recipient;\n(2) a month-to-month plan for use of personal care assistance services;\n(3) changes in need of the recipient requiring a change to the level of service and the personal care assistance care plan;\n(4) evaluation results of supervision visits and identified issues with personal care assistance staff with actions taken;\n(5) all communication with the recipient and personal care assistance staff; and\n(6) hands-on training or individualized training for the care of the recipient.\n(g) The documentation in paragraph (f) must be done on agency templates.\n(h) The services that are not eligible for payment as qualified professional services include:\n(1) direct professional nursing tasks that could be assessed and authorized as skilled nursing tasks;\n(2) agency administrative activities;\n(3) training other than the individualized training required to provide care for a recipient; and\n(4) any other activity that is not described in this section.\n(a) For recipients with chronic health conditions or severely compromised immune systems, a qualified professional may conduct the supervision required under subdivision 14 via two-way interactive audio and visual telecommunication if, at the recipient's request, the recipient's primary health care provider:\n(1) determines that remote supervision is appropriate; and\n(2) documents the determination under clause (1) in a statement of need or other document that is subsequently included in the recipient's personal care assistance care plan.\n(b) Notwithstanding any other provision of law, a care plan developed or amended via remote supervision may be executed by electronic signature.\n(c) A personal care assistance provider agency must not conduct its first supervisory visit for a recipient or complete its initial personal care assistance care plan via a remote visit.\n(d) A recipient may request to return to in-person supervisory visits at any time.\n[See Note.]\n(a) \"Flexible use\" means the scheduled use of authorized hours of personal care assistance services, which vary within a service authorization period covering no more than six months, in order to more effectively meet the needs and schedule of the recipient. Each 12-month service agreement is divided into two six-month authorization date spans. No more than 75 percent of the total authorized units for a 12-month service agreement may be used in a six-month date span.\n(b) Authorization of flexible use occurs during the authorization process under section 256B.0652. The flexible use of authorized hours does not increase the total amount of authorized hours available to a recipient. The commissioner shall not authorize additional personal care assistance services to supplement a service authorization that is exhausted before the end date under a flexible service use plan, unless the assessor determines a change in condition and a need for increased services is established. Authorized hours not used within the six-month period must not be carried over to another time period.\n(c) A recipient who has terminated personal care assistance services before the end of the 12-month authorization period must not receive additional hours upon reapplying during the same 12-month authorization period, except if a change in condition is documented. Services must be prorated for the remainder of the 12-month authorization period based on the first six-month assessment.\n(d) The recipient, responsible party, and qualified professional must develop a written month-to-month plan of the projected use of personal care assistance services that is part of the personal care assistance care plan and ensures:\n(1) that the health and safety needs of the recipient are met throughout both date spans of the authorization period; and\n(2) that the total authorized amount of personal care assistance services for each date span must not be used before the end of each date span in the authorization period.\n(e) The personal care assistance provider agency shall monitor the use of personal care assistance services to ensure health and safety needs of the recipient are met throughout both date spans of the authorization period. The commissioner or the commissioner's designee shall provide written notice to the provider and the recipient or responsible party when a recipient is at risk of exceeding the personal care assistance services prior to the end of the six-month period.\n(f) Misuse and abuse of the flexible use of personal care assistance services resulting in the overuse of units in a manner where the recipient will not have enough units to meet their needs for assistance and ensure health and safety for the entire six-month date span may lead to an action by the commissioner. The commissioner may take action including, but not limited to: (1) restricting recipients to service authorizations of no more than one month in duration; (2) requiring the recipient to have a responsible party; and (3) requiring a qualified professional to monitor and report services on a monthly basis.\n(a) Medical assistance payments for shared personal care assistance services are limited according to this subdivision.\n(b) Shared service is the provision of personal care assistance services by a personal care assistant to two or three recipients, eligible for medical assistance, who voluntarily enter into an agreement to receive services at the same time and in the same setting.\n(c) For the purposes of this subdivision, \"setting\" means:\n(1) the home residence or family foster care home of one or more of the individual recipients; or\n(2) a child care program licensed under chapter 142B or operated by a local school district or private school.\n(d) Shared personal care assistance services follow the same criteria for covered services as subdivision 2.\n(e) Noncovered shared personal care assistance services include the following:\n(1) services for more than three recipients by one personal care assistant at one time;\n(2) staff requirements for child care programs under chapter 245C;\n(3) caring for multiple recipients in more than one setting;\n(4) additional units of personal care assistance based on the selection of the option; and\n(5) use of more than one personal care assistance provider agency for the shared care services.\n(f) The option of shared personal care assistance is elected by the recipient or the responsible party with the assistance of the assessor. The option must be determined appropriate based on the ages of the recipients, compatibility, and coordination of their assessed care needs. The recipient or the responsible party, in conjunction with the qualified professional, shall arrange the setting and grouping of shared services based on the individual needs and preferences of the recipients. The personal care assistance provider agency shall offer the recipient or the responsible party the option of shared or one-on-one personal care assistance services or a combination of both. The recipient or the responsible party may withdraw from participating in a shared services arrangement at any time.\n(g) Authorization for the shared service option must be determined by the commissioner based on the criteria that the shared service is appropriate to meet all of the recipients' needs and their health and safety is maintained. The authorization of shared services is part of the overall authorization of personal care assistance services. Nothing in this subdivision must be construed to reduce the total number of hours authorized for an individual recipient.\n(h) A personal care assistant providing shared personal care assistance services must:\n(1) receive training specific for each recipient served; and\n(2) follow all required documentation requirements for time and services provided.\n(i) A qualified professional shall:\n(1) evaluate the ability of the personal care assistant to provide services for all of the recipients in a shared setting;\n(2) visit the shared setting as services are being provided at least once every six months or whenever needed for response to a recipient's request for increased supervision of the personal care assistance staff;\n(3) provide ongoing monitoring and evaluation of the effectiveness and appropriateness of the shared services;\n(4) develop a contingency plan with each of the recipients which accounts for absence of the recipient in a shared services setting due to illness or other circumstances;\n(5) obtain permission from each of the recipients who are sharing a personal care assistant for number of shared hours for services provided inside and outside the home residence; and\n(6) document the training completed by the personal care assistants specific to the shared setting and recipients sharing services.\nThe commissioner shall provide a rate system for shared personal care assistance services. For two persons sharing services, the rate paid to a provider must not exceed one and one-half times the rate paid for serving a single individual, and for three persons sharing services, the rate paid to a provider must not exceed twice the rate paid for serving a single individual. These rates apply only when all of the criteria for the shared care personal care assistance service have been met.\n(a) An enhanced rate of 107.5 percent of the rate paid for personal care assistance services shall be paid for services provided to persons who qualify for ten or more hours of personal care assistance services per day when provided by a personal care assistant who meets the requirements of subdivision 11, paragraph (d).\n(b) A personal care assistance provider must use all additional revenue attributable to the rate enhancements under this subdivision for the wages and wage-related costs of the personal care assistants, including any corresponding increase in the employer's share of FICA taxes, Medicare taxes, state and federal unemployment taxes, and workers' compensation premiums. The agency must not use the additional revenue attributable to any enhanced rate under this subdivision to pay for mileage reimbursement, health and dental insurance, life insurance, disability insurance, long-term care insurance, uniform allowance, contributions to employee retirement accounts, or any other employee benefits.\n(c) Any change in the eligibility criteria for the enhanced rate for personal care assistance services as described in this subdivision and referenced in subdivision 11, paragraph (d), does not constitute a change in a term or condition for individual providers as defined in section 256B.0711, and is not subject to the state's obligation to meet and negotiate under chapter 179A.\n(a) The commissioner may allow a recipient of personal care assistance services to use a fiscal intermediary to assist the recipient in paying and accounting for medically necessary covered personal care assistance services. Unless otherwise provided in this section, all other statutory and regulatory provisions relating to personal care assistance services apply to a recipient using the personal care assistance choice option.\n(b) Personal care assistance choice is an option of the personal care assistance program that allows the recipient who receives personal care assistance services to be responsible for the hiring, training, scheduling, and firing of personal care assistants according to the terms of the written agreement with the personal care assistance choice agency required under subdivision 20, paragraph (a). This program offers greater control and choice for the recipient in who provides the personal care assistance service and when the service is scheduled. The recipient or the recipient's responsible party must choose a personal care assistance choice provider agency as a fiscal intermediary. This personal care assistance choice provider agency manages payroll, invoices the state, is responsible for all payroll-related taxes and insurance, including premiums for family and medical benefit insurance, and is responsible for providing the consumer training and support in managing the recipient's personal care assistance services.\n(a) Under personal care assistance choice, the recipient or responsible party shall:\n(1) recruit, hire, schedule, and terminate personal care assistants according to the terms of the written agreement required under subdivision 20, paragraph (a);\n(2) develop a personal care assistance care plan based on the assessed needs and addressing the health and safety of the recipient with the assistance of a qualified professional as needed;\n(3) orient and train the personal care assistant with assistance as needed from the qualified professional;\n(4) supervise and evaluate the personal care assistant with the qualified professional, who is required to visit the recipient at least every 180 days;\n(5) monitor and verify in writing and report to the personal care assistance choice agency the number of hours worked by the personal care assistant and the qualified professional;\n(6) engage in an annual reassessment as required in subdivision 3a to determine continuing eligibility and service authorization;\n(7) use the same personal care assistance choice provider agency if shared personal assistance care is being used; and\n(8) ensure that a personal care assistant driving the recipient under subdivision 1, paragraph (i), has a valid driver's license and the vehicle used is registered and insured according to Minnesota law.\n(b) The personal care assistance choice provider agency shall:\n(1) meet all personal care assistance provider agency standards;\n(2) enter into a written agreement with the recipient, responsible party, and personal care assistants;\n(3) not be related as a parent, child, sibling, or spouse to the recipient or the personal care assistant; and\n(4) ensure arm's-length transactions without undue influence or coercion with the recipient and personal care assistant.\n(c) The duties of the personal care assistance choice provider agency are to:\n(1) be the employer of the personal care assistant and the qualified professional for employment law and related regulations including but not limited to purchasing and maintaining workers' compensation, unemployment insurance, surety and fidelity bonds, and liability insurance, and submit any or all necessary documentation including but not limited to workers' compensation, unemployment insurance, and labor market data required under section 256B.4912, subdivision 1a;\n(2) bill the medical assistance program for personal care assistance services and qualified professional services;\n(3) request and complete background studies that comply with the requirements for personal care assistants and qualified professionals;\n(4) pay the personal care assistant and qualified professional based on actual hours of services provided;\n(5) withhold and pay all applicable federal and state taxes;\n(6) verify and keep records of hours worked by the personal care assistant and qualified professional;\n(7) make the arrangements and pay taxes and other benefits, if any, and comply with any legal requirements for a Minnesota employer;\n(8) enroll in the medical assistance program as a personal care assistance choice agency; and\n(9) enter into a written agreement as specified in subdivision 20 before services are provided.\n[See Note.]\n(a) Before services commence under the personal care assistance choice option, and annually thereafter, the personal care assistance choice provider agency and the recipient or responsible party shall enter into a written agreement. The annual agreement must be provided to the recipient or responsible party, each personal care assistant, and the qualified professional when completed, and include at a minimum:\n(1) duties of the recipient, qualified professional, personal care assistant, and personal care assistance choice provider agency;\n(2) salary and benefits for the personal care assistant and the qualified professional;\n(3) administrative fee of the personal care assistance choice provider agency and services paid for with that fee, including background study fees;\n(4) grievance procedures to respond to complaints;\n(5) procedures for hiring and terminating the personal care assistant; and\n(6) documentation requirements including, but not limited to, time sheets, activity records, and the personal care assistance care plan.\n(b) Effective January 1, 2010, except for the administrative fee of the personal care assistance choice provider agency as reported on the written agreement, the remainder of the rates paid to the personal care assistance choice provider agency must be used to pay for the salary and benefits for the personal care assistant or the qualified professional. The provider agency must use a minimum of 72.5 percent of the revenue generated by the medical assistance rate for personal care assistance services for employee personal care assistant wages and benefits. The revenue generated by the qualified professional and the reasonable costs associated with the qualified professional shall not be used in making this calculation.\n(c) The commissioner shall deny, revoke, or suspend the authorization to use the personal care assistance choice option if:\n(1) it has been determined by the qualified professional or public health nurse that the use of this option jeopardizes the recipient's health and safety;\n(2) the parties have failed to comply with the written agreement specified in this subdivision;\n(3) the use of the option has led to abusive or fraudulent billing for personal care assistance services; or\n(4) the department terminates the personal care assistance choice option.\n(d) The recipient or responsible party may appeal the commissioner's decision in paragraph (c) according to section 256.045. The denial, revocation, or suspension to use the personal care assistance choice option must not affect the recipient's authorized level of personal care assistance services.\n(a) All personal care assistance provider agencies must provide, at the time of enrollment, reenrollment, and revalidation as a personal care assistance provider agency in a format determined by the commissioner, information and documentation that includes, but is not limited to, the following:\n(1) the personal care assistance provider agency's current contact information including address, telephone number, and email address;\n(2) proof of surety bond coverage for each business location providing services. Upon new enrollment, or if the provider's Medicaid revenue in the previous calendar year is up to and including $300,000, the provider agency must purchase a surety bond of $50,000. If the Medicaid revenue in the previous year is over $300,000, the provider agency must purchase a surety bond of $100,000. The surety bond must be in a form approved by the commissioner, must be renewed annually, and must allow for recovery of costs and fees in pursuing a claim on the bond;\n(3) proof of fidelity bond coverage in the amount of $20,000 for each business location providing service;\n(4) proof of workers' compensation insurance coverage identifying the business location where personal care assistance services are provided;\n(5) proof of liability insurance coverage identifying the business location where personal care assistance services are provided and naming the department as a certificate holder;\n(6) a copy of the personal care assistance provider agency's written policies and procedures including: hiring of employees; training requirements; service delivery; and employee and consumer safety including process for notification and resolution of consumer grievances, identification and prevention of communicable diseases, and employee misconduct;\n(7) copies of all other forms the personal care assistance provider agency uses in the course of daily business including, but not limited to:\n(i) a copy of the personal care assistance provider agency's time sheet if the time sheet varies from the standard time sheet for personal care assistance services approved by the commissioner, and a letter requesting approval of the personal care assistance provider agency's nonstandard time sheet;\n(ii) the personal care assistance provider agency's template for the personal care assistance care plan; and\n(iii) the personal care assistance provider agency's template for the written agreement in subdivision 20 for recipients using the personal care assistance choice option, if applicable;\n(8) a list of all training and classes that the personal care assistance provider agency requires of its staff providing personal care assistance services;\n(9) documentation that the personal care assistance provider agency and staff have successfully completed all the training required by this section, including the requirements under subdivision 11, paragraph (d), if enhanced personal care assistance services are provided and submitted for an enhanced rate under subdivision 17a;\n(10) documentation of the agency's marketing practices;\n(11) disclosure of ownership, leasing, or management of all residential properties that is used or could be used for providing home care services;\n(12) documentation that the agency will use the following percentages of revenue generated from the medical assistance rate paid for personal care assistance services for employee personal care assistant wages and benefits: 72.5 percent of revenue in the personal care assistance choice option and 72.5 percent of revenue from other personal care assistance providers. The revenue generated by the qualified professional and the reasonable costs associated with the qualified professional shall not be used in making this calculation; and\n(13) effective May 15, 2010, documentation that the agency does not burden recipients' free exercise of their right to choose service providers by requiring personal care assistants to sign an agreement not to work with any particular personal care assistance recipient or for another personal care assistance provider agency after leaving the agency and that the agency is not taking action on any such agreements or requirements regardless of the date signed.\n(b) Personal care assistance provider agencies shall provide the information specified in paragraph (a) to the commissioner at the time the personal care assistance provider agency enrolls as a vendor or upon request from the commissioner. The commissioner shall collect the information specified in paragraph (a) from all personal care assistance providers beginning July 1, 2009.\n(c) All personal care assistance provider agencies shall require all employees in management and supervisory positions and owners of the agency who are active in the day-to-day management and operations of the agency to complete mandatory training as determined by the commissioner before submitting an application for enrollment of the agency as a provider. All personal care assistance provider agencies shall also require qualified professionals to complete the training required by subdivision 13 before submitting an application for enrollment of the agency as a provider. Employees in management and supervisory positions and owners who are active in the day-to-day operations of an agency who have completed the required training as an employee with a personal care assistance provider agency do not need to repeat the required training if they are hired by another agency, if they have completed the training within the past three years. By September 1, 2010, the required training must be available with meaningful access according to title VI of the Civil Rights Act and federal regulations adopted under that law or any guidance from the United States Health and Human Services Department. The required training must be available online or by electronic remote connection. The required training must provide for competency testing. Personal care assistance provider agency billing staff shall complete training about personal care assistance program financial management. This training is effective July 1, 2009. Any personal care assistance provider agency enrolled before that date shall, if it has not already, complete the provider training within 18 months of July 1, 2009. Any new owners or employees in management and supervisory positions involved in the day-to-day operations are required to complete mandatory training as a requisite of working for the agency. Personal care assistance provider agencies certified for participation in Medicare as home health agencies are exempt from the training required in this subdivision. When available, Medicare-certified home health agency owners, supervisors, or managers must successfully complete the competency test.\n(d) All surety bonds, fidelity bonds, workers' compensation insurance, and liability insurance required by this subdivision must be maintained continuously. After initial enrollment, a provider must submit proof of bonds and required coverages at any time at the request of the commissioner. Services provided while there are lapses in coverage are not eligible for payment. Lapses in coverage may result in sanctions, including termination. The commissioner shall send instructions and a due date to submit the requested information to the personal care assistance provider agency.\nMS 2018 [Repealed, 1Sp2019 c 9 art 7 s 47]\n(a) A terminated personal care assistance provider agency, including all named individuals on the current enrollment disclosure form and known or discovered affiliates of the personal care assistance provider agency, is not eligible to enroll as a personal care assistance provider agency for two years following the termination.\n(b) After the two-year period in paragraph (a), if the provider seeks to reenroll as a personal care assistance provider agency, the personal care assistance provider agency must be placed on a one-year probation period, beginning after completion of the following:\n(1) the department's provider trainings under this section; and\n(2) initial enrollment requirements under subdivision 21.\n(c) During the probationary period the commissioner shall complete site visits and request submission of documentation to review compliance with program policy.\nA personal care assistance provider agency shall:\n(1) enroll as a Medicaid provider meeting all provider standards, including completion of the required provider training;\n(2) comply with general medical assistance coverage requirements;\n(3) demonstrate compliance with law and policies of the personal care assistance program to be determined by the commissioner;\n(4) comply with background study requirements;\n(5) verify and keep records of hours worked by the personal care assistant and qualified professional;\n(6) not engage in any agency-initiated direct contact or marketing in person, by phone, or other electronic means to potential recipients, guardians, or family members;\n(7) pay the personal care assistant and qualified professional based on actual hours of services provided;\n(8) withhold and pay all applicable federal and state taxes;\n(9) document that the agency uses a minimum of 72.5 percent of the revenue generated by the medical assistance rate for personal care assistance services for employee personal care assistant wages and benefits. The revenue generated by the qualified professional and the reasonable costs associated with the qualified professional shall not be used in making this calculation;\n(10) make the arrangements and pay unemployment insurance, taxes, workers' compensation, liability insurance, and other benefits, if any;\n(11) enter into a written agreement under subdivision 20 before services are provided;\n(12) report suspected neglect and abuse to the common entry point according to section 256B.0651;\n(13) provide the recipient with a copy of the home care bill of rights at start of service;\n(14) request reassessments at least 60 days prior to the end of the current authorization for personal care assistance services, on forms provided by the commissioner;\n(15) comply with the labor market reporting requirements described in section 256B.4912, subdivision 1a;\n(16) document that the agency uses the additional revenue due to the enhanced rate under subdivision 17a for the wages and any corresponding increase in the employer's share of FICA taxes, Medicare taxes, state and federal unemployment taxes, and workers' compensation premiums of the PCAs whose services meet the requirements under subdivision 11, paragraph (d); and\n(17) ensure that a personal care assistant driving a recipient under subdivision 1, paragraph (i), has a valid driver's license and the vehicle used is registered and insured according to Minnesota law.\n[See Note.]\nPersonal care assistance provider agencies enrolled to provide personal care assistance services under the medical assistance program shall comply with the following:\n(1) owners who have a five percent interest or more and all managing employees are subject to a background study as provided in chapter 245C. This applies to currently enrolled personal care assistance provider agencies and those agencies seeking enrollment as a personal care assistance provider agency. \"Managing employee\" has the same meaning as Code of Federal Regulations, title 42, section 455. An organization is barred from enrollment if:\n(i) the organization has not initiated background studies on owners and managing employees; or\n(ii) the organization has initiated background studies on owners and managing employees, but the commissioner has sent the organization a notice that an owner or managing employee of the organization has been disqualified under section 245C.14, and the owner or managing employee has not received a set aside of the disqualification under section 245C.22;\n(2) a background study must be initiated and completed for all qualified professionals; and\n(3) a background study must be initiated and completed for all personal care assistants.\nA personal care assistance provider agency shall establish and implement policies and procedures for prevention, control, and investigation of infections and communicable diseases according to current nationally recognized infection control practices or guidelines established by the United States Centers for Disease Control and Prevention, as well as applicable regulations of other federal or state agencies.\n(a) The personal care assistance provider agency is required to provide training for the personal care assistant responsible for working with a recipient who is ventilator dependent. All training must be administered by a respiratory therapist, nurse, physician assistant, or physician. Qualified professional supervision by a nurse must be completed and documented on file in the personal care assistant's employment record and the recipient's health record. If offering personal care services to a ventilator-dependent recipient, the personal care assistance provider agency shall demonstrate and document the ability to:\n(1) train the personal care assistant;\n(2) supervise the personal care assistant in the care of a ventilator-dependent recipient;\n(3) supervise the recipient and responsible party in the care of a ventilator-dependent recipient; and\n(4) provide documentation of the training and supervision in clauses (1) to (3) upon request.\n(b) A personal care assistant shall not undertake any clinical services, patient assessment, patient evaluation, or clinical education regarding the ventilator or the patient on the ventilator. These services may only be provided by health care professionals licensed or registered in this state.\n(c) A personal care assistant may only perform tasks associated with ventilator maintenance that are approved by the Board of Medical Practice in consultation with the Respiratory Care Practitioner Advisory Council and the Department of Human Services.\n(a) Required documentation must be completed and kept in the personal care assistance provider agency file or the recipient's home residence. The required documentation consists of:\n(1) employee files, including:\n(i) applications for employment;\n(ii) background study requests and results;\n(iii) orientation records about the agency policies;\n(iv) trainings completed with demonstration of competence, including verification of the completion of training required under subdivision 11, paragraph (d), if personal care assistance services eligible for the enhanced rate are provided and submitted for reimbursement under subdivision 17a;\n(v) supervisory visits;\n(vi) evaluations of employment; and\n(vii) signature on fraud statement;\n(2) recipient files, including:\n(i) demographics;\n(ii) emergency contact information and emergency backup plan;\n(iii) personal care assistance service plan;\n(iv) personal care assistance care plan;\n(v) month-to-month service use plan;\n(vi) all communication records;\n(vii) start of service information, including the written agreement with recipient; and\n(viii) date the home care bill of rights was given to the recipient;\n(3) agency policy manual, including:\n(i) policies for employment and termination;\n(ii) grievance policies with resolution of consumer grievances;\n(iii) staff and consumer safety;\n(iv) staff misconduct; and\n(v) staff hiring, service delivery, staff and consumer safety, staff misconduct, and resolution of consumer grievances;\n(4) time sheets for each personal care assistant along with completed activity sheets for each recipient served; and\n(5) agency marketing and advertising materials and documentation of marketing activities and costs.\n(b) The commissioner may assess a fine of up to $500 on provider agencies that do not consistently comply with the requirements of this subdivision.\nThe commissioner, counties, health plans, tribes, and personal care assistance providers shall work together to provide transitional assistance for recipients and families to come into compliance with the new requirements of this section that may require a change in living arrangement no later than August 10, 2010.\nThe commissioner must provide:\n(1) by October 31, 2009, information to recipients likely to be affected that (i) describes the changes to the personal care assistance program that may result in the loss of access to personal care assistance services, and (ii) includes resources to obtain further information; and\n(2) a service agreement authorizing personal care assistance hours of service at the previously authorized level, throughout the appeal process period, when a recipient requests services pending an appeal.\nWhen the commissioner is investigating a possible overpayment of Medicaid funds, the commissioner must be given immediate access without prior notice to the office during regular business hours and to documentation and records related to services provided and submission of claims for services provided. Denying the commissioner access to records is cause for immediate suspension of payment and/or terminating the personal care provider organization's enrollment according to section 256B.064.",
	"repealed": false
}