{
	"id": "162.18",
	"url": "https://www.revisor.mn.gov/statutes/cite/162.18",
	"title": "162.18 BONDS; MUNICIPAL.",
	"text": "Any city having a population of 5,000 or more may in accordance with chapter 475, except as otherwise provided herein, issue and sell its obligations for the purpose of establishing, locating, relocating, constructing, reconstructing, and improving municipal state-aid streets therein. In the resolution providing for the issuance of the obligations, the governing body of the municipality shall irrevocably pledge and appropriate to the sinking fund from which the obligations are payable, an amount of the moneys allotted or to be allotted to the municipality from its account in the municipal state-aid street fund sufficient to pay the principal of and the interest on the obligations as they respectively come due. The obligations shall be issued in amounts and on terms such that the average annual amount of principal and interest due in all subsequent calendar years on the obligations, including any similar obligations of the municipality which are outstanding, shall not exceed 90 percent of the amount of the last annual allotment preceding the bond issue received by the municipality from the construction account in the municipal state-aid street fund. All interest on the obligations shall be paid out of the municipality's normal maintenance account in the municipal state-aid street fund. Any such obligations may be made general obligations, but if moneys of the municipality other than moneys received from the municipal state-aid street fund, are used for payment of the obligations, the moneys so used shall be restored to the appropriate fund from the moneys next received by the municipality from the construction or maintenance account in the municipal state-aid street fund which are not required to be paid into a sinking fund for obligations.\nObligations issued hereunder may be authorized by resolution of the governing body without authorization by the electors, and shall not be included in the net debt of the municipality for the purpose of any statutory or charter limitation on indebtedness. Expenditures made from the proceeds of the obligations shall not be considered as part of the cost of government of the municipality within the meaning of any statutory or charter limitation on expenditures.\nMoneys received from the sale of the obligations shall be spent only in accordance with other provisions of law and the rules of the transportation commissioner relating to the establishment, location, relocation, construction, reconstruction, and improvement of municipal state-aid streets within the municipality issuing the obligations.\nAny municipality issuing and selling bonds pursuant to this section shall certify to the commissioner the amount of money required annually for the payment of principal and interest on the obligation. Upon receipt thereof, the commissioner shall certify to the commissioner of management and budget the sum of money needed annually by the municipality for the principal and interest, provided that the amount certified by the commissioner shall not exceed the limit heretofore specified. The commissioner of management and budget shall thereafter, until said bonds are retired, issue a payment annually in the amount certified payable to the fiscal officer of the municipality, and the amount thereof shall be deposited by the fiscal officer in the sinking fund from which the obligations are payable.\nThe powers granted in this section are in addition to all powers granted by charter or other laws.",
	"repealed": false
}