{
	"id": "524.3-301",
	"url": "https://www.revisor.mn.gov/statutes/cite/524.3-301",
	"title": "524.3-301 INFORMAL PROBATE OR APPOINTMENT PROCEEDINGS; APPLICATION; CONTENTS.",
	"text": "An informal probate proceeding is an informal proceeding for the probate of decedent's will with or without an application for informal appointment. An informal appointment proceeding is an informal proceeding for appointment of a personal representative in testate or intestate estates. These proceedings may be combined in a single proceeding. Applications for informal probate or informal appointment shall be directed to the registrar, and verified by the applicant, in accordance with section 524.1-310, to be accurate and complete to the best of applicant's knowledge and belief as to the following information:\n(1) Every application for informal probate of a will or for informal appointment of a personal representative, other than a special or successor representative, shall contain the following:\n(i) a statement of the interest of the applicant;\n(ii) the name, birthdate, and date of death of the decedent, and the county and state of the decedent's domicile at the time of death, and the names and addresses of the spouse, children, heirs, and devisees and the ages of any who are minors so far as known or ascertainable with reasonable diligence by the applicant;\n(iii) if the decedent was not domiciled in the state at the time of death, a statement showing venue;\n(iv) a statement identifying and indicating the address of any personal representative of the decedent appointed in this state or elsewhere whose appointment has not been terminated;\n(v) a statement indicating whether the applicant has received a demand for notice, or is aware of any demand for notice of any probate or appointment proceeding concerning the decedent that may have been filed in this state or elsewhere.\n(2) An application for informal probate of a will shall state the following in addition to the statements required by (1):\n(i) that the original of the decedent's last will is in the possession of the court, or accompanies the application, or that an authenticated copy of a will probated in another jurisdiction accompanies the application;\n(ii) that the applicant, to the best of the applicant's knowledge, believes the will to have been validly executed;\n(iii) that after the exercise of reasonable diligence, the applicant is unaware of any instrument revoking the will, and that the applicant believes that the instrument which is the subject of the application is the decedent's last will;\n(iv) that the time limit for informal probate as provided in this article has not expired either because three years or less have passed since the decedent's death, or, if more than three years from death have passed, that circumstances as described by section 524.3-108 authorizing tardy probate have occurred.\n(3) An application for informal appointment of a personal representative to administer an estate under a will shall describe the will by date of execution and state the time and place of probate or the pending application or petition for probate. The application for appointment shall adopt the statements in the application or petition for probate and state the name, address and priority for appointment of the person whose appointment is sought.\n(4) An application for informal appointment of an administrator in intestacy shall state in addition to the statements required by (1):\n(i) that after the exercise of reasonable diligence, the applicant is unaware of any unrevoked testamentary instrument relating to property having a situs in this state under section 524.1-301, or, a statement why any such instrument of which the applicant may be aware is not being probated;\n(ii) the priority of the person whose appointment is sought and the names of any other persons having a prior or equal right to the appointment under section 524.3-203.\n(5) An application for appointment of a personal representative to succeed a personal representative appointed under a different testacy status shall refer to the order in the most recent testacy proceeding, state the name and address of the person whose appointment is sought and of the person whose appointment will be terminated if the application is granted, and describe the priority of the applicant.\n(6) An application for appointment of a personal representative to succeed a personal representative who has tendered a resignation as provided in section 524.3-610(c), or whose appointment has been terminated by death or removal, shall adopt the statements in the application or petition which led to the appointment of the person being succeeded except as specifically changed or corrected, state the name and address of the person who seeks appointment as successor, and describe the priority of the applicant.",
	"repealed": false
}