{
	"id": "462A.21",
	"url": "https://www.revisor.mn.gov/statutes/cite/462A.21",
	"title": "462A.21 HOUSING DEVELOPMENT FUND; ADVANCES, USE REPAYMENT.",
	"text": "The agency may use the moneys held in the housing development fund for the purposes provided in this section.\nIt may make temporary loans to \"nonprofit\" sponsors to defray development costs, as provided by section 462A.05, subdivision 5. Each such loan shall be repaid in full by the borrower to the agency concurrent with the initial endorsement of such borrower's eligible construction loan, unless the authority extends the period for the repayment of the advances. In no event shall the time of repayment be extended later than the date of the final endorsement of the eligible mortgage loan. If no permanent financing is obtained the loan shall be repaid in accordance with such terms and conditions as the agency has prescribed by rule.\nIt may make planning grants to local communities, pursuant to rules promulgated by the agency, in such amounts as the agency determines, not to exceed the net costs, exclusive of any federal or other aid or assistance, as are incurred by the local community in planning for land and building acquisition, improvements, renewal, relocation or conservation. Such grants shall be limited to planning for specific sites upon which housing is, or is to be, situated and sites designated for other uses that are reasonably related to such housing.\nIt may establish a revolving loan fund for predevelopment costs for nonprofit organizations and local government units engaged in the construction or rehabilitation of low- and moderate-income housing, and for the purposes specified in sections 462A.05, subdivision 5; and 462A.07, subdivisions 2, 3, 3a, 5, 5a, 6, 7, 11, and 16. The agency may delegate the authority to administer the revolving loan fund for designated areas in the state to existing nonprofit organizations. For purposes of the authority to administer the revolving loan fund under this subdivision, a nonprofit organization includes a private nonprofit corporation that is formed under laws other than the laws of this state, provided that the nonprofit corporation has an office located in this state. Nonprofit entities selected to exercise such delegated powers must have sufficient professional housing development expertise, as determined by the agency, to evaluate the economic feasibility of an applicant's proposed project. Loans to nonprofit organizations or local government units under this subdivision may be made with or without interest as determined by the agency.\nIt may make capacity building grants to nonprofit organizations, local government units, Indian tribes, and Indian tribal organizations to expand their capacity to provide affordable housing and housing-related services. The grants may be used to assess housing needs and to develop and implement strategies to meet those needs, including but not limited to the creation or preservation of affordable housing, prepurchase and postpurchase counseling and associated administrative costs, and the linking of supportive services to the housing. The agency shall adopt rules, policies, and procedures specifying the eligible uses of grant money. Funding priority may be given to those applicants that include low-income persons in their membership, have provided housing-related services to low-income people, and demonstrate a local commitment of local resources, which may include in-kind contributions.\nIt may pay all costs and expenses of financing not paid out of a special fund created by a resolution or indenture securing notes or bonds.\nIt may make rehabilitation grants and expenditures for correction of residential housing defects as provided in section 462A.05, subdivisions 15 and 16. In order to ensure the preservation of the maximum number of housing units with the money appropriated by the legislature, grants shall be recovered by the agency to the extent provided in this section to be used for future grants. Grants made under the terms of this subdivision shall contain a requirement that the grant be recovered by the agency in accordance with the following schedule:\n(1) if the property is sold, transferred, or otherwise conveyed within the first three years after the date of a grant, the recipient shall repay the full amount of the grant;\n(2) if the property is sold, transferred, or otherwise conveyed within the fourth year after the date of a grant, the recipient shall repay 75 percent of the amount of the grant;\n(3) if the property is sold, transferred, or otherwise conveyed within the fifth year after the date of a grant, the recipient shall repay 50 percent of the amount of the grant;\n(4) if the property is sold, transferred, or otherwise conveyed within the sixth year after the date of a grant, the recipient shall repay 25 percent of the amount of the grant;\n(5) if the property is sold, transferred, or otherwise conveyed within the seventh year after the date of the grant, or thereafter, there is no repayment requirement; provided that no repayment is required to the extent that the grants are made to improve the accessibility of residential housing to a disabled occupant.\nIt may establish loan funds and may make eligible loans from them, at rates of interest and with security as the agency deems advisable, if each loan is determined by the agency to be necessary to permit the occupant of residential housing financed wholly or in part by the loan to meet the occupant's housing costs without expending an unreasonable portion of the occupant's income on them. It may combine loan funds established pursuant to legislative appropriations with loan funds established for the same or similar purposes pursuant to the sale of its notes or bonds, and such combined funds may be deposited with a trustee. Portions of these funds derived from appropriations or the sale of its notes or bonds may be set aside as reserves against losses on loans to be made from the combined funds. Each combined fund, including loan and investment principal and income received therefrom, shall be administered, disbursed, and collected as provided in the appropriation act and the resolution or indenture securing the bonds or notes.\nIt may establish a revolving loan fund and may make eligible loans, pursuant to subdivision 4b, to American Indians as provided in section 462A.07, subdivision 14, and may pay the costs and expenses necessary and incidental to the development and operation of such programs.\nIt may expend moneys for the purpose of section 462A.07, subdivision 15, including the establishment of revolving loan funds for programs for urban American Indians, and may pay the costs and expenses necessary and incidental to the development and operation of the programs.\nIt may expend money for the purpose of section 462A.05, subdivision 2a, and pay the costs and expenses necessary and incidental to the development and operation of the grant program authorized therein.\nIt may make grants for the purpose of section 462A.05, subdivision 15a and may pay the costs and expenses necessary and incidental to the development and operation of the housing accessibility program.\nIt may make emergency energy conservation grants as provided in section 462A.05, subdivision 15b and may pay the costs and expenses necessary and incidental to the development of the emergency energy conservation grant program.\nIt may create a revolving fund to be used to make loans for the purpose of section 462A.05, subdivision 19, and pay the costs and expenses necessary and incidental to the development and operation of the loan program authorized therein.\nIt may establish a revolving loan fund for the purpose of section 462A.05, subdivision 14a and may pay the costs and expenses necessary and incidental to the development and operation of the loan program authorized therein.\nIt may expend money for the purposes of section 462A.05, subdivision 23, and may pay the costs and expenses for the development and operation of the program.\nMS 1996 [Repealed, 1997 c 200 art 4 s 23]\nIt may expend money for the purposes of section 462A.05, subdivision 33, and may pay the costs and expenses for the development and operation of the program.\nIt may expend moneys in the fund, not otherwise appropriated, for such other agency purposes as previously enumerated in this chapter as the agency in its discretion shall determine and provide.\nNotwithstanding the provisions of subdivision 5, the agency shall not expend money in the fund for the purpose of making rehabilitation or accessibility grants except by specific appropriation by the legislature or by transfer of unencumbered account balances as provided by section 462A.20, subdivision 3.\nThe agency may make loans to low and moderate income persons who own existing residential housing for the purpose of improving the energy decarbonization and climate resiliency of the housing. Permitted improvements shall include installation or upgrading of ceiling, wall, floor and duct insulation, storm windows and doors, and caulking and weatherstripping. The improvements shall not be inconsistent with the energy standards as promulgated as part of the State Building Code; provided that the improvements need not bring the housing into full compliance with the energy standards. Any loan for such purpose shall be made only upon determination by the agency that such loan is not otherwise available, wholly or in part, from private lenders upon equivalent terms and conditions. The agency may promulgate rules as necessary to implement and make specific the provisions of this subdivision. The rules shall be designed to permit the state, to the extent not inconsistent with this chapter, to seek federal grants or loans for energy decarbonization, climate resiliency, and other qualified projects.\nIt may establish a home ownership assistance fund, on terms and conditions it deems advisable, to assist persons and families of low and moderate income in the purchase of affordable residential housing and may use the funds to provide loans, additional security for eligible loans or to pay costs associated with or provide additional security for bonds issued by the agency.\nIt may establish a multifamily development assistance fund, on terms and conditions it deems advisable, to be used in connection with the financing of multifamily developments (a) to make loans, with or without interest, pursuant to section 462A.05, subdivisions 2 and 3, or (b) to make payments into accounts of the agency for the purpose of making payments required by a resolution for the issuance of its notes or bonds, as permitted by section 462A.10, subdivision 4.\nIt may establish a family rental housing assistance program to provide loans or direct rental subsidies for housing for families with incomes of up to 80 percent of state median income, or to provide grants for the operating cost of public housing. Priority must be given to those developments with resident families with the lowest income. The development may be financed by the agency or other public or private lenders. Direct rental subsidies must be administered by the agency for the benefit of eligible families. Financial assistance provided under this subdivision to recipients of aid to families with dependent children must be in the form of vendor payments whenever possible. Loans, grants, and direct rental subsidies under this subdivision may be made only with specific appropriations by the legislature. The limitations on eligible mortgagors contained in section 462A.03, subdivision 13, do not apply to loans for the rehabilitation of existing housing under this subdivision.\nMS 1994 [Repealed, 1995 c 224 s 126]\nThe agency may leverage federal program money with program money from the family rental housing assistance program established under subdivision 8b and the rental housing assistance program established under subdivision 8c.\nIt may make loans to encourage innovations in the development or rehabilitation of single or multifamily residential housing pursuant to section 462A.05, subdivision 18.\nIt may create a revolving fund to be used to make loans to encourage innovative multifamily housing pursuant to section 462A.05, subdivision 18a.\nNotwithstanding the repeal of section 462A.26 and the provisions of section 16A.28 or any other law relating to lapse of an appropriation, the appropriations made to the agency by the legislature in 1976 and subsequent years are available until fully expended, and the allocations provided in the appropriations remain in effect. Earnings from investments of any of the amounts appropriated to the agency are appropriated to the agency to be used for the same purposes as the respective original appropriations, after payment of the costs and expenses necessary and incidental to the development and operation of the programs authorized under this chapter.\nMS 1980 [Repealed, 1981 c 306 s 20]\nMS 1996 [Repealed, 1997 c 200 art 4 s 23]\nUnencumbered balances of money appropriated for the purpose of loans or grants for agency programs under these subdivisions may be transferred between programs created by these subdivisions or in accordance with section 462A.20, subdivision 3.\nIt may spend money for the purposes of section 462A.05, subdivisions 14, 14a, and 24, and may pay the costs and expenses necessary and incidental to the development and operation of the programs authorized in those subdivisions.\nMS 1996 [Repealed, 1997 c 200 art 4 s 23]\nMS 2013 Supp [Repealed, 2014 c 161 art 3 s 1]\nIt may make loans or grants for the purpose of the abatement of hazardous levels of lead paint in residential buildings and lead-contaminated soil under section 462A.05, subdivision 15c, and may pay the costs and expenses necessary and incidental to the development and operation of the program.\nMS 2000 [Repealed, 1Sp2001 c 4 art 5 s 10]\nThe agency may spend money for the purposes of section 462A.204 and may pay the costs and expenses necessary and incidental to the development and operation of the program.\nMS 1999 Supp [Repealed, 2000 c 260 s 97]\nIt may make grants to and enter into contracts with community development corporations under section 116J.982, and may pay the costs and expenses for the development and operation of the program.\nMS 2013 Supp [Repealed, 2014 c 161 art 3 s 1]\nIt may expend money for the purposes of section 462A.2091 and may pay the costs and expenses necessary and incidental to the development and operation of the program authorized by section 462A.2091.\nThe agency may spend money for the purposes of the rental housing program authorized under section 462A.2097, and may pay the costs and expenses necessary and incidental to the development and operation of the program.\nMS 2013 Supp [Repealed, 2014 c 161 art 3 s 1]\nMS 2013 Supp [Repealed, 2014 c 161 art 3 s 1]\nThe agency may spend money for the purposes of section 462A.209 and may pay the costs and expenses necessary and incidental to the development and operation of the program.\nThe agency may spend money for the purposes of section 462A.33 and may pay the costs and expenses necessary and incidental to the development and operation of the program.\nMS 2013 Supp [Repealed, 2014 c 161 art 3 s 1]\nIt may establish a disaster relief contingency fund to provide loans or grants, on terms and conditions it deems advisable, to assist with the rehabilitation or replacement of housing damaged as a result of a natural disaster in areas of the state designated under presidential declarations of a major disaster. It may transfer to the disaster relief contingency fund any repayments of grants or loans made from appropriations specifically for assistance after natural disasters in areas of the state designated under a presidential declaration of a major disaster.\nThe agency may spend money for the purposes of section 462A.2035 and may pay costs and expenses necessary and incidental to the development and operation of the program.\nThe agency may spend money for the purposes of sections 327C.095, subdivisions 12 and 13; and 462A.35 and may pay the costs and expenses necessary and incidental to the development and operation of the fund under section 462A.35.\nThe agency may establish a nonprofit housing bond account as a separate account within the housing development fund. Proceeds of nonprofit housing bonds and payments made by the state under section 462A.36 may be credited to the account. The agency may transfer the proceeds of nonprofit housing bonds to another account within the housing development fund that it determines appropriate to accomplish the purposes for which the bonds are authorized under section 462A.36.\nThe agency may establish a housing infrastructure bond account as a separate account within the housing development fund. Proceeds of housing infrastructure bonds and payments made by the state under section 462A.37 may be credited to the account. The agency may transfer the proceeds of housing infrastructure bonds to other accounts within the housing development fund that it determines appropriate to accomplish the purposes for which the bonds are authorized under section 462A.37.",
	"repealed": false
}