{
	"id": "383C.034",
	"url": "https://www.revisor.mn.gov/statutes/cite/383C.034",
	"title": "383C.034 DUTIES OF DIRECTOR.",
	"text": "The human resources director as executive head of the county civil service commission shall direct and supervise all of its administrative and technical activities in addition to the duties imposed, elsewhere in sections 383C.03 to 383C.056, and shall:\n(a) Attend the regular and special meetings of the county civil service commission, to act as its secretary and to record its official actions.\n(b) Appoint, supervise and direct such employees of the human resources department as may be necessary to carry out the provisions of sections 383C.03 to 383C.056. Such employees shall be chosen in accordance with and shall be subject to the provisions of sections 383C.03 to 383C.056.\n(c) Prepare and recommend rules and regulations for the administration of sections 383C.03 to 383C.056, which shall become effective after approval by the commission and the board of county commissioners, as provided in sections 383C.03 to 383C.056, to administer such rules and regulations and to propose amendments thereto.\n(d) Establish and maintain a record of all officers and employees in the service of the county, which shall show the employment history of each such employee. The director shall have access to all records and papers, the examination of which will aid in the discharge of duties in connection with such record.\n(e) Ascertain and record the duties and responsibilities pertaining to all positions in the classified service and classify such positions in the manner hereinafter provided.\n(f) Develop, administer, and update salary plans as negotiated for exclusively represented employees and established for unrepresented employees as approved by the county board of commissioners.\n(g) Provide for, formulate and hold competitive tests to determine the relative qualifications of persons who seek employment in any class of positions and as a result thereof, establish employment lists for the various classes of positions.\n(h) Establish the length of the probationary period for each position which shall not be less than the full-time equivalent of six months and not more than the full-time equivalent of 12 months, not to exceed 24 calendar months, during which time the employee may be discharged without specifying cause or granting a hearing. The purpose of a probationary period is to provide an opportunity to observe an employee performing the duties of the job to ensure the required work can be performed as expected. An appointing authority may require a probationary period for transfers, voluntary demotions, and appointments from reemployment lists to a different department. An appointing authority may extend the probationary period of an employee, not to exceed 24 calendar months, if the employee is unable to perform a majority of the essential functions of their position due to an approved work accommodation or approved leave of absence.\n(i) Establish record of performance and a system of service ratings to be used in determining increases and decreases in salaries and in promotions.\n(j) Keep such record as may be necessary for the proper administration of sections 383C.03 to 383C.056.\n(k) Provide a system of checking payrolls and accounts for payment of salaries or wages to employees in the classified service, as to enable the director upon satisfactory evidence thereof, to certify or cause to be certified that the persons whose names appear thereon have been regularly employed in the performance of the duties indicated at the compensation rates and for the periods for which compensation is claimed or are on authorized leave before payment may be lawfully made to such employees.\n(l) Make investigations concerning the administration and effect of sections 383C.03 to 383C.056 and the rules made thereunder.",
	"repealed": false
}