{
	"id": "239.785",
	"url": "https://www.revisor.mn.gov/statutes/cite/239.785",
	"title": "239.785 LIQUEFIED PETROLEUM GAS SALE; ACCOUNT; PENALTIES.",
	"text": "(a) The operator of a terminal located in Minnesota from which liquefied petroleum gas is dispensed for use or sale in this state other than for delivery to another terminal shall pay a fee equal to one mill for each gallon of liquefied petroleum gas dispensed.\n(b) Any person in Minnesota, other than the operator of a terminal, receiving liquefied petroleum gas from a source outside of Minnesota for use or sale in this state shall pay a fee equal to one mill for each gallon of liquefied petroleum gas received.\nThe fee must be remitted monthly on a form prescribed by the commissioner of revenue for deposit in the liquefied petroleum gas account established in subdivision 6. The fee must be paid and the return filed on or before the 23rd day of each month following the month in which the liquefied petroleum gas was delivered or received.\nAn operator or person who fails to pay the fee imposed under this section is subject to the penalties provided in sections 296A.22 and 296A.23.\nThe audit, assessment, appeal, collection, and administrative provisions of chapters 270C and 296A, that apply to the taxes imposed by chapter 296A, apply to the fee imposed by this section.\nFees and penalties are subject to interest at the rate provided in section 270C.40.\nA liquefied petroleum gas account in the special revenue fund is established in the state treasury. Fees and penalties collected under this section must be deposited in the state treasury and credited to the liquefied petroleum gas account. Money in that account, including interest earned, is appropriated to the commissioner of commerce for programs to improve the energy efficiency of residential liquefied petroleum gas heating equipment in low-income households, and, when necessary, to provide weatherization services to the homes.\nA person who operates a terminal where liquefied petroleum gas is loaded into transport trucks for subsequent distribution shall notify the commissioner within 24 hours when liquefied petroleum gas is physically not available for sale to licensed distributors.",
	"repealed": false
}