{
	"id": "62A.21",
	"url": "https://www.revisor.mn.gov/statutes/cite/62A.21",
	"title": "62A.21 CONTINUATION AND CONVERSION PRIVILEGES FOR INSURED FORMER SPOUSES AND CHILDREN.",
	"text": "No policy of accident and health insurance providing coverage of hospital or medical expense on either an expense incurred basis or other than an expense incurred basis, which in addition to covering the insured also provides coverage to the spouse of the insured shall contain a provision for termination of coverage for a spouse covered under the policy solely as a result of a break in the marital relationship.\n[Repealed, 1981 c 329 s 4]\nEvery policy described in subdivision 1 shall contain a provision which permits continuation of coverage under the policy for the insured's dependent children, which is defined as required by section 62A.302, and former spouse, who was covered on the day before the entry of a valid decree of dissolution of marriage. The coverage shall be continued until the earlier of the following dates:\n(a) the date the insured's former spouse becomes covered under any other group health plan; or\n(b) the date coverage would otherwise terminate under the policy.\nIf the coverage is provided under a group policy, any required premium contributions for the coverage shall be paid by the insured on a monthly basis to the group policyholder for remittance to the insurer. The policy must require the group policyholder to, upon request, provide the insured with written verification from the insurer of the cost of this coverage promptly at the time of eligibility for this coverage and at any time during the continuation period. In no event shall the amount of premium charged exceed 102 percent of the cost to the plan for such period of coverage for other similarly situated spouses and dependent children with respect to whom the marital relationship has not dissolved, without regard to whether such cost is paid by the employer or employee.\nUpon request by the insured's former spouse, who was covered on the day before the entry of a valid decree of dissolution, or dependent child, a health carrier must provide the instructions necessary to enable the child or former spouse to elect continuation of coverage.\nAn individual policy or contract issued as a conversion policy prior to January 1, 2014, shall be renewable at the option of the covered person as long as the covered person is not covered under another qualified plan as defined in section 62E.02, subdivision 4. Any revisions in the table of rate for the individual policy shall apply to the covered person's original age at entry and shall apply equally to all similar conversion policies issued by the insurer.\nSubdivision 1 applies to every policy of accident and health insurance which is delivered, issued for delivery, renewed or amended on or after July 19, 1977.\nSubdivisions 2a and 2b apply to every policy of accident and health insurance which is delivered, issued for delivery, renewed, or amended on or after August 1, 1981.",
	"repealed": false
}