{
	"id": "245G.11",
	"url": "https://www.revisor.mn.gov/statutes/cite/245G.11",
	"title": "245G.11 STAFF QUALIFICATIONS.",
	"text": "(a) All staff members who have direct contact must be 18 years of age or older.\nMS 2020 [Repealed, 2022 c 98 art 12 s 21]\nA treatment director must:\n(1) have at least one year of work experience in direct service to an individual with substance use disorder or one year of work experience in the management or administration of direct service to an individual with substance use disorder;\n(2) have a baccalaureate degree or three years of work experience in administration or personnel supervision in human services; and\n(3) know and understand the implications of this chapter, sections 626.557 and 626.5572, and chapters 245A and 260E. Demonstration of the treatment director's knowledge must be documented in the personnel record.\nAn alcohol and drug counselor supervisor must:\n(1) meet the qualification requirements in subdivision 5;\n(2) have three or more years of experience providing individual and group counseling to individuals with substance use disorder; and\n(3) know and understand the implications of this chapter, sections 245A.65, 626.557, and 626.5572, and chapter 260E.\n(a) An alcohol and drug counselor must either be licensed or exempt from licensure under chapter 148F.\n(b) An individual who is exempt from licensure under chapter 148F, must meet one of the following additional requirements:\n(1) completion of at least a baccalaureate degree with a major or concentration in social work, nursing, sociology, human services, or psychology, or licensure as a registered nurse; successful completion of a minimum of 120 hours of classroom instruction in which each of the core functions listed in chapter 148F is covered; and successful completion of 440 hours of supervised experience as an alcohol and drug counselor, either as a student or a staff member;\n(2) completion of at least 270 hours of drug counselor training in which each of the core functions listed in chapter 148F is covered, and successful completion of 880 hours of supervised experience as an alcohol and drug counselor, either as a student or as a staff member;\n(3) current certification as an alcohol and drug counselor or alcohol and drug counselor reciprocal, through the evaluation process established by the International Certification and Reciprocity Consortium Alcohol and Other Drug Abuse, Inc.;\n(4) completion of a bachelor's degree including 480 hours of alcohol and drug counseling education from an accredited school or educational program and 880 hours of alcohol and drug counseling practicum; or\n(5) employment in a program formerly licensed under Minnesota Rules, parts 9530.5000 to 9530.6400, and successful completion of 6,000 hours of supervised work experience in a licensed program as an alcohol and drug counselor prior to January 1, 2005.\n(c) An alcohol and drug counselor may not provide a treatment service that requires professional licensure unless the individual possesses the necessary license. For the purposes of enforcing this section, the commissioner has the authority to monitor a service provider's compliance with the relevant standards of the service provider's profession and may issue licensing actions against the license holder according to sections 245A.05, 245A.06, and 245A.07, based on the commissioner's determination of noncompliance.\nA paraprofessional must have knowledge of client rights, according to section 148F.165, and staff member responsibilities. A paraprofessional may not admit, transfer, or discharge a client but may be responsible for the delivery of treatment service according to section 245G.10, subdivision 3.\n(a) Treatment coordination must be provided by qualified staff. An individual is qualified to provide treatment coordination if the individual meets the qualifications of an alcohol and drug counselor under subdivision 5 or if the individual:\n(1) is skilled in the process of identifying and assessing a wide range of client needs;\n(2) is knowledgeable about local community resources and how to use those resources for the benefit of the client;\n(3) has successfully completed 30 hours of classroom instruction on treatment coordination for an individual with substance use disorder;\n(4) has either:\n(i) a bachelor's degree in one of the behavioral sciences or related fields; or\n(ii) current certification as an alcohol and drug counselor, level I, by the Upper Midwest Indian Council on Addictive Disorders; and\n(5) has at least 2,000 hours of supervised experience working with individuals with substance use disorder.\n(b) A treatment coordinator must receive at least one hour of supervision regarding individual service delivery from an alcohol and drug counselor, or a mental health professional who has substance use treatment and assessments within the scope of their practice, on a monthly basis.\nA recovery peer must:\n(1) meet the qualifications in section 245I.04, subdivision 18; and\n(2) provide services according to the scope of practice established in section 245I.04, subdivision 19, under the supervision of an alcohol and drug counselor.\n[See Note.]\nA volunteer may provide treatment service when the volunteer is supervised and can be seen or heard by a staff member meeting the criteria in subdivision 4 or 5, but may not practice alcohol and drug counseling unless qualified under subdivision 5.\n(a) A qualified staff member must supervise and be responsible for a treatment service performed by a student intern and must review and sign each assessment, individual treatment plan, and treatment plan review prepared by a student intern.\n(b) An alcohol and drug counselor must supervise and be responsible for a treatment service performed by a former student and must review and sign each assessment, individual treatment plan, and treatment plan review prepared by the former student.\n(c) A student intern or former student must receive the orientation and training required in section 245G.13, subdivisions 1, clause (7), and 2. No more than 50 percent of the treatment staff may be student interns or former students with time documented to be directly related to the provision of treatment services for which the staff are authorized.\nAn individual with a temporary permit from the Board of Behavioral Health and Therapy may provide substance use disorder treatment service according to this subdivision if they meet the requirements of either paragraph (a) or (b).\n(a) An individual with a temporary permit must be supervised by a licensed alcohol and drug counselor assigned by the license holder. The supervising licensed alcohol and drug counselor must document the amount and type of supervision provided at least on a weekly basis. The supervision must relate to the clinical practice.\n(b) An individual with a temporary permit must be supervised by a clinical supervisor approved by the Board of Behavioral Health and Therapy. The supervision must be documented and meet the requirements of section 148F.04, subdivision 4.",
	"repealed": false
}