{
	"id": "18B.07",
	"url": "https://www.revisor.mn.gov/statutes/cite/18B.07",
	"title": "18B.07 PESTICIDE USE, APPLICATION, AND EQUIPMENT CLEANING.",
	"text": "Pesticides must be applied in accordance with the product label or labeling and in a manner that will not cause unreasonable adverse effects on the environment within limits prescribed by this chapter and FIFRA.\n(a) A person may not use, store, handle, distribute, or dispose of a pesticide, rinsate, pesticide container, or pesticide application equipment in a manner:\n(1) that is inconsistent with a label or labeling as defined by FIFRA;\n(2) that endangers humans, damages agricultural products, food, livestock, fish, or wildlife; or\n(3) that will cause unreasonable adverse effects on the environment.\n(b) A person may not direct a pesticide onto property beyond the boundaries of the target site. A person may not apply a pesticide resulting in damage to adjacent property. A person who applies a pesticide resulting in damage to adjacent property that is part of the state outdoor recreation system is subject to enhanced monetary penalties as provided in section 18D.40.\n(c) A person may not directly apply a pesticide on a human by overspray or target site spray, except when:\n(1) the pesticide is intended for use on a human;\n(2) the pesticide application is for mosquito control operations;\n(3) the pesticide application is for control of gypsy moth, forest tent caterpillar, or other pest species, as determined by the commissioner, and the pesticide used is a biological agent; or\n(4) the pesticide application is for a public health risk, as determined by the commissioner of health, and the commissioner of health, in consultation with the commissioner of agriculture, determines that the application is warranted based on the commissioner's balancing of the public health risk with the risk that the pesticide application poses to the health of the general population, with special attention to the health of children.\n(d) For pesticide applications under paragraph (c), clause (2), the following conditions apply:\n(1) no practicable and effective alternative method of control exists;\n(2) the pesticide is among the least toxic available for control of the target pest; and\n(3) notification to residents in the area to be treated is provided at least 24 hours before application through direct notification, posting daily on the treating organization's website, if any, and by sending a broadcast email to those persons who request notification of such, of those areas to be treated by adult mosquito control techniques during the next calendar day. For control operations related to human disease, notice under this paragraph may be given less than 24 hours in advance.\n(e) For pesticide applications under paragraph (c), clauses (3) and (4), the following conditions apply:\n(1) no practicable and effective alternative method of control exists;\n(2) the pesticide is among the least toxic available for control of the target pest; and\n(3) notification of residents in the area to be treated is provided by direct notification and through publication in a newspaper of general circulation within the affected area.\n(f) For purposes of this subdivision, \"direct notification\" may include mailings, public meetings, posted placards, neighborhood newsletters, or other means of contact designed to reach as many residents as possible. Public meetings held to meet this requirement for adult mosquito control, under paragraph (d), must be held within each city or town where the pesticide treatments are to be made, at a time and location that is convenient for residents of the area where the treatments will occur.\n(g) A person may not apply a pesticide in a manner so as to expose a worker in an immediately adjacent, open field.\n(h) Notwithstanding that the application is done in a manner consistent with the label or labeling, it is a violation of this chapter to directly apply a pesticide to a site where an application has not been: (1) requested, ordered, contracted for, or permitted; or (2) performed pursuant to paragraph (c), clause (2), (3), or (4).\nSites being treated with pesticides through irrigation systems must be posted throughout the period of pesticide treatment. The posting must be done in accordance with labeling and rules adopted under this chapter.\nA person may not allow a pesticide, rinsate, or unrinsed pesticide container to be stored, kept, or to remain in or on any site without safeguards adequate to prevent an incident. Pesticides may not be stored in an area with access to an open drain, unless a safeguard is provided.\n(a) A person may not fill pesticide application equipment directly from a public water supply, as defined in section 144.382, or from public waters, as defined in section 103G.005, subdivision 15, unless the equipment or water supply is equipped with a backflow prevention device that complies with the Minnesota Plumbing Code under Minnesota Rules, chapter 4714.\n(b) Cross connections between a water supply used for filling pesticide application equipment are prohibited.\n(c) This subdivision does not apply to permitted applications of aquatic pesticides to public waters.\n[Repealed, 2013 c 114 art 2 s 69]\n(a) A person may not:\n(1) clean pesticide application equipment in surface waters of the state; or\n(2) fill or clean pesticide application equipment adjacent to surface waters, ditches, or wells where, because of the slope or other conditions, pesticides or materials contaminated with pesticides could enter or contaminate the surface waters, groundwater, or wells, as a result of overflow, leakage, or other causes.\n(b) This subdivision does not apply to permitted application of aquatic pesticides to public waters.\nA person may only dispose of pesticide, rinsate, and pesticide containers in accordance with this chapter and FIFRA. The manner of disposal must not cause unreasonable adverse effects on the environment.",
	"repealed": false
}