{
	"id": "13.64",
	"url": "https://www.revisor.mn.gov/statutes/cite/13.64",
	"title": "13.64 ADMINISTRATION; MANAGEMENT AND BUDGET DATA.",
	"text": "(a) Notes and preliminary drafts of reports created, collected, or maintained by the Management Analysis Division, Department of Management and Budget, and prepared during management studies, audits, reviews, consultations, or investigations are classified as confidential or protected nonpublic data until the final report has been published or preparation of the report is no longer being actively pursued.\n(b) Data that support the conclusions of the report and that the commissioner of management and budget reasonably believes will result in litigation are confidential or protected nonpublic until the litigation has been completed or until the litigation is no longer being actively pursued.\n(c) Data on individuals that could reasonably be used to determine the identity of an individual supplying data for a report are private if:\n(1) the data supplied by the individual were needed for a report; and\n(2) the data would not have been provided to the Management Analysis Division without an assurance to the individual that the individual's identity would remain private, or the Management Analysis Division reasonably believes that the individual would not have provided the data.\n(a) Security features of building plans, building specifications, and building drawings of state-owned facilities and non-state-owned facilities leased by the state are classified as nonpublic data when maintained by the Department of Administration and may be shared with anyone as needed to perform duties of the commissioner.\n(b) Data maintained by the Department of Administration that identify an individual with a disability or a family member of an individual with a disability related to services funded by the federal Assistive Technology Act, United States Code, title 29, sections 3001 to 3007, for assistive technology device demonstrations, transition training, loans, reuse, or alternative financing are private data on individuals.\n(a) For purposes of this subdivision, \"unofficial fiscal note\" means a fiscal note requested by or on behalf of a member of the legislature on draft language for a bill that has not been introduced.\n(b) This paragraph applies if a request for an unofficial fiscal note is accompanied by a directive from the requester that the data be classified under this paragraph. Government data on the request, the bill draft, and the unofficial fiscal note are private data on individuals or nonpublic data, provided that the data are accessible to, and may be disclosed by, the requester. If the unofficial fiscal note or an updated version is subsequently used for an introduced bill, or any legislation, including an amendment or a proposed bill, that any member of the legislature offers for consideration by a legislative committee, the fiscal note becomes public data.\nA head or chief administrative officer of a department or agency of the state government, including the supreme court, must provide data that are used to prepare a fiscal note, including data that are not public data under this section to the director of the Legislative Budget Office upon the director's request and consistent with section 3.8853, subdivision 4, unless there are federal laws or regulations that prohibit the provision of the not public data for this purpose. The data must be supplied according to any standards and procedures adopted under section 3.8853, subdivision 3, including any standards and procedures governing timeliness. Notwithstanding section 13.05, subdivision 9, a responsible authority may not require the Legislative Budget Office to pay a cost for supplying data requested under this subdivision.",
	"repealed": false
}