{
	"id": "65B.48",
	"url": "https://www.revisor.mn.gov/statutes/cite/65B.48",
	"title": "65B.48 REPARATION SECURITY COMPULSORY.",
	"text": "Every owner of a motor vehicle of a type which is required to be registered or licensed or is principally garaged in this state shall maintain during the period in which operation or use is contemplated a plan of reparation security under provisions approved by the commissioner, insuring against loss resulting from liability imposed by law for injury and property damage sustained by any person arising out of the ownership, maintenance, operation or use of the vehicle. The plan of reparation security shall provide for basic economic loss benefits and residual liability coverage in amounts not less than those specified in section 65B.49, subdivision 3, clauses (1) and (2). The nonresident owner of a motor vehicle which is not required to be registered or licensed, or which is not principally garaged in this state, shall maintain such security in effect continuously throughout the period of the operation, maintenance or use of such motor vehicle within this state with respect to accidents occurring in this state; such security shall include coverage for property damage to a motor vehicle rented or leased within this state by a nonresident.\nThe security required by sections 65B.41 to 65B.71 may be provided by a policy of insurance complying with sections 65B.41 to 65B.71 which is issued by or on behalf of an insurer authorized to transact business in this state or, if the vehicle is registered in another state, by a policy of insurance issued by or on behalf of an insurer authorized to transact business in either this state or the state in which the vehicle is registered or by qualifying as a self-insurer.\nSelf-insurance, subject to approval of the commissioner, is effected by filing with the commissioner in satisfactory form:\n(1) a continuing undertaking by the owner or other appropriate person to pay tort liabilities or basic economic loss benefits, or both, and to perform all other obligations imposed by sections 65B.41 to 65B.71;\n(2) evidence that appropriate provision exists for prompt administration of all claims, benefits, and obligations provided by sections 65B.41 to 65B.71;\n(3) evidence that reliable financial arrangements, deposits, or commitments exist providing assurance, substantially equivalent to that afforded by a policy of insurance complying with sections 65B.41 to 65B.71, for payment of tort liabilities, basic economic loss benefits, and all other obligations imposed by sections 65B.41 to 65B.71; and\n(4) a nonrefundable initial application fee of $2,500 and a renewal fee of $1,200 for political subdivisions and $1,500 for nonpolitical entities every three years.\nTo carry out the purposes of subdivision 3, the commissioner may adopt rules pursuant to chapter 14. These rules may:\n(a) establish reporting requirements;\n(b) establish standards or guidelines to assure the adequacy of the financing and administration of self-insurance plans;\n(c) establish bonding requirements or other provisions assuring the financial integrity of entities that self-insure other than bonding requirements for self-insuring political subdivisions; and\n(d) establish other reasonable requirements to further the purposes of this section.\nThe state of Minnesota or any agency thereof and any political subdivision of the state or agency thereof shall provide security by lawfully obligating itself to pay benefits in accordance with sections 65B.41 to 65B.71, either as a self-insurer pursuant to subdivision 3, or through purchase of a plan of reparation security.\n(a) Every owner of a motorcycle registered or required to be registered in this state or operated in this state by the owner or with the owner's permission shall provide and maintain security for the payment of tort liabilities arising out of the maintenance or use of the motorcycle in this state. Security may be provided by a contract of liability insurance complying with section 65B.49, subdivision 3, or by qualifying as a self insurer in the manner provided in subdivision 3.\n(b) At the time an application for motorcycle insurance without personal injury protection coverage is completed, there must be attached to the application a separate form containing a written notice in at least 10-point bold type, if printed, or in capital letters, if typewritten that states:\n\"Under Minnesota law, a policy of motorcycle coverage issued in the State of Minnesota must provide liability coverage only, and there is no requirement that the policy provide personal injury protection (PIP) coverage in the case of injury sustained by the insured. No PIP coverage provided by an automobile insurance policy you may have in force will extend to provide coverage in the event of a motorcycle accident.\"\nA person providing security pursuant to subdivision 3 is a \"self-insurer.\"\n\"Security covering the vehicle\" is the insurance or other security so provided. The vehicle for which the security is so provided is the \"secured vehicle.\"\n[Repealed, 1984 c 592 s 94]",
	"repealed": false
}