{
	"id": "174.13",
	"url": "https://www.revisor.mn.gov/statutes/cite/174.13",
	"title": "174.13 TRANSPORTATION PROGRAMMING AND INVESTMENT COMMITTEE.",
	"text": "(a) The Transportation Programming and Investment Committee is established in the Department of Transportation. The committee must provide policy direction for the department's capital investments on the transportation system and must make programmatic capital investment decisions and recommendations to the commissioner of transportation. At a minimum, the committee must:\n(1) make, approve, or confirm major policy and spending decisions related to construction on trunk highways;\n(2) select projects pursuant to state law and department policies;\n(3) make decisions on trunk highway programming;\n(4) distribute uncommitted funds;\n(5) direct state road construction funds to specific projects, programs, and studies; and\n(6) create and maintain the investment opportunity plan and select projects from that list for funding as funds allow.\n(b) In making programming decisions, the Transportation Programming and Investment Committee must follow state and federal law. The committee and the commissioner must not override or contradict state or federal law.\n(a) The commissioner of transportation must establish membership of the Transportation Programming and Investment Committee and designate a chair of the committee.\n(b) The commissioner must publish a committee roster on the Department of Transportation's website that identifies (1) the positions in the department for which membership on the committee is designated, and (2) the position for which chair of the committee is designated.\n(c) Any decision or recommendation of the committee must be made by a vote of at least two-thirds of the voting members.\n(a) The Transportation Programming and Investment Committee must meet at least once each calendar month.\n(b) The chair must designate a person to take minutes for each meeting. At a minimum, the minutes must include the following information:\n(1) the members and anyone else present for the meeting;\n(2) the issues considered by the committee;\n(3) a summary of the discussion for each issue; and\n(4) the number of yes and no votes for each vote taken.\nThe minutes must be posted on the Department of Transportation's website within seven business days after the meeting. The minutes must remain available on the department's website for two calendar years after the minutes were posted.\nIf the commissioner of transportation does not follow a decision or recommendation made by the Transportation Programming and Investment Committee, the commissioner must notify the committee in writing that the commissioner did not follow the decision or recommendation and explain the reasons for the decision. The commissioner must post the notification on the Department of Transportation's website within seven business days of submitting it to the committee. The notification must remain available on the department's website for two calendar years after the notification was posted.\nThe Transportation Programming and Investment Committee must establish and maintain an investment opportunity plan that includes projects with an identified need but are not funded by or cannot be funded by the standard programming process. The plan must set forth a process to be used when determining how to allocate funding. The commissioner of transportation must publish the plan on the Department of Transportation's website. The committee must publish on the department's website a list of all projects that the committee considers for funding. The list must identify the projects that were selected and the projects that were not selected. For each project that was not selected, the commissioner must include the reason it was not selected.",
	"repealed": false
}