{
	"id": "144.9503",
	"url": "https://www.revisor.mn.gov/statutes/cite/144.9503",
	"title": "144.9503 PRIMARY PREVENTION.",
	"text": "The commissioner shall develop and maintain a primary prevention program to reduce lead exposure in young children and pregnant women. A community health board serving a city of the first class shall determine areas at high risk for toxic lead exposure before doing primary prevention lead hazard reduction activities. The program shall provide primary prevention lead education materials, promote primary prevention swab team services, provide lead cleanup equipment and material grants as funding allows, monitor regulated lead work, and develop and maintain lead-safe practices in cooperation with the commissioner of administration.\n(a) The commissioner of health and community health boards serving cities of the first class shall determine areas at high risk for toxic lead exposure.\n(b) A community health board serving a city of the first class shall rank order census tracts by awarding points as specified in this paragraph. The priority for primary prevention in census tracts at high risk for toxic lead exposure shall be based on the cumulative points awarded to each census tract. A greater number of points means a higher priority.\n(1) One point may be awarded to a census tract for each ten percent of children who were under six years old at the time they were screened for lead in blood and whose blood lead level exceeds ten micrograms of lead per deciliter of whole blood, provided the commissioner has determined that the data used to award the points are comprehensive and representative.\n(2) One point may be awarded for every five percent of housing that is defined as dilapidated or deteriorated by the planning department or similar agency of the city in which the housing is located. Where data is available by neighborhood or section within a city, the percent of dilapidated or deteriorated housing shall apply equally to each census tract within the neighborhood or section.\n(3) One point may be awarded for every 100 parts per million of lead in soil, based on the median soil lead values of foundation soil samples, calculated on 100 parts per million intervals, or fraction thereof. A community health board shall use data from its own soil survey conducted according to rules adopted under section 144.9508, except that a community health board serving Minneapolis or St. Paul that has not conducted its own soil survey shall use the June 1988 census tract version of the houseside map titled \"Distribution of Houseside Lead Content of Soil-Dust in the Twin Cities,\" prepared by the Center for Urban and Regional Affairs, Humphrey Institute, University of Minnesota, Publication 1989, Center for Urban and Regional Affairs 89-4. Where the map displays a census tract that is crossed by two or more intervals, the community health board shall make a reasoned determination of the median foundation soil lead value for that census tract.\n(4) A community health board may award one point to each census tract for each of the following factors based on cutoff criteria to be determined by the community health board:\n(i) percent of minority population;\n(ii) number of children less than six years of age;\n(iii) percent of housing built before 1950; and\n(iv) percent of population living in poverty.\n(c) The commissioner may determine areas at high risk for toxic lead exposure at the county level or within a county outside a city of the first class using one or more of the following criteria:\n(1) blood lead levels greater than ten micrograms per deciliter of whole blood in children under six years of age;\n(2) percent of dilapidated or deteriorated housing;\n(3) soil lead levels in excess of 100 parts per million;\n(4) percent of minority population;\n(5) percent of housing built before 1950;\n(6) percent of children living in poverty; or\n(7) other factors appropriate in preventing lead exposure, as determined by a federal agency including the United States Centers for Disease Control and Prevention, the United States Environmental Protection Agency, or the United States Department of Housing and Urban Development.\nThe commissioner of health shall develop and maintain a primary prevention lead education strategy to prevent lead exposure. The strategy includes:\n(1) lead education materials that describe the health effects of lead exposure, safety measures, and methods to be used in the lead hazard reduction process;\n(2) providing lead education materials to the general public;\n(3) providing lead education materials to property owners, landlords, and tenants by swab team workers and public health professionals, such as nurses, sanitarians, health educators, nonprofit organizations working on lead issues, and other public health professionals in areas at high risk for toxic lead exposure; and\n(4) promoting awareness of community, legal, and housing resources.\nPrimary prevention may include the use of swab team services. The swab team services may be provided based on lead hazard screens whenever possible and must at least include lead hazard reduction for deteriorated interior lead-based paint, bare soil, and dust.\n[Repealed, 1998 c 407 art 2 s 109]\n[Repealed, 2001 c 205 art 1 s 27,43]\nThe commissioner shall develop and maintain in cooperation with the commissioner of administration provisions and procedures to define lead-safe practices information for residential remodeling, renovation, installation, and rehabilitation activities that are not lead hazard reduction, but may disrupt lead-based paint surfaces and guidance documents for the regulated industry.\n[Repealed, 1998 c 407 art 2 s 109]\n[Repealed, 1998 c 407 art 2 s 109]",
	"repealed": false
}