{
	"id": "446A.14",
	"url": "https://www.revisor.mn.gov/statutes/cite/446A.14",
	"title": "446A.14 INTEREST RATE SWAPS AND OTHER AGREEMENTS.",
	"text": "(a) The authority may enter into interest rate exchange or swap agreements, hedges, forward purchase or sale agreements, loan sale or pooling agreements or trusts, or other similar agreements in connection with:\n(1) the issuance or proposed issuance of bonds;\n(2) the making, proposed making, or sale of loans or other financial assistance or investments;\n(3) outstanding bonds, loans, or other financial assistance; or\n(4) existing similar agreements.\n(b) The agreements authorized by this subdivision include, without limitation, master agreements, options or contracts to enter into those agreements in the future and related agreements, including, without limitation, agreements to provide credit enhancement, liquidity, or remarketing; valuation; monitoring; or administrative services currently or in the future. However, the term of an option to enter into an interest rate swap, exchange, hedge, or other similar agreement and the term of a contract to sell, buy, or refund bonds in the future must not exceed five years and the authorization of the authority to enter into option agreements with respect to interest rate swap agreements expires on December 31, 2008; provided that the option agreements entered into prior to that date remain valid agreements of the authority after that date.\n(c) The agreements authorized by this subdivision or supplements to master agreements may be entered into on the basis of negotiation with a qualified third party or through a competitive proposal process on terms and conditions and with covenants and provisions approved by the authority and may include, without limitation:\n(1) provisions establishing reserves;\n(2) pledging assets or revenues of the authority for current or other payments or termination payments;\n(3) contracting with the other parties to the agreements to provide for the custody, collection, securing, investment, and payment of money of the authority or money held in trust; or\n(4) requiring the issuance of bonds or entering into loans or other agreements authorized by this subdivision in the future.\n(d) Subject to the terms of the agreement and other agreements of the authority with bondholders or other third parties, the agreements authorized by this subdivision may be general or limited obligations of the authority payable from all available or certain specified funds appropriated to the authority. The agreements authorized by this subdivision do not constitute debt of the authority for the purposes of the limits on bonds or notes of the authority set forth in section 446A.12, subdivision 1.\n(e) The authority may issue bonds to provide funds to make payments, including, without limitation, termination payments pursuant to an agreement authorized by this subdivision.\n(f) The aggregate notional amount of interest rate swap or exchange agreements in effect at any time must not exceed an amount equal to ten percent of the aggregate principal amount of bonds the authority is authorized to have outstanding pursuant to section 446A.12, subdivision 1, including the notional amount of interest rate swap or exchange agreements with respect to which a reversing agreement has been entered into, the effect of which is to terminate the original agreement or a portion thereof, and reversing agreements with respect to all or a portion of existing agreements.\nFor the purposes of this section, the authority may exercise all powers provided in this chapter. The authority may consent, whenever it considers it necessary or desirable in connection with agreements entered into under this subdivision, to modifications, amendments, or waivers of the terms of the agreements. The proceeds of any agreements entered into pursuant to this subdivision are appropriated to the authority pursuant to section 446A.04, subdivision 20. The agreements entered into pursuant to this subdivision are not subject to sections 16C.03, subdivision 4, and 16C.05.",
	"repealed": false
}