{
	"id": "176.2611",
	"url": "https://www.revisor.mn.gov/statutes/cite/176.2611",
	"title": "176.2611 COORDINATION OF THE OFFICE OF ADMINISTRATIVE HEARINGS' CASE MANAGEMENT SYSTEM AND THE WORKERS' COMPENSATION IMAGING SYSTEM.",
	"text": "(a) For purposes of this section, the definitions in this subdivision apply unless otherwise specified.\n(b) \"Commissioner\" means the commissioner of labor and industry.\n(c) \"Department\" means the Department of Labor and Industry.\n(d) \"Document\" includes all data, whether in electronic or paper format, that is filed with or issued by the office or department related to a claim-specific dispute resolution proceeding under this section.\n(e) \"Office\" means the Office of Administrative Hearings.\nSubject to further amendments pursuant to section 176.2612, subdivision 2, this section specifies whether documents must be filed with the office or the commissioner, and governs access to dispute-related documents and data at the office or department. This section prevails over any conflicting provision in this chapter, Laws 1998, chapter 366, or corresponding rules.\nExcept as provided in subdivision 4 and section 176.421, all documents that require action by the office under this chapter must be filed, electronically or in paper format, with the office as required by the chief administrative law judge. Filing a document that initiates or is filed in preparation for a proceeding at the office satisfies any requirement under this chapter that the document must be filed with the commissioner.\n(a) The following documents must be filed directly with the commissioner in the format and manner prescribed by the commissioner:\n(1) all requests for an administrative conference under section 176.106, regardless of the amount in dispute;\n(2) a motion to intervene in an administrative conference that is pending at the department;\n(3) any other document related to an administrative conference that is pending at the department;\n(4) an objection to a penalty assessed by the commissioner or the department;\n(5) requests for medical and rehabilitation dispute certification under section 176.081, subdivision 1, paragraph (c), including related documents; and\n(6) except as provided in this subdivision or subdivision 3, any other document required to be filed with the commissioner.\n(b) The filing requirement in paragraph (a), clause (1), makes no changes to the jurisdictional provisions in section 176.106. A claim petition that contains only medical or rehabilitation issues, unless primary liability is disputed, is considered to be a request for an administrative conference and must be filed with the commissioner.\n(c) The commissioner must refer a timely, unresolved objection to a penalty under paragraph (a), clause (4), to the office within 60 calendar days.\n(a) The commissioner must revise dispute resolution forms, in consultation with the chief administrative law judge, to reflect the filing requirements in this section.\n(b) Until August 31, 2020, the office must send the department all documents that are accepted for filing or issued by the office. The office must send the documents to the department, electronically or by courier, within two business days of when the documents are accepted for filing or issued by the office. Beginning August 31, 2020, all dispute-related documents accepted for filing or issued by the office, and all dispute-related documents filed with the department that are referred to the office under section 176.106, must be immediately transmitted between the office's case management system and CAMPUS using application programming interfaces.\n(a) All documents filed with or issued by the office under this chapter are private data on individuals and nonpublic data pursuant to chapter 13, except that the documents are available to the following:\n(1) the office;\n(2) the department;\n(3) the employer;\n(4) the insurer;\n(5) the employee;\n(6) the dependent of a deceased employee;\n(7) an intervenor in the dispute;\n(8) the attorney to a party in the dispute;\n(9) a person who furnishes written authorization from the employer, insurer, employee, or dependent of a deceased employee; and\n(10) a person, agency, or other entity allowed access to the documents under this chapter or other law.\nOnce a document filed with or issued by the office under this chapter is transmitted to the commissioner under subdivision 5 or section 176.281, access to the document in the division file is as provided in section 176.231.\n(b) The office and department may post notice of scheduled proceedings on the agencies' websites and at their principal places of business in any manner that protects the employee's identifying information. Identifying information includes the employee's name or any part of the employee's name.\nThe Workers' Compensation Court of Appeals has authority to amend its rules of procedure to reflect electronic filing with the office under this section for purposes of section 176.421, subdivision 5, and to allow electronic filing with the court under section 176.285. Section 14.125 does not apply to the agency's rulemaking authority under this section and sections 176.281, paragraph (d), and 176.285, subdivision 2a.",
	"repealed": false
}