{
	"id": "256B.6925",
	"url": "https://www.revisor.mn.gov/statutes/cite/256B.6925",
	"title": "256B.6925 ENROLLEE INFORMATION.",
	"text": "The commissioner shall provide to each potential enrollee the following information:\n(1) basic features of receiving services through managed care;\n(2) which individuals are excluded from managed care enrollment, subject to mandatory managed care enrollment, or who may choose to enroll voluntarily;\n(3) for mandatory and voluntary enrollment, the length of the enrollment period and information about an enrollee's right to disenroll in accordance with Code of Federal Regulations, part 42, section 438.56;\n(4) the service area covered by each managed care organization;\n(5) covered services, including services provided by the managed care organization and services provided by the commissioner;\n(6) the provider directory and drug formulary for each managed care organization;\n(7) cost-sharing requirements;\n(8) requirements for adequate access to services, including provider network adequacy standards;\n(9) a managed care organization's responsibility for coordination of enrollee care; and\n(10) quality and performance indicators, including enrollee satisfaction for each managed care organization, if available.\nThe commissioner shall ensure that managed care organizations provide to each enrollee the following information:\n(1) an enrollee handbook within a reasonable time after receiving notice of the enrollee's enrollment. The handbook must, at a minimum, include information on benefits provided, how and where to access benefits, cost-sharing requirements, how transportation is provided, and other information as required by Code of Federal Regulations, part 42, section 438.10, paragraph (g);\n(2) a provider directory for the following provider types: physicians, specialists, hospitals, pharmacies, behavioral health providers, and long-term supports and services providers, as appropriate. The directory must include the provider's name, group affiliation, street address, telephone number, website, specialty if applicable, whether the provider accepts new enrollees, the provider's cultural and linguistic capabilities as identified in Code of Federal Regulations, part 42, section 438.10, paragraph (h), and whether the provider's office accommodates people with disabilities;\n(3) a drug formulary that includes both generic and name brand medications that are covered and each medication tier, if applicable;\n(4) written notice of termination of a contracted provider. Within 15 calendar days after receipt or issuance of the termination notice, the managed care organization must make a good faith effort to provide notice to each enrollee who received primary care from, or was seen on a regular basis by, the terminated provider; and\n(5) upon enrollee request, the managed care organization's physician incentive plan.\n(a) All information required to be provided to enrollees and potential enrollees of a managed care organization, including the provider directory, enrollee handbook, and drug formulary, must be provided in a manner and format that is easily understood and readily accessible. The information must be available through the enrollee support system established under section 256B.69, subdivision 36, the department's website and each managed care organization's website. The commissioner and managed care organization shall inform each enrollee that the information is available on the department's and the managed care organization's websites and shall provide the potential enrollee or enrollee with the applicable URL to access the information. An enrollee with a disability who cannot access the information online must be provided, upon request, with auxiliary aids and services necessary to access the information at no cost to the enrollee.\n(b) The commissioner and managed care organization shall provide all required information electronically to potential enrollees and enrollees unless the enrollee requests the information in paper form. The commissioner and managed care organization shall inform an enrollee that, upon request, the information is available in paper form without charge to the enrollee, and shall mail the information to the potential enrollee's or the enrollee's mailing address within five business days of the request. If the information is provided to the enrollee through email, the managed care organization must receive the enrollee's agreement before providing the information by email.\n(c) The information required to be provided electronically to a potential enrollee or enrollee must:\n(1) be readily accessible;\n(2) be published in a prominent location on the commissioner's and managed care organization's websites in a format that has the capability of being retained and printed; and\n(3) satisfy the requirements for content and language requirements in accordance with Code of Federal Regulations, part 42, section 438.10, paragraph (d).\n(a) Managed care contracts entered into under section 256B.69, 256B.692, or 256L.12, must require a managed care organization to provide language assistance, and auxiliary aids and services, if requested, to ensure access to a managed care organization's programs and services, as required under United States Code, title 42, sections 18116 and 2000d, and any other federal regulations or guidance from the United States Department of Health and Human Services.\n(b) The commissioner shall establish a methodology to identify the prevalent non-English languages spoken by enrollees and potential enrollees throughout Minnesota and in each managed care organization's service area.\n(c) The commissioner shall ensure that oral interpretation is provided in all languages and written interpretation is provided in each prevalent non-English language, and that both are available to enrollees and potential enrollees free of charge. Oral interpretation services shall include the use of auxiliary aids, TTY/TDY, and American sign language.\n(d) All written materials that target potential enrollees and are provided to enrollees, including the provider directory, enrollee handbook, appeals and grievance notices, and denial and termination notices, must:\n(1) use at least 12-point font;\n(2) be written at a 7th grade reading level;\n(3) be available in alternative formats and through auxiliary aids and services that consider the special needs of the enrollee, including an enrollee with a disability or limited English proficiency;\n(4) use taglines that consist of short statements in each of the prevalent non-English languages, in an 18-point font, that explain the availability of language interpreter services free of charge; and\n(5) explain how to request auxiliary aids and services, including the provision of the materials in alternative formats and the TTY/TDY telephone number of the managed care organization's customer service unit and the department's enrollee support system.\n(e) For purposes of this subdivision, \"prevalent non-English language\" means a non-English language that is determined by the commissioner to be spoken by a significant number or percentage of potential enrollees and enrollees with limited proficiency in English.\n(a) The commissioner shall ensure that the managed care organization:\n(1) submits all marketing materials to the commissioner for approval before distribution and that marketing materials are accurate and do not mislead, confuse, or defraud;\n(2) distributes marketing materials to a managed care organization's entire service area and as otherwise permitted by contract;\n(3) complies with the information requirements in Code of Federal Regulations, part 42, section 438.10;\n(4) does not seek to influence enrollment with the sale or offering of any private insurance, with the exception of communications between an enrollee and a managed care organization that is related to the offering of a qualified health plan as defined under section 62K.03; and\n(5) does not directly, or indirectly, engage in door-to-door, telephone, email, texting, or other cold-call marketing activities.\n(b) For the purposes of this subdivision, \"cold-call marketing activities\" means any unsolicited personal contact or communication by a managed care organization with an individual who is not enrolled in that managed care organization that can be reasonably interpreted as intended to influence the individual to enroll in a specific managed care organization or to not enroll in or disenroll from another managed care organization.",
	"repealed": false
}