{
	"id": "144E.07",
	"url": "https://www.revisor.mn.gov/statutes/cite/144E.07",
	"title": "144E.07 SUMMARY APPROVAL.",
	"text": "An ambulance service may request a change in its primary service area, as established under section 144E.06, to eliminate any overlap in primary service areas or to expand its primary service area to provide service to a contiguous, but undesignated, primary service area. An ambulance service requesting a change in its primary service area must submit a written application to the director on a form provided by the director and must comply with the requirements of this section.\nAn applicant requesting to retract service from a geographic area within its designated primary service area must provide documentation showing that another licensed ambulance service is providing or will provide ambulance coverage within the proposed area of withdrawal.\nAn applicant requesting to provide service in a geographic area that is within the primary service area of another licensed ambulance service or services must submit documentation from the service or services whose primary service areas overlap the proposed expansion area, approving the expansion and agreeing to withdraw any service coverage from the proposed expanded area. The application may include documentation from the public safety answering point coordinator or coordinators endorsing the proposed change.\nAn applicant requesting to provide service in a geographic area where no primary ambulance service has been designated must submit documentation of approval from the ambulance service or services which are contiguous to the proposed expansion area. The application may include documentation from the public safety answering point coordinator or coordinators endorsing the proposed change. If a licensed ambulance service provides evidence of historically providing 911 ambulance coverage to the undesignated area, it is not necessary to provide documentation from the contiguous ambulance service or services approving the change. At a minimum, a 12-month history of primary ambulance coverage must be included with the application.\nThe director shall report any approved change to the local public safety answering point coordinator.",
	"repealed": false
}