{
	"id": "414.0325",
	"url": "https://www.revisor.mn.gov/statutes/cite/414.0325",
	"title": "414.0325 ORDERLY ANNEXATION IN DESIGNATED UNINCORPORATED AREA.",
	"text": "(a) One or more townships and one or more municipalities, by joint resolution, may designate an unincorporated area as in need of orderly annexation. One or more municipalities, by joint resolution with the county, may designate an unincorporated area in which there is no organized township government as in need of orderly annexation.\n(b) A designated area is any area which the signatories to a joint resolution for orderly annexation have identified as being appropriate for annexation, either currently or at some point in the future, pursuant to the negotiated terms and conditions set forth in the joint resolution. Land described as a designated area is not, by virtue of being so described, considered also to be annexed for purposes of this chapter.\n(c) The joint resolution will confer jurisdiction on the chief administrative law judge over annexations in the designated area and over the various provisions in said agreement by submission of said joint resolution to the chief administrative law judge.\n(d) The resolution shall include a description of the designated area and the reasons for designation.\n(e) Thereafter, an annexation of any part of the designated area may be initiated by:\n(1) submitting to the chief administrative law judge a resolution of any signatory to the joint resolution; or\n(2) the chief administrative law judge.\n(f) Whenever a state agency, other than the Pollution Control Agency, orders a municipality to extend a municipal service to an area, the order confers jurisdiction on the chief administrative law judge to consider designation of the area for orderly annexation.\n(g) If a joint resolution designates an area as in need of orderly annexation and states that no alteration of its stated boundaries is appropriate, the chief administrative law judge may review and comment, but may not alter the boundaries.\n(h) If a joint resolution designates an area as in need of orderly annexation, provides for the conditions for its annexation, and states that no consideration by the chief administrative law judge is necessary, the chief administrative law judge may review and comment, but shall, within 30 days, order the annexation in accordance with the terms of the resolution.\nAt least 60 days before a petition is filed under this section or section 414.033, the petitioner must notify the municipality that the petitioner intends to file a petition for annexation. At least 30 days before a petition is filed for annexation, the petitioner must be notified by the municipality that the cost of electric utility service to the petitioner may change if the land is annexed to the municipality. The notice must include an estimate of the cost impact of any change in electric utility services, including rate changes and assessments, resulting from the annexation.\nAt least ten days before the municipality or township adopts an orderly annexation agreement, a notice of the intent to include property in an orderly annexation area must be published in a newspaper of general circulation in both the township and municipality. The notice must clearly identify the boundaries of the area proposed to be included in the orderly annexation agreement. The cost of providing notice must be equally divided between the municipality and the township, unless otherwise agreed upon by the municipality and the township. This subdivision applies only to the initial designation to include property in an orderly annexation area subject to the orderly annexation agreement, or any expansion of the orderly annexation area subject to the agreement, and not to any subsequent annexation of any property from within the designated area. This subdivision also does not apply when the orderly annexation agreement only designates for immediate annexation property for which all of the property owners have petitioned to be annexed.\nUpon receipt of a resolution for annexation of a part of the designated area, the chief administrative law judge shall set a time and place for a hearing in accordance with section 414.09.\n(a) In arriving at a decision, the chief administrative law judge shall consider the factors in section 414.031, subdivision 4.\n(b) Based upon factors in section 414.031, subdivision 4, the chief administrative law judge may order the annexation:\n(1) on finding that the subject area is now or is about to become urban or suburban in character and that the annexing municipality is capable of providing the services required by the area within a reasonable time; or\n(2) on finding that the existing township form of government is not adequate to protect the public health, safety, and welfare; or\n(3) on finding that annexation would be in the best interests of the subject area.\n(c) The chief administrative law judge may deny the annexation if it conflicts with any provision of the joint agreement.\n(d) The chief administrative law judge may alter the boundaries of the proposed annexation by increasing or decreasing the area so as to include that property within the designated area which is in need of municipal services or will be in need of municipal services.\n(e) If the annexation is denied, no proceeding for the annexation of substantially the same area may be initiated within two years from the date of the denial order unless the new proceeding is initiated by a majority of the area's property owners and the petition is supported by affected parties to the resolution.\n(f) In all cases, the chief administrative law judge shall set forth the factors which are the basis for the decision.\nThe chief administrative law judge's order shall be effective upon the issuance of the order or at such later time as is provided in the order.\nA copy of the annexation order must be delivered immediately by the chief administrative law judge to the appropriate county auditors.\nFor the purposes of taxation, if the annexation becomes effective on or before August 1 of a levy year, the municipality may levy on the annexed area beginning with that same levy year. If the annexation becomes effective after August 1 of a levy year, the town may continue to levy on the annexed area for that levy year, and the municipality may not levy on the annexed area until the following levy year.\n(a) An orderly annexation agreement may provide for the establishment of a board to exercise planning and land use control authority within any area designated as an orderly annexation area pursuant to this section, in the manner prescribed by section 471.59. The orderly annexation agreement may also delegate planning and land use authority to the municipalities or towns or may establish some other process within the orderly annexation agreement to accomplish planning and land use control of the designated area.\n(b) A board or other planning authority designated or established pursuant to an orderly annexation agreement shall have all of the powers contained in sections 462.351 to 462.364, and shall have the authority to adopt and enforce the State Fire Code promulgated pursuant to section 326B.02, subdivision 5.\n(c) The orderly annexation agreement may provide that joint planning and land use controls shall apply to any or all parts of the area designated for orderly annexation as well as to any adjacent unincorporated or incorporated area, provided that the area to be included shall be described in the joint resolution.\n(d) If the orderly annexation agreement does not provide for joint planning and land use control, delegate planning and land use control to the municipalities or towns, or establish some other process for planning and land use authority, the following procedures shall govern:\n(1) if the county and townships agree to exclude the area from their zoning and subdivision ordinances, the municipality may extend its zoning and subdivision regulations to include the entire orderly annexation area as provided in section 462.357, subdivision 1, and section 462.358, subdivision 1a; or\n(2) if the county and township do not agree to such extraterritorial zoning and subdivision regulation by the municipality, zoning and subdivision regulation within the orderly annexation area shall be controlled by a three-member committee with one member appointed from each of the municipal, town, and county governing bodies.\n(e) The committee under paragraph (d), clause (2), shall:\n(1) serve as the \"governing body\" and \"board of appeals and adjustments,\" for purposes of sections 462.357 and 462.358, within the orderly annexation area; and\n(2) have all of the powers contained in sections 462.351 to 462.364, and the authority to adopt and enforce the State Fire Code promulgated pursuant to section 326B.02, subdivision 5.\nAn orderly annexation agreement is a binding contract upon all parties to the agreement and is enforceable in the district court in the county in which the unincorporated property in question is located. The provisions of an orderly annexation agreement are not preempted by any provision of this chapter unless the agreement specifically provides so. If an orderly annexation agreement provides the exclusive procedures by which the unincorporated property identified in the agreement may be annexed to the municipality, the municipality shall not annex that property by any other procedure.",
	"repealed": false
}