{
	"id": "414.0333",
	"url": "https://www.revisor.mn.gov/statutes/cite/414.0333",
	"title": "414.0333 JOINT INFORMATIONAL MEETING.",
	"text": "There must be a joint informational meeting of the municipal council of the annexing municipality and the town board of supervisors of the township containing the land proposed to be annexed or included in annexation proceedings under section 414.031. For an annexation under section 414.031, the joint informational meeting must be held after the final mediation meeting or the final meeting held pursuant to section 414.01, subdivision 16, if any, and before the hearing on the matter is held. If no mediation meetings are held, the joint informational meeting must be held after the initiating documents have been filed and before the hearing on the matter. The time, date, and place of the public informational meeting must be determined jointly by the chair of the town board of supervisors and the mayor of the annexing municipality. The chair of the town board of supervisors and the mayor must serve as the cochairs for the informational meeting. Notice of the time, date, place, and purpose of the informational meeting must be posted by the town clerk in the township's designated place for posting notices, and by the municipal clerk in the municipality's designated place for posting notices. In addition, both the city and town shall publish, at their own expense, notice in their respective official newspapers. If the city and town use the same official newspaper, a joint notice may be published and the costs evenly divided. All notice required by this section must be provided at least ten days before the date for the public informational meeting. At the public informational meeting, all persons appearing must have an opportunity to be heard, but the co-chairs may, by mutual agreement, establish the amount of time allowed for each speaker. The municipal council, the town board of supervisors, and any resident or affected property owner may be represented by counsel and may place into the record of the informational meeting documents, expert opinions, or other materials supporting their positions on issues raised by the proposed annexation proceeding. The clerk of the township must record minutes of the proceedings of the informational meeting and the municipal clerk must make an audio recording of the informational meeting. The township must provide the chief administrative law judge and the municipality with a copy of the printed minutes and the municipality must provide the chief administrative law judge and the township with a copy of the audio recording. The record of the informational meeting for a proceeding under section 414.031 is admissible in any proceeding under this chapter and shall be taken into consideration by the chief administrative law judge or the chief administrative law judge's designee.",
	"repealed": false
}