{
	"id": "144A.476",
	"url": "https://www.revisor.mn.gov/statutes/cite/144A.476",
	"title": "144A.476 BACKGROUND STUDIES.",
	"text": "(a) Before the commissioner issues a temporary license, issues a license as a result of an approved change in ownership, or renews a license, an owner or managerial official is required to complete a background study under section 144.057. No person may be involved in the management, operation, or control of a home care provider if the person has been disqualified under chapter 245C. If an individual is disqualified under section 144.057 or chapter 245C, the individual may request reconsideration of the disqualification. If the individual requests reconsideration and the commissioner sets aside or rescinds the disqualification, the individual is eligible to be involved in the management, operation, or control of the provider. If an individual has a disqualification under section 245C.15, subdivision 1, and the disqualification is affirmed, the individual's disqualification is barred from a set aside, and the individual must not be involved in the management, operation, or control of the provider.\n(b) For purposes of this section, owners of a home care provider subject to the background check requirement are those individuals whose ownership interest provides sufficient authority or control to affect or change decisions related to the operation of the home care provider. An owner includes a sole proprietor, a general partner, or any other individual whose individual ownership interest can affect the management and direction of the policies of the home care provider.\n(c) For the purposes of this section, managerial officials subject to the background check requirement are individuals who provide direct contact as defined in section 245C.02, subdivision 11, or individuals who have the responsibility for the ongoing management or direction of the policies, services, or employees of the home care provider. Data collected under this subdivision shall be classified as private data on individuals under section 13.02, subdivision 12.\n(d) The department shall not issue any license if the applicant or owner or managerial official has been unsuccessful in having a background study disqualification set aside under section 144.057 and chapter 245C; if the owner or managerial official, as an owner or managerial official of another home care provider, was substantially responsible for the other home care provider's failure to substantially comply with sections 144A.43 to 144A.482; or if an owner that has ceased doing business, either individually or as an owner of a home care provider, was issued a correction order for failing to assist clients in violation of this chapter.\n(a) Employees, contractors, and volunteers of a home care provider are subject to the background study required by section 144.057, and may be disqualified under chapter 245C. Nothing in this section shall be construed to prohibit a home care provider from requiring self-disclosure of criminal conviction information.\n(b) Termination of an employee in good faith reliance on information or records obtained under paragraph (a) or subdivision 1, regarding a confirmed conviction does not subject the home care provider to civil liability or liability for unemployment benefits.",
	"repealed": false
}