{
	"id": "383B.061",
	"url": "https://www.revisor.mn.gov/statutes/cite/383B.061",
	"title": "383B.061 LEGISLATIVE RESEARCH COMMITTEE.",
	"text": "In Hennepin County there is hereby created a Legislative Research Committee. The committee shall consist of the senators and representatives in the legislature from the county.\nThe committee may investigate and study, accumulate, compile, analyze, and report on information concerning policies, plans, programs, and procedures relating to or affecting the fiscal and legislative needs of the county and any governmental or political subdivision within the county, including any school district, and any metropolitan or district authority having jurisdiction in any area of the county. The committee shall gather information and provide material to be used by senators and representatives from the county in their work while the legislature is in session and in connection with any legislative proposals affecting the county and such subdivisions. It may appoint subcommittees to perform any of its functions or duties.\nThe committee or any subcommittee appointed by it may sit at any time and place as it deems advisable. It shall meet at least once in each quarter and shall meet at any time upon the call of the chair. Nine members constitute a quorum. A majority of the quorum may act in any matter coming within the jurisdiction of the committee.\nThe committee shall select a chair and a vice-chair from its own members and may prescribe its rules of procedure. It may appoint a secretary who need not be a member. The committee may employ such other persons and obtain the assistance of such research agencies as its deems necessary.\nThe members of the committee and the members of any subcommittee shall be compensated for expenses necessarily incurred in the performance of their official duties.\nThe county board shall appropriate from the county general revenue fund for the purpose of this section the sum of $20,000 for the use of the committee during the biennium ending December 31, 1966, and the sum of $20,000 for the use of the committee during each biennium thereafter. For the payment of the expenses of the committee it shall draw its warrants upon the county treasurer. These warrants shall be signed by the chair and one other member of the committee and approved by the county auditor. The county treasurer shall pay them as and when presented but not exceeding in any year the amount provided therefor.",
	"repealed": false
}