{
	"id": "58.20",
	"url": "https://www.revisor.mn.gov/statutes/cite/58.20",
	"title": "58.20 DEFINITIONS.",
	"text": "For purposes of this section to section 58.23, the terms defined in this section have the meanings given.\n\"Allowable assets for liquidity\" means assets that may be used to satisfy the liquidity requirements under section 58.22, including:\n(1) unrestricted cash and cash equivalents; and\n(2) unencumbered investment grade assets held for sale or trade, including agency mortgage-backed securities, obligations of government-sponsored enterprises, and United States Treasury obligations.\n\"Board of directors\" means the formal body established by a covered institution that is responsible for corporate governance and compliance with sections 58.21 to 58.23.\n\"Corporate governance\" means the structure of the covered institution and how the covered institution is managed, including the corporate rules, policies, processes, and practices used to oversee and manage the covered institution.\n\"Covered institution\" means a mortgage servicer that services or subservices for others at least 2,000 or more residential mortgage loans in the United States, excluding whole loans owned, and loans being interim serviced prior to sale as of the most recent calendar year end, reported on the NMLS mortgage call report.\n\"External audit\" means the formal report, prepared by an independent certified public accountant, expressing an opinion on whether the financial statements are:\n(1) presented fairly, in all material aspects, in accordance with the applicable financial reporting framework; and\n(2) inclusive of an evaluation of the adequacy of a company's internal control structure.\n\"Government-sponsored enterprises\" means the Federal National Mortgage Association, and the Federal Home Loan Mortgage Corporation.\n\"Interim serviced prior to sale\" means the collection of a limited number of contractual mortgage payments immediately after origination on loans held for sale but no longer than a period of ninety days prior to the loans being sold into the secondary market.\n\"Internal audit\" means the internal activity of performing independent and objective assurance and consulting to evaluate and improve the effectiveness of company operations, risk management, internal controls, and governance processes.\n\"Mortgage-backed security\" means a financial instrument, often debt securities, collateralized by residential mortgages.\n\"Mortgage call report\" means the quarterly or annual report of residential real estate loan origination, servicing, and financial information completed by companies licensed in NMLS.\n\"Mortgage servicing rights\" means the contractual right to service a residential mortgage loan on behalf of the owner of the associated mortgage in exchange for compensation specified in the servicing contract.\n\"Mortgage servicing rights investor\" or \"master servicer\" means an entity that (1) invests in and owns mortgage servicing rights; and (2) relies on subservicers to administer the loans on the mortgage servicing rights investor's behalf.\n\"Nationwide Multistate Licensing System\" or \"NMLS\" has the meaning given in section 58A.02, subdivision 8.\n\"Operating liquidity\" means the money necessary for an entity to perform normal business operations, including payment of rent, salaries, interest expenses, and other typical expenses associated with operating the entity.\n\"Residential mortgage loans serviced\" means the specific portfolio or portfolios of residential mortgage loans for which a licensee is contractually responsible to the owner or owners of the mortgage loans for the defined servicing activities.\n\"Reverse mortgage\" has the meaning given in section 47.58, subdivision 1, paragraph (a).\n\"Risk management assessment\" means the functional evaluations performed under the risk management program and the reports provided to the board of directors under the relevant governance protocol.\n\"Risk management program\" means the policies and procedures designed to identify, measure, monitor, and mitigate risk commensurate with the covered institution's size and complexity.\n\"Servicer\" has the meaning given in section 58.02, subdivision 20.\n\"Servicing liquidity\" or \"liquidity\" means the financial resources necessary to manage liquidity risk arising from servicing functions required in acquiring and financing mortgage servicing rights; hedging costs, including margin calls, associated with the mortgage servicing rights asset and financing facilities; and advances or costs of advance financing for principal, interest, taxes, insurance, and any other servicing related advances.\n\"Subservicer\" means the entity performing routine administration of residential mortgage loans as the agent of a servicer or mortgage servicing rights investor under the terms of a subservicing contract.\n\"Subservicing for others\" means the contractual activities performed by subservicers on behalf of a servicer or mortgage servicing rights investor.\n\"Tangible net worth\" means total equity less receivables due from related entities, less goodwill and other intangibles, less pledged assets.\n\"Whole loans\" means a loan where a mortgage and the underlying credit risk is owned and held on a balance sheet of the entity possessing all ownership rights.",
	"repealed": false
}