{
	"id": "325E.72",
	"url": "https://www.revisor.mn.gov/statutes/cite/325E.72",
	"title": "325E.72 DIGITAL FAIR REPAIR.",
	"text": "This section may be cited as the \"Digital Fair Repair Act.\"\n(a) For the purposes of this section, the following terms have the meanings given.\n(b) \"Authorized repair provider\" means an individual or business who is unaffiliated with an original equipment manufacturer and who has: (1) an arrangement with the original equipment manufacturer, for a definite or indefinite period, under which the original equipment manufacturer grants to the individual or business a license to use a trade name, service mark, or other proprietary identifier to offer diagnostic, maintenance, or repair services for digital electronic equipment under the name of the original equipment manufacturer; or (2) an arrangement with the original equipment manufacturer to offer diagnostic, maintenance, or repair services for digital electronic equipment on behalf of the original equipment manufacturer. An original equipment manufacturer that offers diagnostic, maintenance, or repair services for the original equipment manufacturer's digital electronic equipment is considered an authorized repair provider with respect to the digital electronic equipment if the original equipment manufacturer does not have an arrangement described in this paragraph with an unaffiliated individual or business.\n(c) \"Contractor\" has the meaning given in section 326B.31, subdivision 14.\n(d) \"Cybersecurity\" means the practice of protecting networks, devices, and data from unauthorized access or criminal use and the practice of ensuring the confidentiality, integrity, and availability of information.\n(e) \"Digital electronic equipment\" or \"equipment\" means any hardware product that depends, in whole or in part, on digital electronics embedded in or attached to the product in order for the product to function, for which the original equipment manufacturer makes available tools, parts, or documentation to authorized repair providers.\n(f) \"Documentation\" means a manual, diagram, reporting output, service code description, schematic diagram, or similar information made available by an original equipment manufacturer to an authorized repair provider to facilitate diagnostic, maintenance, or repair services for digital electronic equipment.\n(g) \"Embedded software\" means any programmable instructions provided on firmware delivered with digital electronic equipment, or with a part for the equipment, in order to operate the equipment. Embedded software includes all relevant patches and fixes made by the manufacturer of the equipment or part in order to operate the equipment.\n(h) \"Fair and reasonable terms\" means, with respect to:\n(1) parts for digital electronic equipment offered by an original equipment manufacturer:\n(i) costs that are fair to both parties; and\n(ii) terms under which an original equipment manufacturer offers the part to an authorized repair provider and which:\n(A) is not conditioned on or imposing a substantial obligation to use or restrict the use of the part to diagnose, maintain, or repair digital electronic equipment sold, leased, or otherwise supplied by the original equipment manufacturer, including a condition that the owner or independent repair provider become an authorized repair provider of the original equipment manufacturer; or\n(B) a requirement that a part be registered, paired with, or approved by the original equipment manufacturer or an authorized repair provider before the part is operational or prohibit an original equipment manufacturer from imposing any additional cost or burden that is not reasonably necessary or is designed to be an impediment on the owner or independent repair provider;\n(2) tools, software, and documentation for digital electronic equipment offered by an original equipment manufacturer:\n(i) costs that are equivalent to the lowest actual cost for which the original equipment manufacturer offers the tool, software, or documentation to an authorized repair provider, including any discount, rebate, or other financial incentive offered to an authorized repair provider; and\n(ii) terms that are equivalent to the most favorable terms under which an original equipment manufacturer offers the tool, software, or documentation to an authorized repair provider, including the methods and timeliness of delivery of the tool, software, or documentation, do not impose on an owner or an independent repair provider:\n(A) a substantial obligation to use or restrict the use of the tool, software, or documentation to diagnose, maintain, or repair digital electronic equipment sold, leased, or otherwise supplied by the original equipment manufacturer, including a condition that the owner or independent repair provider become an authorized repair provider of the original equipment manufacturer; or\n(B) a requirement that a tool be registered, paired with, or approved by the original equipment manufacturer or an authorized repair provider before the part or tool is operational; and\n(3) documentation offered by an original equipment manufacturer: that the documentation is made available by the original equipment manufacturer at no charge, except that when the documentation is requested in physical printed form, a charge may be included for the reasonable actual costs of preparing and sending the copy.\n(i) \"Independent repair provider\" means an individual or business operating in Minnesota that: (1) does not have an arrangement described in paragraph (b) with an original equipment manufacturer; (2) is not affiliated with any individual or business that has an arrangement described in paragraph (b); and (3) is engaged in providing diagnostic, maintenance, or repair services for digital electronic equipment. An original equipment manufacturer or, with respect to the original equipment manufacturer, an individual or business that has an arrangement with the original equipment manufacturer or is affiliated with an individual or business that has an arrangement with that original equipment manufacturer, is considered an independent repair provider for purposes of the instances the original equipment manufacturer engages in diagnostic, maintenance, or repair services for digital electronic equipment that is not manufactured by or sold under the name of the original equipment manufacturer.\n(j) \"Manufacturer of motor vehicle equipment\" means a business engaged in the business of manufacturing or supplying components used to manufacture, maintain, or repair a motor vehicle.\n(k) \"Motor vehicle\" means a vehicle that is: (1) designed to transport persons or property on a street or highway; and (2) certified by the manufacturer under (i) all applicable federal safety and emissions standards, and (ii) all requirements for distribution and sale in the United States. Motor vehicle does not include a recreational vehicle or an auto home equipped for habitation.\n(l) \"Motor vehicle dealer\" means an individual or business that, in the ordinary course of business: (1) is engaged in the business of selling or leasing new motor vehicles to an individual or business pursuant to a franchise agreement; (2) has obtained a license under section 168.27; and (3) is engaged in providing diagnostic, maintenance, or repair services for motor vehicles or motor vehicle engines pursuant to a franchise agreement.\n(m) \"Motor vehicle manufacturer\" means a business engaged in the business of manufacturing or assembling new motor vehicles.\n(n) \"Original equipment manufacturer\" means any individual or business that, in the normal course of business, is engaged in the business of selling or leasing to any individual or business new digital electronic equipment manufactured by or on behalf of the original equipment manufacturer.\n(o) \"Owner\" means an individual or business that owns or leases digital electronic equipment purchased or used in Minnesota.\n(p) \"Part\" means any replacement part or assembly of parts, either new or used, made available by an original equipment manufacturer to authorized repair providers to facilitate the maintenance or repair of digital electronic equipment manufactured or sold by the original equipment manufacturer.\n(q) \"Personally identifiable information\" means any representation of information that permits the identity of an individual to whom the information applies to be reasonably inferred by either direct or indirect means.\n(r) \"Tool\" means any software program, hardware implement, or other apparatus used for diagnosis, maintenance, or repair of digital electronic equipment, including software or other mechanisms that provide, program, pair a part, calibrate functionality, or perform any other function required to repair the original equipment or part back to fully functional condition, including updates.\n(s) \"Trade secret\" has the meaning given in section 325C.01, subdivision 5.\n(t) \"Video game console\" means a computing device, such as a console machine, a handheld console device, or another device or system, and its components and peripherals, that is primarily used by consumers for playing video games but which is neither a general nor an all-purpose computer. A general or all-purpose computer includes but is not limited to a desktop computer, laptop, tablet, or cell phone.\n(a) For digital electronic equipment and parts for the equipment sold or used in Minnesota, an original equipment manufacturer must make available to any independent repair provider or to the owner of digital electronic equipment manufactured by or on behalf of, or sold by, the original equipment manufacturer, on fair and reasonable terms, documentation, parts, and tools, inclusive of any updates to information or embedded software, for diagnostic, maintenance, or repair purposes. Nothing in this section requires an original equipment manufacturer to make available a part, tools, or documentation if it is no longer available to the original equipment manufacturer.\n(b) Such parts, tools, and documentation shall be made available within 60 days after the first sale of the digital electronic equipment in Minnesota.\nA violation of this section is an unlawful practice under section 325D.44. All remedies, penalties, and authority granted to the attorney general under section 8.31 are available to the attorney general to enforce this section.\n(a) Nothing in this section requires an original equipment manufacturer to divulge a trade secret or license any intellectual property to an owner or an independent service provider, except as necessary to provide documentation, parts, and tools on fair and reasonable terms.\n(b) Nothing in this section alters the terms of any arrangement described in subdivision 2, paragraph (b), including but not limited to the performance or provision of warranty or recall repair work by an authorized repair provider on behalf of an original equipment manufacturer pursuant to the arrangement, in force between an authorized repair provider and an original equipment manufacturer. A provision in the terms of an arrangement described in subdivision 2, paragraph (b), that purports to waive, avoid, restrict, or limit the original equipment manufacturer's obligations to comply with this section is void and unenforceable.\n(c) Nothing in this section requires an original equipment manufacturer or an authorized repair provider to provide to an owner or independent repair provider access to information, other than documentation, that is provided by the original equipment manufacturer to an authorized repair provider pursuant to the terms of an arrangement described in subdivision 2, paragraph (b).\n(d) Nothing in this section requires an original equipment manufacturer or authorized repair provider to make available any parts, tools, or documentation for the purpose of making modifications to any digital electronic equipment.\n(e) Nothing in this section shall be construed to require the original equipment manufacturer to sell service parts if the service parts are no longer provided by the original equipment manufacturer or made available to authorized repair providers of the original equipment manufacturer.\n(f) Nothing in this section shall require an original manufacturer to make available special documentation, tools, and parts that would disable or override antitheft security measures set by the owner of the equipment without the owner's authorization.\n(g) Nothing in this section shall apply if the original equipment manufacturer provides equivalent or better, readily available replacement equipment at no charge to the customer.\n(h) Nothing in this section requires the original manufacturer to provide access to parts, tools, or documentation for work that is required to be done or supervised by an individual or contractor licensed under chapter 326B or with any individual or contractor who does not possess the relevant license required for that work.\n(a) Nothing in this section applies to: (1) a motor vehicle manufacturer, manufacturer of motor vehicle equipment, or motor vehicle dealer acting in that capacity; or (2) any product or service of a motor vehicle manufacturer, manufacturer of motor vehicle equipment, or motor vehicle dealer acting in that capacity.\n(b) Nothing in this section applies to manufacturers or distributors of a medical device as defined in the Federal Food, Drug, and Cosmetic Act, United States Code, title 21, section 301 et seq., or a digital electronic product or software manufactured for use in a medical setting including diagnostic, monitoring, or control equipment or any product or service that the manufacturer or distributor of a medical device offers.\n(c) Nothing in this section applies to manufacturers, distributors, importers, or dealers of any off-road or nonroad equipment, including without limitation farm and utility tractors; farm implements; farm machinery; forestry equipment; industrial equipment; utility equipment; construction equipment; compact construction equipment; road-building equipment; electronic vehicle charging infrastructure equipment; mining equipment; turf, yard, and garden equipment; outdoor power equipment; portable generators; marine, all-terrain sports, and recreational vehicles, including without limitation racing vehicles; stand-alone or integrated stationary or mobile internal combustion engines; generator sets and fuel cell power; power tools; and any tools, technology, attachments, accessories, components, and repair parts for any of the foregoing.\n(d) Nothing in this section shall be construed to require any original equipment manufacturer or authorized repair provider to make available any parts, tools, or documentation required for the diagnosis, maintenance, or repair of a video game console and its components and peripherals.\n(e) Nothing in this section applies to an energy storage system, as defined in section 216B.2422, subdivision 1, paragraph (f).\n(f) Nothing in this section requires an original equipment manufacturer to make available parts, documentation, or tools related to cybersecurity, except as necessary for the repair or maintenance of equipment. Notwithstanding anything in this section to the contrary, an original equipment manufacturer is not required to make available parts, documentation, or tools related to cybersecurity which: (1) could reasonably give a recipient or third-party access to trade secret or personally identifiable information owned or possessed by an original equipment manufacturer for itself or on behalf of another person; (2) is protected from disclosure under other laws of this state; or (3) could reasonably be used to compromise cybersecurity or cybersecurity equipment.\n(g) Nothing in this section applies to information technology equipment that is intended for use in critical infrastructure, as defined in United States Code, title 42, section 5195c(e).\nNo original equipment manufacturer or authorized repair provider shall be liable for any damage or injury caused to any digital electronic equipment, person, or property that occurs as a result of repair, diagnosis, maintenance, or modification performed by an independent repair provider or owner, including but not limited to any indirect, incidental, special, or consequential damages; any loss of data, privacy, or profits; or an inability to use, or reduced functionality of, the digital electronic equipment.\nThis section applies to equipment sold on or after July 1, 2021.",
	"repealed": false
}