{
	"id": "244.171",
	"url": "https://www.revisor.mn.gov/statutes/cite/244.171",
	"title": "244.171 CHALLENGE INCARCERATION PROGRAM; BASIC ELEMENTS.",
	"text": "The commissioner shall administer an intensive, structured, and disciplined program with a high level of offender accountability and control and direct and related consequences for failure to meet behavioral expectations. The program shall have the following goals:\n(1) to punish and hold the offender accountable;\n(2) to protect the safety of the public;\n(3) to treat offenders with substance use disorder; and\n(4) to prepare the offender for successful reintegration into society.\nThe program shall contain all of the components described in paragraphs (a) to (e).\n(a) The program shall contain a highly structured daily schedule for the offender.\n(b) The program shall contain a rigorous physical program designed to teach personal discipline and improve the physical and mental well-being of the offender. It shall include skills designed to teach the offender how to reduce and cope with stress.\n(c) The program shall contain individualized educational programs designed to improve the basic educational skills of the offender and to provide vocational training.\n(d) The program shall contain programs designed to promote the offender's self-worth and the offender's acceptance of responsibility for the consequences of the offender's own decisions.\n(e) The program shall contain culturally sensitive substance use disorder programs, licensed by the Department of Human Services and designed to serve the inmate population. It shall require that each offender submit to a chemical use assessment and that the offender receive the appropriate level of treatment as indicated by the assessment.\nAn offender in the challenge incarceration program whose crime was committed before August 1, 1993, does not earn good time during phases I and II of the program, notwithstanding section 244.04.\n(a) The commissioner shall impose severe and meaningful sanctions for violating the conditions of the challenge incarceration program. The commissioner shall remove an offender from the challenge incarceration program if the offender:\n(1) commits a material violation of or repeatedly fails to follow the rules of the program;\n(2) commits any misdemeanor, gross misdemeanor, or felony offense; or\n(3) presents a risk to the public, based on the offender's behavior, attitude, or abuse of alcohol or controlled substances. The removal of an offender from the challenge incarceration program is governed by the procedures in the commissioner's rules adopted under section 244.05, subdivision 2.\n(b) An offender who is removed from the challenge incarceration program shall be imprisoned for a time period equal to the offender's term of imprisonment, minus earned good time if any, but in no case for longer than the time remaining in the offender's sentence. \"Term of imprisonment\" means a time period equal to two-thirds of the sentence originally executed by the sentencing court, minus jail credit, if any.\n(c) Notwithstanding paragraph (b), an offender who has been removed from the challenge incarceration program but who remains otherwise eligible for acceptance into the program may be readmitted at the commissioner's discretion. An offender readmitted to the program under this paragraph must participate from the beginning and complete all of the program's phases.\nThe commissioner shall develop specialized training for correctional employees who supervise and are assigned to the challenge incarceration program.",
	"repealed": false
}