{
	"id": "13.37",
	"url": "https://www.revisor.mn.gov/statutes/cite/13.37",
	"title": "13.37 GENERAL NONPUBLIC DATA.",
	"text": "As used in this section, the following terms have the meanings given them.\n(a) \"Security information\" means government data the disclosure of which the responsible authority determines would be likely to substantially jeopardize the security of information, possessions, individuals or property against theft, tampering, improper use, attempted escape, illegal disclosure, trespass, or physical injury. \"Security information\" includes checking account numbers, crime prevention block maps and lists of volunteers who participate in community crime prevention programs and their home and mailing addresses, telephone numbers, email or other digital addresses, Internet communication services accounts information or similar accounts information, and global positioning system locations.\n(b) \"Trade secret information\" means government data, including a formula, pattern, compilation, program, device, method, technique or process (1) that was supplied by the affected individual or organization, (2) that is the subject of efforts by the individual or organization that are reasonable under the circumstances to maintain its secrecy, and (3) that derives independent economic value, actual or potential, from not being generally known to, and not being readily ascertainable by proper means by, other persons who can obtain economic value from its disclosure or use.\n(c) \"Labor relations information\" means management positions on economic and noneconomic items that have not been presented during the collective bargaining process or interest arbitration, including information specifically collected or created to prepare the management position.\n(d) \"Parking space leasing data\" means the following government data on an applicant for, or lessee of, a parking space: residence address, home telephone number, beginning and ending work hours, place of employment, work telephone number, and location of the parking space.\n(a) The following government data is classified as nonpublic data with regard to data not on individuals, pursuant to section 13.02, subdivision 9, and as private data with regard to data on individuals, pursuant to section 13.02, subdivision 12: security information; trade secret information; sealed absentee ballots prior to opening by an election judge; sealed bids, including the number of bids received, prior to the opening of the bids; parking space leasing data; and labor relations information, provided that specific labor relations information which relates to a specific labor organization is classified as protected nonpublic data pursuant to section 13.02, subdivision 13.\n(b) If a government entity denies a data request based on a determination that the data are security information, upon request, the government entity must provide a short description explaining the necessity for the classification.\n(a) Crime prevention block maps and names, home addresses, and telephone numbers of volunteers who participate in community crime prevention programs may be disseminated to volunteers participating in crime prevention programs. The location of a National Night Out event is public data.\n(b) The responsible authority of a government entity in consultation with the appropriate chief law enforcement officer, emergency manager, or public health official, may make security information accessible to any person, entity, or the public if the government entity determines that the access will aid public health, promote public safety, or assist law enforcement.",
	"repealed": false
}