{
	"id": "144.05",
	"url": "https://www.revisor.mn.gov/statutes/cite/144.05",
	"title": "144.05 GENERAL DUTIES OF COMMISSIONER; REPORTS.",
	"text": "The state commissioner of health shall have general authority as the state's official health agency and shall be responsible for the development and maintenance of an organized system of programs and services for protecting, maintaining, and improving the health of the citizens. This authority shall include but not be limited to the following:\n(1) conduct studies and investigations, collect and analyze health and vital data, and identify and describe health problems;\n(2) plan, facilitate, coordinate, provide, and support the organization of services for the prevention and control of illness and disease and the limitation of disabilities resulting therefrom;\n(3) establish and enforce health standards for the protection and the promotion of the public's health such as quality of health services, reporting of disease, regulation of health facilities, environmental health hazards and personnel;\n(4) affect the quality of public health and general health care services by providing consultation and technical training for health professionals and paraprofessionals;\n(5) promote personal health by conducting general health education programs and disseminating health information;\n(6) coordinate and integrate local, state and federal programs and services affecting the public's health;\n(7) continually assess and evaluate the effectiveness and efficiency of health service systems and public health programming efforts in the state; and\n(8) advise the governor and legislature on matters relating to the public's health.\nIt is part of the department's mission that within the department's resources the commissioner shall endeavor to:\n(1) prevent the waste or unnecessary spending of public money;\n(2) use innovative fiscal and human resource practices to manage the state's resources and operate the department as efficiently as possible;\n(3) coordinate the department's activities wherever appropriate with the activities of other governmental agencies;\n(4) use technology where appropriate to increase agency productivity, improve customer service, increase public access to information about government, and increase public participation in the business of government;\n(5) utilize constructive and cooperative labor-management practices to the extent otherwise required by chapters 43A and 179A;\n(6) report to the legislature on the performance of agency operations and the accomplishment of agency goals in the agency's biennial budget according to section 16A.10, subdivision 1; and\n(7) recommend to the legislature appropriate changes in law necessary to carry out the mission and improve the performance of the department.\nWhen the commissioner transfers operational money between programs under section 16A.285, in addition to the requirements of that section the commissioner must provide the chairs of the legislative committees that have jurisdiction over the agency's budget with sufficient detail to identify the account to which the money was originally appropriated, and the account to which the money is being transferred.\nUpon receiving notice under section 149A.90, subdivision 1, of the death of an individual who cannot be identified, the commissioner must post on the department's website information regarding the individual for purposes of obtaining information that may aid in identifying the individual and for purposes of notifying relatives who may be seeking the individual. The information must remain on the website continuously until the person's identity is determined.\nNotwithstanding any law to the contrary, the commissioner of health is prohibited from collecting data on individuals regarding lawful firearm ownership in the state or data related to an individual's right to carry a weapon under section 624.714.\nThe commissioner of health shall provide quarterly reports to the chairs and ranking minority members of the legislative committees with jurisdiction over health and human services policy and finance on:\n(1) interagency agreements or service-level agreements and any renewals or extensions of existing interagency or service-level agreements with a state department under section 15.01, state agency under section 15.012, or the Department of Information Technology Services, with a value of more than $100,000, or related agreements with the same department or agency with a cumulative value of more than $100,000; and\n(2) transfers of appropriations of more than $100,000 between accounts within or between agencies.\nThe report must include the statutory citation authorizing the agreement, transfer or dollar amount, purpose, and effective date of the agreement, and duration of the agreement.\n(a) If the submission of a report by the commissioner of health to the legislature is mandated by statute and the enabling legislation does not include a date for the submission of a final report, the mandate to submit the report shall expire in accordance with this section.\n(b) If the mandate requires the submission of an annual report and the mandate was enacted before January 1, 2021, the mandate shall expire on January 1, 2023. If the mandate requires the submission of a biennial or less frequent report and the mandate was enacted before January 1, 2021, the mandate shall expire on January 1, 2024.\n(c) Any reporting mandate enacted on or after January 1, 2021, shall expire three years after the date of enactment if the mandate requires the submission of an annual report and shall expire five years after the date of enactment if the mandate requires the submission of a biennial or less frequent report, unless the enacting legislation provides for a different expiration date.\n(d) The commissioner shall submit a list to the chairs and ranking minority members of the legislative committees with jurisdiction over health by February 15 of each year, beginning February 15, 2022, of all reports set to expire during the following calendar year in accordance with this section. The mandate to submit a report to the legislature under this paragraph does not expire.\nThe commissioner must consult with the commissioner of management and budget to create, review, and revise grant program performance measures and to evaluate grant programs administered by the commissioner in accordance with section 16A.055, subdivisions 1a and 1b.",
	"repealed": false
}