{
	"id": "276.04",
	"url": "https://www.revisor.mn.gov/statutes/cite/276.04",
	"title": "276.04 NOTICE OF RATES; PROPERTY TAX STATEMENTS.",
	"text": "On receiving the tax lists from the county auditor, the county treasurer shall, if directed by the county board, give three weeks' published notice in a newspaper specifying the rates of taxation for all general purposes and the amounts raised for each specific purpose.\n(a) The treasurer shall provide for the printing of the tax statements. The commissioner of revenue shall prescribe the form of the property tax statement and its contents. The tax statement must not state or imply that property tax credits are paid by the state of Minnesota. The statement must contain a tabulated statement of the dollar amount due to each taxing authority and the amount of the state tax from the parcel of real property for which a particular tax statement is prepared. The dollar amounts attributable to the county, the state tax, the voter approved school tax, the other local school tax, the township or municipality, and the total of the metropolitan special taxing districts as defined in section 275.065, subdivision 3, paragraph (i), must be separately stated. The amounts due all other special taxing districts, if any, may be aggregated except that any levies made by the regional rail authorities in the county of Anoka, Carver, Dakota, Hennepin, Ramsey, Scott, or Washington under chapter 398A shall be listed on a separate line directly under the appropriate county's levy. If the county levy under this paragraph includes an amount for a lake improvement district as defined under sections 103B.501 to 103B.581, the amount attributable for that purpose must be separately stated from the remaining county levy amount. In the case of Ramsey County, if the county levy under this paragraph includes an amount for public library service under section 134.07, the amount attributable for that purpose may be separated from the remaining county levy amount. The amount of the tax on homesteads qualifying under the senior citizens' property tax deferral program under chapter 290B is the total amount of property tax before subtraction of the deferred property tax amount. The amount of the tax on contamination value imposed under sections 270.91 to 270.98, if any, must also be separately stated. The dollar amounts, including the dollar amount of any special assessments, may be rounded to the nearest even whole dollar. For purposes of this section whole odd-numbered dollars may be adjusted to the next higher even-numbered dollar.\n(b) The property tax statements for manufactured homes and sectional structures taxed as personal property shall contain the same information that is required on the tax statements for real property.\n(c) Real and personal property tax statements must contain the following information in the order given in this paragraph. The information must contain the current year tax information in the right column with the corresponding information for the previous year in a column on the left:\n(1) the property's estimated market value under section 273.11, subdivision 1;\n(2) the property's homestead market value exclusion under section 273.13, subdivision 35;\n(3) the property's taxable market value under section 272.03, subdivision 15;\n(4) the property's gross tax, before credits;\n(5) for agricultural properties, the credits under sections 273.1384 and 273.1387;\n(6) any credits received under sections 273.119; 273.1234 or 273.1235; 273.135; 273.1391; 273.1398, subdivision 4; 469.171; and 473H.10, except that the amount of credit received under section 273.135 must be separately stated and identified as \"taconite tax relief\"; and\n(7) the net tax payable in the manner required in paragraph (a).\n(d) If the county uses envelopes for mailing property tax statements and if the county agrees, a taxing district may include a notice with the property tax statement notifying taxpayers when the taxing district will begin its budget deliberations for the current year, and encouraging taxpayers to attend the hearings. If the county allows notices to be included in the envelope containing the property tax statement, and if more than one taxing district relative to a given property decides to include a notice with the tax statement, the county treasurer or auditor must coordinate the process and may combine the information on a single announcement.\nIn the case of property subject to the areawide tax under section 276A.06, subdivision 7, for both the current year taxes and the previous year tax amounts, the net tax capacity portion of the tax shown for each taxing jurisdiction must be based on the property's total net tax capacity multiplied by the jurisdiction's net tax capacity tax rate. In addition to the tax amounts shown for each jurisdiction, the statement must include a line showing the \"fiscal disparities adjustment\" equal to the total gross tax payable minus the sum of the tax amounts shown for the individual taxing jurisdictions for each year. The fiscal disparities adjustment may be a negative number. In all other respects the statement must fulfill the requirements of subdivision 2.\nThe county treasurer shall mail to taxpayers statements of their personal property taxes due not later than March 31, except in the case of manufactured homes and sectional structures taxed as personal property. Statements of the real property taxes due shall be mailed not later than March 31. The validity of the tax shall not be affected by failure of the treasurer to mail the statement. The taxpayer is defined as the owner who is responsible for the payment of the tax.\nIf so directed by the county board, the treasurer shall visit places in the county as the treasurer deems expedient for the purpose of receiving taxes and the county board is authorized to pay the expenses of such visits and of preparing duplicate tax lists. Failure to mail the tax statement shall not be deemed a material defect to affect the validity of any judgment and sale for delinquent taxes.\nUpon written request by the owner of real property located in the county, or by the owner's agent, a county may send tax statements by electronic means instead of by mailing. For the purposes of the payment deadlines specified in section 279.01, the postmark date on the envelope containing these property tax statements is the date the statements were sent by electronic means.",
	"repealed": false
}