{
	"id": "504B.291",
	"url": "https://www.revisor.mn.gov/statutes/cite/504B.291",
	"title": "504B.291 EVICTION ACTION FOR NONPAYMENT; REDEMPTION; OTHER RIGHTS.",
	"text": "(a) A landlord may bring an eviction action for nonpayment of rent irrespective of whether the lease contains a right of reentry clause. Such an eviction action is equivalent to a demand for the rent. There is a rebuttable presumption that the rent has been paid if the tenant produces a copy or copies of one or more money orders or produces one or more original receipt stubs evidencing the purchase of a money order, if the documents: (i) total the amount of the rent; (ii) include a date or dates approximately corresponding with the date rent was due; and (iii) in the case of copies of money orders, are made payable to the landlord. This presumption is rebutted if the landlord produces a business record that shows that the tenant has not paid the rent. The landlord is not precluded from introducing other evidence that rebuts this presumption. In such an action, unless the landlord has also sought to evict the tenant by alleging a material violation of the lease under section 504B.285, subdivision 5, the tenant may, at any time before possession has been delivered, redeem the tenancy and be restored to possession by paying to the landlord or bringing to court the amount of the rent that is in arrears, with interest, costs of the action, and an attorney's fee not to exceed $5, and by performing any other covenants of the lease. Redemption may be made with a written guarantee from (1) a federal agency, state agency, or local unit of government, or (2) any other organization that qualifies for tax-exempt status under United States Code, title 26, section 501(c)(3), and that administers a government rental assistance program, has sufficient funds available, and guarantees funds will be provided to the landlord.\n(b) If the tenant has paid to the landlord or brought into court the amount of rent in arrears but is unable to pay the interest, costs of the action, and attorney's fees required by paragraph (a), the court may permit the tenant to pay these amounts into court and be restored to possession within the same period of time, if any, for which the court stays the issuance of the order to vacate under section 504B.345.\n(c) Prior to or after commencement of an action to recover possession for nonpayment of rent, the parties may agree only in writing that partial payment of rent in arrears which is accepted by the landlord prior to issuance of the order granting restitution of the premises pursuant to section 504B.345 may be applied to the balance due and does not waive the landlord's action to recover possession of the premises for nonpayment of rent.\n(d) Rental payments under this subdivision must first be applied to rent claimed as due in the complaint from prior rental periods before applying any payment toward rent claimed in the complaint for the current rental period, unless the court finds that under the circumstances the claim for rent from prior rental periods has been waived.\n(a) If the lease under which an action is brought under subdivision 1 is for a term of more than 20 years, the action may not begin until the landlord serves a written notice on the tenant and on all creditors with legal or equitable recorded liens on the property. The notice must state: (1) the lease will be canceled unless the amounts, agreements, and legal obligations in default are paid or performed within 30 days, or a longer specified period; and (2) if the amounts, agreements, and legal obligations are not paid or performed within that period, then the landlord may evict the tenant at the expiration of the period.\n(b) If the lease provides that the landlord must give more than the 30 days' notice provided in paragraph (a), then notice must be the same as that provided in the lease.\n(c) The tenant may be restored to possession of the property under the terms of the original lease if, before the expiration of six months after the landlord obtains possession due to the tenant's abandonment or surrender of the property or the landlord prevails in the action, the tenant or a creditor holding a legal or equitable lien on the property: (1) pays to the landlord or brings into court the amount of rent then in arrears, with interest and the costs of the action; and (2) performs the other agreements or legal obligations that are in default.\nUpon recovery of possession by the landlord in the action, a certified copy of the judgment shall, upon presentation, be recorded in the office of the county recorder of the county where the land is situated if unregistered land or in the office of the registrar of titles of the county if registered land and upon recovery of possession by the landlord by abandonment or surrender by the tenant an affidavit by the landlord or the landlord's attorney setting forth the fact shall be recorded in a like manner and the recorded certified copy of the judgment or the recorded affidavit shall be prima facie evidence of the facts stated therein in reference to the recovery of possession by the landlord.",
	"repealed": false
}