{
	"id": "49.43",
	"url": "https://www.revisor.mn.gov/statutes/cite/49.43",
	"title": "49.43 STATE BANK; CONVERSION, MERGER, CONSOLIDATION; NATIONAL BANKING ASSOCIATION.",
	"text": "A state bank may convert into a national banking association or merge or consolidate with one or more national banking associations under the charter of one of such national banking associations as permitted by any law of the United States without approval of any authority of this state, upon the affirmative vote, at a meeting of stockholders called for that purpose, of the holders of not less than two-thirds of the voting power of all stockholders of such state bank entitled under the articles of incorporation to vote. Any stockholder not voting in favor of such conversion or merger or consolidation at such meeting may, at that meeting or within 20 days thereafter, object to the conversion, merger, or consolidation and demand payment for that person's stock at the par value or the book value thereof, whichever shall be the greater. If the conversion, merger or consolidation takes effect at any time after this demand and the resulting national bank has not made payment in the amount demanded, the stockholder may, at any time within 60 days thereafter, apply to the district court in the county wherein is situated the principal place of business of the national banking association into which the state bank has been converted or with which it has merged or consolidated for the appointment of three persons to appraise the value of that person's stock. The court shall thereupon appoint these appraisers and designate the time and place of their first meeting, with such directions in regard to their proceedings as shall be deemed proper and also direct the time and manner in which payment shall be made of the value of that person's stock to the stockholder. The appraisers shall meet at the time and place designated and, after being duly sworn to discharge their duties honestly and faithfully, make and certify a written estimate of the value of the stock at the time of the appraisal and deliver one copy to the national banking association and another to the stockholder. The charges and expenses of the appraisers shall be paid one-half by the stockholder and one-half by the national banking association. When the national banking association shall have paid the appraised value of the stock, the stock shall be canceled and the stockholder shall cease to be a member of the national banking association or to have any interest in the stock or in the corporation or in the corporate property and the stock may be held and disposed of by the national banking association for its own benefit. In lieu of the rights given a dissenting stockholder by this section, the stockholder may exercise any rights given by applicable law of the United States.",
	"repealed": false
}