{
	"id": "16A.85",
	"url": "https://www.revisor.mn.gov/statutes/cite/16A.85",
	"title": "16A.85 MASTER LEASE.",
	"text": "The commissioner of administration may determine, in conjunction with the commissioner of management and budget, the personal property needs of the various state departments, agencies, boards, commissions and the legislature that may be economically funded through a master lease program and request the commissioner of management and budget to execute a master lease.\nThe commissioner of management and budget may authorize the sale and issuance of certificates of participation relative to a master lease in an amount sufficient to fund these personal property needs. The term of the certificates must be less than the expected useful life of the equipment whose purchase is financed by the certificates. The commissioner of administration may use the proceeds from the master lease or the sale of the certificates of participation to acquire the personal property through the appropriate procurement procedure in chapter 16C. Money appropriated for the lease or acquisition of this personal property is appropriated to the commissioner of management and budget to make master lease payments.\nThe commissioner of management and budget may covenant in a master lease that the state will abide by the terms and provisions that are customary in net lease or lease-purchase transactions including, but not limited to, covenants providing that the state:\n(1) will maintain insurance as required under the terms of the lease agreement;\n(2) is responsible to the lessor for any public liability or property damage claims or costs related to the selection, use, or maintenance of the leased equipment, to the extent of insurance or self-insurance maintained by the lessee, and for costs and expenses incurred by the lessor as a result of any default by the lessee;\n(3) authorizes the lessor to exercise the rights of a secured party with respect to the equipment subject to the lease in the event of default by the lessee and, in addition, for the present recovery of lease rentals due during the current term of the lease as liquidated damages.\nThe commissioner of management and budget may not enter into a master lease unless the commissioner of management and budget has conducted a demand survey of the amount of projected rentals and determines that money has been appropriated and allotted for the payment of the maximum amount of rentals that are projected to be payable from state money and that are projected to be due or to become due during the appropriation period in which the lease contract is entered into. A master lease does not constitute or create a general or moral obligation or indebtedness of the state in excess of the money from time to time appropriated or otherwise available for the payment of rent coming due under the lease, and the state has no continuing obligation to appropriate money for the payment of rent or other obligations under the lease. Rent due under a master lease during a current lease term for which money has been appropriated is a current expense of the state.\nProperty subject to a master lease is not subject to personal property taxes. Property purchased by a lessor for lease to the state under a valid master lease and rent due under the lease are not subject to sales tax.\nThe net income from investment of the proceeds of the certificates of participation, as estimated by the commissioner of management and budget, must be credited to the fund whose assets will be used to pay off the certificates of participation.\nThe commissioner of management and budget shall reduce the operating budgets of state agencies that use the master lease program. The amount of the reduction is the difference between the budgeted purchase price of the equipment and the actual master lease payments.",
	"repealed": false
}