{
	"id": "147.0375",
	"url": "https://www.revisor.mn.gov/statutes/cite/147.0375",
	"title": "147.0375 LICENSURE OF EMINENT PHYSICIANS.",
	"text": "The board shall issue a license to practice medicine to any person who satisfies the requirements in paragraphs (a) to (d).\n(a) The applicant must satisfy all the requirements established in section 147.02, subdivision 1, paragraphs (a), (e), (f), (g), and (h).\n(b) The applicant must present evidence satisfactory to the board that the applicant is a graduate of a medical or osteopathic school approved by the board as equivalent to accredited United States or Canadian schools based upon its faculty, curriculum, facilities, accreditation, or other relevant data. If the applicant is a graduate of a medical or osteopathic program that is not accredited by the Liaison Committee for Medical Education or the American Osteopathic Association, the applicant may use the Federation of State Medical Boards' Federation Credentials Verification Service (FCVS) or its successor. If the applicant uses this service as allowed under this paragraph, the physician application fee may be less than $200 but must not exceed the cost of administering this paragraph.\n(c) The applicant must present evidence satisfactory to the board of the completion of one year of graduate, clinical medical training in a program accredited by a national accrediting organization approved by the board or other graduate training approved in advance by the board as meeting standards similar to those of a national accrediting organization. This requirement does not apply:\n(1) to an applicant who is admitted as a permanent immigrant to the United States on or before October 1, 1991, as a person of exceptional ability in the sciences according to Code of Federal Regulations, title 20, section 656.22 (d); or\n(2) to an applicant holding a valid license to practice medicine in another state or country and issued a permanent immigrant visa after October 1, 1991, as a person of extraordinary ability in the field of science or as an outstanding professor or researcher according to Code of Federal Regulations, title 8, section 204.5(h) and (i), or a temporary nonimmigrant visa or status as a person of extraordinary ability in the field of science according to Code of Federal Regulations, title 8, section 214.2(o).\n(d) The applicant must present evidence satisfactory to the board that the applicant has been appointed to serve as a faculty member of a medical school accredited by the Liaison Committee of Medical Education or an osteopathic medical school accredited by the American Osteopathic Association.\nThe board may contract with any qualified person or organization for the performance of a review or investigation, including site visits if necessary, of any medical or osteopathic school prior to approving the school under section 147.02, subdivision 1, paragraph (b), or subdivision 1, paragraph (b), of this section. To the extent possible, the board shall require the school being reviewed to pay the costs of the review or investigation.\nIf a person holding a license issued under this section resigns or is terminated from the academic medical center in which the licensee is employed as a faculty member, the licensee must notify the board in writing no later than 30 days after the date of termination or resignation. Upon notification of resignation or termination, the board shall terminate the medical license.\nA person holding a license issued under this section is subject to the reporting obligations of section 147.111.\nA person issued a license under this section may only practice medicine within the clinical setting of the academic medical center where the licensee is an appointed faculty member or within a physician group practice affiliated with the academic medical center.\nThe licensee must meet the continuing education requirements under Minnesota Rules, chapter 5605.\n[Repealed, 2017 c 82 s 2]",
	"repealed": false
}