{
	"id": "580.25",
	"url": "https://www.revisor.mn.gov/statutes/cite/580.25",
	"title": "580.25 REDEMPTION, HOW MADE.",
	"text": "Redemption shall be made as provided in this section.\nThe person desiring to redeem shall pay the amount required by law for the redemption, and shall produce to the person or officer receiving the redemption payment:\n(1) a copy of the docket of the judgment, or of the recorded deed or mortgage, or of the record or files evidencing any other lien under which the person claims a right to redeem;\n(2) a copy of any recorded assignment necessary to evidence the person's ownership of the lien. If the redemption is under an assignment of a judgment, the assignment shall be filed in the court entering the judgment, as provided by law, and the person so redeeming shall produce a copy of it and of the record of its filing, and the copy of the docket shall show that the proper entry was made upon the docket. No further evidence of the assignment of the judgment is required unless the mortgaged premises or part of it is registered property, in which case the judgment and all assignments of the judgment must be entered as a memorial upon the certificate of title to the mortgaged premises and a copy of the judgment and each assignment with the certificate of record endorsed on it must be produced; and\n(3) an affidavit of the person or the person's agent, showing the amount then actually claimed due on the person's lien and required to be paid on the lien in order to redeem from the person. Additional fees and charges may be claimed due only as provided in section 582.03.\nIf redemption is made to the sheriff, the sheriff may charge a fee of $250 for issuing the certificate of redemption and any related service. No other fee may be charged by the sheriff for a redemption.\nWithin 24 hours after a redemption is made, the person redeeming shall cause the documents so required to be produced to be recorded with the county recorder, or registrar of titles, who may receive fees as prescribed in section 357.18 or 508.82. If the redemption is made at any place other than the county seat, it is sufficient forthwith to deposit the documents in the nearest post office, addressed to the recorder or registrar of titles, with the postage prepaid. A person recording documents produced for redemption shall, on the same day, deliver copies of the documents to the sheriff for public inspection. The sheriff may receive a fee of $20 for the documents delivered following a redemption. The sheriff shall note the date of delivery on the documents and shall maintain for public inspection all documents delivered to the sheriff for a period of six months after the end of the mortgagor's redemption period.",
	"repealed": false
}