{
	"id": "148.235",
	"url": "https://www.revisor.mn.gov/statutes/cite/148.235",
	"title": "148.235 PRESCRIBING DRUGS AND THERAPEUTIC DEVICES.",
	"text": "[Repealed, 2014 c 235 s 42; 2014 c 312 art 24 s 43]\n[Repealed, 2014 c 235 s 42; 2014 c 312 art 24 s 43]\n[Repealed, 2014 c 235 s 42; 2014 c 312 art 24 s 43]\n[Repealed by amendment, 1999 c 172 s 5]\n[Repealed, 2014 c 235 s 42; 2014 c 312 art 24 s 43]\n[Repealed, 2014 c 235 s 42; 2014 c 312 art 24 s 43]\n[Repealed, 2014 c 235 s 42; 2014 c 312 art 24 s 43]\n[Repealed by amendment, 1999 c 172 c 5]\n[Repealed, 2014 c 235 s 42; 2014 c 312 art 24 s 43]\n[Repealed, 2014 c 235 s 42; 2014 c 312 art 24 s 43]\nAdvanced practice registered nurses are authorized to:\n(1) diagnose, prescribe, and institute therapy or referrals of patients to health care agencies and providers;\n(2) prescribe, procure, sign for, record, administer, and dispense over-the-counter, legend, and controlled substances, including sample drugs; and\n(3) plan and initiate a therapeutic regimen that includes ordering and prescribing durable medical devices and equipment, nutrition, diagnostic services, and supportive services including, but not limited to, home health care, hospice, physical therapy, and occupational therapy.\n(a) Advanced practice registered nurses must:\n(1) comply with federal Drug Enforcement Administration (DEA) requirements related to controlled substances; and\n(2) file any and all of the nurse's DEA registrations and numbers with the board.\n(b) The board shall maintain current records of all advanced practice registered nurses with DEA registration and numbers.\nA registered nurse may implement a protocol that does not reference a specific patient and results in a prescription of a legend drug that has been predetermined and delegated by a licensed practitioner as defined under section 151.01, subdivision 23, when caring for a patient whose condition falls within the protocol and when the protocol specifies the circumstances under which the drug is to be prescribed or administered.\nA nurse may implement a protocol that does not reference a specific patient and results in the administration of a vaccine that has been predetermined and delegated by a licensed practitioner as defined in section 151.01, subdivision 23, when caring for a patient whose characteristics fall within the protocol and when the protocol specifies the contraindications for implementation, including patients or populations of patients for whom the vaccine must not be administered and the conditions under which the vaccine must not be administered.\nNotwithstanding the provisions of Minnesota Rules, part 4658.1360, subpart 2, a graduate of a foreign nursing school who has successfully completed an approved competency evaluation under the provisions of section 144A.61 is eligible to administer medications in a nursing facility upon completion of a medication training program for unlicensed personnel offered through a postsecondary educational institution, which meets the requirements specified in Minnesota Rules, part 4658.1360, subpart 2, item B.\nSubject to the requirements of this subdivision, a registered nurse in a family planning agency as defined in Minnesota Rules, part 9505.0280, subpart 3, may dispense contraceptives prescribed by a licensed practitioner as defined in section 151.01, subdivision 23, pursuant to a dispensing protocol established by the agency's medical director or under the direction of a physician. The dispensing protocol must address the requirements of sections 151.01, subdivision 30, and 151.212, subdivision 1. In addition, the registered nurse may not dispense contraceptives if the patient is under 12 years of age.\n[Repealed, 2008 c 321 s 8]",
	"repealed": false
}