{
	"id": "148.518",
	"url": "https://www.revisor.mn.gov/statutes/cite/148.518",
	"title": "148.518 LICENSURE FOLLOWING LAPSE OF LICENSURE STATUS.",
	"text": "An applicant whose licensure status has lapsed and who is applying for a speech-language pathology or audiology license must:\n(1) apply for licensure renewal according to section 148.5191 and document compliance with the continuing education requirements of section 148.5193 since the applicant's license lapsed;\n(2) fulfill the requirements of section 148.517;\n(3) apply for renewal according to section 148.5191, provide evidence to the commissioner that the applicant holds a current and unrestricted credential for the practice of speech-language pathology from the Professional Educator Licensing and Standards Board or for the practice of speech-language pathology or audiology in another jurisdiction that has requirements equivalent to or higher than those in effect for Minnesota, and provide evidence of compliance with Professional Educator Licensing and Standards Board or that jurisdiction's continuing education requirements;\n(4) apply for renewal according to section 148.5191 and submit verified documentation of successful completion of 160 hours of supervised practice approved by the commissioner. To participate in a supervised practice, the applicant shall first apply and obtain temporary licensing according to section 148.5161; or\n(5) apply for renewal according to section 148.5191 and provide documentation of obtaining a qualifying score on the examination described in section 148.515, subdivision 4, within one year of the application date for license renewal.\nAn applicant applying for speech-language pathology assistant licensure and whose licensure status has lapsed must:\n(1) apply for renewal according to section 148.5191, and provide evidence to the commissioner that the applicant has an associate's degree from a speech-language pathology assistant program that is accredited by the Higher Learning Commission of the North Central Association of Colleges;\n(2) apply for renewal according to section 148.5191 and provide evidence to the commissioner that the applicant has a bachelor's degree in the discipline of communication sciences or disorders and a speech-language pathology assistant certificate program, including relevant coursework and supervised field experience according to section 148.5181; or\n(3) apply for licensure renewal according to section 148.5191 and document compliance with the continuing education requirements of section 148.5193 since the applicant's license lapsed.",
	"repealed": false
}