{
	"id": "62M.09",
	"url": "https://www.revisor.mn.gov/statutes/cite/62M.09",
	"title": "62M.09 STAFF AND PROGRAM QUALIFICATIONS.",
	"text": "A utilization review organization shall have utilization review staff who are properly trained, qualified, and supervised.\nNurses, physicians, and other licensed health professionals conducting reviews of medical services, and other clinical reviewers conducting specialized reviews in their area of specialty must be currently licensed or certified by an approved state licensing agency in the United States.\n(a) A physician must review and make the adverse determination under section 62M.05 in all cases in which the utilization review organization has concluded that an adverse determination for clinical reasons is appropriate.\n(b) The physician conducting the review and making the adverse determination must:\n(1) hold a current, unrestricted license to practice medicine in this state; and\n(2) have the same or similar medical specialty as a provider that typically treats or manages the condition for which the health care service has been requested.\nThis paragraph does not apply to reviews conducted in connection with policies issued by a health plan company that is assessed less than three percent of the total amount assessed by the Minnesota Comprehensive Health Association.\n(c) The physician should be reasonably available by telephone to discuss the determination with the attending health care professional.\n(d) Notwithstanding paragraph (a), a review of an adverse determination involving a prescription drug must be conducted by a licensed pharmacist or physician who is competent to evaluate the specific clinical issues presented in the review.\n(e) This subdivision does not apply to outpatient mental health or substance abuse services governed by subdivision 3a.\n(a) A peer of the treating mental health or substance abuse provider, a doctoral-level psychologist, or a physician must review requests for outpatient services in which the utilization review organization has concluded that an adverse determination for a mental health or substance abuse service for clinical reasons is appropriate, provided that any final adverse determination issued under section 62M.05 for a treatment is made by a psychiatrist certified by the American Board of Psychiatry and Neurology and appropriately licensed in this state or by a doctoral-level psychologist licensed in this state.\n(b) Notwithstanding paragraph (a), a doctoral-level psychologist shall not review any request or final adverse determination for a mental health or substance abuse service or treatment if the treating provider is a psychiatrist.\n(c) Notwithstanding the notification requirements of section 62M.05, a utilization review organization that has made an adverse determination to authorize in accordance with the requirements of section 62M.05 may elect to provide notification of a determination to continue coverage through facsimile or mail.\n(d) This subdivision does not apply to determinations made in connection with policies issued by a health plan company that is assessed less than three percent of the total amount assessed by the Minnesota Comprehensive Health Association.\nA dentist must review all cases in which the utilization review organization has concluded that an adverse determination for a dental service or procedure for clinical reasons is appropriate and an appeal has been made by the attending dentist, enrollee, or designee.\nA chiropractor must review all cases in which the utilization review organization has concluded that an adverse determination for a chiropractic service or procedure for clinical reasons is appropriate and an appeal has been made by the attending chiropractor, enrollee, or designee.\nA utilization review organization's decisions must be supported by written clinical criteria and review procedures. Clinical criteria and review procedures must be established with appropriate involvement from actively practicing physicians. A utilization review organization must use written clinical criteria, as required, for determining the appropriateness of the authorization request. The utilization review organization must have a procedure for ensuring, at a minimum, the annual evaluation and updating of the written criteria based on sound clinical principles.\nA utilization review organization must use physician consultants in the appeal process described in section 62M.06, subdivision 3. The physician consultants must be board certified by the American Board of Medical Specialists or the American Osteopathic Association.\nA utilization review organization must have a formalized program of orientation and ongoing training of utilization review staff.\nA utilization review organization must have written documentation of an active quality assessment program.\n[Repealed, 2012 c 247 art 1 s 32]",
	"repealed": false
}