{
	"id": "446A.086",
	"url": "https://www.revisor.mn.gov/statutes/cite/446A.086",
	"title": "446A.086 STATE MAY GUARANTEE GOVERNMENTAL UNIT BUILDING DEBT; REPAYMENT.",
	"text": "(a) As used in this section, the following terms have the meanings given.\n(b) \"Authority\" means the Minnesota Public Facilities Authority.\n(c) \"Commissioner\" means the commissioner of management and budget.\n(d) \"Debt obligation\" means:\n(1) a general obligation bond or note issued by a county, a bond or note to which the general obligation of a county is pledged under section 469.034, subdivision 2, or a bond or note payable from a county lease obligation under section 641.24, to provide funds for the construction of:\n(i) jails;\n(ii) correctional facilities;\n(iii) law enforcement facilities;\n(iv) social services and human services facilities;\n(v) solid waste facilities; or\n(vi) qualified housing development projects as defined in section 469.034, subdivision 2; or\n(2) a general obligation bond or note issued by a governmental unit to provide funds for the construction, improvement, or rehabilitation of:\n(i) wastewater facilities;\n(ii) drinking water facilities;\n(iii) stormwater facilities; or\n(iv) any publicly owned building or infrastructure improvement that has received partial funding from grants awarded by the commissioner of employment and economic development related to redevelopment, contaminated site cleanup, bioscience, small cities development programs, and rural business infrastructure programs, for which bonds are issued by the authority under section 446A.087.\n(e) \"Governmental unit\" means a county or a statutory or home rule charter city.\n(a) This section provides a state guarantee of the payment of principal and interest on debt obligations if:\n(1) the obligations are issued for new projects and are not issued for the purposes of refunding previous obligations;\n(2) application to the Public Facilities Authority is made before issuance; and\n(3) the obligations are covered by an agreement meeting the requirements of subdivision 3.\n(b) Applications to be covered by the provisions of this section must be made in a form and contain the information prescribed by the authority. Applications are subject to either a fee of $500 for each bond issue requested by a county or governmental unit or the applicable fees under section 446A.087.\n(c) Application fees paid under this section must be deposited in a separate credit enhancement bond guarantee account in the special revenue fund. Money in the credit enhancement bond guarantee account is appropriated to the authority for purposes of administering this section.\n(d) Neither the authority nor the commissioner is required to promulgate administrative rules under this section and the procedures and requirements established by the authority or commissioner under this section are not subject to chapter 14.\n(a) For specified debt obligations to be covered by this section, the governmental unit must enter an agreement with the authority obligating the governmental unit to be bound by this section.\n(b) This agreement must be in a form prescribed by the authority and contain any provisions required by the authority, including, at least, an obligation to:\n(1) deposit with the paying agent three days before the date on which the payment is due an amount sufficient to make that payment or ten days prior to the date a payment is due on revenue bonds issued by the authority under section 446A.087;\n(2) notify the authority, if the governmental unit will be unable to make all or a portion of the payment; and\n(3) include a provision in the bond resolution and county's agreement with the paying agent for the debt obligation that requires the paying agent to inform the commissioner if it becomes aware of a default or potential default in the payment of principal or interest on that issue or if, on the day two business days before the date a payment is due on that issue, there are insufficient funds to make the payment on deposit with the paying agent.\n(c) Funds invested in a refunding escrow account established under section 475.67 that are to become available to the paying agent on a principal or interest payment date are deemed to be on deposit with the paying agent three business days before the payment date.\n(d) The provisions of an agreement under this subdivision are binding as to an issue as long as any debt obligation of the issue remains outstanding.\n(e) This section and the obligations of the state under this section are not a public debt of the state under article XI, section 4, of the Minnesota Constitution, and the legislature may, at any time, choose not to appropriate amounts under subdivision 4, paragraph (b).\n(a) After receipt of a notice of a default or potential default in payment of principal or interest in debt obligations covered by this section or an agreement under this section, and after consultation with the governmental unit and the paying agent, and after verification of the accuracy of the information provided, the authority shall notify the commissioner of the potential default. The notice must include a final figure as to the amount due that the governmental unit will be unable to repay on the date due.\n(b) Upon receipt of this notice from the authority, the commissioner shall issue a payment and authorize the authority to pay to the bond holders or paying agent for the debt obligation the specified amount on or before the date due. The amounts needed for the purposes of this subdivision are annually appropriated to the authority from the general fund.\nIf the state has paid part or all of the principal or interest due on a debt obligation, the amount paid bears interest from the date paid by the state until the date of repayment. The interest rate is the commissioner's invested cash rate as it is certified by the commissioner. Interest only accrues on the amounts paid and outstanding less the reduction in aid under subdivision 7 and other payments received from the governmental unit.\nIf the state has paid part or all of the principal or interest due on a debt obligation, the governmental unit's pledge of its full faith and credit and unlimited taxing powers to repay the principal and interest due on those debt obligations becomes, without an election or the requirement of a further authorization, a pledge of the full faith and credit and unlimited taxing powers of the governmental unit to repay to the state the amount paid, with interest. Amounts paid by the state must be repaid in the order in which the state payments were made.\n(a) Except as provided in paragraph (b), the commissioner may reduce, by the amount paid by the state under this section on behalf of the governmental unit, plus the interest due on the state payments, the local government aid under chapter 477A. The amount of any aid reduction reverts from the appropriate account to the state general fund.\n(b) If, after review of the financial situation of the governmental unit, the authority advises the commissioner that a total reduction of the aids would cause an undue hardship on the governmental unit, the authority, with the approval of the commissioner, may establish a different schedule for reduction of aids to repay the state. The amount of aids to be reduced are decreased by any amounts repaid to the state by the governmental unit from other revenue sources.\n(a) With the approval of the authority, a governmental unit may levy in the year the state makes a payment under this section an amount up to the amount necessary to provide funds for the repayment of the amount paid by the state plus interest through the date of estimated repayment by the governmental unit. The proceeds of this levy may be used only for this purpose unless they exceed the amount actually due. Any excess must be used to repay other state payments made under this section or must be deposited in the debt redemption fund of the governmental unit. The amount of aids to be reduced to repay the state are decreased by the amount levied.\n(b) If the state is not repaid in full for a payment made under this section by November 30 of the calendar year following the year in which the state makes the payment, the authority shall require the governmental unit to certify a property tax levy in an amount up to the amount necessary to provide funds for repayment of the amount paid by the state plus interest through the date of estimated repayment by the governmental unit. To prevent undue hardship, the authority may allow the governmental unit to certify the levy over a five-year period. The proceeds of the levy may be used only for this purpose unless they are in excess of the amount actually due, in which case the excess must be used to repay other state payments made under this section or must be deposited in the debt redemption fund of the governmental unit. If the authority orders the governmental unit to levy, the amount of aids reduced to repay the state are decreased by the amount levied.\nIf the state makes payments on behalf of a governmental unit under this section or the governmental unit defaults in the payment of principal or interest on an outstanding debt obligation, it must submit a plan to the authority for approval specifying the measures it intends to implement to resolve the issues which led to its inability to make the payment and to prevent further defaults. If the authority determines that a governmental unit's plan is not adequate, the authority shall notify the governmental unit that the plan has been disapproved, the reasons for the disapproval, and that the state will not make future payments under this section for debt obligations of the affected governmental unit issued after the date specified in that notice until its plan is approved. The authority may also notify the governmental unit that until its plan is approved, aids due the governmental unit will be withheld after a date specified in the notice.\nThe authority may enter into written agreements or contracts relating to the continuing disclosure of information needed to facilitate the ability of governmental units to issue debt obligations according to federal securities laws, rules, and regulations, including Securities and Exchange Commission rules and regulations, section 240.15c2-12. The agreements or contracts may be in any form the authority deems reasonable and in the state's best interests.\nThe amount of debt outstanding under this section must not exceed $1,000,000,000.\nWhenever the state pays under this section interest on bonds for which the issuer is entitled to federal interest subsidy payments, the state is subrogated to the issuer's rights to any federal interest subsidy payments relating to the interest paid by the state, unless and until the state has been reimbursed by the issuer in full.",
	"repealed": false
}