{
	"id": "458A.01",
	"url": "https://www.revisor.mn.gov/statutes/cite/458A.01",
	"title": "458A.01 DEFINITIONS.",
	"text": "The definitions given in this section shall obtain for the purposes of sections 458A.01 to 458A.15 except as otherwise expressly provided or indicated by the context.\n\"Transit commissioner\" or \"commissioner\" means a member of the commission.\n\"Municipality\" or \"municipal corporation\" means the municipalities comprising the transit area as defined in section 458A.02.\n\"Person\" means any human being, any municipality or other public corporation or other public agency, any private corporation, any copartnership, joint stock company or other company, association or other organization, or any receiver, trustee, assignee, agent, or other legal representative of any of the foregoing, but does not include the commission.\n\"Public transit\" means transportation of passengers for hire by means, without limitation, of a street railway, elevated railway, subway, underground railroad, motor vehicles, buses, or other means of conveyance operating as a common carrier on a regular route or routes, or any combination thereof; provided, however, that \"public transit\" shall not include a common carrier railroad or common carrier railroads.\n\"Public transit system\" means, without limitation, a combination of property, structures, improvements, equipment, plants, parking or other facilities, and rights, or any thereof, used or useful for the purposes of public transit.\n\"Mass transit system\" means a public transit system the primary function of which is to provide rapid public transit for large numbers of passengers.\n\"Operator\" means any person engaged or seeking to engage in the business of providing public transit, but does not include persons engaged primarily in the transportation of children to or from school, in operating taxicabs, in operating buses, limousines, or other means for the transportation of passengers between a common carrier terminal station and a hotel or motel, in operating a common carrier railroad or common carrier railroads, or a person furnishing transportation solely for the person's employees or customers.",
	"repealed": false
}