{
	"id": "144A.471",
	"url": "https://www.revisor.mn.gov/statutes/cite/144A.471",
	"title": "144A.471 HOME CARE PROVIDER AND HOME CARE SERVICES.",
	"text": "A home care provider may not open, operate, manage, conduct, maintain, or advertise itself as a home care provider or provide home care services in Minnesota without a temporary or current home care provider license issued by the commissioner of health.\nA home care licensee must not provide sleeping accommodations as a provision of home care services. For purposes of this subdivision, the provision of sleeping accommodations and assisted living services under section 144G.08, subdivision 9, requires assisted living facility licensure under chapter 144G. This subdivision does not apply to those settings exempt from assisted living facility licensure under section 144G.08, subdivision 7.\n(a) \"Direct home care service\" means a home care service provided to a client by the home care provider or its employees, and not by contract. Factors that must be considered in determining whether an individual or a business entity provides at least one home care service directly include, but are not limited to, whether the individual or business entity:\n(1) has the right to control, and does control, the types of services provided;\n(2) has the right to control, and does control, when and how the services are provided;\n(3) establishes the charges;\n(4) collects fees from the clients or receives payment from third-party payers on the clients' behalf;\n(5) pays individuals providing services compensation on an hourly, weekly, or similar basis;\n(6) treats the individuals providing services as employees for the purposes of payroll taxes and workers' compensation insurance; and\n(7) holds itself out as a provider of home care services or acts in a manner that leads clients or potential clients to believe that it is a home care provider providing home care services.\n(b) None of the factors listed in this subdivision is solely determinative.\n(a) \"Regularly engaged\" means providing, or offering to provide, home care services as a regular part of a business. The following factors must be considered by the commissioner in determining whether an individual or a business entity is regularly engaged in providing home care services:\n(1) whether the individual or business entity states or otherwise promotes that the individual or business entity provides home care services;\n(2) whether persons receiving home care services constitute a substantial part of the individual's or the business entity's clientele; and\n(3) whether the home care services provided are other than occasional or incidental to the provision of services other than home care services.\n(b) None of the factors listed in this subdivision is solely determinative.\nA person involved in the management, operation, or control of a home care provider that operates without an appropriate license is guilty of a misdemeanor. This section does not apply to a person who has no legal authority to affect or change decisions related to the management, operation, or control of a home care provider.\nAn applicant seeking to become a home care provider must apply for either a basic or comprehensive home care license.\nHome care services that can be provided with a basic home care license are assistive tasks provided by licensed or unlicensed personnel that include:\n(1) assisting with dressing, self-feeding, oral hygiene, hair care, grooming, toileting, and bathing;\n(2) providing standby assistance;\n(3) providing verbal or visual reminders to the client to take regularly scheduled medication, which includes bringing the client previously set-up medication, medication in original containers, or liquid or food to accompany the medication;\n(4) providing verbal or visual reminders to the client to perform regularly scheduled treatments and exercises;\n(5) preparing modified diets ordered by a licensed health professional; and\n(6) assisting with laundry, housekeeping, meal preparation, shopping, or other household chores and services if the provider is also providing at least one of the activities in clauses (1) to (5).\nHome care services that may be provided with a comprehensive home care license include any of the basic home care services listed in subdivision 6, and one or more of the following:\n(1) services of an advanced practice registered nurse, physician assistant, registered nurse, licensed practical nurse, physical therapist, respiratory therapist, occupational therapist, speech-language pathologist, dietitian or nutritionist, or social worker;\n(2) tasks delegated to unlicensed personnel by a registered nurse or assigned by a licensed health professional within the person's scope of practice;\n(3) medication management services;\n(4) hands-on assistance with transfers and mobility;\n(5) treatment and therapies;\n(6) assisting clients with eating when the clients have complicating eating problems as identified in the client record or through an assessment such as difficulty swallowing, recurrent lung aspirations, or requiring the use of a tube or parenteral or intravenous instruments to be fed; or\n(7) providing other complex or specialty health care services.\n(a) Except as otherwise provided in this chapter, home care services that are provided by the state, counties, or other units of government must be licensed under this chapter.\n(b) An exemption under this subdivision does not excuse the exempted individual or organization from complying with applicable provisions of the home care bill of rights in section 144A.44. The following individuals or organizations are exempt from the requirement to obtain a home care provider license:\n(1) an individual or organization that offers, provides, or arranges for personal care assistance services under the medical assistance program as authorized under sections 256B.0625, subdivision 19a, and 256B.0659;\n(2) a provider that is licensed by the commissioner of human services to provide semi-independent living services for persons with developmental disabilities under section 252.275 and Minnesota Rules, parts 9525.0900 to 9525.1020;\n(3) a provider that is licensed by the commissioner of human services to provide home and community-based services for persons with developmental disabilities under section 256B.092 and Minnesota Rules, parts 9525.1800 to 9525.1930;\n(4) an individual or organization that provides only home management services, if the individual or organization is registered under section 144A.482; or\n(5) an individual who is licensed in this state as a nurse, dietitian, social worker, occupational therapist, physical therapist, or speech-language pathologist who provides health care services in the home independently and not through any contractual or employment relationship with a home care provider or other organization.\nThe following are excluded from home care licensure and are not required to provide the home care bill of rights:\n(1) an individual or business entity providing only coordination of home care that includes one or more of the following:\n(i) determination of whether a client needs home care services, or assisting a client in determining what services are needed;\n(ii) referral of clients to a home care provider;\n(iii) administration of payments for home care services; or\n(iv) administration of a health care home established under section 62U.03;\n(2) an individual who is not an employee of a licensed home care provider if the individual:\n(i) only provides services as an independent contractor to one or more licensed home care providers;\n(ii) provides no services under direct agreements or contracts with clients; and\n(iii) is contractually bound to perform services in compliance with the contracting home care provider's policies and service plans;\n(3) a business that provides staff to home care providers, such as a temporary employment agency, if the business:\n(i) only provides staff under contract to licensed or exempt providers;\n(ii) provides no services under direct agreements with clients; and\n(iii) is contractually bound to perform services under the contracting home care provider's direction and supervision;\n(4) any home care services conducted by and for the adherents of any recognized church or religious denomination for its members through spiritual means, or by prayer for healing;\n(5) an individual who only provides home care services to a relative;\n(6) an individual not connected with a home care provider that provides assistance with basic home care needs if the assistance is provided primarily as a contribution and not as a business;\n(7) an individual not connected with a home care provider that shares housing with and provides primarily housekeeping or homemaking services to an elderly or disabled person in return for free or reduced-cost housing;\n(8) an individual or provider providing home-delivered meal services;\n(9) an individual providing senior companion services and other older American volunteer programs (OAVP) established under the Domestic Volunteer Service Act of 1973, United States Code, title 42, chapter 66;\n(10) a member of a professional corporation organized under chapter 319B that does not regularly offer or provide home care services as defined in section 144A.43, subdivision 3;\n(11) the following organizations established to provide medical or surgical services that do not regularly offer or provide home care services as defined in section 144A.43, subdivision 3: a business trust organized under sections 318.01 to 318.04, a nonprofit corporation organized under chapter 317A, a partnership organized under chapter 323, or any other entity determined by the commissioner;\n(12) an individual or agency that provides medical supplies or durable medical equipment, except when the provision of supplies or equipment is accompanied by a home care service;\n(13) a physician licensed under chapter 147;\n(14) an individual who provides home care services to a person with a developmental disability who lives in a place of residence with a family, foster family, or primary caregiver;\n(15) a business that only provides services that are primarily instructional and not medical services or health-related support services;\n(16) an individual who performs basic home care services for no more than 14 hours each calendar week to no more than one client;\n(17) an individual or business licensed as hospice as defined in sections 144A.75 to 144A.755 who is not providing home care services independent of hospice service;\n(18) activities conducted by the commissioner of health or a community health board as defined in section 145A.02, subdivision 5, including communicable disease investigations or testing; or\n(19) administering or monitoring a prescribed therapy necessary to control or prevent a communicable disease, or the monitoring of an individual's compliance with a health directive as defined in section 144.4172, subdivision 6.",
	"repealed": false
}