{
	"id": "84A.55",
	"url": "https://www.revisor.mn.gov/statutes/cite/84A.55",
	"title": "84A.55 COMMISSIONER'S CONTROL OF CONSERVATION LANDS.",
	"text": "Game preserves, areas, and projects established under section 84A.01, 84A.20, or 84A.31, are under the management, operation, and control of the commissioner of natural resources. The commissioner has the powers and duties provided in this section.\nThe commissioner shall care for, preserve, protect, and develop the forests in preserves, areas, and projects; shall prevent forest fires in them so far as means are available; and may experiment in and practically advance afforestation and reforestation there.\nThe commissioner may sell merchantable timber on lands held by the state under section 84A.07, 84A.26, or 84A.36. It must be sold in the same way as timber on other state lands.\nThe commissioner may impound, control, and regulate the waters of meandered and other public lakes in preserves, areas, and projects and the flow of natural streams.\nThe commissioner shall care for, protect, and preserve any species of wildlife there, so far as means are available.\nThe commissioner may regulate and license, subject to revocation for violation of any state law relating to wild animals or of this section, the breeding, propagation, and disposition of wildlife in preserves, areas, or projects by any person as necessary to execute subdivision 5.\nThe commissioner may issue, subject to revocation for violation of state law relating to wild animals or of sections 84A.50 to 84A.55, special licenses or permits for hunting, fishing, camping, or other uses consistent with those sections or any other applicable state law.\nUnless specifically prohibited by a rule of the commissioner, snowmobiles may be operated on lands subject to this section that have been identified by the commissioner as wildlife management areas.\nThe commissioner may police the game preserves, areas, and projects as necessary to carry out this section. The commissioner may employ and designate individuals according to section 84.0835 to enforce laws governing the use of the game preserves, areas, and projects.\nThe commissioner may make necessary investigations and surveys for and may undertake projects for the drainage of state-owned lands within a game preserve, conservation area, or other area subject to this section so far as the commissioner determines that the lands will benefit from the project for the purposes for which the area was established. The commissioner may pay the cost of drainage projects out of funds appropriated and available for them. If the commissioner finds after investigation that a project for the construction, repair, or improvement of a public ditch or ditch system undertaken by a county or other public agency as otherwise provided by law will benefit the lands for those purposes, the commissioner may cooperate in the project by joining in the petition for the project or consenting to or approving it on any conditions the commissioner determines. The commissioner shall authorize the imposition of assessments for the projects on the lands in any amounts the commissioner determines, or may make lump-sum contributions to the county or other public funds established for the payment of the cost of the project. The assessments or contributions must not exceed the value of benefits to the state-owned lands as determined by the commissioner and specified by written certificates or other statement filed in the proceedings. Assessments or contributions are payable only out of funds appropriated and available for them in amounts the commissioner determines. The commissioner of natural resources shall establish by rule before January 1, 1986, the criteria for determining benefits to state-owned lands held or used to protect or propagate wildlife, provide hunting or fishing for the public, or serve other purposes relating to conservation, development, or use of soil, water, forests, wild animals, or related natural resources.\nThe commissioner may construct and maintain and contribute funds for construction and maintenance of roads and airplane landing fields or strips within a game preserve, conservation area, or other area subject to this section. Payments for highway purposes under this subdivision may be made to any governmental subdivision or to the United States in amounts set by the commissioner from the account created by section 84A.51.\nThe commissioner may promulgate rules necessary for the execution of this section, including the conditions of licenses and permits under subdivision 7 and the amount of license fees. In addition to notice required by other law, the commissioner must give 30 days' notice posted in each township affected by the rules. The rules have the force of law, and any violation of rules is a misdemeanor. Lands within a game preserve, area, or project referred to in subdivision 1, whether owned privately or by the state or any governmental subdivision, are subject to the rules consistent with the constitutional rights of private owners or other applicable state law.\nNothing shall be done under this section that will interfere with the operation of ditches or drainage systems existing in any game preserve, area, or project referred to in subdivision 1, or damage or destroy any existing road or highway in it, so far as constructed, improved, or maintained by any governmental subdivision or public agency or person other than the commissioner, unless the right to them is first acquired by the commissioner by purchase or condemnation, upon payment of just compensation to the political subdivision, public agency, or person affected and damaged.\nThe commissioner may acquire by purchase or condemnation any land or interest in land or any public work or project or right in it necessary for any purpose authorized in this section.\nSalaries and expenses incurred to carry out this section must be paid from money appropriated from the consolidated account or other fund or account designated in the applicable appropriation.",
	"repealed": false
}