{
	"id": "142E.31",
	"url": "https://www.revisor.mn.gov/statutes/cite/142E.31",
	"title": "142E.31 GRANTS FOR SCHOOL AGE CHILD CARE PROGRAMS AND CHILD CARE RESOURCE AND REFERRAL PROGRAMS.",
	"text": "The commissioner of children, youth, and families shall distribute funds to public or private nonprofit organizations for the planning, establishment, expansion, improvement, or operation of child care resource and referral programs under this section. The commissioner must adopt rules for programs under this section and sections 142E.30 and 142E.32. The commissioner must develop a process to fund organizations to operate child care resource and referral programs that includes application forms, timelines, and standards for renewal.\nThe commissioner shall designate an organization to administer a child care resource and referral program to serve a region.\n(a) The commissioner shall distribute funds for the administration of child care resource and referral programs based on the following factors for each region:\n(1) the region served by the program;\n(2) the number of children under the age of 13 years needing child care;\n(3) the ratio of children under the age of 13 years needing child care to the number of licensed spaces;\n(4) the number of licensed child care providers and school-age care programs; and\n(5) other related factors determined by the commissioner.\n(b) The commissioner may provide ongoing funding to a designated organization for a child care resource and referral program that continues to meet state standards.\nA local match of 25 percent is required.\nWithin each region, a child care resource and referral program must:\n(1) maintain one database of all existing child care resources and services and one database of family referrals;\n(2) provide a child care referral service for families;\n(3) develop resources to meet the child care service needs of families;\n(4) increase the capacity to provide culturally responsive child care services;\n(5) coordinate professional development opportunities for child care and school-age care providers;\n(6) administer and award child care services grants;\n(7) cooperate with the Minnesota Child Care Resource and Referral Network and its member programs to develop effective child care services and child care resources;\n(8) assist in fostering coordination, collaboration, and planning among child care programs and community programs such as school readiness, Head Start, early childhood family education, local interagency early intervention committees, early childhood screening, special education services, and other early childhood care and education services and programs that provide flexible, family-focused services to families with young children to the extent possible;\n(9) administer the child care one-stop regional assistance network to assist child care providers and individuals interested in becoming child care providers with establishing and sustaining a licensed family child care or group family child care program or a child care center; and\n(10) provide supports that enable economically challenged individuals to obtain the job skills training, career counseling, and job placement assistance necessary to begin a career path in child care.",
	"repealed": false
}