{
	"id": "62D.06",
	"url": "https://www.revisor.mn.gov/statutes/cite/62D.06",
	"title": "62D.06 GOVERNING BODY.",
	"text": "The governing body of any health maintenance organization which is a corporation may include enrollees, providers, or other individuals; provided, however, that after a health maintenance organization which is a corporation has been authorized under sections 62D.01 to 62D.30 for one year, at least 40 percent of the governing body shall be composed of enrollees and members elected by the enrollees and members from among the enrollees and members. For purposes of this section, \"member\" means a consumer who receives health care services through a self-insured contract that is administered by the health maintenance organization or its related third-party administrator. The number of members elected to the governing body shall not exceed the number of enrollees elected to the governing body. An enrollee or member elected to the governing board may not be a person:\n(1) whose occupation involves, or before retirement involved, the administration of health activities or the provision of health services;\n(2) who is or was employed by a health care facility as a licensed health professional; or\n(3) who has or had a direct substantial financial or managerial interest in the rendering of a health service, other than the payment of a reasonable expense reimbursement or compensation as a member of the board of a health maintenance organization.\nAfter a health maintenance organization which is a local governmental unit has been authorized under sections 62D.01 to 62D.30 for one year, an enrollee advisory body shall be established. The enrollees who make up this advisory body shall be elected by the enrollees from among the enrollees.\nThe governing body shall establish a mechanism to afford the enrollees an opportunity to express their opinions in matters of policy and operation through the establishment of advisory panels, by the use of advisory referenda on major policy decisions, or through the use of other mechanisms as may be prescribed or permitted by the commissioner of health.",
	"repealed": false
}