{
	"id": "169.79",
	"url": "https://www.revisor.mn.gov/statutes/cite/169.79",
	"title": "169.79 VEHICLE REGISTRATION; DISPLAYING LICENSE PLATES.",
	"text": "No person shall operate, drive, or park a motor vehicle on any highway unless the vehicle is registered in accordance with the laws of this state and has the number plates or permit confirming that valid registration or operating authority has been obtained, except as provided in sections 168.10 and 168.12, subdivision 2f, as assigned to it by the commissioner of public safety, conspicuously displayed thereon in a manner that the view of any plate or permit is not obstructed. A plate issued under section 168.27 or a permit issued under chapter 168 may be displayed on a vehicle in conjunction with expired registration whether or not it displays the license plate to which the last registration was issued.\nIf the vehicle is a semitrailer, the number plate displayed must be assigned to the registered owner and correlate to the documentation on file with the department.\nIf the vehicle is a motorcycle, motor scooter, motorized bicycle, motorcycle sidecar, trailer registered at greater than 3,000 pounds gross vehicle weight (GVW), semitrailer, or vehicle displaying a dealer plate, then one license plate must be displayed horizontally or vertically, for a motorcycle issued vertical license plates under section 168.12, subdivision 2a, with the identifying numbers and letters facing outward from the vehicle and must be mounted on the rear of the vehicle.\nIf the vehicle is a trailer with 3,000 pounds or less GVW with lifetime registration, the numbered plate or sticker must be adhered to the side of the trailer frame tongue near the hitch.\nNotwithstanding subdivision 1 and section 168.09, subdivision 1, a roadable aircraft is not required to display a license plate.\nIf the vehicle is (1) a collector's vehicle with a pioneer, classic car, collector, or street rod license; (2) a vehicle that meets the requirements of a pioneer, classic, or street rod vehicle except that the vehicle is used for general transportation purposes; or (3) a vehicle that is of model year 1972 or earlier, not registered under section 168.10, subdivision 1c, and is used for general transportation purposes, then one plate must be displayed on the rear of the vehicle, or one plate on the front and one on the rear, at the discretion of the owner.\nIf the vehicle is a truck-tractor, road-tractor, or farm truck, as defined in section 168.002, subdivision 8, but excluding from that definition semitrailers and trailers, then one plate must be displayed on the front of the vehicle.\nIf the motor vehicle is any kind of motor vehicle other than those provided for in subdivisions 2 to 4, one plate must be displayed on the front and one on the rear of the vehicle.\nAll plates must be (1) securely fastened so as to prevent them from swinging, (2) displayed horizontally with the identifying numbers and letters facing outward from the vehicle, and (3) mounted in the upright position. The person driving the motor vehicle shall keep the plate legible and unobstructed and free from grease, dust, or other blurring material so that the lettering is plainly visible at all times. It is unlawful to cover any assigned letters and numbers or the name of the state of origin of a license plate with any material whatever, including any clear or colorless material that affects the plate's visibility or reflectivity.\nAs viewed facing the plates:\n(a) License plates issued to vehicles registered under section 168.017 must display the month of expiration in the lower left corner of each plate and the year of expiration in the lower right corner of each plate.\n(b) License plates issued to vehicles registered under section 168.127 must display either fleet registration validation stickers in the lower right corner of each plate or distinctive license plates, issued by the registrar, with \"FLEET REG\" displayed on the bottom center portion of each plate.\n(c) License plates issued after July 1, 2008, requiring validation must display the month of expiration in the lower left corner of each plate and the year of expiration in the lower right corner of the plate.\nVehicles displaying tax-exempt plates issued under section 16B.581 or 168.012 must have vehicle markings that comply with section 168.012, subdivision 1.",
	"repealed": false
}