{
	"id": "144.396",
	"url": "https://www.revisor.mn.gov/statutes/cite/144.396",
	"title": "144.396 TOBACCO USE PREVENTION.",
	"text": "The legislature finds that it is important to reduce the prevalence of tobacco use among the youth of this state. It is a goal of the state to reduce tobacco use among youth by 25 percent by the year 2005, and to promote statewide and local tobacco use prevention activities to achieve this goal.\nThe commissioner, in consultation with other public, private, or nonprofit organizations involved in tobacco use prevention efforts, shall establish measurable outcomes to determine the effectiveness of the grants receiving funds under this section in reducing the use of tobacco among youth.\nThe commissioner of health shall conduct a statewide assessment of tobacco-related behaviors and attitudes among youth to establish a baseline to measure the statewide effect of tobacco use prevention activities. The commissioner of education must provide any information requested by the commissioner of health as part of conducting the assessment. To the extent feasible, the commissioner of health should conduct the assessment so that the results may be compared to nationwide data.\n(a) The commissioner shall develop the criteria and procedures to allocate the grants under this section. In developing the criteria, the commissioner shall establish an administrative cost limit for grant recipients. The outcomes established under subdivision 2 must be specified to the grant recipients receiving grants under this section at the time the grant is awarded.\n(b) A recipient of a grant under this section must coordinate its tobacco use prevention activities with other entities performing tobacco use prevention activities within the recipient's service area.\n(a) To the extent funds are appropriated for the purposes of this subdivision, the commissioner of health shall award competitive grants to eligible applicants for projects and initiatives directed at the prevention of tobacco use. The project areas for grants include:\n(1) statewide public education and information campaigns which include implementation at the local level; and\n(2) coordinated special projects, including training and technical assistance, a resource clearinghouse, and contracts with ethnic and minority communities.\n(b) Eligible applicants may include, but are not limited to, nonprofit organizations, colleges and universities, professional health associations, community health boards, and other health care organizations. Applicants must submit proposals to the commissioner. The proposals must specify the strategies to be implemented to target tobacco use among youth, and must take into account the need for a coordinated statewide tobacco prevention effort.\n(c) The commissioner must give priority to applicants who demonstrate that the proposed project:\n(1) is research based or based on proven effective strategies;\n(2) is designed to coordinate with other activities and education messages related to other health initiatives;\n(3) utilizes and enhances existing prevention activities and resources; or\n(4) involves innovative approaches preventing tobacco use among youth.\n(a) The commissioner shall award grants to eligible applicants for local and regional projects and initiatives directed at tobacco prevention in coordination with other health areas aimed at reducing high-risk behaviors in youth that lead to adverse health-related problems. The project areas for grants include:\n(1) school-based tobacco prevention programs aimed at youth and parents;\n(2) local public awareness and education projects aimed at tobacco prevention in coordination with locally assessed community public health needs pursuant to chapter 145A; or\n(3) local initiatives aimed at reducing high-risk behavior in youth associated with tobacco use and the health consequences of these behaviors.\n(b) Eligible applicants may include, but are not limited to, community health boards, school districts, community clinics, Indian tribes, nonprofit organizations, and other health care organizations. Applicants must submit proposals to the commissioner. The proposals must specify the strategies to be implemented to target tobacco use among youth, and must be targeted to achieve the outcomes established in subdivision 2.\n(c) The commissioner must give priority to applicants who demonstrate that the proposed project or initiative:\n(1) is supported by the community in which the applicant serves;\n(2) is based on research or on proven effective strategies;\n(3) is designed to coordinate with other community activities related to other health initiatives;\n(4) incorporates an understanding of the role of community in influencing behavioral changes among youth regarding tobacco use and other high-risk health-related behaviors; or\n(5) addresses disparities among populations of color related to tobacco use and other high-risk health-related behaviors.\n(d) The commissioner shall divide the state into specific geographic regions and allocate a percentage of the money available for distribution to projects or initiatives aimed at that geographic region. If the commissioner does not receive a sufficient number of grant proposals from applicants that serve a particular region or the proposals submitted do not meet the criteria developed by the commissioner, the commissioner shall provide technical assistance and expertise to ensure the development of adequate proposals aimed at addressing the public health needs of that region. In awarding the grants, the commissioner shall consider locally assessed community public health needs pursuant to chapter 145A.\nThe commissioner shall distribute funds appropriated for the purpose of local health promotion and protection activities to community health boards for local health initiatives other than tobacco prevention aimed at high risk health behaviors among youth. The commissioner shall distribute these funds to the community health boards based on demographics and other need-based factors relating to health.\nThe commissioner shall coordinate the projects and initiatives funded under this section with the tobacco use prevention efforts of the Minnesota partnership for action against tobacco, community health boards, and other public, private, and nonprofit organizations and the tobacco prevention efforts that are being conducted on the national level.\nThe commissioner of health must prioritize smoking prevention and smoking cessation activities in low-income, indigenous, and minority communities in their collaborations with the organization specifically described in subdivision 8.\nUsing the outcome measures established in subdivision 2, the commissioner of health shall conduct a biennial evaluation of the statewide and local tobacco use prevention projects and community health board activities funded under this section. The evaluation must include:\n(1) the effect of these activities on the amount of tobacco use by youth and rates at which youth start to use tobacco products; and\n(2) a longitudinal tracking of outcomes for youth.\nGrant recipients and community health boards shall cooperate with the commissioner in the evaluation and provide the commissioner with the information necessary to conduct the evaluation. Beginning January 15, 2003, the results of each evaluation must be submitted to the chairs and members of the house of representatives Health and Human Services Finance Committee and the senate Health and Family Security Budget Division.\nThe commissioner of health shall submit a biennial report to the chairs and members of the house of representatives Health and Human Services Finance Committee and the senate Health and Family Security Budget Division on the statewide and local projects and community health board prevention activities funded under this section. These reports must include information on grant recipients, activities that were conducted using grant funds, and evaluation data and outcome measures, if available. These reports are due by January 15 of the odd-numbered years, beginning in 2001.\nThe legislative auditor may audit tobacco use prevention and local public health expenditures to ensure that the money is spent for tobacco use prevention measures and public health initiatives.\nFunds appropriated to the statewide tobacco prevention grants, local tobacco prevention grants, or the local public health promotion and prevention must not be used as a substitute for traditional sources of funding tobacco use prevention activities or public health initiatives. Any local unit of government receiving money under this section must ensure that existing local financial efforts remain in place.\n[Repealed, 2000 c 488 art 11 s 12]",
	"repealed": false
}