{
	"id": "116.9401",
	"url": "https://www.revisor.mn.gov/statutes/cite/116.9401",
	"title": "116.9401 DEFINITIONS.",
	"text": "(a) For the purposes of sections 116.9401 to 116.9407, the following terms have the meanings given them.\n(b) \"Agency\" means the Pollution Control Agency.\n(c) \"Alternative\" means a substitute process, product, material, chemical, strategy, or combination of these that is technically feasible and serves a functionally equivalent purpose to a chemical in a children's product.\n(d) \"Chemical\" means a substance with a distinct molecular composition or a group of structurally related substances and includes the breakdown products of the substance or substances that form through decomposition, degradation, or metabolism.\n(e) \"Chemical of high concern\" means a chemical identified on the basis of credible scientific evidence by a state, federal, or international agency as being known or suspected with a high degree of probability to:\n(1) harm the normal development of a fetus or child or cause other developmental toxicity;\n(2) cause cancer, genetic damage, or reproductive harm;\n(3) disrupt the endocrine or hormone system;\n(4) damage the nervous system, immune system, or organs, or cause other systemic toxicity;\n(5) be persistent, bioaccumulative, and toxic; or\n(6) be very persistent and very bioaccumulative.\n(f) \"Child\" means a person under 12 years of age.\n(g) \"Children's product\" means a consumer product intended for use by children, such as baby products, toys, car seats, personal care products, and clothing.\n(h) \"Commissioner\" means the commissioner of the Pollution Control Agency.\n(i) \"Department\" means the Department of Health.\n(j) \"Distributor\" means a person who sells consumer products to retail establishments on a wholesale basis.\n(k) \"Green chemistry\" means an approach to designing and manufacturing products that minimizes the use and generation of toxic substances.\n(l) \"Manufacturer\" means any person who manufactures a final consumer product sold at retail or whose brand name is affixed to the consumer product. In the case of a consumer product imported into the United States, manufacturer includes the importer or domestic distributor of the consumer product if the person who manufactured or assembled the consumer product or whose brand name is affixed to the consumer product does not have a presence in the United States.\n(m) \"Priority chemical\" means a chemical identified by the Department of Health as a chemical of high concern that meets the criteria in section 116.9403.\n(n) \"Safer alternative\" means an alternative whose potential to harm human health is less than that of the use of a priority chemical that it could replace.",
	"repealed": false
}