{
	"id": "124D.69",
	"url": "https://www.revisor.mn.gov/statutes/cite/124D.69",
	"title": "124D.69 AID FOR ALTERNATIVE PROGRAMS PROVIDED UNDER CONTRACT.",
	"text": "If a pupil enrolls in an alternative program, eligible under section 124D.68, subdivision 3, paragraph (d), or subdivision 4, operated by a private organization that has contracted with a school district to provide educational services for eligible pupils under section 124D.68, subdivision 2, the district contracting with the private organization must reimburse the provider an amount equal to the sum of (1) at least 95 percent of the district's average general education less basic skills revenue per pupil unit times the number of pupil units for pupils attending the program, and (2) the amount of basic skills revenue generated by pupils attending the program according to section 126C.10, subdivision 4. For a pupil attending the program part time, the revenue paid to the program, excluding compensatory revenue, must be reduced proportionately, according to the amount of time the pupil attends the program, and revenue paid to the district shall be reduced accordingly. Pupils for whom a district provides reimbursement may not be counted by the district for any purpose other than computation of general education revenue. If payment is made to a district or program for a pupil under this section, the department must not make a payment for the same pupil under section 124D.68, subdivision 9. Notwithstanding sections 125A.15, 125A.51, and 125A.515, general education revenue for a student who receives educational services under this section shall be paid according to this section.\nDuring the term of the contract to provide educational services under subdivision 1, all state aid under subdivision 1 accrues to the account assigned to the alternative program site and is reserved for that site.\nIn addition to the amounts provided in section 124D.68, subdivision 9, a school district may allocate funds from its undesignated general fund to a private contracted alternative program, including a private contracted alternative program that is tuition free and provides a comprehensive secondary academic program for students who have been assessed as having substance use disorder and who have completed a licensed treatment program for substance use disorder.",
	"repealed": false
}