{
	"id": "153A.13",
	"url": "https://www.revisor.mn.gov/statutes/cite/153A.13",
	"title": "153A.13 DEFINITIONS.",
	"text": "The definitions in this section apply to sections 153A.13 to 153A.18.\n\"Commissioner\" means the commissioner of the Department of Health or a designee.\n\"Hearing aid \" means an instrument as defined in section 148.512, subdivision 10a.\n\"Hearing aid dispensing\" has the meaning given in section 148.512, subdivision 10b.\n\"Dispenser of hearing aids \" means a natural person who engages in prescription hearing aid dispensing, whether or not certified by the commissioner of health or licensed by an existing health-related board, except that a person described as follows is not a dispenser of prescription hearing aids:\n(1) a student participating in supervised field work that is necessary to meet requirements of an accredited educational program if the student is designated by a title which clearly indicates the student's status as a student trainee; or\n(2) a person who helps a dispenser of prescription hearing aids in an administrative or clerical manner and does not engage in prescription hearing aid dispensing.\nA person who offers to dispense a prescription hearing aid, or a person who advertises, holds out to the public, or otherwise represents that the person is authorized to dispense prescription hearing aids, must be certified by the commissioner except when the person is an audiologist as defined in section 148.512.\n\"Advisory council\" means the Minnesota Hearing Aid Dispenser Advisory Council, or a committee of the council, established under section 153A.20.\n\"ANSI\" means American National Standard Specification for Audiometers as defined in the United States Food and Drug Administration, Code of Federal Regulations, title 21, section 874.1050.\n\"Certification number\" means the number assigned to each certification by the commissioner.\n\"Supervision\" means monitoring activities of, and accepting responsibility for, the prescription hearing aid dispensing activities of a trainee.\n\"Direct supervision\" or \"directly supervised\" means the on-site and contemporaneous location of a supervisor and trainee, when the supervisor observes the trainee engaging in prescription hearing aid dispensing with a consumer.\n\"Indirect supervision\" or \"indirectly supervised\" means the remote and independent performance of prescription hearing aid dispensing by a trainee when authorized under section 153A.14, subdivision 4a, paragraph (b).\n\"Over-the-counter hearing aid\" or \"OTC hearing aid\" has the meaning given in section 148.512, subdivision 10c.\n\"Prescription hearing aid\" has the meaning given in section 148.512, subdivision 13a.",
	"repealed": false
}