{
	"id": "160.272",
	"url": "https://www.revisor.mn.gov/statutes/cite/160.272",
	"title": "160.272 SAFETY REST AREA AND TRAVEL INFORMATION CENTER LEASES.",
	"text": "(a) Except as provided in subdivision 3, and notwithstanding any other law to the contrary, the commissioner may enter into lease agreements through negotiations with public or not-for-profit entities or through best value, as defined in section 16C.02, subdivision 4, with private entities relating to the use of safety rest areas and travel information centers. For purposes of this section, \"private entity\" means a chamber of commerce, a tourist and visitors bureau, or other organization that exists to promote tourism and economic development.\n(b) A lease under this subdivision may:\n(1) with the approval of the commissioner of administration, prescribe a lease term length of up to 20 years, with options for renewal;\n(2) allow the lessee to operate a safety rest area facility in whole or in part;\n(3) allow the lessee to offer for sale products or services under section 160.2725; and\n(4) allow the lessee to add leasehold improvements to the site after approval by the commissioner.\n(c) A lease agreement for a safety rest area is subject to section 160.273 regarding vending at safety rest areas.\n(d) A lease agreement must include terms that promote and encourage the employment of needy elderly persons according to section 160.282.\n(e) The commissioner may publicly acknowledge the lessee and may erect signs adjacent to the main travel lanes of a highway acknowledging the lessee. Acknowledgment on the main line may consist of placement of up to one sign for each direction of traffic served. The placement of signs shall only be allowed (1) as approved through the Manual on Uniform Traffic Control Devices process for experimentation, (2) in accordance with federal standards and policies, and (3) so that no sign exceeds 100 square feet. No more than three acknowledgment signs or displays may be placed at any one rest area, in addition to the main-line signs.\nThe commissioner shall deposit revenues from leases authorized under this section into the safety rest area account established in section 160.2745.\nNothing in this section affects existing contracts under section 248.07 or their renewal.",
	"repealed": false
}