{
	"id": "325F.676",
	"url": "https://www.revisor.mn.gov/statutes/cite/325F.676",
	"title": "325F.676 TICKET SALES.",
	"text": "(a) For the purposes of this section, the following terms have the meanings given.\n(b) \"Commissioner\" means the commissioner of commerce.\n(c) \"Entertainment\" means all forms of entertainment, including but not limited to theatrical or operatic performances, concerts, motion pictures, entertainment at fairgrounds, amusement parks, athletic competitions and other sports, and all other forms of diversion, recreation, or show.\n(d) \"Internet domain name\" means a globally unique, hierarchical reference to an Internet host or service, which is assigned through a centralized Internet naming authority and which is composed of a series of character strings separated by periods with the rightmost string specifying the top of the hierarchy.\n(e) \"Online ticket marketplace\" means the administrator of a website or other electronic service, including an agent, employee, or assignee of the administrator, that sells tickets or maintains a platform to facilitate the sale of tickets.\n(f) \"Operator\" means a person, including an agent, employee, or assignee of the person, who:\n(1) owns, operates, or controls a place of entertainment;\n(2) produces entertainment; or\n(3) sells a ticket to a place of entertainment for original sale.\n(g) \"Person\" means a party, individual, partnership, association, corporation, or other legal entity.\n(h) \"Place of entertainment\" means an entertainment facility, including but not limited to an amphitheater, theater, stadium, arena, racetrack, museum, amusement park, venue, club, or other place where performances, concerts, exhibits, athletic games, contests, or other forms of entertainment are held. For the purposes of this section, place of entertainment does not include movie theaters.\n(i) \"Ticket reseller\" means a person that offers or sells tickets for resale after the original sale to an entertainment event located in this state and includes an operator to the extent that the operator offers or sells tickets for resale. Sales by a ticket reseller include sales by any means, including but not limited to in person or by telephone, mail, delivery service, facsimile, Internet, email, or other electronic means. A ticket reseller does not include a person that purchases a ticket solely for the person's own use or the use of the person's invitees, employees, or agents.\n(j) \"URL\" means a uniform resource locator for a website on the Internet.\n(a) An operator, ticket reseller, or online ticket marketplace must, at all times during the ticket listing and purchasing process, disclose in an easily readable and conspicuous manner and in dollars:\n(1) the total cost of the ticket, inclusive of all fees and surcharges that must be paid in order to purchase the ticket;\n(2) the portion of the ticket price that represents a service charge; and\n(3) any other fee or surcharge charged to the purchaser.\n(b) The disclosure of subtotals, fees, charges, and all other components of the total price must not be false or misleading, and must not be presented more prominently or in the same or larger size than the total price. The disclosure of subtotals, fees, charges, and all other components of the total price may be displayed in a manner that allows the purchaser to hide or minimize the itemized list. The price of a ticket must not increase with respect to a particular person after the ticket is first displayed to the person, excluding reasonable fees for the delivery of nonelectronic tickets based on the delivery method selected by the purchaser and any additional purchases made by the purchaser, which must be disclosed prior to accepting payment.\n(c) A ticket reseller and online ticket marketplace must disclose in an easily readable and conspicuous manner on the ticket reseller's or online ticket marketplace's website or electronic service:\n(1) that the website or electronic service is owned or operated by a ticket reseller or online ticket marketplace and that the price of a resale ticket offered for sale may be higher or lower than the original purchase price;\n(2) that the purchaser is responsible for checking with the place of entertainment for information on changes to the event or cancellations prior to the event's start time; and\n(3) the refund policy of the ticket reseller or online ticket marketplace.\nA ticket reseller or online ticket marketplace must require a purchaser to confirm having read the disclosures required by this paragraph before completing a transaction.\n(d) A ticket reseller or online ticket marketplace must provide to the purchaser proof of purchase, which must include all event and ticket information, within 24 hours of the purchase, including:\n(1) that the purchaser is responsible for checking with the place of entertainment for information on changes to the event or cancellations prior to the event's start time; and\n(2) the refund policy of the ticket reseller or online ticket marketplace.\n(e) An online ticket marketplace must not use any combination of text, images, trademark, copyright, web designs, or Internet addresses that is identical or substantially similar to text, images, trademark, copyright, web designs, or Internet addresses associated with a place of entertainment without the written permission of the place of entertainment duly authorized to provide the permission. This paragraph does not prohibit an online ticket marketplace from using text containing the name of a place of entertainment or of an event in order to describe the location of the event or the event itself. This paragraph does not prohibit an online ticket marketplace from providing information or images identifying the specific seat or area the purchaser will occupy in the place of entertainment.\n(f) The obligations of paragraphs (a) to (d) do not apply to any person, unless the person engaged in annual aggregate transactions that were equal to or greater than $5,000.\n(a) A ticket reseller or online ticket marketplace must not:\n(1) sell or offer to sell more than one copy of the same ticket to a place of entertainment;\n(2) directly or indirectly employ another person to wait in line to purchase tickets for the purpose of reselling the tickets if the practice is prohibited or if the place of entertainment has posted a policy prohibiting the practice;\n(3) sell or offer to sell a ticket without first informing the person of the location of the place of entertainment and the ticket's assigned seat, including but not limited to the seat number, row, and section number of the seat;\n(4) sell or offer to sell a ticket for which there is no assigned seat without first informing the person of the general admission area to which the ticket corresponds; or\n(5) advertise, offer for sale, or contract for the sale of a ticket before the ticket has been made available to the public, including via presale, without first obtaining permission from the place of entertainment and having actual or constructive possession of the ticket, unless the ticket reseller owns the ticket pursuant to a season ticket package purchased by the ticket reseller.\n(b) A person must not use or cause to be used an Internet domain name or subdomain thereof in an operator, ticket reseller, or online ticket marketplace website's URL that contains any of the following, unless acting on behalf of the place of entertainment, event, or person scheduled to perform or appear at the event:\n(1) the name of a place of entertainment;\n(2) the name of an event, including the name of a person scheduled to perform or appear at the event; or\n(3) a name substantially similar to those described in clause (1) or (2).\n(c) A person must not:\n(1) circumvent any portion of the process for purchasing a ticket on the Internet or for admission to a place of entertainment, including but not limited to security or identity validation measures or an access control system; or\n(2) disguise the identity of a purchaser for the purpose of purchasing a number of tickets for admission to a place of entertainment that exceeds the maximum number of tickets allowed for purchase by a person.\n(d) A person must not sell a ticket obtained in violation of paragraph (c) if the person:\n(1) participated in or had the ability to control the conduct committed in violation of paragraph (c); or\n(2) knew that the ticket was acquired in violation of paragraph (c).\n(e) An operator, online ticket marketplace, or ticket reseller must not sell a ticket unless:\n(1) the ticket is in the possession or constructive possession of the operator, online ticket marketplace, or ticket reseller; or\n(2) the operator, online ticket marketplace, or ticket reseller has a written contract with the place of entertainment to obtain the ticket.\n(f) Pursuant to United States Code, title 15, section 45c, circumvention of a security measure, access control system, or other technological control measure used by an online ticket marketplace to enforce posted event ticket purchasing limits or to maintain the integrity of posted online ticket purchasing order rules is prohibited.\nUpon request by the commissioner, an online ticket marketplace must disclose to the commissioner information about technology and methods used in an alleged violation of subdivision 3, paragraph (f). Data collected or maintained by the commissioner under this subdivision are civil investigative data under section 13.39 and the commissioner may share with the attorney general any not public data, as defined in section 13.02, subdivision 8a, received under this subdivision.\nThe commissioner may enforce this section under section 45.027.",
	"repealed": false
}