{
	"id": "62U.07",
	"url": "https://www.revisor.mn.gov/statutes/cite/62U.07",
	"title": "62U.07 SECTION 125 PLANS.",
	"text": "(a) For purposes of this section, the following terms have the meanings given them.\n(b) \"Employee\" means an employee currently on an employer's payroll other than a retiree or disabled former employee.\n(c) \"Employer\" means a person, firm, corporation, partnership, association, business trust, or other entity employing one or more persons, including a political subdivision of the state, filing payroll tax information on the employed person or persons.\n(d) \"Section 125 Plan\" means a cafeteria or premium-only plan under section 125 of the Internal Revenue Code that allows employees to pay for health coverage premiums with pretax dollars.\n(e) \"Small employer\" means an employer with two to 50 employees.\n(a) Effective July 1, 2009, all employers with 11 or more current full-time equivalent employees in this state shall establish and maintain a Section 125 Plan to allow their employees to purchase individual market or employer-based health coverage with pretax dollars. Nothing in this section requires employers to offer or purchase group health coverage for their employees. The following employers are exempt from the Section 125 Plan requirement:\n(1) employers that offer a health plan as defined in section 62A.011, subdivision 3, that is group coverage;\n(2) employers that provide self-insurance as defined in section 62E.02; or\n(3) employers that have no employees who are eligible to participate in a Section 125 Plan.\n(b) Notwithstanding paragraph (a), an employer may opt out of the requirement to establish a Section 125 Plan by sending a form to the commissioner of commerce. The commissioner of commerce shall create a check-box form for employers to opt out. The form must contain a check box indicating the employer is choosing to opt out and a check box indicating that the employer certifies they have received education and information on the advantages of Section 125 Plans. The commissioner of commerce shall make the form available through their website by April 1, 2009.\n(a) Employers that do not offer a health plan as defined in section 62A.011, subdivision 3, that is group coverage and are required to offer or choose to offer a Section 125 Plan shall:\n(1) allow employees to purchase an individual market health plan for themselves and their dependents;\n(2) allow employees to choose any insurance producer licensed in accident and health insurance under chapter 60K to assist them in purchasing an individual market health plan;\n(3) upon an employee's request, deduct premium amounts on a pretax basis in an amount not to exceed an employee's wages, and remit these employee payments to the health plan; and\n(4) provide notice to employees that individual market health plans purchased by employees through payroll deduction are not employer-sponsored or administered.\n(b) Employers shall be held harmless from any and all claims related to the individual market health plans purchased by employees under a Section 125 Plan.\n(a) The commissioner of employment and economic development shall award grants to eligible small employers that establish Section 125 Plans.\n(b) In order to be eligible for a grant, a small employer must:\n(1) not have offered health insurance to employees through a group health insurance plan as defined in section 62A.10 or through a self-insured plan as defined in section 62E.02 in the 12 months prior to applying for grant funding under this section;\n(2) have established a Section 125 Plan within 90 days prior to applying for grant funding under this section, and must not have offered a Section 125 Plan to employees for at least a nine-month period prior to the establishment of the Section 125 Plan under this section; and\n(3) certify to the commissioner that the employer has established a Section 125 Plan and meets the requirements of subdivision 3.\n(c) The amount of the grant awarded to a small employer under this section shall be $350.",
	"repealed": false
}