{
	"id": "469.1763",
	"url": "https://www.revisor.mn.gov/statutes/cite/469.1763",
	"title": "469.1763 RESTRICTIONS ON POOLING; FIVE-YEAR LIMIT.",
	"text": "(a) For purposes of this section, the following terms have the meanings given.\n(b) \"Activities\" means acquisition of property, clearing of land, site preparation, soils correction, removal of hazardous waste or pollution, installation of utilities, construction of public or private improvements, and other similar activities, but only to the extent that tax increment revenues may be spent for such purposes under other law.\n(c) \"Third party\" means an entity other than (1) the person receiving the benefit of assistance financed with tax increments, or (2) the municipality or the development authority or other person substantially under the control of the municipality.\n(d) \"Revenues derived from tax increments paid by properties in the district\" means only tax increment as defined in section 469.174, subdivision 25, clause (1), and does not include tax increment as defined in section 469.174, subdivision 25, clauses (2) to (5).\n(a) For each tax increment financing district, an amount equal to at least 75 percent of the total revenue derived from tax increments paid by properties in the district must be expended on activities in the district or to pay bonds, to the extent that the proceeds of the bonds were used to finance activities in the district or to pay, or secure payment of, debt service on credit enhanced bonds. For districts, other than redevelopment districts for which the request for certification was made after June 30, 1995, the in-district percentage for purposes of the preceding sentence is 80 percent. Not more than 25 percent of the total revenue derived from tax increments paid by properties in the district may be expended, through a development fund or otherwise, on activities outside of the district but within the defined geographic area of the project except to pay, or secure payment of, debt service on credit enhanced bonds. For districts, other than redevelopment districts for which the request for certification was made after June 30, 1995, the pooling percentage for purposes of the preceding sentence is 20 percent. The revenues derived from tax increments paid by properties in the district that are expended on costs under section 469.176, subdivision 4h, may be deducted first before calculating the percentages that must be expended within and without the district.\n(b) In the case of a housing district, a housing project, as defined in section 469.174, subdivision 11, is an activity in the district.\n(c) All administrative expenses are considered to be expenditures for activities outside of the district, except that if the only expenses for activities outside of the district under this subdivision are for the purposes described in paragraph (d), administrative expenses will be considered as expenditures for activities in the district.\n(d) The authority may elect, in the tax increment financing plan for the district, to increase by up to ten percentage points the permitted amount of expenditures for activities located outside the geographic area of the district under paragraph (a). As permitted by section 469.176, subdivision 4k, the expenditures, including the permitted expenditures under paragraph (a), need not be made within the geographic area of the project. Expenditures that meet the requirements of this paragraph are legally permitted expenditures of the district, notwithstanding section 469.176, subdivisions 4b, 4c, and 4j. To qualify for the increase under this paragraph, the expenditures must:\n(1) be used exclusively to assist housing that meets the requirement for a qualified low-income building, as that term is used in section 42 of the Internal Revenue Code; and\n(2) not exceed the qualified basis of the housing, as defined under section 42(c) of the Internal Revenue Code, less the amount of any credit allowed under section 42 of the Internal Revenue Code; and\n(3) be used to:\n(i) acquire and prepare the site of the housing;\n(ii) acquire, construct, or rehabilitate the housing; or\n(iii) make public improvements directly related to the housing; or\n(4) be used to develop housing:\n(i) if the market value of the housing does not exceed the lesser of:\n(A) 150 percent of the average market value of single-family homes in that municipality; or\n(B) $200,000 for municipalities located in the metropolitan area, as defined in section 473.121, or $125,000 for all other municipalities; and\n(ii) if the expenditures are used to pay the cost of site acquisition, relocation, demolition of existing structures, site preparation, and pollution abatement on one or more parcels, if the parcel contains a residence containing one to four family dwelling units that has been vacant for six or more months and is in foreclosure as defined in section 325N.10, subdivision 7, but without regard to whether the residence is the owner's principal residence, and only after the redemption period has expired; or\n(5) to assist owner-occupied housing that meets the requirements of section 469.1761, subdivision 2.\n(e) The authority under paragraph (d), clause (4), expires on December 31, 2016. Increments may continue to be expended under this authority after that date, if they are used to pay bonds or binding contracts that would qualify under subdivision 3, paragraph (a), if December 31, 2016, is considered to be the last date of the five-year period after certification under that provision.\n(f) For purposes of determining whether the minimum percentage of expenditures for activities in the district and maximum percentages of expenditures allowed on activities outside the district have been met under this subdivision, any amounts returned to the county auditor as excess increment, as returned increment under subdivision 4, paragraph (g), or as remedies under section 469.1771, subdivision 2, shall first be subtracted from the total revenues derived from tax increments paid by properties in the district. Any other amounts returned to the county auditor for purposes other than a remedy under section 469.1771, subdivision 3, are considered to be expenditures for activities in the district.\n(a) Revenues derived from tax increments paid by properties in the district that are expended on an activity within the district will instead be considered to have been expended on an activity outside the district for purposes of subdivision 2 unless:\n(1) before or within five years after certification of the district, the revenues are actually paid to a third party with respect to the activity;\n(2) bonds, the proceeds of which must be used to finance the activity, are issued and sold to a third party before or within five years after certification of the district, the revenues are spent to repay the bonds, and the proceeds of the bonds either are, on the date of issuance, reasonably expected to be spent before the end of the later of (i) the five-year period, or (ii) a reasonable temporary period within the meaning of the use of that term under section 148(c)(1) of the Internal Revenue Code, or are deposited in a reasonably required reserve or replacement fund;\n(3) binding contracts with a third party are entered into for performance of the activity before or within five years after certification of the district and the revenues are spent under the contractual obligation;\n(4) costs with respect to the activity are paid before or within five years after certification of the district and the revenues are spent to reimburse a party for payment of the costs, including interest on unreimbursed costs; or\n(5) revenues are spent for housing purposes as described by subdivision 2, paragraph (b).\n(b) For purposes of this subdivision, bonds include subsequent refunding bonds if the original refunded bonds meet the requirements of paragraph (a), clause (2).\n(c) For a redevelopment district or a renewal and renovation district certified after June 30, 2003, and before April 20, 2009, the five-year periods described in paragraph (a) are extended to ten years after certification of the district. For a redevelopment district certified after April 20, 2009, and before June 30, 2012, the five-year periods described in paragraph (a) are extended to eight years after certification of the district. This extension is provided primarily to accommodate delays in development activities due to unanticipated economic circumstances.\n(d) For a redevelopment district that was certified after December 31, 2017, and before June 30, 2020, the five-year periods described in paragraph (a) are extended to eight years after certification of the district.\n(a) Beginning with the sixth year following certification of the district, or beginning with the year following the extended period for districts whose five-year period is extended under subdivision 3, paragraphs (c) and (d), a district must be decertified when the product of the applicable in-district percentage multiplied by the cumulative revenues derived from tax increments paid by properties in the district that have been collected through the end of the calendar year, equals or exceeds an amount sufficient to pay the following:\n(1) any costs and obligations described in subdivision 3, paragraphs (a) and (b), excluding those under a qualifying pay-as-you-go contract and note;\n(2) any accrued interest on the costs and obligations in clause (1), payable in accordance with the terms thereof; and\n(3) any administrative expenses falling within the exception in subdivision 2, paragraph (c).\n(b) For districts with an outstanding qualifying pay-as-you-go contract and note, the required decertification under paragraph (a) is deferred until the end of the remaining term of the last outstanding qualifying pay-as-you-go contract and note, and the applicable in-district percentage of cumulative revenues derived from tax increments paid by properties in the district are sufficient to pay the obligations identified in subdivision 3, paragraphs (a) and (b), provided that the deferral shall not exceed the district's duration limit under section 469.176. During the deferral, beginning at the time paragraph (a) would otherwise require decertification, the authority must annually either:\n(1) remove from the district, by the end of the year, all parcels that will no longer have their tax increment revenue pledged or subject to a qualifying pay-as-you-go contract and note or other costs and obligations described in subdivision 3, paragraphs (a) and (b), after the end of the year; or\n(2) use the applicable in-district percentage of revenues derived from tax increments paid by those parcels to prepay an outstanding qualifying pay-as-you-go contract and note of the district or other costs and obligations described in subdivision 3, paragraphs (a) and (b), or to accumulate and use revenues derived from tax increments paid by those parcels as permitted under paragraph (i).\nThe authority must remove any parcels as required by this paragraph by modification of the tax increment financing plan and notify the county auditor of the removed parcels by the end of the same calendar year. Notwithstanding section 469.175, subdivision 4, paragraphs (b), clause (1), and (e), the notice, discussion, public hearing, and findings required for approval of the original plan are not required for such a modification.\n(c) Notwithstanding paragraph (a) or (b), if tax increment was pledged prior to August 1, 2023, to a bond other than a pay-as-you-go contract and note or interfund loan, and the proceeds of the bond were used solely or in part to pay authorized costs for activities outside the district, the requirement to decertify under paragraph (a) or remove parcels under paragraph (b) shall not apply prior to the bond being fully paid or defeased.\n(d) For purposes of this subdivision, \"applicable in-district percentage\" means the percentage of tax increment revenue that is restricted for expenditures within the district, as determined under subdivision 2, paragraphs (a) and (d), for the district.\n(e) For purposes of this subdivision, \"qualifying pay-as-you-go contract and note\" means a pay-as-you-go contract and note that is considered to be for activities within the district under subdivision 3, paragraph (a).\n(f) For purposes of this subdivision, the reference in paragraph (a) to cumulative revenues derived from tax increments paid by properties in the district through the end of the calendar year shall include any final settlement distributions made in the following January. For purposes of the calculation in paragraph (a), any amounts returned to the county auditor as excess increment or as remedies under section 469.1771, subdivision 2, shall first be subtracted from the cumulative revenues derived from tax increments paid by properties in the district.\n(g) The timing and implementation of a decertification pursuant to paragraphs (a) and (b) shall be subject to the following:\n(1) when a decertification is required under paragraph (a) and not deferred under paragraph (b), the authority must, as soon as practical and no later than the final settlement distribution date of January 25 as identified in section 276.111 for the property taxes payable in the calendar year identified in paragraph (a), make the decertification by resolution effective for the end of the calendar year identified in paragraph (a), and communicate the decertification to the county auditor;\n(2) when a decertification is deferred under paragraph (b), the authority must, by December 31 of the year in which the last qualifying pay-as-you-go contract and note reaches termination, make the decertification by resolution effective for the end of that calendar year and communicate the decertification to the county auditor;\n(3) if the county auditor is unable to prevent tax increments from being calculated for taxes payable in the year following the year for which the decertification is made effective, the county auditor may redistribute the tax increments in the same manner as excess increments under section 469.176, subdivision 2, paragraph (c), clause (4), without first distributing them to the authority; and\n(4) if tax increments are distributed to an authority for a taxes payable year after the year for which the decertification was required to be effective, the authority must return the amount of the distributions to the county auditor for redistribution in the same manner as excess increments under section 469.176, subdivision 2, paragraph (c), clause (4).\n(h) The provisions of this subdivision do not apply to a housing district.\n(i) Notwithstanding anything to the contrary in paragraph (a) or (b), if an authority has made the election in the tax increment financing plan for the district under subdivision 2, paragraph (d), then the requirement to decertify under paragraph (a) or remove parcels under paragraph (b) shall not apply prior to such time that the accumulated revenues derived from tax increments paid by properties in the district that are eligible to be expended for housing purposes described under subdivision 2, paragraph (d), equals the lesser of the amount the authority is permitted to expend for housing purposes described under subdivision 2, paragraph (d), or the amount authorized for such purposes in the tax increment financing plan. Increment revenues collected after the district would have decertified under paragraph (a) or from parcels which otherwise would be subject to removal under paragraph (b), absent the exception of this paragraph, shall be used solely for housing purposes as described in subdivision 2, paragraph (d).\nExcept as otherwise provided in this section, revenues derived from tax increments may be used to pay debt service on credit enhanced bonds issued to finance activities outside of the district from which the revenues are derived, regardless of when the district is created. For purposes of this subdivision, \"district\" includes a district or a project area for which certification to collect increments was requested before August 1, 1979.\n(a) This subdivision applies only to districts for which the request for certification was made before August 1, 2001, and without regard to whether the request for certification was made prior to August 1, 1979.\n(b) The municipality for the district may transfer available increments from another tax increment financing district located in the municipality, if the transfer is necessary to eliminate a deficit in the district to which the increments are transferred. The municipality may transfer increments as provided by this subdivision without regard to whether the transfer or expenditure is authorized by the tax increment financing plan for the district from which the transfer is made. A deficit in the district for purposes of this subdivision means the lesser of the following two amounts:\n(1) the amount due during the calendar year to pay preexisting obligations of the district; minus the sum of\n(i) the total increments collected or to be collected from properties located within the district that are available for the calendar year including amounts collected in prior years that are currently available; plus\n(ii) total increments from properties located in other districts in the municipality including amounts collected in prior years that are available to be used to meet the district's obligations under this section, excluding this subdivision, or other provisions of law; or\n(2) the reduction in increments collected from properties located in the district for the calendar year as a result of the changes in classification rates in Laws 1997, chapter 231, article 1; Laws 1998, chapter 389, article 2; and Laws 1999, chapter 243, and Laws 2001, First Special Session chapter 5, or the elimination of the general education tax levy under Laws 2001, First Special Session chapter 5.\nThe authority may compute the deficit amount under clause (1) only (without regard to the limit under clause (2)) if the authority makes an irrevocable commitment, by resolution, to use increments from the district to which increments are to be transferred and any transferred increments are only used to pay preexisting obligations and administrative expenses for the district that are required to be paid under section 469.176, subdivision 4h, paragraph (a).\n(c) A preexisting obligation means:\n(1) bonds issued and sold before August 1, 2001, or bonds issued pursuant to a binding contract requiring the issuance of bonds entered into before July 1, 2001, and bonds issued to refund such bonds or to reimburse expenditures made in conjunction with a signed contractual agreement entered into before August 1, 2001, to the extent that the bonds are secured by a pledge of increments from the tax increment financing district; and\n(2) binding contracts entered into before August 1, 2001, to the extent that the contracts require payments secured by a pledge of increments from the tax increment financing district.\n(d) The municipality may require a development authority, other than a seaway port authority, to transfer available increments including amounts collected in prior years that are currently available for any of its tax increment financing districts in the municipality to make up an insufficiency in another district in the municipality, regardless of whether the district was established by the development authority or another development authority. This authority applies notwithstanding any law to the contrary, but applies only to a development authority that:\n(1) was established by the municipality; or\n(2) the governing body of which is appointed, in whole or part, by the municipality or an officer of the municipality or which consists, in whole or part, of members of the governing body of the municipality. The municipality may use this authority only after it has first used all available increments of the receiving development authority to eliminate the insufficiency and exercised any permitted action under section 469.1792, subdivision 3, for preexisting districts of the receiving development authority to eliminate the insufficiency.\n(e) The authority under this subdivision to spend tax increments outside of the area of the district from which the tax increments were collected:\n(1) is an exception to the restrictions under section 469.176, subdivisions 4b, 4c, 4d, 4e, 4i, and 4j; the expenditure limits under section 469.176, subdivision 1c; and the other provisions of this section; and the percentage restrictions under subdivision 2 must be calculated after deducting increments spent under this subdivision from the total increments for the district; and\n(2) applies notwithstanding the provisions of the Tax Increment Financing Act in effect for districts for which the request for certification was made before June 30, 1982, or any other law to the contrary.\n(f) If a preexisting obligation requires the development authority to pay an amount that is limited to the increment from the district or a specific development within the district and if the obligation requires paying a higher amount to the extent that increments are available, the municipality may determine that the amount due under the preexisting obligation equals the higher amount and may authorize the transfer of increments under this subdivision to pay up to the higher amount. The existence of a guarantee of obligations by the individual or entity that would receive the payment under this paragraph is disregarded in the determination of eligibility to pool under this subdivision. The authority to transfer increments under this paragraph may only be used to the extent that the payment of all other preexisting obligations in the municipality due during the calendar year have been satisfied.\n(g) For transfers of increments made in calendar year 2005 and later, the reduction in increments as a result of the elimination of the general education tax levy for purposes of paragraph (b), clause (2), for a taxes payable year equals the general education tax rate for the school district under Minnesota Statutes 2000, section 273.1382, subdivision 1, for taxes payable in 2001, multiplied by the captured tax capacity of the district for the current taxes payable year.",
	"repealed": false
}