{
	"id": "152.125",
	"url": "https://www.revisor.mn.gov/statutes/cite/152.125",
	"title": "152.125 INTRACTABLE PAIN.",
	"text": "(a) For purposes of this section, the terms in this subdivision have the meanings given.\n(b) \"Drug diversion\" means the unlawful transfer of prescription drugs from their licit medical purpose to the illicit marketplace.\n(c) \"Intractable pain\" means a pain state in which the cause of the pain cannot be removed or otherwise treated with the consent of the patient and in which, in the generally accepted course of medical practice, no relief or cure of the cause of the pain is possible, or none has been found after reasonable efforts. Conditions associated with intractable pain may include cancer and the recovery period, sickle cell disease, noncancer pain, rare diseases, orphan diseases, severe injuries, and health conditions requiring the provision of palliative care or hospice care. Reasonable efforts for relieving or curing the cause of the pain may be determined on the basis of, but are not limited to, the following:\n(1) when treating a nonterminally ill patient for intractable pain, an evaluation conducted by the attending physician, advanced practice registered nurse, or physician assistant and one or more physicians, advanced practice registered nurses, or physician assistants specializing in pain medicine or the treatment of the area, system, or organ of the body confirmed or perceived as the source of the intractable pain; or\n(2) when treating a terminally ill patient, an evaluation conducted by the attending physician, advanced practice registered nurse, or physician assistant who does so in accordance with the standard of care and the level of care, skill, and treatment that would be recognized by a reasonably prudent physician, advanced practice registered nurse, or physician assistant under similar conditions and circumstances.\n(d) \"Palliative care\" has the meaning given in section 144A.75, subdivision 12.\n(e) \"Rare disease\" means a disease, disorder, or condition that affects fewer than 200,000 individuals in the United States and is chronic, serious, life altering, or life threatening.\nThe evaluation and treatment of intractable pain when treating a nonterminally ill patient is governed by the following criteria:\n(1) a diagnosis of intractable pain by the treating physician, advanced practice registered nurse, or physician assistant and either by a physician, advanced practice registered nurse, or physician assistant specializing in pain medicine or a physician, advanced practice registered nurse, or physician assistant treating the area, system, or organ of the body that is the source of the pain is sufficient to meet the definition of intractable pain; and\n(2) the cause of the diagnosis of intractable pain must not interfere with medically necessary treatment, including but not limited to prescribing or administering a controlled substance in Schedules II to V of section 152.02.\n(a) Notwithstanding any other provision of this chapter, a physician, advanced practice registered nurse, or physician assistant may prescribe or administer a controlled substance in Schedules II to V of section 152.02 to a patient in the course of the physician's, advanced practice registered nurse's, or physician assistant's treatment of the patient for a diagnosed condition causing intractable pain. No physician, advanced practice registered nurse, or physician assistant shall be subject to disciplinary action by the Board of Medical Practice or Board of Nursing for appropriately prescribing or administering a controlled substance in Schedules II to V of section 152.02 in the course of treatment of a patient for intractable pain, provided the physician, advanced practice registered nurse, or physician assistant:\n(1) keeps accurate records of the purpose, use, prescription, and disposal of controlled substances, writes accurate prescriptions, and prescribes medications in conformance with chapter 147 or 148 or in accordance with the current standard of care; and\n(2) enters into a patient-provider agreement that meets the criteria in subdivision 5.\n(b) No physician, advanced practice registered nurse, or physician assistant, acting in good faith and based on the needs of the patient, shall be subject to disenrollment or termination by the commissioner of health solely for prescribing a dosage that equates to an upward deviation from morphine milligram equivalent dosage recommendations or thresholds specified in state or federal opioid prescribing guidelines or policies, including but not limited to the Guideline for Prescribing Opioids for Chronic Pain issued by the Centers for Disease Control and Prevention and Minnesota opioid prescribing guidelines.\n(c) A physician, advanced practice registered nurse, or physician assistant treating intractable pain by prescribing, dispensing, or administering a controlled substance in Schedules II to V of section 152.02 that includes but is not limited to opioid analgesics must not taper a patient's medication dosage solely to meet a predetermined morphine milligram equivalent dosage recommendation or threshold if the patient is stable and compliant with the treatment plan, is experiencing no serious harm from the level of medication currently being prescribed or previously prescribed, and is in compliance with the patient-provider agreement as described in subdivision 5.\n(d) A physician's, advanced practice registered nurse's, or physician assistant's decision to taper a patient's medication dosage must be based on factors other than a morphine milligram equivalent recommendation or threshold.\n(e) No pharmacist, health plan company, or pharmacy benefit manager shall refuse to fill a prescription for an opiate issued by a licensed practitioner with the authority to prescribe opiates solely based on the prescription exceeding a predetermined morphine milligram equivalent dosage recommendation or threshold. Health plan companies that participate in Minnesota health care programs under chapters 256B and 256L, and pharmacy benefit managers under contract with these health plan companies, must comply with section 1004 of the federal SUPPORT Act, Public Law 115-271, when providing services to medical assistance and MinnesotaCare enrollees.\nThis section does not apply to:\n(1) a physician's, advanced practice registered nurse's, or physician assistant's treatment of a patient for substance use disorder resulting from the use of controlled substances in Schedules II to V of section 152.02;\n(2) the prescription or administration of controlled substances in Schedules II to V of section 152.02 to a patient whom the physician, advanced practice registered nurse, or physician assistant knows to be using the controlled substances for nontherapeutic or drug diversion purposes;\n(3) the prescription or administration of controlled substances in Schedules II to V of section 152.02 for the purpose of terminating the life of a patient having intractable pain; or\n(4) the prescription or administration of a controlled substance in Schedules II to V of section 152.02 that is not a controlled substance approved by the United States Food and Drug Administration for pain relief.\nPrior to treating a patient for intractable pain in accordance with subdivision 2, a physician, advanced practice registered nurse, or physician assistant shall discuss with the patient or the patient's legal guardian, if applicable, the risks associated with the controlled substances in Schedules II to V of section 152.02 to be prescribed or administered in the course of the physician's, advanced practice registered nurse's, or physician assistant's treatment of a patient, and document the discussion in the patient's record as required in the patient-provider agreement described in subdivision 5.\n(a) Before treating a patient for intractable pain, a physician, advanced practice registered nurse, or physician assistant and the patient or the patient's legal guardian, if applicable, must mutually agree to the treatment and enter into a provider-patient agreement. The agreement must include a description of the prescriber's and the patient's expectations, responsibilities, and rights according to best practices and current standards of care.\n(b) The agreement must be signed by the patient or the patient's legal guardian, if applicable, and the physician, advanced practice registered nurse, or physician assistant and included in the patient's medical records. A copy of the signed agreement must be provided to the patient.\n(c) The agreement must be reviewed by the patient and the physician, advanced practice registered nurse, or physician assistant annually. If there is a change in the patient's treatment plan, the agreement must be updated and a revised agreement must be signed by the patient or the patient's legal guardian. A copy of the revised agreement must be included in the patient's medical record and a copy must be provided to the patient.\n(d) Absent clear evidence of drug diversion, nonadherence with the agreement must not be used as the sole reason to stop a patient's treatment with scheduled drugs. If a patient experiences difficulty adhering to the agreement, the prescriber must evaluate the patient for other conditions, including but not limited to substance use disorder, and must ensure that the patient's course of treatment is appropriately adjusted to reflect any change in diagnosis.\n(e) A patient-provider agreement is not required in an emergency or inpatient hospital setting.",
	"repealed": false
}