{
	"id": "360.016",
	"url": "https://www.revisor.mn.gov/statutes/cite/360.016",
	"title": "360.016 FEDERAL AID.",
	"text": "The commissioner is authorized to cooperate with the government of the United States, and any agency or department thereof, in the planning, acquisition, construction, improvement, maintenance, and operation of airports and other air navigation facilities in this state and to comply with the provisions of the laws of the United States and any regulations made thereunder for the expenditure of federal money upon such airports and other air navigation facilities.\nThe commissioner is authorized to accept, receive, and receipt for and disburse federal money and other money, either public or private, for and in behalf of this state, or any municipality thereof, for the planning, acquisition, construction, improvement, maintenance, and operation of airports and other air navigation facilities, whether such work is to be done by the state or by such municipalities, or jointly, aided by grants of aid from the United States, upon such terms and conditions as are or may be prescribed by the laws of the United States and any rules or regulations made thereunder. The commissioner is authorized to act as agent of any municipality or municipalities acting jointly, upon the request of such municipality or municipalities, in accepting, receiving, receipting for, and disbursing federal money, and other money public or private, made available to finance, in whole or in part, the planning, acquisition, construction, improvement, maintenance, or operation of a municipal airport or air navigation facility; and if requested by such municipality or municipalities may act as its or their agent in contracting for and supervising such planning, acquisition, construction, improvement, maintenance, or operation; and all municipalities are authorized to designate the commissioner as their agent for the foregoing purposes. The commissioner, as principal on behalf of the state, and any municipality on its own behalf, subject to the provisions of section 360.0161 may enter into any contracts, with each other or with the United States or with any person, which may be required in connection with a grant or loan of federal money for municipal airport or air navigation facility purposes. All federal money accepted under this section shall be accepted and transferred or expended by the commissioner upon such terms and conditions as are prescribed by the United States.\nThe commissioner may enter into any contracts necessary to the execution of powers granted by this chapter. All contracts for the planning, acquisition, construction, improvement, maintenance, and operation of airports, or other air navigation facilities, made by the commissioner, either as the agent of this state or as the agent of any municipality, shall be made pursuant to the laws of this state governing the making of like contracts; provided, that where the planning, acquisition, construction, improvement, maintenance, and operation of any airport or other air navigation facility is financed wholly or partially with federal money, the commissioner, as agent of the state or of any municipality thereof, may let contracts in the manner prescribed by the federal authorities, acting under the laws of the United States and any rules or regulations made thereunder, notwithstanding any other state law to the contrary.\nAll money accepted for disbursement by the commissioner pursuant to subdivision 2 shall be deposited in the state treasury and, unless otherwise prescribed by the authority from which the money is received, kept in separate funds, designated according to the purposes for which the money was made available, and held by the state in trust for such purposes. All such money is hereby appropriated for the purposes for which the same was made available, to be expended in accordance with federal laws and regulations and with the laws of this state.",
	"repealed": false
}