{
	"id": "245G.19",
	"url": "https://www.revisor.mn.gov/statutes/cite/245G.19",
	"title": "245G.19 LICENSE HOLDERS SERVING CLIENTS WITH CHILDREN.",
	"text": "In addition to the requirements of sections 245G.01 to 245G.17, a license holder that offers supervision of a child of a client is subject to the requirements of this section. A license holder providing room and board for a client and the client's child must have an appropriate facility license from the Department of Health.\n\"Supervision of a child\" means a caregiver is within sight or hearing of an infant, toddler, or preschooler at all times so that the caregiver can intervene to protect the child's health and safety. For a school-age child it means a caregiver is available to help and care for the child to protect the child's health and safety.\nA license holder must meet the following requirements:\n(1) have a policy and schedule delineating the times and circumstances when the license holder is responsible for supervision of a child in the program and when the child's parents are responsible for supervision of a child. The policy must explain how the program will communicate its policy about supervision of a child responsibility to the parent; and\n(2) have written procedures addressing the actions a staff member must take if a child is neglected or abused, including while the child is under the supervision of the child's parent.\nDuring the times the license holder is responsible for the supervision of a child, the license holder must meet the following standards:\n(1) child and adult ratios in Minnesota Rules, part 9502.0367;\n(2) day care training in section 142B.70;\n(3) behavior guidance in Minnesota Rules, part 9502.0395;\n(4) activities and equipment in Minnesota Rules, part 9502.0415;\n(5) physical environment in Minnesota Rules, part 9502.0425;\n(6) physical space requirements in section 142B.72; and\n(7) water, food, and nutrition in Minnesota Rules, part 9502.0445, unless the license holder has a license from the Department of Health.",
	"repealed": false
}