{
	"id": "326B.13",
	"url": "https://www.revisor.mn.gov/statutes/cite/326B.13",
	"title": "326B.13 APPLICATION OF ADMINISTRATIVE PROCEDURE ACT.",
	"text": "Subject to this section, the adoption of the code and amendment is subject to the Administrative Procedure Act.\nThe commissioner need not publish or distribute those parts of the code which are adopted by reference pursuant to section 14.07, subdivision 4.\nAll standards referred to in any model or statewide specialty code or any of the modifications of a code need not be filed with the secretary of state. All standards that are incorporated by reference into the code must be kept on file and available for inspection in the office of the commissioner.\nIn no event may a state agency subsequently authorized to adopt rules involving State Building Code subject matter proceed to adopt the rules without prior consultation with the commissioner.\nAny interested person may propose amendments to the code which may be either applicable to all municipalities or, where it is alleged and established that geological conditions exist within a municipality which are not generally found within other municipalities, amendments may be restricted in application to that municipality.\nThe commissioner shall approve any proposed amendments deemed by the commissioner to be reasonable in conformity with the policy and purpose of the code and justified under the particular circumstances involved. The commissioner shall make an electronic version of amendments to the code available to municipalities. Upon request, a municipality may receive a paper copy of amendments to the code available for a fee prescribed by the commissioner.\nWith the approval of the commissioner the state building official shall investigate or provide for investigations, or may accept authenticated reports from authoritative sources, concerning new materials or modes of construction intended for use in the construction of buildings or structures, and shall propose amendments to the code setting forth the conditions under which the new materials or modes may be used.\nA rule to adopt or amend the State Building Code is effective 270 days after publication of the rule's notice of adoption in the State Register. The rule may provide for a later effective date. The rule may provide for an earlier effective date if the commissioner or board proposing the rule finds that an earlier effective date is necessary to protect public health and safety after considering, among other things, the need for time for training of individuals to comply with and enforce the rule. The commissioner must publish an electronic version of the entire adopted rule chapter on the department's website within ten days of receipt from the revisor of statutes. The commissioner shall clearly indicate the effective date of the rule on the department's website.",
	"repealed": false
}