{
	"id": "12B.40",
	"url": "https://www.revisor.mn.gov/statutes/cite/12B.40",
	"title": "12B.40 APPLICATION PROCESS.",
	"text": "(a) The director must develop application materials and may update the materials as needed. Application materials must include instructions and requirements for assistance under this chapter.\n(b) A county government has 30 days from the end of the incident period or the president's official denial of the governor's request for a declaration of a major disaster to request that the governor declare a state disaster. The director may deny a late request. The county government's request for a state disaster declaration must include:\n(1) the cause, location of damage, and incident period;\n(2) documentation of a local, tribal, county, or state disaster or emergency declaration in response to the disaster;\n(3) a description of damages, an initial damage assessment, and the amount of eligible costs incurred by the applicant;\n(4) a statement or evidence that the applicant has the ability to pay for at least 25 percent of total eligible costs incurred from the disaster; and\n(5) a statement or evidence that the local government has incurred damages equal to or exceeding 50 percent of the federal countywide threshold in effect during the incident period.\n(c) An applicant has 60 days from the governor's declaration of a state disaster to submit a complete application for state public disaster assistance to the director.\n(d) The director must review the application and supporting documentation for completeness and may return the application with a request for more detailed information. The director may consult with local public officials to ensure the application reflects the extent and magnitude of the damage and to reconcile any differences. The application is not complete until the director receives all requested information.\n(e) If the director returns an application with a request for more detailed information or for correction of deficiencies, the applicant must submit all required information within 30 days of the applicant's receipt of the director's request. The applicant's failure to provide the requested information in a timely manner without a reasonable explanation may be cause for denial of the application.\n(f) The director has no more than 60 days from the receipt of a complete application to approve or deny the application, or the application is deemed approved. If the director denies an application, the director must send a denial letter. If the director approves an application or the application is automatically deemed approved after 60 days, the director must notify the applicant of the steps necessary to obtain reimbursement of eligible costs, including submission of invoices or other documentation substantiating the costs submitted for reimbursement.",
	"repealed": false
}