{
	"id": "325F.662",
	"url": "https://www.revisor.mn.gov/statutes/cite/325F.662",
	"title": "325F.662 SALE OF USED MOTOR VEHICLES.",
	"text": "For the purposes of this section, the following terms have the meanings given to them.\n(a) \"Consumer\" means the purchaser, other than for purposes of resale, of a used motor vehicle used primarily for personal, family, or household purposes.\n(b) \"Dealer\" means a motor vehicle dealer or lessor, as defined in section 168.27, subdivisions 2, 3, and 4, whether licensed or unlicensed, or the dealer's or lessor's agent, who is engaged in the business of selling or arranging the sale of used motor vehicles in this state; except that, the term does not include a bank or financial institution, a business selling a used motor vehicle to an employee of that business, a lessor selling, either directly or indirectly, a leased used motor vehicle to that vehicle's lessee or a family member or employee of the lessee, or a licensed auctioneer selling motor vehicles at an auction if, in the ordinary course of the auctioneer's business, the sale of motor vehicles is incidental to the sale of other real or personal property.\n(c) \"Motor vehicle\" means a passenger automobile, as defined in section 168.002, subdivision 24, including pickup trucks and vans.\n(d) \"Used motor vehicle\" means any motor vehicle which has been driven more than the limited use necessary in moving or road testing a new motor vehicle prior to delivery to a consumer. The term does not include a new motor vehicle sold by a dealer franchised to sell the vehicle if the vehicle was driven for demonstration purposes using dealer plates and if, when the vehicle was sold, it carried a manufacturer's express warranty which provides coverage at least as broad with respect to covered components and duration as that required by this section.\n(e) \"Express warranty\" means a dealer's written statement, as defined in section 325G.17, subdivision 5, provided to a consumer in connection with the sale of a used motor vehicle.\n(f) \"Buyer's Guide\" means the window form required by the Federal Trade Commission's \"Used Motor Vehicle Trade Regulation Rule,\" Code of Federal Regulations, title 16, section 455.2.\n(a) Every used motor vehicle sold by a dealer is covered by an express warranty which the dealer shall provide to the consumer in writing. At a minimum, the express warranty applies for the following terms:\n(1) if the used motor vehicle has less than 36,000 miles, the warranty must remain in effect for at least 60 days or 2,500 miles, whichever comes first;\n(2) if the used motor vehicle has 36,000 miles or more, but less than 75,000 miles, the warranty must remain in effect for at least 30 days or 1,000 miles, whichever comes first; and\n(3) unless the vehicle is sold by a new motor vehicle dealer, as defined in section 168.27, subdivision 2, if the used motor vehicle has 75,000 miles or more, but less than 200,000 miles, the warranty must remain in effect for at least 15 days or 500 miles, whichever comes first.\n(b) The express warranty must require the dealer, in the event of a malfunction, defect, or failure in a covered part, to repair or replace the covered part, or at the dealer's election, to accept return of the used motor vehicle from the consumer and provide a refund to the consumer.\n(c) For used motor vehicles with less than 36,000 miles, the dealer's express warranty shall cover, at minimum, the following parts:\n(1) with respect to the engine, all lubricated parts, intake manifolds, engine block, cylinder head, rotary engine housings, and ring gear;\n(2) with respect to the transmission, the automatic transmission case, internal parts, and the torque converter; or, the manual transmission case, and the internal parts;\n(3) with respect to the drive axle, the axle housings and internal parts, axle shafts, drive shafts and output shafts, and universal joints; but excluding the secondary drive axle on vehicles, other than passenger vans, mounted on a truck chassis;\n(4) with respect to the brakes, the master cylinder, vacuum assist booster, wheel cylinders, hydraulic lines and fittings, and disc brakes calipers;\n(5) with respect to the steering, the steering gear housing and all internal parts, power steering pump, valve body, piston, and rack;\n(6) the water pump;\n(7) the externally mounted mechanical fuel pump;\n(8) the radiator;\n(9) the alternator, generator, and starter.\n(d) For used motor vehicles with 36,000 miles or more, but less than 200,000 miles, the dealer's express warranty shall cover, at minimum, the following parts:\n(1) with respect to the engine, all lubricated parts, intake manifolds, engine block, cylinder head, rotary engine housings, and ring gear;\n(2) with respect to the transmission, the automatic transmission case, internal parts, and the torque converter; or, the manual transmission case, and internal parts;\n(3) with respect to the drive axle, the axle housings and internal parts, axle shafts, drive shafts and output shafts, and universal joints; but excluding the secondary drive axle on vehicles, other than passenger vans, mounted on a truck chassis;\n(4) with respect to the brakes, the master cylinder, vacuum assist booster, wheel cylinders, hydraulic lines and fittings, and disc brake calipers;\n(5) with respect to the steering, the steering gear housing and all internal parts, power steering pump, valve body, and piston;\n(6) the water pump;\n(7) the externally mounted mechanical fuel pump.\n(e)(1) A dealer's obligations under the express warranty remain in effect notwithstanding the fact that the warranty period has expired, if the consumer promptly notified the dealer of the malfunction, defect, or failure in the covered part within the specified warranty period and, within a reasonable time after notification, brings the vehicle or arranges with the dealer to have the vehicle brought to the dealer for inspection and repair.\n(2) If a dealer does not have a repair facility, the dealer shall designate where the vehicle must be taken for inspection and repair.\n(3) In the event the malfunction, defect, or failure in the covered part occurs at a location which makes it impossible or unreasonable to return the vehicle to the selling dealer, the consumer may have the repairs completed elsewhere with the consent of the selling dealer, which consent may not be unreasonably withheld.\n(4) Notwithstanding the provisions of this paragraph, a consumer may have nonwarranty maintenance and nonwarranty repairs performed other than by the selling dealer and without the selling dealer's consent.\n(f) Nothing in this section diminishes the obligations of a manufacturer under an express warranty issued by the manufacturer. The express warranties created by this section do not require a dealer to repair or replace a covered part if the repair or replacement is covered by a manufacturer's new car warranty, or the manufacturer otherwise agrees to repair or replace the part.\n(g) The express warranties created by this section do not cover defects or repair problems which result from collision, abuse, negligence, or lack of adequate maintenance following sale to the consumer.\n(h) The terms of the express warranty, including the duration of the warranty and the parts covered, must be fully, accurately, and conspicuously disclosed by the dealer on the front of the Buyers Guide.\nNotwithstanding the provisions of subdivision 2, a dealer is not required to provide an express warranty for a used motor vehicle:\n(1) except for a used motor vehicle described in subdivision 2, paragraph (a), clause (3), sold for a total cash sale price of less than $3,000, including the trade-in value of any vehicle traded in by the consumer, but excluding tax, license fees, registration fees, and finance charges;\n(2) with an engine designed to use diesel fuel;\n(3) with a gross weight, as defined in section 168.002, subdivision 13, in excess of 9,000 pounds;\n(4) that has been custom-built or modified for show or for racing;\n(5) except for a used motor vehicle described in subdivision 2, paragraph (a), clause (3), that is eight years of age or older, as calculated from the first day in January of the designated model year of the vehicle;\n(6) that has been produced by a manufacturer which has never manufactured more than 10,000 motor vehicles in any one year;\n(7) that has 200,000 miles or more at time of sale;\n(8) that has not been manufactured in compliance with applicable federal emission standards in force at the time of manufacture as provided by the Clean Air Act, United States Code, title 42, sections 7401 through 7642, and regulations adopted pursuant thereto, and safety standards as provided by the National Traffic and Motor Safety Act, United States Code, title 15, sections 1381 through 1431, and regulations adopted pursuant thereto; or\n(9) that has been issued a certificate of title that bears a \"salvage\" brand or stamp under section 168A.151.\nWhen purchasing a used motor vehicle, a consumer may waive the express warranty for a covered part if:\n(1) the dealer discloses in a clear and conspicuous typed or printed statement on the front of the Buyers Guide that the waived part contains a malfunction, defect, or repair problem; and\n(2) the consumer circles this typed or printed statement and signs the Buyers Guide next to the circled statement.\nIf a dealer fails to give the express warranty required by this section, the dealer nevertheless is considered to have given the express warranty as a matter of law.\nIn selling or offering to sell any used motor vehicle, and in providing the express warranty required by this section, a dealer shall comply in all respects with the Federal Trade Commission's \"Used Motor Vehicle Trade Regulation Rule,\" Code of Federal Regulations, title 16, part 455.\n(a) In accordance with section 325G.19, subdivision 2, every express warranty in connection with the sale of a used motor vehicle must be honored by the dealer according to the terms of the express warranty.\n(b) Following repair or replacement of a covered part, the dealer remains responsible under the express warranty for that covered part for one additional warranty period.\n(c) By honoring the terms of the express warranty by repairing or replacing a covered part, the dealer does not create an additional implied warranty on any portion of the used motor vehicle.\n(d) A dealer may limit the duration of implied warranties to the duration of the express warranty.\n(a) A refund, as provided under subdivision 2, must consist of the full purchase price of the used motor vehicle and all other charges, including but not limited to excise tax, registration tax, license fees, and reimbursement for towing expenses incurred by the consumer as a result of the vehicle being out of service for warranty repair, less a reasonable allowance for the consumer's use of the vehicle not exceeding ten cents per mile driven or ten percent of the purchase price, whichever is less. Refunds must include the amount stated by the dealer as the trade-in value of any vehicle traded in and applied to the purchase price of the used motor vehicle. Refunds must be made to the consumer and lienholder, if any, as their interests appear on the records of the registrar of motor vehicles.\n(b) The amount of the excise tax to be paid by the dealer to the consumer under paragraph (a) is the tax paid by the consumer when the vehicle was purchased less an amount equal to the tax paid multiplied by a fraction, the denominator of which is the purchase price of the vehicle and the numerator of which is the allowance deducted from the refund for the consumer's use of the vehicle.\n(c) A dealer must give the consumer an itemized statement listing each of the amounts refunded under this subdivision. If the amount of excise tax refunded is not separately stated, or if the dealer does not apply for a refund of the tax within one year of the return of the motor vehicle, the Department of Public Safety may refund the excise tax, as determined under paragraph (b), directly to the consumer and lienholder, if any, as their interests appear on the records of the registrar of motor vehicles.\n(a) It is unlawful for a dealer to advertise for sale or sell a used motor vehicle as \"certified\" or use any similar descriptive term in the advertisement or the sale of a used motor vehicle that implies the vehicle has been certified to meet the terms of a used motor vehicle certification program if any of the following apply:\n(1) the dealer knows or should know that the odometer on the vehicle does not indicate actual mileage, has been rolled back or otherwise altered to show fewer miles, or has been replaced with an odometer showing fewer miles than actually driven;\n(2) the dealer knows or should know that the vehicle was reacquired by the vehicle's manufacturer or a dealer pursuant to state or federal warranty laws;\n(3) the dealer knows or should know that the title to the vehicle has been inscribed with the notation \"damaged,\" \"flood,\" \"junk,\" \"lemon law buyback,\" \"manufacturer repurchase,\" \"nonrepairable,\" \"rebuilt,\" \"reconditioned,\" \"salvage,\" or similar title designation required by this state or another state;\n(4) the dealer knows or should know that the vehicle has sustained damage in an impact, fire, or flood, that substantially impairs the use or safety of the vehicle;\n(5) the dealer knows or should know that the vehicle has sustained frame damage;\n(6) prior to sale, the dealer fails to provide the buyer with a completed inspection report indicating all the components inspected;\n(7) the dealer disclaims any warranties of merchantability on the vehicle; or\n(8) the vehicle is sold \"AS IS.\"\n(b) This section does not abrogate or limit any disclosure obligation imposed by any other law.\nAny dealer who is found to have violated this section is subject to the penalties and remedies, including a private right of action, as provided in section 8.31. In addition, a violation of subdivision 7 is also a violation of section 325F.69.\nA private civil action brought by a consumer under this section with respect to a warranty claim must be commenced within one year of the expiration of the express warranty.\nNothing in this section limits the rights or remedies which are otherwise available to a consumer under any other law.",
	"repealed": false
}