{
	"id": "148.5198",
	"url": "https://www.revisor.mn.gov/statutes/cite/148.5198",
	"title": "148.5198 RESTRICTION ON SALE OF PRESCRIPTION HEARING AIDS.",
	"text": "(a) An audiologist or certified dispenser dispensing a prescription hearing aid in this state must comply with paragraphs (b) and (c).\n(b) The audiologist or certified dispenser must provide the buyer with a 45-calendar-day written money-back guarantee. The guarantee must permit the buyer to cancel the purchase for any reason within 45 calendar days after receiving the prescription hearing aid by giving or mailing written notice of cancellation to the audiologist or certified dispenser. If the buyer mails the notice of cancellation, the 45-calendar-day period is counted using the postmark date, to the date of receipt by the audiologist or certified dispenser. If the prescription hearing aid must be repaired, remade, or adjusted during the 45-calendar-day money-back guarantee period, the running of the 45-calendar-day period is suspended one day for each 24-hour period that the prescription hearing aid is not in the buyer's possession. A repaired, remade, or adjusted prescription hearing aid must be claimed by the buyer within three business days after notification of availability, after which time the running of the 45-calendar-day period resumes. The guarantee must entitle the buyer, upon cancellation, to receive a refund of payment within 30 days of return of the prescription hearing aid to the audiologist or certified dispenser. The audiologist or certified dispenser may retain as a cancellation fee no more than $250 of the buyer's total purchase price of the prescription hearing aid.\n(c) The audiologist or certified dispenser shall provide the buyer with a contract written in plain English, that contains uniform language and provisions that meet the requirements under the Plain Language Contract Act, sections 325G.29 to 325G.36. The contract must include, but is not limited to, the following: in immediate proximity to the space reserved for the signature of the buyer, or on the first page if there is no space reserved for the signature of the buyer, a clear and conspicuous disclosure of the following specific statement in all capital letters of no less than 12-point boldface type: \"MINNESOTA STATE LAW GIVES THE BUYER THE RIGHT TO CANCEL THIS PURCHASE FOR ANY REASON AT ANY TIME PRIOR TO MIDNIGHT OF THE 45TH CALENDAR DAY AFTER RECEIPT OF THE PRESCRIPTION HEARING AID(S). THIS CANCELLATION MUST BE IN WRITING AND MUST BE GIVEN OR MAILED TO THE AUDIOLOGIST OR CERTIFIED DISPENSER. IF THE BUYER DECIDES TO RETURN THE PRESCRIPTION HEARING AID(S) WITHIN THIS 45-CALENDAR-DAY PERIOD, THE BUYER WILL RECEIVE A REFUND OF THE TOTAL PURCHASE PRICE OF THE AID(S) FROM WHICH THE AUDIOLOGIST OR CERTIFIED DISPENSER MAY RETAIN AS A CANCELLATION FEE NO MORE THAN $250.\"\nAny audiologist, certified dispenser, or company who agrees to repair a prescription hearing aid must provide the owner of the prescription hearing aid, or the owner's representative, with a bill that describes the repair and services rendered. The bill must also include the repairing audiologist's, certified dispenser's, or company's name, address, and telephone number.\nThis subdivision does not apply to an audiologist, certified dispenser, or company that repairs a prescription hearing aid pursuant to an express warranty covering the entire prescription hearing aid and the warranty covers the entire cost, both parts and labor, of the repair.\nAny guarantee of prescription hearing aid repairs must be in writing and delivered to the owner of the prescription hearing aid, or the owner's representative, stating the repairing audiologist's, certified dispenser's, or company's name, address, telephone number, length of guarantee, model, and serial number of the prescription hearing aid and all other terms and conditions of the guarantee.\nA person found to have violated this section is guilty of a misdemeanor.\nIn addition to the penalty provided in subdivision 4, a person found to have violated this section is subject to the penalties and remedies provided in section 325F.69, subdivision 1.\nUpon the request of the owner of a prescription hearing aid or the owner's representative for a written estimate and prior to the commencement of repairs, a repairing audiologist, certified dispenser, or company shall provide the customer with a written estimate of the price of repairs. If a repairing audiologist, certified dispenser, or company provides a written estimate of the price of repairs, it must not charge more than the total price stated in the estimate for the repairs. If the repairing audiologist, certified dispenser, or company after commencing repairs determines that additional work is necessary to accomplish repairs that are the subject of a written estimate and if the repairing audiologist, certified dispenser, or company did not unreasonably fail to disclose the possible need for the additional work when the estimate was made, the repairing audiologist, certified dispenser, or company may charge more than the estimate for the repairs if the repairing audiologist, certified dispenser, or company immediately provides the owner or owner's representative a revised written estimate pursuant to this section and receives authorization to continue with the repairs. If continuation of the repairs is not authorized, the repairing audiologist, certified dispenser, or company shall return the prescription hearing aid as close as possible to its former condition and shall release the prescription hearing aid to the owner or owner's representative upon payment of charges for repairs actually performed and not in excess of the original estimate.",
	"repealed": false
}