{
	"id": "18B.09",
	"url": "https://www.revisor.mn.gov/statutes/cite/18B.09",
	"title": "18B.09 PESTICIDE APPLICATION IN CITIES.",
	"text": "This section applies only to statutory and home rule charter cities that enact ordinances as provided in this section.\n(a) Statutory and home rule charter cities may enact an ordinance, which may include penalty and enforcement provisions, containing the pesticide application warning information contained in subdivision 3. An ordinance may not be adopted that is more restrictive than the ordinance authorized by subdivision 3.\n(b) Cities of the first class may enact an ordinance, which may include penalty and enforcement provisions, containing the pesticide prohibition contained in subdivision 4. An ordinance may not be adopted that is more restrictive than the ordinance authorized by subdivision 4.\n(a) All commercial or noncommercial applicators who apply pesticides to turf areas must post or affix warning signs on the property where the pesticides are applied.\n(b) Warning signs must project at least 18 inches above the top of the grass line. The warning signs must be of a material that is rain-resistant for at least a 48-hour period and must remain in place up to 48 hours from the time of initial application.\n(c) The following information must be printed on the warning sign in contrasting colors and capitalized letters measuring at least one-half inch, or in another format approved by the commissioner. The sign must provide the following information:\n(1) the name of the business organization, entity, or person applying the pesticide; and\n(2) the following language: \"This area chemically treated. Keep children and pets off until ...(date of safe entry)...\" or a universally accepted symbol and text approved by the commissioner that is recognized as having the same meaning or intent as specified in this paragraph. The warning sign may include the name of the pesticide used.\n(d) The warning sign must be posted on a lawn or yard between two feet and five feet from the sidewalk or street. For parks, golf courses, athletic fields, playgrounds, or other similar recreational property, the warning signs must be posted immediately adjacent to areas within the property where pesticides have been applied and at or near the entrances to the property.\n(a) A person may not apply or use a pollinator-lethal pesticide within the geographic boundaries of a city that has enacted an ordinance under subdivision 2 prohibiting such use.\n(b) For purposes of this subdivision, \"pollinator-lethal pesticide\" means a pesticide that has a pollinator protection box on the label or labeling or a pollinator, bee, or honey bee precautionary statement in the environmental hazards section of the label or labeling.\n(c) This subdivision does not apply to:\n(1) pet care products used to mitigate fleas, mites, ticks, heartworms, or other animals that are harmful to the health of a domesticated animal;\n(2) personal care products used to mitigate lice and bedbugs;\n(3) indoor pest control products used to mitigate insects indoors, including ant bait;\n(4) pesticides as used or applied by the Metropolitan Mosquito Control District for public health protection if the pesticide includes vector species on the label;\n(5) wood preservative pesticides used either within a sealed steel cylinder or inside an enclosed building at a secure facility by trained technicians and pesticide-treated wood products;\n(6) pesticides used or applied to control or eradicate a noxious weed designated by the commissioner under section 18.79, subdivision 13; and\n(7) pesticides used or applied on land used for agricultural production and located in an area zoned for agricultural use.\n(d) The commissioner must maintain a list of pollinator-lethal pesticides on the department's website.\n(e) The commissioner must consult with federal regulatory authorities to ensure this section and ordinances adopted under subdivision 2, paragraph (b), comply with federal law. A city of the first class must consult with the commissioner before adopting an ordinance under subdivision 2, paragraph (b), to ensure that the proposed ordinance complies with state law.",
	"repealed": false
}