{
	"id": "138.661",
	"url": "https://www.revisor.mn.gov/statutes/cite/138.661",
	"title": "138.661 STATE HISTORIC SITE NETWORK.",
	"text": "Historic sites in section 138.662 constitute the state historic site network. The sites are significant state resources that the Minnesota Historical Society is preserving, developing, interpreting, and maintaining for public use, benefit, and access during open hours.\nThe Minnesota Historical Society shall exercise the administration and control of the sites in section 138.662 other than the Minnesota State Capitol, preserve their historic features, conduct archaeological investigations, establish necessary interpretive centers, and perform additional duties and services at the sites necessary to meet their educational mission. Ownership of the properties is either by the state or the Minnesota Historical Society. The Minnesota Historical Society may contract with existing state departments and agencies for materials and services, including utility services, necessary for the administration and maintenance of the sites listed in section 138.662. The authority of the commissioner of natural resources to administer and control the historic sites enumerated in section 138.662 is withdrawn, and is conferred upon the Minnesota Historical Society. The commissioner of natural resources shall continue to administer and control the state parks enumerated in this section excepting the portions designated as historic sites, the administration and control of which is by this section vested in the Minnesota Historical Society.\nThe criteria for selecting historic sites for the state historic site network is described in section 86A.05, subdivision 11, paragraph (b).\nHistoric sites in the state historic site network shall be developed and interpreted by the Minnesota Historical Society for public use and access with state appropriations or with other nonstate sources of funding designated for that purpose. Public use may be limited to a seasonal basis as determined by the Minnesota Historical Society.\nHistoric sites in the state historic site network shall be developed and operated in accordance with master plans as described in section 86A.09.",
	"repealed": false
}