{
	"id": "256R.54",
	"url": "https://www.revisor.mn.gov/statutes/cite/256R.54",
	"title": "256R.54 ANCILLARY SERVICES.",
	"text": "(a) The commissioner shall adopt rules under the Administrative Procedure Act to set the amount and method of payment for ancillary materials and services provided to recipients residing in nursing facilities. Payment for materials and services may be made to either the vendor of ancillary services pursuant to Minnesota Rules, parts 9505.0170 to 9505.0475, or to a nursing facility pursuant to Minnesota Rules, parts 9505.0170 to 9505.0475.\n(b) Payment for the same or similar service to a recipient shall not be made to both the nursing facility and the vendor. The commissioner shall ensure: (1) the avoidance of double payments through audits and adjustments to the nursing facility's annual cost report as required by section 256R.12, subdivisions 8 and 9; and (2) that charges and arrangements for ancillary materials and services are cost-effective and as would be incurred by a prudent and cost-conscious buyer.\n(c) Therapy services provided to a recipient must be medically necessary and appropriate to the medical condition of the recipient. If the vendor, nursing facility, or ordering physician, advanced practice registered nurse, or physician assistant cannot provide adequate medical necessity justification, as determined by the commissioner, the commissioner may recover or disallow the payment for the services and may require prior authorization for therapy services as a condition of payment or may impose administrative sanctions to limit the vendor, nursing facility, or ordering physician's, advanced practice registered nurse's, or physician assistant's participation in the medical assistance program. If the provider number of a nursing facility is used to bill services provided by a vendor of therapy services that is not related to the nursing facility by ownership, control, affiliation, or employment status, no withholding of payment shall be imposed against the nursing facility for services not medically necessary except for funds due the unrelated vendor of therapy services as provided in subdivision 5. For the purpose of this subdivision, no monetary recovery may be imposed against the nursing facility for funds paid to the unrelated vendor of therapy services as provided in subdivision 5, for services not medically necessary.\n(d) For purposes of this section and section 256R.12, subdivisions 8 and 9, therapy includes physical therapy, occupational therapy, speech therapy, audiology, and mental health services that are covered services according to Minnesota Rules, parts 9505.0170 to 9505.0475.\n(e) For purposes of this subdivision, \"ancillary services\" includes transportation defined as a covered service in section 256B.0625, subdivision 17.\nThe physical therapist, occupational therapist, speech therapist, mental health professional, or audiologist who provides or supervises the provision of therapy services, other than an initial evaluation, to a medical assistance recipient must certify in writing that the therapy's nature, scope, duration, and intensity are appropriate to the medical condition of the recipient every 30 days. The therapist's statement of certification must be maintained in the recipient's medical record together with the specific orders by the physician, advanced practice registered nurse, or physician assistant and the treatment plan. If the recipient's medical record does not include these documents, the commissioner may recover or disallow the payment for such services. If the therapist determines that the therapy's nature, scope, duration, or intensity is not appropriate to the medical condition of the recipient, the therapist must provide a statement to that effect in writing to the nursing facility for inclusion in the recipient's medical record. The commissioner shall make recommendations regarding the medical necessity of services provided.\nPayment for therapy services provided to nursing facility residents that are billed separate from nursing facility's payment rate or according to Minnesota Rules, parts 9505.0170 to 9505.0475, shall be subject to the requirements in this subdivision and subdivisions 4 to 8.\nThe practitioner invoice must include, in a format specified by the commissioner, the provider number of the nursing facility where the medical assistance recipient resides regardless of the service setting.\nNursing facilities that are related by ownership, control, affiliation, or employment status to the vendor of therapy services shall report, in a format specified by the commissioner, the revenues received during the reporting period for therapy services provided to residents of the nursing facility. The commissioner shall offset the revenues received during the reporting period for therapy services provided to residents of the nursing facility to the total payment rate of the nursing facility by dividing the amount of offset by the sum of the nursing facility's resident days. Except as specified in subdivisions 6 and 8, the amount of offset shall be the revenue in excess of 108 percent of the cost removed from the cost report resulting from the requirement of the commissioner to ensure the avoidance of double payments as determined by section 256R.12, subdivisions 8 and 9.\nNursing facilities shall limit charges in total to vendors of therapy services for renting space, equipment, or obtaining other services during the rate year to 108 percent of the annualized cost removed from the reporting period cost report resulting from the requirement of the commissioner to ensure the avoidance of double payments as determined by section 256R.12, subdivisions 8 and 9. If the arrangement for therapy services is changed so that a nursing facility is subject to this subdivision instead of subdivision 4, the cost that is used to determine rent must be adjusted to exclude the annualized costs for therapy services that are not provided in the rate year. The maximum charges to the vendors shall be based on the commissioner's determination of annualized cost and may be subsequently adjusted upon resolution of appeals.\nThe commissioner shall require reporting of all revenues relating to the provision of therapy services and shall establish a therapy cost, as determined by section 256R.12, subdivisions 8 and 9, to revenue ratio for the reporting period ending in 1986. For subsequent reporting periods the ratio may increase five percentage points in total until a new base year is established under subdivision 7. Increases in excess of five percentage points may be allowed if adequate justification is provided to and accepted by the commissioner. Unless an exception is allowed by the commissioner, the amount of offset in subdivision 4 is the greater of the amount determined in subdivision 4 or the amount of offset that is imputed based on one minus the lesser of (1) the actual reporting period ratio or (2) the base reporting period ratio increased by five percentage points, multiplied by the revenues.\nThe commissioner may establish a new base reporting period for determining the cost to revenue ratio.\nIf the arrangement for therapy services is changed so that a nursing facility is subject to the provisions of subdivision 4 instead of subdivision 5, an average cost to revenue ratio based on the ratios of nursing facilities that are subject to the provisions of subdivision 4 shall be imputed for subdivision 6.\nThis section does not allow unrelated nursing facilities to reorganize related organization therapy services and provide services among themselves to avoid offsetting revenues. Nursing facilities that are found to be in violation of this provision are subject to the penalty requirements of section 256R.04, subdivision 5.",
	"repealed": false
}