{
	"id": "144.551",
	"url": "https://www.revisor.mn.gov/statutes/cite/144.551",
	"title": "144.551 HOSPITAL CONSTRUCTION MORATORIUM.",
	"text": "(a) The following construction or modification may not be commenced:\n(1) any erection, building, alteration, reconstruction, modernization, improvement, extension, lease, or other acquisition by or on behalf of a hospital that increases the bed capacity of a hospital, relocates hospital beds from one physical facility, complex, or site to another, or otherwise results in an increase or redistribution of hospital beds within the state; and\n(2) the establishment of a new hospital.\n(b) This section does not apply to:\n(1) construction or relocation within a county by a hospital, clinic, or other health care facility that is a national referral center engaged in substantial programs of patient care, medical research, and medical education meeting state and national needs that receives more than 40 percent of its patients from outside the state of Minnesota;\n(2) a project for construction or modification for which a health care facility held an approved certificate of need on May 1, 1984, regardless of the date of expiration of the certificate;\n(3) a project for which a certificate of need was denied before July 1, 1990, if a timely appeal results in an order reversing the denial;\n(4) a project exempted from certificate of need requirements by Laws 1981, chapter 200, section 2;\n(5) a project involving consolidation of pediatric specialty hospital services within the Minneapolis-St. Paul metropolitan area that would not result in a net increase in the number of pediatric specialty hospital beds among the hospitals being consolidated;\n(6) a project involving the temporary relocation of pediatric-orthopedic hospital beds to an existing licensed hospital that will allow for the reconstruction of a new philanthropic, pediatric-orthopedic hospital on an existing site and that will not result in a net increase in the number of hospital beds. Upon completion of the reconstruction, the licenses of both hospitals must be reinstated at the capacity that existed on each site before the relocation;\n(7) the relocation or redistribution of hospital beds within a hospital building or identifiable complex of buildings provided the relocation or redistribution does not result in: (i) an increase in the overall bed capacity at that site; (ii) relocation of hospital beds from one physical site or complex to another; or (iii) redistribution of hospital beds within the state or a region of the state;\n(8) relocation or redistribution of hospital beds within a hospital corporate system that involves the transfer of beds from a closed facility site or complex to an existing site or complex provided that: (i) no more than 50 percent of the capacity of the closed facility is transferred; (ii) the capacity of the site or complex to which the beds are transferred does not increase by more than 50 percent; (iii) the beds are not transferred outside of a federal health systems agency boundary in place on July 1, 1983; (iv) the relocation or redistribution does not involve the construction of a new hospital building; and (v) the transferred beds are used first to replace within the hospital corporate system the total number of beds previously used in the closed facility site or complex for mental health services and substance use disorder services. Only after the hospital corporate system has fulfilled the requirements of this item may the remainder of the available capacity of the closed facility site or complex be transferred for any other purpose;\n(9) a construction project involving up to 35 new beds in a psychiatric hospital in Rice County that primarily serves adolescents and that receives more than 70 percent of its patients from outside the state of Minnesota;\n(10) a project to replace a hospital or hospitals with a combined licensed capacity of 130 beds or less if: (i) the new hospital site is located within five miles of the current site; and (ii) the total licensed capacity of the replacement hospital, either at the time of construction of the initial building or as the result of future expansion, will not exceed 100 licensed hospital beds, or the combined licensed capacity of the hospitals, whichever is less;\n(11) the relocation of licensed hospital beds from an existing state facility operated by the Direct Care and Treatment executive board to a new or existing facility, building, or complex operated by the Direct Care and Treatment executive board; from one regional treatment center site to another; or from one building or site to a new or existing building or site on the same campus;\n(12) the construction or relocation of hospital beds operated by a hospital having a statutory obligation to provide hospital and medical services for the indigent that does not result in a net increase in the number of hospital beds, notwithstanding section 144.552, 27 beds, of which 12 serve mental health needs, may be transferred from Hennepin County Medical Center to Regions Hospital under this clause;\n(13) a construction project involving the addition of up to 31 new beds in an existing nonfederal hospital in Beltrami County;\n(14) a construction project involving the addition of up to eight new beds in an existing nonfederal hospital in Otter Tail County with 100 licensed acute care beds;\n(15) a construction project involving the addition of 20 new hospital beds in an existing hospital in Carver County serving the southwest suburban metropolitan area;\n(16) a project for the construction or relocation of up to 20 hospital beds for the operation of up to two psychiatric facilities or units for children provided that the operation of the facilities or units have received the approval of the commissioner of human services;\n(17) a project involving the addition of 14 new hospital beds to be used for rehabilitation services in an existing hospital in Itasca County;\n(18) a project to add 20 licensed beds in existing space at a hospital in Hennepin County that closed 20 rehabilitation beds in 2002, provided that the beds are used only for rehabilitation in the hospital's current rehabilitation building. If the beds are used for another purpose or moved to another location, the hospital's licensed capacity is reduced by 20 beds;\n(19) a critical access hospital established under section 144.1483, clause (9), and section 1820 of the federal Social Security Act, United States Code, title 42, section 1395i-4, that delicensed beds since enactment of the Balanced Budget Act of 1997, Public Law 105-33, to the extent that the critical access hospital does not seek to exceed the maximum number of beds permitted such hospital under federal law;\n(20) notwithstanding section 144.552, a project for the construction of a new hospital in the city of Maple Grove with a licensed capacity of up to 300 beds provided that:\n(i) the project, including each hospital or health system that will own or control the entity that will hold the new hospital license, is approved by a resolution of the Maple Grove City Council as of March 1, 2006;\n(ii) the entity that will hold the new hospital license will be owned or controlled by one or more not-for-profit hospitals or health systems that have previously submitted a plan or plans for a project in Maple Grove as required under section 144.552, and the plan or plans have been found to be in the public interest by the commissioner of health as of April 1, 2005;\n(iii) the new hospital's initial inpatient services must include, but are not limited to, medical and surgical services, obstetrical and gynecological services, intensive care services, orthopedic services, pediatric services, noninvasive cardiac diagnostics, behavioral health services, and emergency room services;\n(iv) the new hospital:\n(A) will have the ability to provide and staff sufficient new beds to meet the growing needs of the Maple Grove service area and the surrounding communities currently being served by the hospital or health system that will own or control the entity that will hold the new hospital license;\n(B) will provide uncompensated care;\n(C) will provide mental health services, including inpatient beds;\n(D) will be a site for workforce development for a broad spectrum of health-care-related occupations and have a commitment to providing clinical training programs for physicians and other health care providers;\n(E) will demonstrate a commitment to quality care and patient safety;\n(F) will have an electronic medical records system, including physician order entry;\n(G) will provide a broad range of senior services;\n(H) will provide emergency medical services that will coordinate care with regional providers of trauma services and licensed emergency ambulance services in order to enhance the continuity of care for emergency medical patients; and\n(I) will be completed by December 31, 2009, unless delayed by circumstances beyond the control of the entity holding the new hospital license; and\n(v) as of 30 days following submission of a written plan, the commissioner of health has not determined that the hospitals or health systems that will own or control the entity that will hold the new hospital license are unable to meet the criteria of this clause;\n(21) a project approved under section 144.553;\n(22) a project for the construction of a hospital with up to 25 beds in Cass County within a 20-mile radius of the state Ah-Gwah-Ching facility, provided the hospital's license holder is approved by the Cass County Board;\n(23) a project for an acute care hospital in Fergus Falls that will increase the bed capacity from 108 to 110 beds by increasing the rehabilitation bed capacity from 14 to 16 and closing a separately licensed 13-bed skilled nursing facility;\n(24) notwithstanding section 144.552, a project for the construction and expansion of a specialty psychiatric hospital in Hennepin County for up to 50 beds, exclusively for patients who are under 21 years of age on the date of admission. The commissioner conducted a public interest review of the mental health needs of Minnesota and the Twin Cities metropolitan area in 2008. No further public interest review shall be conducted for the construction or expansion project under this clause;\n(25) a project for a 16-bed psychiatric hospital in the city of Thief River Falls, if the commissioner finds the project is in the public interest after the public interest review conducted under section 144.552 is complete;\n(26)(i) a project for a 20-bed psychiatric hospital, within an existing facility in the city of Maple Grove, exclusively for patients who are under 21 years of age on the date of admission, if the commissioner finds the project is in the public interest after the public interest review conducted under section 144.552 is complete;\n(ii) this project shall serve patients in the continuing care benefit program under section 256.9693. The project may also serve patients not in the continuing care benefit program; and\n(iii) if the project ceases to participate in the continuing care benefit program, the commissioner must complete a subsequent public interest review under section 144.552. If the project is found not to be in the public interest, the license must be terminated six months from the date of that finding. If the commissioner of human services terminates the contract without cause or reduces per diem payment rates for patients under the continuing care benefit program below the rates in effect for services provided on December 31, 2015, the project may cease to participate in the continuing care benefit program and continue to operate without a subsequent public interest review;\n(27) a project involving the addition of 21 new beds in an existing psychiatric hospital in Hennepin County that is exclusively for patients who are under 21 years of age on the date of admission;\n(28) a project to add 55 licensed beds in an existing safety net, level I trauma center hospital in Ramsey County as designated under section 383A.91, subdivision 5, of which 15 beds are to be used for inpatient mental health and 40 are to be used for other services. In addition, five unlicensed observation mental health beds shall be added;\n(29) upon submission of a plan to the commissioner for public interest review under section 144.552 and the addition of the 15 inpatient mental health beds specified in clause (28), to its bed capacity, a project to add 45 licensed beds in an existing safety net, level I trauma center hospital in Ramsey County as designated under section 383A.91, subdivision 5. Five of the 45 additional beds authorized under this clause must be designated for use for inpatient mental health and must be added to the hospital's bed capacity before the remaining 40 beds are added. Notwithstanding section 144.552, the hospital may add licensed beds under this clause prior to completion of the public interest review, provided the hospital submits its plan by the 2021 deadline and adheres to the timelines for the public interest review described in section 144.552;\n(30) upon submission of a plan to the commissioner for public interest review under section 144.552, a project to add up to 30 licensed beds in an existing psychiatric hospital in Hennepin County that exclusively provides care to patients who are under 21 years of age on the date of admission. Notwithstanding section 144.552, the psychiatric hospital may add licensed beds under this clause prior to completion of the public interest review, provided the hospital submits its plan by the 2021 deadline and adheres to the timelines for the public interest review described in section 144.552;\n(31) any project to add licensed beds in a hospital located in Cook County or Mahnomen County that: (i) is designated as a critical access hospital under section 144.1483, clause (9), and United States Code, title 42, section 1395i-4; (ii) has a licensed bed capacity of fewer than 25 beds; and (iii) has an attached nursing home, so long as the total number of licensed beds in the hospital after the bed addition does not exceed 25 beds. Notwithstanding section 144.552, a public interest review is not required for a project authorized under this clause;\n(32) upon submission of a plan to the commissioner for public interest review under section 144.552, a project to add 22 licensed beds at a Minnesota freestanding children's hospital in St. Paul that is part of an independent pediatric health system with freestanding inpatient hospitals located in Minneapolis and St. Paul. The beds shall be utilized for pediatric inpatient behavioral health services. Notwithstanding section 144.552, the hospital may add licensed beds under this clause prior to completion of the public interest review, provided the hospital submits its plan by the 2022 deadline and adheres to the timelines for the public interest review described in section 144.552;\n(33) a project for a 144-bed psychiatric hospital on the site of the former Bethesda hospital in the city of Saint Paul, Ramsey County, if the commissioner finds the project is in the public interest after the public interest review conducted under section 144.552 is complete. Following the completion of the construction project, the commissioner of health shall monitor the hospital, including by assessing the hospital's case mix and payer mix, patient transfers, and patient diversions. The hospital must have an intake and assessment area. The hospital must accommodate patients with acute mental health needs, whether they walk up to the facility, are delivered by ambulances or law enforcement, or are transferred from other facilities. The hospital must comply with subdivision 1a, paragraph (b). The hospital must annually submit de-identified data to the department in the format and manner defined by the commissioner; or\n(34) a project involving the relocation of up to 26 licensed long-term acute care hospital beds from an existing long-term care hospital located in Hennepin County with a licensed capacity prior to the relocation of 92 beds to dedicated space on the campus of an existing safety net, level I trauma center hospital in Ramsey County as designated under section 383A.91, subdivision 5, provided both the commissioner finds the project is in the public interest after the public interest review conducted under section 144.552 is complete and the relocated beds continue to be used as long-term acute care hospital beds after the relocation.\n(a) From August 1, 2022, to July 31, 2027, subdivision 1, paragraph (a), and sections 144.552 and 144.553, do not apply to:\n(1) those portions of any erection, building, alteration, reconstruction, modernization, improvement, extension, lease, or other acquisition by or on behalf of a hospital that increase the mental health bed capacity of a hospital; or\n(2) the establishment of a new psychiatric hospital.\n(b) Any hospital that increases its bed capacity or is established under this subdivision must:\n(1) use all the newly licensed beds exclusively for mental health services;\n(2) accept medical assistance and MinnesotaCare enrollees;\n(3) abide by the terms of the Minnesota Attorney General Hospital Agreement;\n(4) have an arrangement with a tertiary care facility or a sufficient number of medical specialists to determine and arrange appropriate treatment of medical conditions; and\n(5) submit to the commissioner requested information the commissioner deems necessary for the commissioner to conduct the study of inpatient mental health access and quality described in paragraph (e).\n(c) The commissioner shall monitor the implementation of exceptions under this subdivision. Each hospital or hospital corporate system granted an exception under this subdivision shall submit to the commissioner each year a report on how the hospital or hospital corporate system continues to satisfy the conditions on which the exception was granted.\n(d) Any hospital found to be in violation of this subdivision is subject to sanction under section 144.55, subdivision 6, paragraph (c).\n(e) By January 15, 2027, the commissioner of health shall submit to the chairs and ranking minority members of the legislative committees and divisions with jurisdiction over health a report containing the result of a study of inpatient mental health access and quality. The report must contain:\n(1) the location of every hospital that has expanded its capacity or been established under this subdivision;\n(2) summary data by location of the patient population served in the newly licensed beds, including age, duration of stay, and county of residence; and\n(3) an analysis of the change in access and quality of inpatient mental health care in Minnesota resulting from the enactment of this subdivision.\nA hospital that expands its capacity or is established under this subdivision must provide the information and data the commissioner requests to fulfill the requirements of this paragraph. For the purposes of section 144.55, subdivision 6, paragraph (c), a hospital's failure to provide data requested by the commissioner is a failure to satisfy the conditions on which an exception is granted under this subdivision.\n(f) The commissioner may request from other hospitals information that the commissioner deems necessary to perform the analysis required under paragraph (e).\n(g) No psychiatric hospital may be established on the site of the former Bethesda hospital in Saint Paul, Ramsey County, unless the commissioner determines that establishment of the hospital is in the public interest after completing a public interest review under section 144.552.\nThe commissioner shall grant an emergency waiver from the provisions of this section if the need for the project is a result of fire, tornado, flood, storm damage, or other similar disaster, if adequate health care facilities are not available for the people who previously used the applicant facility, and if the request for an emergency waiver is limited in nature and scope only to those repairs necessitated by the natural disaster.\nThe district court in Ramsey County has jurisdiction to enjoin an alleged violation of subdivision 1. At the request of the commissioner of health, the attorney general may bring an action to enjoin an alleged violation. The commissioner of health shall not issue a license for any portion of a hospital in violation of subdivision 1. No hospital in violation of subdivision 1 may apply for or receive public funds under chapters 245 to 256B, or from any other source.\nExcept as indicated in this subdivision, the terms used in this section have the meanings given them under Minnesota Statutes 1982, sections 145.832 to 145.845, and the rules adopted under those sections.\nThe term \"hospital\" has the meaning given it in section 144.50.",
	"repealed": false
}