{
	"id": "298.01",
	"url": "https://www.revisor.mn.gov/statutes/cite/298.01",
	"title": "298.01 MINING OR PRODUCING ORES.",
	"text": "[Repealed, 1987 c 268 art 9 s 43]\n[Repealed, 1985 c 300 s 30]\nEvery person engaged in the business of mining, refining, or producing ores, metals, or minerals in this state, except iron ore or taconite concentrates, shall pay an occupation tax to the state of Minnesota as provided in this subdivision. For purposes of this subdivision, mining includes the application of hydrometallurgical processes. Hydrometallurgical processes are processes that extract the ores, metals, or minerals, by use of aqueous solutions that leach, concentrate, and recover the ore, metal, or mineral. The tax is determined in the same manner as the tax imposed by section 290.02, except that sections 290.05, subdivision 1, clause (a), 290.17, subdivision 4, and 290.191, subdivision 2, do not apply, and the occupation tax must be computed by applying to taxable income the rate of 2.45 percent.\nThe tax is in addition to all other taxes.\n(a) For purposes of determining a person's taxable income under subdivision 3, gross income is determined by the amount of gross proceeds from mining in this state under section 298.016 and includes any gain or loss recognized from the sale or disposition of assets used in the business in this state. If more than one ore, mineral, or metal referred to in section 298.016 is mined and processed at the same mine and plant, a gross income for each ore, mineral, or metal must be determined separately. The gross incomes may be combined on one occupation tax return to arrive at the gross income of all production.\n(b) In applying section 290.191, subdivision 5, transfers of ores, metals, or minerals that are subject to tax under this chapter are deemed to be sales in this state.\n(a) For purposes of determining taxable income under subdivision 3, the deductions from gross income include only those expenses necessary to convert raw ores to marketable quality. Such expenses include costs associated with refinement but do not include expenses such as transportation, stockpiling, marketing, or marine insurance that are incurred after marketable ores are produced, unless the expenses are included in gross income. The allowable deductions from a mine or plant that mines and produces more than one mineral, metal, or energy resource must be determined separately for the purposes of computing the deduction in section 290.0133, subdivision 9. These deductions may be combined on one occupation tax return to arrive at the deduction from gross income for all production.\n(b) The provisions of sections 290.0133, subdivisions 7 and 9, and 290.0134, subdivisions 7 and 9, are not used to determine taxable income.\n[Repealed, 2006 c 259 art 12 s 17]\n[Repealed, 2006 c 259 art 12 s 17]\nA person engaged in the business of mining or producing of iron ore, taconite concentrates or direct reduced ore in this state shall pay an occupation tax to the state of Minnesota. The tax is determined in the same manner as the tax imposed by section 290.02, except that sections 290.05, subdivision 1, clause (a), 290.17, subdivision 4, and 290.191, subdivision 2, do not apply, and the occupation tax shall be computed by applying to taxable income the rate of 2.45 percent.\nThe tax is in addition to all other taxes.\n(a) For purposes of determining a person's taxable income under subdivision 4, gross income is determined by the mine value of the ore mined in Minnesota and includes any gain or loss recognized from the sale or disposition of assets used in the business in this state.\n(b) Mine value is the value, or selling price, of iron ore or taconite concentrates, f.o.b. mine. The mine value is calculated by multiplying the iron unit price for the period, as determined by the commissioner, by the tons produced and the weighted average analysis.\n(c) In applying section 290.191, subdivision 5, transfers of iron ore and taconite concentrates are deemed to be sales in this state.\n(d) If iron ore or taconite and a mineral, metal, or energy resource referred to in section 298.016 is mined and processed at the same mine and plant, a gross income for each mineral, metal, or energy resource must be determined separately from the mine value for the iron ore or taconite. The gross income may be combined on one occupation tax return to arrive at the gross income from all production.\nFor purposes of determining taxable income under subdivision 4, the deductions from gross income include only those expenses necessary to convert raw iron ore or taconite concentrates to marketable quality. Such expenses include costs associated with beneficiation and refinement but do not include expenses such as transportation, stockpiling, marketing, or marine insurance that are incurred after marketable iron ore or taconite pellets are produced. The allowable deductions from a mine or plant that mines and produces iron ore or taconite and one or more mineral or metal referred to in section 298.016 must be determined separately for the purposes of computing the deduction in section 290.0133, subdivision 9. These deductions may be combined on one occupation tax return to arrive at the deduction from gross income for all production.\nFor purposes of determining taxable income under subdivision 4, the provisions of sections 290.0133, subdivisions 7 and 9, and 290.0134, subdivisions 7 and 9, are not used to determine taxable income.\n[Repealed, 2006 c 259 art 12 s 17]\n[Repealed, 2006 c 259 art 12 s 17]\nIf the taxes imposed in subdivisions 3 and 4 are found unconstitutional by any court of last resort, then persons engaged in the business of mining or producing iron ore or other ores shall pay the occupation taxes imposed in Minnesota Statutes 1986, chapter 298.\nIf a person is engaged in the business of mining or producing both iron ores, taconite concentrates, or direct reduced ore, and other ores from the same mine or facility, that person must separately determine the mine value of (1) the iron ore, taconite concentrates, and direct reduced ore, and (2) the amount of gross proceeds from mining other ores in Minnesota. The ratio of mine value from iron ore, taconite concentrates, and direct reduced ore to gross proceeds from mining other ores must be applied to deductions common to both processes to determine taxable income for tax paid pursuant to subdivisions 3 and 4.",
	"repealed": false
}