{
	"id": "256B.037",
	"url": "https://www.revisor.mn.gov/statutes/cite/256B.037",
	"title": "256B.037 PROSPECTIVE PAYMENT OF DENTAL SERVICES.",
	"text": "The commissioner may conduct a demonstration project to contract, on a prospective per capita payment basis, with an organization or organizations licensed under chapter 62C, 62D, or 62N for the provision of all dental care services beginning July 1, 1994, under the medical assistance and MinnesotaCare programs, or when necessary waivers are granted by the secretary of health and human services, whichever occurs later. The commissioner shall identify a geographic area or areas, including both urban and rural areas, where access to dental services has been inadequate, in which to conduct demonstration projects. The commissioner shall seek any federal waivers or approvals necessary to implement this section from the secretary of health and human services.\nThe commissioner may exclude from participation in the demonstration project any or all groups currently excluded from participation in the prepaid medical assistance program under section 256B.69. Except for persons excluded from participation in the demonstration project, all persons who have been determined eligible for medical assistance and, if applicable, MinnesotaCare and reside in the designated geographic areas are required to enroll in a dental plan to receive their dental care services. Except for emergency services or out-of-plan services authorized by the dental plan, recipients must receive their dental services from dental care providers who are part of the dental plan provider network.\nThe commissioner shall select either multiple dental plans or a single dental plan in a designated area. A dental plan under contract with the department must serve medical assistance recipients in a designated geographic area and may serve MinnesotaCare recipients. The commissioner may limit the number of dental plans with which the department contracts within a designated geographic area, taking into consideration the number of recipients within the designated geographic area; the number of potential dental plan contractors; the size of the provider network offered by dental plans; the dental care services offered by a dental plan; qualifications of dental plan personnel; accessibility of services to recipients; dental plan assurances of recipient confidentiality; dental plan marketing and enrollment activities; dental plan compliance with this section; dental plan performance under other contracts with the department to serve medical assistance or MinnesotaCare recipients; or any other factors necessary to provide the most economical care consistent with high standards of dental care.\nFor purposes of this section, \"dental plan\" means an organization licensed under chapter 62C, 62D, or 62N that contracts with the department to provide covered dental care services to recipients on a prepaid capitation basis. \"Emergency services\" has the meaning given in section 256B.0625, subdivision 4. \"Multiple dental plan area\" means a designated area in which more than one dental plan is offered. \"Participating provider\" means a dentist or dental clinic who is employed by or under contract with a dental plan to provide dental care services to recipients. \"Single dental plan area\" means a designated area in which only one dental plan is available.\nAfter the department has executed contracts with dental plans to provide covered dental care services in a multiple dental plan area, the department shall:\n(1) inform applicants and recipients, in writing, of available dental plans, when written notice of dental plan selection must be submitted to the department, and when dental plan participation begins;\n(2) assign to a dental plan recipients who fail to notify the department in writing of their dental plan choice; and\n(3) notify recipients, in writing, of their assigned dental plan before the effective date of the recipient's dental plan participation.\nAfter the department has executed a contract with a dental plan to provide covered dental care services as the sole dental plan in a geographic area, the provisions in paragraphs (a) to (c) apply.\n(a) The department shall assure that applicants and recipients are informed, in writing, of participating providers in the dental plan and when dental plan participation begins.\n(b) The dental plan may require the recipient to select a specific dentist or dental clinic and may assign to a specific dentist or dental clinic recipients who fail to notify the dental plan of their selection.\n(c) The dental plan shall notify recipients in writing of their assigned providers before the effective date of dental plan participation.\n(a) In multiple dental plan areas, recipients may change dental plans once within the first year the recipient participates in a dental plan. After the first year of dental plan participation, recipients may change dental plans during the annual 30-day open enrollment period.\n(b) In single dental plan areas, recipients may change their specific dentist or clinic at least once during the first year of dental plan participation. After the first year of dental plan participation, recipients may change their specific dentist or clinic at least once annually. The dental plan shall notify recipients of this change option.\n(c) If a dental plan's contract with the department is terminated for any reason, recipients in that dental plan shall select a new dental plan and may change dental plans or a specific dentist or clinic within the first 60 days of participation in the second dental plan.\n(d) Recipients may change dental plans or a specific dentist or clinic at any time as follows:\n(1) in multiple dental plan areas, if the travel time from the recipient's residence to a general practice dentist is over 30 minutes, the recipient may change dental plans;\n(2) in single dental plan areas, if the travel time from the recipient's residence to the recipient's specific dentist or clinic is over 30 minutes, the recipient may change providers; or\n(3) if the recipient's dental plan or specific dentist or clinic was incorrectly designated due to department or dental plan error.\n(e) Requests for change under this subdivision must be submitted to the department or dental plan in writing. The department or dental plan shall notify recipients whether the request is approved or denied within 30 days after receipt of the written request.\nThe commissioner shall consult with an independent actuary to establish prepayment rates, but shall retain final authority over the methodology used to establish the rates. The prepayment rates shall not result in payments that exceed the per capita expenditures that would have been made for dental services by the programs under a fee-for-service reimbursement system. The package of dental benefits provided to individuals under this subdivision shall not be less than the package of benefits provided under the medical assistance fee-for-service reimbursement system for dental services.\nAll recipients of services under this section have the right to appeal to the commissioner under section 256.045. A recipient participating in a dental plan may utilize the dental plan's internal complaint procedure but is not required to exhaust the internal complaint procedure before appealing to the commissioner. The appeal rights and procedures in Minnesota Rules, part 9500.1463, apply to recipients who enroll in dental plans.\nA contractor shall submit encounter-specific information as required by the commissioner, including, but not limited to, information required for assessing client satisfaction, quality of care, and cost and utilization of services. Dental plans and participating providers must provide the commissioner access to recipient dental records to monitor compliance with the requirements of this section.\nNothing in this section prohibits the commissioner from contracting with an organization for comprehensive health services, including dental services, under section 256B.035 or 256B.69.\nA dental plan and its participating providers or nonparticipating providers who provide emergency services or services authorized by the dental plan shall not charge recipients for any costs for covered services.\nA dental plan is accountable to the commissioner for the fiscal management of covered dental care services. The state of Minnesota and recipients shall be held harmless for the payment of obligations incurred by a dental plan if the dental plan or a participating provider becomes insolvent and the department has made the payments due to the dental plan under the contract.\nA dental plan shall have an internal quality improvement system. A dental plan shall permit the commissioner or the commissioner's agents to evaluate the quality, appropriateness, and timeliness of covered dental care services through inspections, site visits, and review of dental records.\nTo the extent required under section 62A.046 and Minnesota Rules, part 9506.0080, a dental plan shall coordinate benefits for or recover the cost of dental care services provided recipients who have other dental care coverage. Coordination of benefits includes the dental plan paying applicable co-payments or deductibles on behalf of a recipient.\nA dental plan shall demonstrate that its financial risk capacity is acceptable to its participating providers; except, an organization licensed as a health maintenance organization under chapter 62D, a nonprofit health service plan under chapter 62C, or a community integrated service network under chapter 62N, is not required to demonstrate financial risk capacity beyond the requirements in those chapters for licensure or a certificate of authority.\nThe contract between the commissioner and the dental plan must specify that the dental plan is an agent of the welfare system and shall have access to welfare data on recipients to the extent necessary to carry out the dental plan's responsibilities under the contract. The dental plan shall comply with chapter 13, the Minnesota Government Data Practices Act.",
	"repealed": false
}