{
	"id": "3.303",
	"url": "https://www.revisor.mn.gov/statutes/cite/3.303",
	"title": "3.303 LEGISLATIVE COORDINATING COMMISSION; CREATION AND ORGANIZATION; STAFF; DUTIES.",
	"text": "The Legislative Coordinating Commission is created to coordinate the legislative activities of the senate and house of representatives and the joint legislative commissions, committees, offices, and task forces.\nThe commission consists of the majority leader of the senate, the president of the senate, two senators appointed by the majority leader, the minority leader of the senate, and one senator appointed by the minority leader; and the majority leader of the house of representatives, the speaker of the house, two representatives appointed by the speaker, the minority leader of the house of representatives, and one representative appointed by the minority leader. Each member shall serve until a successor is named during a regular session following appointment. A vacancy shall be filled for the unexpired term in the same manner as the original appointment.\nThe chair of the commission alternates between the president of the senate and the speaker of the house of representatives at the start of the regular legislative session in each odd-numbered year.\nThe members of the commission shall serve without compensation but be reimbursed in the same manner as members of standing committees of the senate and the house of representatives.\nThe commission shall represent the legislature and assist state agencies to make arrangements to accommodate and appropriately recognize individuals or groups visiting Minnesota as direct or indirect representatives of foreign governments, other states, or subdivisions or agencies of foreign governments or other states and to provide other services determined by the commission.\n(a) The commission may make grants, employ an executive director and other staff, and obtain office space, equipment, and supplies necessary to perform its duties.\n(b) The executive director may enter into contracts in compliance with section 3.225 to provide necessary services and supplies for the house of representatives and the senate, and for legislative commissions and joint legislative offices. A contract for professional or technical services that is valued at more than $50,000 may be made only after the executive director has consulted with the chair and vice-chair of the commission.\nThe commission shall study and report to the legislature on all matters relating to the economic status of women in Minnesota, including:\n(1) the contributions of women to the economy;\n(2) economic security of homemakers and women in the labor force;\n(3) opportunities for education and vocational training;\n(4) employment opportunities;\n(5) women's access to benefits and services provided to citizens of this state; and\n(6) laws and business practices constituting barriers to the full participation by women in the economy.\nThe commission shall also study the adequacy of programs and services relating to families in Minnesota. The commission shall communicate its findings and make recommendations to the legislature on an ongoing basis.\nMS 2010 [Expired, 2007 c 148 art 2 s 1; 2009 c 101 art 2 s 1]\nMS 2010 [Expired, 2007 c 148 art 2 s 2]\n(a) The Legislative Coordinating Commission shall develop and maintain a user-friendly, public-oriented website that informs, educates, and demonstrates to the public how the constitutionally dedicated funds in the arts and cultural heritage fund, outdoor heritage fund, clean water fund, parks and trails fund, and environment and natural resources trust fund are being expended to meet the requirements established for each fund in the state constitution. Information provided on the website must include, but is not limited to:\n(1) information on all project proposals received by the Outdoor Heritage Council and the Legislative-Citizen Commission on Minnesota Resources;\n(2) information on all projects receiving funding, including:\n(i) the name of the project and a project description;\n(ii) the name, telephone number, members of the board or equivalent governing body, and email address of the funding recipient and, when applicable, the website address where the public can directly access detailed information on the recipient's receipt and use of money for the project;\n(iii) the amount and source of funding, including the fiscal year of the appropriation;\n(iv) the amount and source of any additional funding or leverage;\n(v) the duration of the project;\n(vi) the number of full-time equivalents funded under the project. For the purposes of this item, \"full-time equivalent\" means a position directly attributed to the receipt of money from one or more of the funds covered under this section, calculated as the total number of hours planned for the position divided by 2,088;\n(vii) the direct expenses and administration costs of the project;\n(viii) proposed measurable outcomes and the plan for measuring and evaluating the results;\n(ix) for pass-through, noncompetitive grants, the entity acting as the fiscal agent or administering agency and a point of contact for additional information; and\n(x) for competitive grants, the name and a brief description of the qualifications of all board members or members of an equivalent governing body ultimately responsible for awarding the grants, as well as any grant-making advisory group. In addition, an entity that awards competitive grants, including but not limited to a state agency or any statewide, regional, or local organization, must report whether an employee, decision maker, advisory group member, or other person involved in the grant process disclosed a conflict of interest or potential conflict of interest. If the entity reports that a conflict of interest or potential conflict of interest was disclosed, the entity must provide the Legislative Coordinating Commission with a contact person for additional information and the Legislative Coordinating Commission must post this information on the website. An entity that awards competitive grants must obtain and apply the conflict of interest policies developed by the commissioner of administration under section 16B.98, subdivision 3, unless the entity maintains and applies its own documented conflict of interest policies which are substantially similar to the commissioner of administration's policies;\n(3) actual measured outcomes and evaluation of projects as required under sections 85.53, subdivision 2; 114D.50, subdivision 4; and 129D.17, subdivision 2;\n(4) education about the areas and issues the projects address, including, when feasible, maps of where projects have been undertaken;\n(5) all frameworks developed for future uses of each fund; and\n(6) methods by which members of the public may apply for project funds under any of the constitutionally dedicated funds.\nInformation that could be used to identify, contact, or locate an individual minor shall be withheld from the information required for the website.\n(b) As soon as practicable or by January 15 of the applicable fiscal year, whichever comes first, a state agency or other recipient of a direct appropriation from a fund covered under this section shall submit the information required under paragraph (a) and, when applicable, compile and submit the same information for any grant recipient or other subrecipient of funding. All information for proposed and funded projects, including the proposed measurable outcomes, must be made available on the website as soon as practicable. Information on the measured outcomes and evaluation must be posted as soon as it becomes available. The costs of these activities shall be paid out of the arts and cultural heritage fund, outdoor heritage fund, clean water fund, parks and trails fund, and the environment and natural resources trust fund proportionately. For purposes of this section, \"measurable outcomes\" means outcomes, indicators, or other performance measures that may be quantified or otherwise measured in order to measure the effectiveness of a project or program in meeting its intended goal or purpose.\nIf, in addition to providing the information directly to the website, an agency submits a formal report to the Legislative Coordinating Commission, the report must be submitted electronically.\n(c) The Legislative Coordinating Commission shall be responsible for receiving all ten-year plans and 25-year frameworks for each of the constitutionally dedicated funds. To the extent practicable, staff for the commission shall provide assistance and oversight to these planning efforts and shall coordinate public access to hearings and public meetings for all planning efforts.\nThe commission may accept gifts and grants for purposes related to the duties of the commission. Money received by the commission from gifts and grants is appropriated to the commission for purposes specified in the gift or grant.",
	"repealed": false
}