{
	"id": "151.26",
	"url": "https://www.revisor.mn.gov/statutes/cite/151.26",
	"title": "151.26 EXCEPTIONS.",
	"text": "Nothing in this chapter shall subject a person duly licensed in this state to practice medicine, dentistry, or veterinary medicine, to inspection by the State Board of Pharmacy, nor prevent the person from administering drugs, medicines, chemicals, or poisons in the person's practice, nor prevent a duly licensed practitioner from furnishing to a patient properly packaged and labeled drugs, medicines, chemicals, or poisons as may be considered appropriate in the treatment of such patient; unless the person is engaged in the dispensing, sale, or distribution of drugs and the board provides reasonable notice of an inspection.\nExcept for the provisions of section 151.37, nothing in this chapter applies to or interferes with the dispensing, in its original package and at no charge to the patient, of a legend drug that was packaged by a manufacturer and provided to the dispenser for dispensing as a professional sample. Samples of a controlled substance shall only be dispensed when one of the approved indications for the controlled substance is a seizure disorder and when the sample is prepared and distributed pursuant to Code of Federal Regulations, title 21, part 203, subpart D.\nNothing in this chapter shall prevent the sale of drugs, medicines, chemicals, or poisons at wholesale to licensed physicians, dentists and veterinarians for use in their practice, nor to hospitals for use therein.\nNothing in this chapter shall prevent the sale of drugs, chemicals, or poisons either at wholesale or retail for use for commercial purposes, or in the arts, nor interfere with the sale of insecticides, as defined in Minnesota Statutes 1974, section 24.069, and nothing in this chapter shall prevent the sale of common household preparations and other drugs, chemicals, and poisons sold exclusively for use for nonmedicinal purposes; provided that this exception does not apply to any compound, substance, or derivative that is not approved for human consumption by the United States Food and Drug Administration or specifically permitted for human consumption under Minnesota law, and, when introduced into the body, induces an effect similar to that of a Schedule I or Schedule II controlled substance listed in section 152.02, subdivisions 2 and 3, or Minnesota Rules, parts 6800.4210 and 6800.4220, regardless of whether the substance is marketed for the purpose of human consumption.\nNothing in this chapter shall apply to or interfere with the vending or retailing of any nonprescription medicine or drug not otherwise prohibited by statute that is prepackaged, fully prepared by the manufacturer or producer for use by the consumer, and labeled in accordance with the requirements of the state or federal Food and Drug Act; nor to the manufacture, wholesaling, vending, or retailing of flavoring extracts, toilet articles, cosmetics, perfumes, spices, and other commonly used household articles of a chemical nature, for use for nonmedicinal purposes; provided that this exception does not apply to any compound, substance, or derivative that is not approved for human consumption by the United States Food and Drug Administration or specifically permitted for human consumption under Minnesota law, and, when introduced into the body, induces an effect similar to that of a Schedule I or Schedule II controlled substance listed in section 152.02, subdivisions 2 and 3, or Minnesota Rules, parts 6800.4210 and 6800.4220, regardless of whether the substance is marketed for the purpose of human consumption. Nothing in this chapter shall prevent the sale of drugs or medicines by licensed pharmacists at a discount to persons over 65 years of age.\n[Repealed, 1973 c 639 s 11]",
	"repealed": false
}