{
	"id": "299A.2994",
	"url": "https://www.revisor.mn.gov/statutes/cite/299A.2994",
	"title": "299A.2994 ASIAN-AMERICAN JUVENILE CRIME PREVENTION.",
	"text": "The commissioner of public safety shall establish a grant program for coordinated, family-based crime intervention and prevention services for Asian-American youth. The commissioners of human services, education, and public safety shall work together to coordinate grant activities.\nThe commissioner, in consultation with the Asian-Pacific Council, shall award grants in amounts up to $150,000 to agencies based in the Asian-American community that have experience providing coordinated, family-based community services to Asian-American youth and families.\nProjects eligible for grants under this section must provide coordinated crime intervention, prevention, and educational services that include:\n(1) education for Asian-American parents, including parenting methods in the United States and information about the United States legal and educational systems;\n(2) crime intervention and prevention programs for Asian-American youth, including employment and career-related programs and guidance and counseling services;\n(3) family-based services, including support networks, language classes, programs to promote parent-child communication, access to education and career resources, and conferences for Asian-American children and parents;\n(4) coordination with public and private agencies to improve communication between the Asian-American community and the community at large; and\n(5) hiring staff to implement the services in clauses (1) to (4).\nGrant money awarded under this section may be used to satisfy any state or local match requirement that must be satisfied in order to receive federal funds.\nGrant recipients must report to the commissioner by June 30 of each year on the services and programs provided, expenditures of grant money, and an evaluation of the program's success in reducing crime among Asian-American youth.",
	"repealed": false
}