{
	"id": "359.01",
	"url": "https://www.revisor.mn.gov/statutes/cite/359.01",
	"title": "359.01 COMMISSION.",
	"text": "The governor may appoint and commission as notaries public, by and with the advice and consent of the senate, as many citizens of this state or resident aliens, over the age of 18 years, as the governor considers necessary. The governor will appoint and commission notaries public and the secretary of state shall receive applications for appointments and commissions, shall keep a register of those persons appointed and commissioned as notaries public by the governor with the advice and consent of the senate, shall update that register when informed of a change in name and address by a notary public, shall process applications by a notary public for reappointment, shall receive fees for the performance of these functions to be deposited into the general fund, and shall perform those clerical and administrative duties associated with these functions. The governor may also receive such applications directly.\n(a) The governor, by and with the advice and consent of the senate, may appoint as notary public a person who is not a resident of this state if:\n(1) the person is a resident of Wisconsin, Iowa, North Dakota, or South Dakota;\n(2) the person designates the secretary of state as agent for the service of process for all purposes relating to notarial acts and for receipt of all correspondence relating to notarial acts; and\n(3) the person designates the Minnesota county in which the person's notary commission will be recorded pursuant to section 359.061.\n(b) The secretary of state shall receive applications for nonresident notary appointments and commissions, shall keep a register of those persons appointed and commissioned as notaries public by the governor with the advice and consent of the senate, shall update that register when informed of a change in name and address by a notary public, shall process applications by a notary public for reappointment, shall receive fees for the performance of these functions to be deposited into the general fund, and shall perform those clerical and administrative duties associated with these functions. The governor may also receive such applications directly.\n(a) When making application for a commission the applicant must submit, along with the information required by the secretary of state, a nonrefundable fee of $120, which shall be forwarded by the secretary of state to the commissioner of management and budget to be deposited in the state treasury and credited to the general fund.\n(b) Except as otherwise provided in paragraph (a), all fees shall be retained by the secretary of state and are nonreturnable, except for an overpayment of a fee.\nThe secretary of state shall prepare the application form for a commission. The form may request personal information about the applicant, including, but not limited to, relevant civil litigation, occupational license history, and criminal background, if any. For the purposes of this section, \"criminal background\" includes, but is not limited to, criminal charges, arrests, indictments, pleas, and convictions. The form must also include an oath of office statement.\nBefore performing electronic notarial acts, a notary public shall register the capability to notarize electronically with the secretary of state. Unless terminated for any reason, the term of registration to perform electronic notarial acts begins on the registration starting date set by the secretary of state and continues as long as the notary public has a valid commission to perform notarial acts. The requirements of this chapter relating to electronic notarial acts do not apply to notarial acts performed under sections 358.15, paragraph (a), clause (4), and 358.60, subdivision 1, clause (2).\nA commission to act as a notary public authorizes the notary public to perform notarial acts. The commission does not provide the notary public any immunity or benefit conferred by law of this state on public officials or employees.",
	"repealed": false
}