{
	"id": "16B.355",
	"url": "https://www.revisor.mn.gov/statutes/cite/16B.355",
	"title": "16B.355 COOPERATIVE LOCAL FACILITIES GRANTS.",
	"text": "Within the limits of available appropriations, the commissioner shall make grants to counties, cities, towns, and school districts to acquire, construct, or renovate public land and buildings and other public improvements of a capital nature for cooperative facilities to be owned and operated by the grantees.\nA grant under this section may not be made until the commissioner has determined that at least 30 percent of the total project cost has been committed to the project from nonstate sources.\nNo more than one-third of the amount appropriated by any one appropriation act may be granted to any one project.\n(a) To be eligible to receive a grant, the grant application must be made to the commissioner on behalf of any combination of at least three counties, cities, towns, or school districts. The grant applicants must have entered into a joint powers agreement and formed a joint powers board under section 471.59 to govern the facilities. The joint powers board must approve the application by resolution.\n(b) The grant application must demonstrate that acquisition, construction, or renovation of the cooperative facilities will improve the delivery of services by the grant applicants and will generate savings to the applicants in operating their buildings and programs.\n(c) The commissioner shall prescribe and provide the application form. The application must include at least the following information:\n(1) identification of the facilities;\n(2) a plan for the facilities;\n(3) a description of how the facilities will improve the delivery of governmental services by the applicants;\n(4) a detailed estimate, along with necessary supporting evidence, of the total costs for the facilities;\n(5) an estimate of the dates when the facilities for which the grant is requested will be contracted for and completed;\n(6) a detailed estimate, along with necessary supporting evidence, of the savings in operating costs of buildings and programs that the project will generate;\n(7) the manner in which the applicants will meet the local match requirement; and\n(8) any additional information or material the commissioner prescribes.\nThe commissioner, in consultation with the commissioner of management and budget and the commissioners of other state departments, as appropriate, shall give priority to projects that demonstrate a significant increase in cooperation as measured by one or more of the following criteria:\n(1) improved quality, access, transparency, or level of service to citizens;\n(2) fundamental change in the organization of service delivery;\n(3) substantial savings in operating costs; or\n(4) positive return on investment over the life of the facility.\nAt least one-half of the money provided as grants each fiscal biennium must be for projects located outside the seven-county metropolitan area, as defined in section 473.121, subdivision 2.",
	"repealed": false
}