{
	"id": "167.50",
	"url": "https://www.revisor.mn.gov/statutes/cite/167.50",
	"title": "167.50 MINNESOTA TRUNK HIGHWAY BONDS.",
	"text": "For the purpose of providing money for trunk highway purposes, when authorized by law and requested by the commissioner of transportation, the commissioner of management and budget shall issue and sell bonds of the state of Minnesota, for the prompt payment of which, with the interest thereon, the full faith, credit, and taxing powers of the state are hereby irrevocably pledged. \"Trunk highway purposes\" shall include recreational vehicle usage and lanes. Such bonds shall be known as Minnesota trunk highway bonds. The proceeds thereof shall be credited to the trunk highway fund, except that accrued interest and any premium received upon sale of such bonds shall be credited to the state bond fund.\nThe bonds shall be issued and sold upon competitive bids after published notice. The bonds shall be issued and sold at the times and prices (not less than par and accrued interest), in the form and denominations, bearing interest at the rate or rates, maturing on dates, with or without option of prior redemption upon notice and at specified times and prices, payable at a bank or banks, within or without the state, with provisions for registration, conversion, and exchange and for the issuance of temporary bonds or notes in anticipation of the sale and delivery of definitive bonds, and in accordance with such further provisions, as the commissioner of management and budget may determine, subject to the approval of the attorney general (but not subject to the provisions of chapter 14, including 14.386). Each bond shall mature within 20 years from its date of issue and shall be executed by the commissioner of management and budget under official seal. The signature of the commissioner on the face of and any interest coupons appurtenant to any bond, and the seal may be printed, lithographed, stamped, engraved, or otherwise reproduced thereon, provided that the signature of one of the officers, or of an authorized representative of a corporate registrar or other agent designated by the commissioner of management and budget to authenticate the bonds, shall be manually subscribed on the face of each bond.\nThe commissioner of management and budget shall ascertain and certify to purchasers of the bonds the performance and existence of all acts, conditions, and things necessary to make them valid and binding general obligations of the state of Minnesota in accordance with their terms. Any act authorizing the issuance of bonds pursuant to this section shall, together with this section, constitute complete authority for such issue, and such bonds shall not be subject to the restrictions or limitations contained in any other law.\nAll expenses incidental to the sale, printing, execution, and delivery of state trunk highway bonds pursuant to this section, including, but not limited to, actual and necessary travel and subsistence expenses of state officers and employees for such purposes, shall be paid from the trunk highway fund, and the amounts necessary therefor are appropriated from said fund.",
	"repealed": false
}