{
	"id": "147C.15",
	"url": "https://www.revisor.mn.gov/statutes/cite/147C.15",
	"title": "147C.15 LICENSURE REQUIREMENTS.",
	"text": "To be eligible for a license, an applicant, with the exception of those seeking licensure by reciprocity under subdivision 2, must:\n(1) submit a completed application on forms provided by the board along with all fees required under section 147C.40 that includes:\n(i) the applicant's name, Social Security number, home address, email address, and telephone number, and business address and telephone number;\n(ii) the name and location of the respiratory therapy education program the applicant completed;\n(iii) a list of degrees received from educational institutions;\n(iv) a description of the applicant's professional training beyond the first degree received;\n(v) the applicant's work history for the five years preceding the application, including the average number of hours worked per week;\n(vi) a list of registrations, certifications, and licenses held in other jurisdictions;\n(vii) a description of any other jurisdiction's refusal to credential the applicant;\n(viii) a description of all professional disciplinary actions initiated against the applicant in any jurisdiction; and\n(ix) any history of drug or alcohol abuse, and any misdemeanor or felony conviction;\n(2) submit a certificate of completion from an approved education program;\n(3) achieve a qualifying score on a credentialing examination within five years prior to application for registration;\n(4) submit a verified copy of a valid and current credential, issued by the National Board for Respiratory Care or other board-approved national organization, as a certified respiratory therapist, registered respiratory therapist, or other entry or advanced level respiratory therapist designation;\n(5) submit additional information as requested by the board, including providing any additional information necessary to ensure that the applicant is able to practice with reasonable skill and safety to the public;\n(6) sign a statement that the information in the application is true and correct to the best of the applicant's knowledge and belief; and\n(7) sign a waiver authorizing the board to obtain access to the applicant's records in this or any other state in which the applicant has completed an approved education program or engaged in the practice of respiratory therapy.\nTo be eligible for licensure by reciprocity, the applicant must be credentialed by the National Board for Respiratory Care or other board-approved organization and have worked at least eight weeks of the previous five years as a respiratory therapist and must:\n(1) submit the application materials and fees as required by subdivision 1, clauses (1), (4), (5), (6), and (7);\n(2) provide a verified copy from the appropriate government body of a current and unrestricted credential or license for the practice of respiratory therapy in another jurisdiction that has initial credentialing requirements equivalent to or higher than the requirements in subdivision 1; and\n(3) provide letters of verification from the appropriate government body in each jurisdiction in which the applicant holds a credential or license. Each letter must state the applicant's name, date of birth, credential number, date of issuance, a statement regarding disciplinary actions, if any, taken against the applicant, and the terms under which the credential was issued.\nThe board may issue a temporary permit to practice as a respiratory therapist to an applicant eligible for licensure under this section if the application for licensure is complete, all applicable requirements in this section have been met, and a nonrefundable fee set by the board has been paid. The permit remains valid only until the meeting of the board at which a decision is made on the respiratory therapist's application for licensure.\nMS 2008 [Repealed by amendment, 2009 c 142 art 2 s 4]\nMS 2008 [Repealed by amendment, 2009 c 142 art 2 s 4]\nLicenses issued under this chapter expire annually.\n(a) To be eligible for license renewal a licensee must:\n(1) annually, or as determined by the board, complete a renewal application on a form provided by the board;\n(2) submit the renewal fee;\n(3) provide evidence every two years of a total of 24 hours of continuing education approved by the board as described in section 147C.25; and\n(4) submit any additional information requested by the board to clarify information presented in the renewal application. The information must be submitted within 30 days after the board's request, or the renewal request is nullified.\n(b) Applicants for renewal who have not practiced the equivalent of eight full weeks during the past five years must achieve a passing score on retaking the credentialing examination.\n(c) A licensee must maintain a correct mailing address with the board for receiving board communications, notices, and license renewal documents. Placing the license renewal application in first-class United States mail, addressed to the licensee at the licensee's last known address with postage prepaid, constitutes valid service. Failure to receive the renewal documents does not relieve a licensee of the obligation to comply with this section.\n(d) The name of a licensee who does not return a complete license renewal application, annual license fee, or late application fee, as applicable, within the time period required by this section shall be removed from the list of individuals authorized to practice during the current renewal period. If the licensee's license is reinstated, the licensee's name shall be placed on the list of individuals authorized to practice.\nA licensee who changes addresses must inform the board within 30 days, in writing, of the change of address. All notices or other correspondence mailed to or served on a licensee by the board at the licensee's address on file with the board shall be considered as having been received by the licensee.\nAt least 30 days before the license renewal date, the board shall send out a renewal notice to the last known address of the licensee on file. The notice must include a renewal application and a notice of fees required for renewal. It must also inform the licensee that the license will expire without further action by the board if an application for license renewal is not received before the deadline for renewal. The licensee's failure to receive this notice shall not relieve the licensee of the obligation to meet the deadline and other requirements for license renewal. Failure to receive this notice is not grounds for challenging expiration of licensure status.\nThe renewal application and fee must be postmarked on or before July 1 of the year of renewal or as determined by the board. If the postmark is illegible, the application shall be considered timely if received by the third working day after the deadline.\nMS 2008 [Repealed by amendment, 2009 c 142 art 2 s 4]\nFor any individual whose license has lapsed for two years or less, to regain a license, the individual must:\n(1) apply for license renewal according to subdivision 7;\n(2) document compliance with the continuing education requirements of section 147C.25 since the licensee's initial licensure or last renewal; and\n(3) submit the fees required under section 147C.40 for the period not licensed, including the fee for late renewal.\n(a) A licensee whose license has lapsed under subdivision 12 before January 1, 2020, and who seeks to regain licensed status after January 1, 2020, shall be treated as a first-time licensee only for purposes of establishing a license renewal schedule, and shall not be subject to the license cycle conversion provisions in section 147C.45.\n(b) This subdivision expires July 1, 2022.\nThe board shall not renew, reissue, reinstate, or restore a license that has lapsed and has not been renewed within two annual renewal cycles. A licensee whose license is canceled for nonrenewal must obtain a new license by applying for licensure and fulfilling all requirements then in existence for initial licensure as a respiratory therapist.\n(a) A registrant licensee holding an active license as a respiratory therapist in the state may, upon approval of the board, be granted license cancellation if the board is not investigating the person as a result of a complaint or information received or if the board has not begun disciplinary proceedings against the licensee. Such action by the board shall be reported as a cancellation of a license in good standing.\n(b) A licensee who receives board approval for license cancellation is not entitled to a refund of any licensure fees paid for the license year in which cancellation of the license occurred.\n(c) To obtain a license after cancellation, a licensee must obtain a new license by applying for licensure and fulfilling the requirements then in existence for obtaining initial licensure as a respiratory therapist.",
	"repealed": false
}