{
	"id": "343.01",
	"url": "https://www.revisor.mn.gov/statutes/cite/343.01",
	"title": "343.01 PURPOSES; POWERS; COUNTY ORGANIZATION.",
	"text": "A state federation of county and district societies for the prevention of cruelty to animals may be created as a corporation under chapter 317A for the purpose provided in section 343.06. The federation may appoint representatives in any county where no active county or district society exists for the purpose of receiving and accounting for funds from any source, and may also appoint agents at large to carry out the work of the federation throughout the state. The federation and all county and district societies may appoint agents for the purpose of investigating or otherwise assisting lawfully empowered officials in the prosecution of persons charged with cruelty to animals. Appointed agents must have training and experience in activities relating to prevention of cruelty to animals or enforcement of laws relating to cruelty to animals. The federation may make bylaws as are necessary to implement its authority under this chapter and under chapter 317A.\nThe Minnesota Humane Society, also known as the Minnesota Society for the Prevention of Cruelty, is confirmed and continued as a nonprofit organization under chapter 317A.\n(a) The Minnesota Humane Society, also known as the Minnesota Society for the Prevention of Cruelty, and the Minnesota federated humane societies are not affiliated with each other or with the state of Minnesota.\n(b) The Minnesota federated humane societies have the powers given to it under this chapter.\nIt is unlawful for any organization, association, firm or corporation not named in this chapter to refer to itself as or in any way to use the names Minnesota federated humane societies, Minnesota Society for the Prevention of Cruelty, the Minnesota Humane Society, or any combination of words or phrases using the above names which would imply that it represents, acts in behalf or is a branch of the society or the federation.\nThe federation and the society must each be governed by a board of directors designated in accordance with chapter 317A. The powers, duties, and organization of the federation and the society and other matters for the conduct of the business of the federation and the society are as provided in chapter 317A and in the articles of incorporation and bylaws of each organization.",
	"repealed": false
}