{
	"id": "322C.0205",
	"url": "https://www.revisor.mn.gov/statutes/cite/322C.0205",
	"title": "322C.0205 FILING OF RECORDS WITH SECRETARY OF STATE; EFFECTIVE TIME AND DATE.",
	"text": "A record authorized or required to be filed with the secretary of state under this chapter must be captioned to describe the record's purpose, be in a medium permitted by the secretary of state, and be delivered to the secretary of state. If the filing fee of $35 or any filing fee specified in this chapter for the filing has been paid, unless the secretary of state determines that a record does not comply with the filing requirements of this chapter, the secretary of state shall file the record and:\n(1) for a statement of denial under section 322C.0303, send an image of the filed statement and a receipt for the fees to the person on whose behalf the statement was delivered for filing and to the limited liability company; and\n(2) for all other records, send an image of the filed record to the person on whose behalf the record was filed.\nUpon request and payment of the requisite fee, the secretary of state shall send to the requester a certified copy of a requested record.\nExcept as otherwise provided in sections 322C.0115, 322C.0201, subdivision 4, paragraph (a), and 322C.0206, a record filed with the secretary of state under this chapter may specify an effective time and a delayed effective date. Subject to sections 322C.0115, 322C.0201, subdivision 4, paragraph (a), and 322C.0206, a record filed with the secretary of state is effective:\n(1) if the record does not specify either an effective time or a delayed effective date, on the date and at the time the record is filed as evidenced by the secretary of state's endorsement of the date and time on the record;\n(2) if the record specifies an effective time but not a delayed effective date, on the date the record is filed at the time specified in the record;\n(3) if the record specifies a delayed effective date but not an effective time, at 11:59 p.m. on the earlier of:\n(i) the specified date; or\n(ii) the 90th day after the record is filed; or\n(4) if the record specifies an effective time and a delayed effective date, at the specified time on the earlier of:\n(i) the specified date; or\n(ii) the 90th day after the record is filed.",
	"repealed": false
}