{
	"id": "332A.04",
	"url": "https://www.revisor.mn.gov/statutes/cite/332A.04",
	"title": "332A.04 REGISTRATION.",
	"text": "Application for registration to operate as a debt management services provider in this state must be made in writing to the commissioner, under oath, in the form prescribed by the commissioner, and must contain:\n(1) the full name of each principal of the entity applying;\n(2) the address, which must not be a post office box, and the telephone number and, if applicable, email address, of the applicant;\n(3) identification of the trust account required under section 332A.13;\n(4) consent to the jurisdiction of the courts of this state;\n(5) the name and address of the registered agent authorized to accept service of process on behalf of the applicant or appointment of the commissioner as the applicant's agent for purposes of accepting service of process;\n(6) disclosure of:\n(i) whether any controlling or affiliated party has ever been convicted of a crime or found civilly liable for an offense involving moral turpitude, including forgery, embezzlement, obtaining money under false pretenses, larceny, extortion, conspiracy to defraud, or any other similar offense or violation, or any violation of a federal or state law or regulation in connection with activities relating to the rendition of debt management services or involving any consumer fraud, false advertising, deceptive trade practices, or similar consumer protection law;\n(ii) any judgments, private or public litigation, tax liens, written complaints, administrative actions, or investigations by any government agency against the applicant or any officer, director, manager, or shareholder owning more than five percent interest in the applicant, unresolved or otherwise, filed or otherwise commenced within the preceding ten years;\n(iii) whether the applicant or any person employed by the applicant has had a record of having defaulted in the payment of money collected for others, including the discharge of debts through bankruptcy proceedings; and\n(iv) whether the applicant's license or registration to provide debt management services in any other state has ever been revoked or suspended;\n(7) a copy of the applicant's standard debt management services agreement that the applicant intends to execute with debtors;\n(8) proof of accreditation, unless the applicant was licensed in Minnesota as a debt prorater immediately before August 1, 2007; and\n(9) any other information and material as the commissioner may require.\nThe commissioner may, for good cause shown, temporarily waive any requirement of this subdivision.\nA registration is effective until 11:59 p.m. on December 31 of the year for which the application for registration is filed or until it is surrendered by the registrant or revoked or suspended by the commissioner. The registration is limited solely to the business of providing debt management services.\nThe registration application must be accompanied by payment of $1,000 as a registration fee.\nThe registration application must be accompanied by a surety bond in which the applicant shall be the obligor, in a sum to be determined by the commissioner but not less than $5,000, and in which an insurance company, which is duly authorized by the state of Minnesota to transact the business of fidelity and surety insurance, shall be a surety. However, the commissioner may accept a deposit in cash, or securities that may legally be purchased by savings banks or for trust funds of an aggregate market value equal to the bond requirement, in lieu of the surety bond. The cash or securities must be deposited with the commissioner of management and budget. The commissioner may also require a fidelity bond in an appropriate amount covering employees of any applicant. Each branch office or additional place of business in this state of an applicant must be bonded as provided in this subdivision. In determining the bond amount necessary for the maintenance of any office, whether it is a surety bond, fidelity bond, or both, the commissioner shall consider the financial responsibility, experience, character, and general fitness of the debt management services provider and its operators and owners; the volume of business handled or proposed to be handled; the location of the office and the geographical area served or proposed to be served; and other information the commissioner may deem pertinent based upon past performance, previous examinations, annual reports, and manner of business conducted in other states.\nThe bond must run to the state of Minnesota for the use of the state and of any person or persons who may have a cause of action against the obligor arising out of the obligor's activities as a debt management services provider to a debtor domiciled in this state. The bond must be conditioned that the obligor will not commit any fraudulent act and will faithfully conform to and abide by the provisions of this chapter and of all rules lawfully made by the commissioner under this chapter and pay to the state and to any such person or persons any and all money that may become due or owing to the state or to such person or persons from the obligor under and by virtue of this chapter.\nIf the registrant has failed to account to a debtor or distribute to the debtor's creditors the amounts required by this chapter, or has failed to perform any of the services promised in the debt management services agreement, the registrant is in default. The debtor or the debtor's legal representative or receiver, the commissioner, or the attorney general, shall have, in addition to all other legal remedies, a right of action in the name of the debtor on the bond or the security given under this section, for loss suffered by the debtor, not exceeding the face amount of the bond or security, and without the necessity of joining the registrant in the suit or action based on the default.\nThe commissioner must maintain a list of registered debt management services providers. The list must be made available to the public in written form upon request and on the Department of Commerce website.",
	"repealed": false
}