{
	"id": "501C.1104",
	"url": "https://www.revisor.mn.gov/statutes/cite/501C.1104",
	"title": "501C.1104 WHEN RIGHT TO INCOME ARISES; APPORTIONMENT OF INCOME.",
	"text": "An income beneficiary is entitled to income from the date specified in the trust instrument or, if none is specified, from the date an asset becomes subject to the trust. In the case of an asset that becomes subject to a trust because of the death of any person, it becomes subject to the trust as of the date of the death of the person or, if later, the date the estate or trust becomes entitled to the asset if acquired after the death of the person, even though there is an intervening period of administration of an estate or trust during which the beneficiary may have no right to a distribution of the income.\nIn the administration of a decedent's estate or an asset that becomes subject to a trust by reason of a will:\n(1) receipts due but not paid at the date of death of the testator are principal;\n(2) receipts in the form of periodic payments, other than corporate distributions to stockholders, including rent, interest, or annuities, not due at the date of the death of the testator must be treated as accruing from day to day. That portion of the receipt that accrues before the date of death is principal, and the balance is income.\nIn all other cases, any receipt from an income-producing asset is income even though the receipt was earned or accrued in whole or in part before the date when the asset became subject to the trust.\nOn termination of an income interest, the income beneficiary whose interest is terminated, or the income beneficiary's estate, is entitled to:\n(1) income undistributed on the date of termination;\n(2) income due but not paid to the trustee on the date of termination; and\n(3) income in the form of periodic payments, other than corporate distributions to stockholders, including rent, interest, or annuities, not due on the date of termination, accrued from day to day.\nCorporate distributions to stockholders must be treated as due on the day fixed by the corporation for determination of stockholders of record entitled to distribution or, if no date is fixed, on the date of declaration of the distribution by the corporation.\nIf a gift or bequest is made in trust that is intended to qualify for the federal estate tax deduction for transfers under section 2056 of the Internal Revenue Code of 1986, as amended, or the federal gift tax deduction under section 2523 of the Internal Revenue Code of 1986, as amended, all distributions of income to the transferor's spouse shall not be made less frequently than annually.",
	"repealed": false
}