{
	"id": "169.20",
	"url": "https://www.revisor.mn.gov/statutes/cite/169.20",
	"title": "169.20 RIGHT-OF-WAY.",
	"text": "(a) When two vehicles enter an uncontrolled intersection from different highways at approximately the same time, the driver of the vehicle on the left shall yield the right-of-way to the vehicle on the right.\n(b) When two vehicles enter an intersection controlled by stop signs or by blinking red traffic signals requiring drivers or vehicles from any direction to stop before proceeding, the driver of the vehicle on the left shall yield the right-of-way to the vehicle on the right.\n(c) At an uncontrolled approach to a T-shaped intersection, the driver required to turn shall yield to the cross traffic.\n(d) The driver of any vehicle traveling at an unlawful speed shall forfeit any right-of-way which the driver might otherwise have hereunder.\n(e) The foregoing rules are modified as hereinafter stated in this section.\nThe driver of a vehicle intending to turn to the left within an intersection or into an alley, private road, or driveway shall yield the right-of-way to any vehicle approaching from the opposite direction which is within the intersection or so close thereto as to constitute an immediate hazard.\n(a) The driver of a vehicle shall stop as required by this chapter at the entrance to a through highway and shall yield the right-of-way to other vehicles which have entered the intersection from the through highway or which are approaching so closely on the through highway as to constitute an immediate hazard, but the driver having so yielded may proceed, and the drivers of all other vehicles approaching the intersection on the through highway shall yield the right-of-way to the vehicles so proceeding into or across the through highway.\n(b) The driver of a vehicle shall likewise stop in obedience to a stop sign, as required herein, at an intersection where a stop sign is erected at one or more entrances thereto although not a part of a through highway, and shall proceed cautiously, yielding to vehicles not so obliged to stop which are within the intersection or approaching so closely as to constitute an immediate hazard, but may then proceed.\nThe driver of a vehicle about to enter or cross a roadway from any place other than a roadway shall yield the right-of-way to all vehicles approaching on the roadway to be entered or crossed.\n(a) Upon the immediate approach of an authorized emergency vehicle equipped with at least one lighted lamp exhibiting red light visible under normal atmospheric conditions from a distance of 500 feet to the front of the vehicle and, except as otherwise provided in paragraph (b), when the driver is giving audible signal by siren, the driver of each other vehicle shall yield the right-of-way and shall immediately drive to a position parallel to and as close as possible to the right-hand edge or curb of the highway clear of any intersection, and shall stop and remain in this position until the authorized emergency vehicle has passed, except when otherwise directed by a police officer. The driver of another vehicle on a one-way roadway shall drive to the closest edge or curb and stop.\n(b) The driver of an authorized emergency vehicle escorting the movement of an oversize or overweight vehicle or load need not sound an audible signal by siren but shall exhibit the light required by paragraph (a). The driver of each other vehicle then shall yield the right-of-way, as required by paragraph (a), to the emergency vehicle escorting the oversize or overweight vehicle or load.\n(c) Upon the approach of an authorized emergency vehicle the driver of each streetcar shall immediately stop the car clear of any intersection and keep it in this position and keep the doors and gates of the streetcar closed until the authorized emergency vehicle has passed, except when otherwise directed by a police officer.\n(d) This subdivision does not operate to relieve the driver of an authorized emergency vehicle from the duty to drive with due regard for the safety of persons using the highways.\n(e) A driver who fails to comply with paragraph (a), (b), or (c) is guilty of a petty misdemeanor and may be penalized according to section 169.89.\n(f) A driver who intentionally obstructs an emergency vehicle or otherwise intentionally fails to comply with paragraph (a), (b), or (c) is guilty of a misdemeanor.\n(a) A peace officer may arrest the driver of a motor vehicle if the peace officer has probable cause to believe that the driver has operated the vehicle in violation of subdivision 5, paragraph (a), (b), or (f), within the four-hour period following the termination of the emergency incident or a receipt of a report under paragraph (c). The arrest may be made even though the violation was not committed in the presence of the peace officer.\n(b) A peace officer may issue a citation in lieu of arrest to the driver of a motor vehicle if the peace officer has probable cause to believe that the driver has operated the vehicle in violation of subdivision 5.\n(c) Although probable cause may be otherwise satisfied by other evidentiary elements or factors, probable cause is sufficient for purposes of this subdivision when a member of the crew of an authorized emergency vehicle responding to an emergency incident makes a timely report of the violation of subdivision 5 and provides a description of the vehicle used to commit the offense and the vehicle's license plate number. For the purposes of an arrest under paragraph (a), \"timely\" means that the report must be made within a four-hour period following the termination of the emergency incident.\n(a) If a motor vehicle is operated in violation of subdivision 5, the owner of the vehicle, or for a leased motor vehicle the lessee of the vehicle, is guilty of a petty misdemeanor.\n(b) Paragraph (a) does not apply if (1) a person other than the owner or lessee was operating the vehicle at the time the violation occurred, or (2) the owner presents written evidence that the motor vehicle had been reported to a law enforcement agency as stolen at the time of the violation.\n(c) Paragraph (a) does not apply to a lessor of a motor vehicle if the lessor keeps a record of the name and address of the lessee.\n(d) Paragraph (a) does not prohibit or limit the prosecution of a motor vehicle operator who violates subdivision 5.\n(e) A violation under paragraph (a) does not constitute grounds for revocation or suspension of the owner's or lessee's driver's license.\nWhen any funeral procession identifies itself by using regular lights on all cars and by keeping all cars in close formation, the driver of every other vehicle, except an emergency vehicle, shall yield the right-of-way.\n(a) The driver of a vehicle traveling in the right-hand lane of traffic shall yield the right-of-way to any transit bus attempting to enter that lane from a bus stop or shoulder, as indicated by a flashing left turn signal.\n(b) The driver of a vehicle traveling in the right-hand lane of traffic shall yield the right-of-way to any school bus attempting to enter that lane from a shoulder, right-turn lane, or other location where the school bus has stopped to load or unload passengers. The school bus must indicate the intent to enter the right-hand lane of traffic by activating a flashing left turn signal.\nIf two vehicles with a total length in excess of 40 feet, a total width in excess of ten feet, or any combination of vehicles, approach or drive through a roundabout at approximately the same time or so closely as to constitute a hazard of collision, the operator of the vehicle or combination of vehicles on the right must yield the right-of-way to the vehicle or combination of vehicles on the left and, if necessary, must reduce speed or stop in order to so yield.",
	"repealed": false
}