{
	"id": "609.226",
	"url": "https://www.revisor.mn.gov/statutes/cite/609.226",
	"title": "609.226 HARM CAUSED BY DOG.",
	"text": "A person who causes great or substantial bodily harm to another by negligently or intentionally permitting any dog to run uncontrolled off the owner's premises, or negligently failing to keep it properly confined is guilty of a misdemeanor. A person who is convicted of a second or subsequent violation of this section involving the same dog is guilty of a gross misdemeanor.\nIf the owner of a dangerous dog, as defined under section 347.50, subdivision 2, has been convicted of a misdemeanor under section 347.55, and the same dog causes bodily injury to a person other than the owner, the owner is guilty of a gross misdemeanor and may be sentenced to imprisonment for not more than 364 days or to payment of a fine of not more than $3,000, or both.\nIf proven by a preponderance of the evidence, it shall be an affirmative defense to liability under subdivision 1 or 2 that the victim provoked the dog to cause the victim's bodily harm.\n(a) As used in this subdivision, \"service animal\" means an animal individually trained or being trained to do work or perform tasks for the benefit of an individual with a disability.\n(b) A person who negligently or intentionally (1) permits the person's dog to run uncontrolled off the person's premises, or (2) fails to keep the person's dog properly confined or controlled; and as a result the dog causes bodily harm to a service animal or otherwise renders a service animal unable to perform its duties, is guilty of a misdemeanor.\n(c) The court shall order a person convicted of violating this subdivision to pay restitution for the costs and expenses resulting from the crime. Costs and expenses include, but are not limited to, the service animal user's loss of income, veterinary expenses, transportation costs, and other expenses of temporary replacement assistance services, and service animal replacement or retraining costs incurred by a school, agency, or individual. If the court finds that the convicted person is indigent, the court may reduce the amount of restitution to a reasonable level or order it paid in installments.\n(d) This subdivision does not preclude a person from seeking any available civil remedies for an act that violates this subdivision.",
	"repealed": false
}