{
	"id": "13.591",
	"url": "https://www.revisor.mn.gov/statutes/cite/13.591",
	"title": "13.591 BUSINESS DATA.",
	"text": "The following data, that are submitted to a government entity by a business requesting financial assistance or a benefit financed by public funds, are private or nonpublic data: financial information about the business, including credit reports; financial statements; net worth calculations; business plans; income and expense projections; balance sheets; customer lists; income tax returns; and design, market, and feasibility studies not paid for with public funds.\nData submitted to a government entity under subdivision 1 become public when public financial assistance is provided or the business receives a benefit from the government entity, except that the following data remain private or nonpublic: business plans; income and expense projections not related to the financial assistance provided; customer lists; income tax returns; and design, market, and feasibility studies not paid for with public funds.\n(a) Data submitted by a business to a government entity in response to a request for bids as defined in section 16C.02, subdivision 11, are private or nonpublic until the time and date specified in the solicitation that bids are due, at which time the name of the bidder and the dollar amount specified in the response become public. All other data in a bidder's response to a bid are private or nonpublic data until completion of the selection process. For purposes of this section, \"completion of the selection process\" means that the government entity has completed its evaluation and has ranked the responses. After a government entity has completed the selection process, all remaining data submitted by all bidders are public with the exception of trade secret data as defined and classified in section 13.37. A statement by a bidder that submitted data are copyrighted or otherwise protected does not prevent public access to the data contained in the bid.\nIf all responses to a request for bids are rejected prior to completion of the selection process, all data, other than the name of the bidder and the dollar amount specified in the response, remain private or nonpublic until a resolicitation of bids results in completion of the selection process or a determination is made to abandon the purchase. If the rejection occurs after the completion of the selection process, the data remain public. If a resolicitation of bids does not occur within one year of the bid opening date, the remaining data become public.\n(b) Data submitted by a business to a government entity in response to a request for proposal, as defined in section 16C.02, subdivision 12, are private or nonpublic until the time and date specified in the solicitation that proposals are due, at which time the name of the responder becomes public. All other data in a responder's response to a request for proposal are private or nonpublic data until completion of the evaluation process. For purposes of this section, \"completion of the evaluation process\" means that the government entity has completed negotiating the contract with the selected vendor. After a government entity has completed the evaluation process, all remaining data submitted by all responders are public with the exception of trade secret data as defined and classified in section 13.37. A statement by a responder that submitted data are copyrighted or otherwise protected does not prevent public access to the data contained in the response.\nIf all responses to a request for proposal are rejected prior to completion of the evaluation process, all data, other than the names of the responders, remain private or nonpublic until a resolicitation of the requests for proposal results in completion of the evaluation process or a determination is made to abandon the purchase. If the rejection occurs after the completion of the evaluation process, the data remain public. If a resolicitation of proposals does not occur within one year of the proposal opening date, the remaining data become public.\n(a) Data created or maintained by a government entity as part of the selection or evaluation process referred to in this section are protected nonpublic data until completion of the selection process or completion of the evaluation process at which time the data are public with the exception of trade secret data as defined and classified in section 13.37.\n(b) If a government entity asks employees of other government entities to assist with the selection of the responses to a request for bid or the evaluation of responses to a request for proposal, the government entity may share not public data in the responses with those employees. The employees participating in the selection or evaluation may not further disseminate the not public data they review.\n(a) For purposes of this subdivision, \"internal competitive response\" means a bid or proposal to provide government goods or services that is prepared by the staff of a government entity in competition with bids or proposals solicited by (1) the same government entity from the private sector or (2) a different government entity from the private sector.\n(b) Data in an internal competitive response is classified as private or nonpublic until completion of the selection process or completion of the evaluation process at which time the data are public with the exception of trade secret data as defined and classified in section 13.37.",
	"repealed": false
}