{
	"id": "127A.42",
	"url": "https://www.revisor.mn.gov/statutes/cite/127A.42",
	"title": "127A.42 REDUCTION OF AID FOR VIOLATION OF LAW.",
	"text": "The amount of state aids to which a district is entitled shall be the amount computed according to statutes. The annual state aid certificate made by the commissioner to the commissioner of management and budget shall show the amount of any reductions made.\nThe commissioner may reduce or withhold the district's state aid for any school year whenever the board of the district authorizes or permits violations of law within the district by:\n(1) employing a teacher who does not hold a valid teaching license or permit in a public school;\n(2) noncompliance with a mandatory rule of general application promulgated by the commissioner in accordance with statute, unless special circumstances make enforcement inequitable, impose an extraordinary hardship on the district, or the rule is contrary to the district's best interests;\n(3) the district's continued performance of a contract made for the rental of rooms or buildings for school purposes or for the rental of any facility owned or operated by or under the direction of any private organization, if the contract has been disapproved, the time for review of the determination of disapproval has expired, and no proceeding for review is pending;\n(4) any practice which is a violation of sections 1 and 2 of article 13 of the Constitution of the state of Minnesota;\n(5) failure to reasonably provide for a resident pupil's school attendance under Minnesota Statutes;\n(6) noncompliance with state laws prohibiting discrimination because of race, color, creed, religion, national origin, sex, age, marital status, status with regard to public assistance or disability, as defined in sections 363A.08 to 363A.19 and 363A.28, subdivision 10; or\n(7) using funds contrary to the statutory purpose of the funds.\nThe reduction or withholding must be made in the amount and upon the procedure provided in this section, or, in the case of the violation stated in clause (1), upon the procedure provided in section 127A.43.\n(a) After consultation with the commissioner of human rights, the commissioner of education shall adopt rules in conformance with chapter 14. The rules must direct districts to file with the commissioner of education assurances of compliance with state and federal laws prohibiting discrimination. The assurances must be provided in a form and manner prescribed by the commissioner.\n(b) If it appears that one or more violations of the Minnesota Human Rights Act are occurring in a district, the commissioner of human rights shall notify the commissioner of the violations, and the commissioner of education may then proceed pursuant to subdivision 4.\nWhen it appears that a violation is occurring in a district, the commissioner shall notify the board of that district in writing. The notice must specify the violations, set a reasonable time within which the district must correct the specified violations, describe the correction required, and advise that if the correction is not made within the time allowed, special state aids to the district will be reduced or withheld. The time allowed for correction may be extended by the commissioner if there is reasonable ground therefor.\nThe board to which such notice is given may, by a majority vote of the whole board, decide to dispute that the specified violation exists or that the time allowed is reasonable or the correction specified is correct, or that the commissioner may reduce or withhold aids. The board must give the commissioner written notice of the decision. If the commissioner, after further investigation as the commissioner deems necessary, adheres to the previous notice, the commissioner shall notify the school board of its decision. If the commissioner, after further investigation as the commissioner deems necessary, adheres to the previous notice, the board shall be entitled to a hearing by the commissioner under this subdivision and notwithstanding chapter 14. The commissioner must set a hearing time and place and the board of the district must be given notice by mail. The hearings must be designed to give a full and fair hearing and permit interested parties an opportunity to produce evidence relating to the issues involved. A stenographic record must be made of all testimony given and other proceedings during the hearing. If practicable, rules governing admission of evidence in courts shall apply to the hearing. The final decision of the commissioner must be in writing and the controlling facts upon which the decision is made must be stated in sufficient detail to apprise the parties and the reviewing court of the basis and reason for the decision. The decision must be confined to whether any of the specified violations existed at the date of the commissioner's first notice, whether the violations were corrected within the time permitted, whether the violations require withholding or reduction of the state aids under this section, and in what amount.\nThe commissioner shall not reduce state aids payable to the district if the violation specified is corrected within the time permitted, or if the commissioner on being notified of the district board's decision to dispute decides the violation does not exist, or if the commissioner decides after hearing no violation specified in the commissioner's notice existed at the time of the notice, or that the violations were corrected within the time permitted. Otherwise state aids payable to the district for the year in which the violation occurred may be reduced or withheld as follows: The total amount of state aids to which the district may be entitled shall be reduced in the proportion that the period during which a specified violation continued, computed from the last day of the time permitted for correction, bears to the total number of days school is held in the district during the year in which a violation exists, multiplied by up to 60 percent of the basic revenue, as defined in section 126C.10, subdivision 2, of the district for that year.\nReductions in aid under this section and sections 127A.41 and 127A.43 must be from general education aid. If there is not sufficient general education aid remaining to be paid for the school year in which the violation occurred, the reduction shall be from other aids that are payable to the district for that year. If there is not a sufficient amount of state aids remaining payable to the district for the school year in which the violation occurred to permit the full amount of reduction required, that part of the required reduction not taken from that school year's aids will be taken from the state aids payable to the district for the next school year, and the reduction will be made from the various aids payable for the next year.\n[Repealed, 1999 c 241 art 9 s 54]\nA final decision of the commissioner under this section may be appealed in accordance with section 480A.06, subdivision 3.\nAny notice given to the board of a district will be deemed given when a copy thereof is mailed, registered, to the superintendent of the district, if there is a superintendent, and to the clerk of the board of the district. If it is shown that neither the superintendent nor the clerk in fact received such notice in the ordinary course of mail, then the time for correction will be accordingly extended by the commissioner so that a reasonable time will be allowed from actual receipt of notice for correction. If notice is sent by the commissioner with respect to a violation which is continued by the district in a succeeding year, no separate notice for that violation for the succeeding year will be required. Proceedings initiated by such notice shall include any continuing violation notwithstanding that a part thereof occurs in a year different from the year in which it started. The commissioner may require reasonable proof of the time that a violation ceased for the determination of the amount of aids to be reduced or withheld. Costs and disbursements of the review by the court of appeals, exclusive of those incurred in the administrative proceedings, may be taxed against the losing party and in the event taxed against the state must be paid from the appropriations made to the department for the payment of state aids.",
	"repealed": false
}