{
	"id": "469.071",
	"url": "https://www.revisor.mn.gov/statutes/cite/469.071",
	"title": "469.071 BLOOMINGTON.",
	"text": "The city of Bloomington may establish a port authority that has the same powers as a port authority established under section 469.049. If the city establishes a port authority, the city shall exercise all the powers relating to the port authority granted to a city by section 469.049 or other law and may do all that a port authority may do under sections 469.048 to 469.068.\nThe port authority of the city of Bloomington may lease or purchase and accept a conveyance of real property from another public agency, commission, or unit of government if the port authority is able to properly use the property for the purposes of sections 469.048 to 469.068.\nThe port authority may, with the approval of its city council, issue bonds under section 469.060 to pay for the real property.\nNotwithstanding section 473.556, subdivision 6, or any other law, real property conveyed to the port authority of the city of Bloomington by the metropolitan sports facilities commission is exempt from taxation under sections 473.556, subdivision 4; and 469.012, subdivision 2.\nNotwithstanding section 469.068, the Bloomington port authority need not require competitive bidding with respect to a structured parking facility or other public improvements constructed in conjunction with, and directly above or below, or adjacent and integrally related to, a development and financed with the proceeds of tax increment, revenue bonds, or other funds of the port authority and the city of Bloomington.\nThe port authority of the city of Bloomington shall consist of seven commissioners. The mayor and a member of the city council shall serve on the port authority during their service as mayor and council member.\nFor vacancies that occur among the other members after the effective date of Laws 1992, chapter 384, the terms shall be as follows: for the first two vacancies, each member shall serve a term of two years and for the last three vacancies, two members shall serve a term of four years and one member shall serve a term of six years. For subsequent terms, the term is six years.",
	"repealed": false
}