{
	"id": "135A.031",
	"url": "https://www.revisor.mn.gov/statutes/cite/135A.031",
	"title": "135A.031 APPROPRIATIONS.",
	"text": "The appropriations for the University of Minnesota and the Minnesota State Colleges and Universities are determined by considering the biennial budget documents submitted under section 135A.034, performance in advancing the objectives under section 135A.011, available resources according to the state budget forecast, the relative balance between state support for students and public postsecondary institutions, and other factors the legislature considers important in determining the level of state appropriations for public postsecondary education.\n[Repealed, 2007 c 144 art 2 s 52]\n[Repealed, 2007 c 144 art 2 s 52]\n[Repealed, 2007 c 144 art 2 s 52]\n[Repealed, 2007 c 144 art 2 s 52]\n[Repealed, 2007 c 144 art 2 s 52]\n(a) The University of Minnesota and the Minnesota State Colleges and Universities systems shall include in their biennial budget proposals to the legislature:\n(1) a five-year history of systemwide expenditures, reported by:\n(i) functional areas, including instruction, research, public service, student financial aid, and auxiliary services, and including direct costs and indirect costs, such as institutional support, academic support, student services, and facilities management, associated with each functional area; and\n(ii) objects of expenditure, such as salaries, benefits, supplies, and equipment, including a full explanation of all material changes to the expenditure categories when compared to the prior fiscal year;\n(2) a five-year history of the system's total instructional expenditures per full-year equivalent student, by level of instruction, including upper-division undergraduate, lower-division undergraduate, graduate, professional, and other categories of instructional programs offered by the system;\n(3) a five-year history of the system's total revenues by funding source, including tuition, state operations and maintenance appropriations, state special appropriations, other restricted state funds, federal appropriations, sponsored research funds, gifts, auxiliary revenue, indirect cost recovery, and any other revenue sources;\n(4) an explanation describing how state appropriations made to the system in the previous biennium were allocated and the methodology used to determine the allocation;\n(5) data describing how the institution reallocated resources to advance the priorities set forth in the budget submitted under section 135A.034 and the statewide objectives under section 135A.011. The information must indicate whether instruction and support programs received a reduction in or additional resources. The total amount reallocated must be clearly explained;\n(6) the tuition rates and fees established by the governing board in each of the past ten years and comparison data for peer institutions and national averages;\n(7) data on the number and proportion of students graduating within four, five, and six years from universities and within three years from colleges as reported in the integrated postsecondary education data system. These data must be provided for each institution by race, ethnicity, and gender. Data and information must be submitted that describe the system's plan and progress toward attaining the goals set forth in the plan to increase the number and proportion of students that graduate within four, five, or six years from a university or within three years from a college;\n(8) data on, and the methodology used to measure, the number of students traditionally underrepresented in higher education enrolled at the system's institutions. Data and information must be submitted that describe the system's plan and progress toward attaining the goals set forth in the plan to increase the recruitment, retention, and timely graduation of students traditionally underrepresented in higher education;\n(9) data on the revenue received from all sources to support research or workforce development activities or the system's efforts to license, sell, or otherwise market products, ideas, technology, and related inventions created in whole or in part by the system. Data and information must be submitted that describe the system's plan and progress toward attaining the goals set forth in the plan to increase the revenue received to support research or workforce development activities or revenue received from the licensing, sale, or other marketing and technology transfer activities by the system;\n(10) data on consulting contracts from the last two completed fiscal years for which the work is performed by a consultant who is not an employee of the system, for which the system paid in excess of $500,000. Data must include the name of the consultant, the total value of the contract, a description of the work completed, and a description of the reasons for using an outside consultant and not internal staff. Consulting contracts are defined as contracts from management, investment and financial advisory services, project management, computer/technology advisory services, and construction project management; and\n(11) aggregate data on the following:\n(i) student demographics;\n(ii) a five-year history of student enrollment, including student enrollment by legislative district;\n(iii) a five-year history of student debt;\n(iv) a five-year history of mandatory student fees by campus;\n(v) employee head count and employee demographics;\n(vi) facilities, including physical space overview, condition, square footage, distribution by region, any deferred maintenance, and capital bonding requested and received;\n(vii) administrative costs, including the definition of \"administrators\" used by the system, the total number of \"administrators\" as percent of total employee head count, and system office budget for Minnesota State Colleges and Universities as percent of total system general fund revenue; and\n(viii) college and university operating budgets.\n(b) Data required by this subdivision shall be submitted by the public postsecondary systems to the Minnesota Office of Higher Education and the Department of Management and Budget and included in the biennial budget document. Representatives from each system, in consultation with the commissioner of management and budget and the commissioner of the Office of Higher Education, shall develop consistent reporting practices for this purpose.\n(c) To the extent practicable, each system shall develop the ability to respond to legislative requests for financial analyses that are more detailed than those required by this subdivision, including but not limited to analyses that show expenditures or revenues by institution or program, or in multiple categories of expenditures or revenues, and analyses that show revenue sources for particular types of expenditures.",
	"repealed": false
}