{
	"id": "352.1155",
	"url": "https://www.revisor.mn.gov/statutes/cite/352.1155",
	"title": "352.1155 NO ANNUITY REDUCTION.",
	"text": "Except as indicated in subdivision 4, the annuity reduction provisions of section 352.115, subdivision 10, do not apply to a person who:\n(1) retires from the Minnesota State Colleges and Universities system with at least ten years of combined service credit in a system under the jurisdiction of the Board of Trustees of the Minnesota State Colleges and Universities;\n(2) was employed on a full-time basis immediately preceding retirement as a faculty member or as an unclassified administrator in that system;\n(3) was not a recipient of an early retirement incentive under section 136F.481;\n(4) begins drawing an annuity from the general state employees retirement plan of the Minnesota State Retirement System; and\n(5) returns to work on not less than a one-third time basis and not more than a two-thirds time basis in the system from which the person retired under an agreement in which the person may not earn a salary of more than $62,000 in a calendar year through employment after retirement in the system from which the person retired.\nInitial participation, the amount of time worked, and the duration of participation under this section must be mutually agreed upon by the president of the institution where the person returns to work and the employee. The president may require up to one-year notice of intent to participate in the program as a condition of participation under this section. The president shall determine the time of year the employee shall work. The employer or the president may not require a person to waive any rights under a collective bargaining agreement as a condition of participation under this section.\nNotwithstanding any law to the contrary, a person eligible under this section may not, based on employment to which the waiver in this section applies, earn further service credit in a Minnesota public defined benefit plan and is not eligible to participate in a Minnesota public defined contribution plan, other than a firefighter relief association governed by chapter 424A or the statewide volunteer firefighter plan governed by chapter 353G. No employer or employee contribution to any of these plans may be made on behalf of such a person.\nFor a person eligible under this section who earns more than $62,000 in a calendar year through reemployment in the Minnesota State Colleges and Universities system following retirement, the annuity reduction provisions of section 352.115, subdivision 10, apply only to income over $62,000.\nA person who returns to work under this section is a member of the appropriate bargaining unit and is covered by the appropriate collective bargaining contract. Except as provided in this section, the person's coverage is subject to any part of the contract limiting rights of part-time employees.",
	"repealed": false
}