{
	"id": "278.01",
	"url": "https://www.revisor.mn.gov/statutes/cite/278.01",
	"title": "278.01 DEFENSE OR OBJECTION TO REAL AND PERSONAL PROPERTY TAXES; SERVICE AND FILING.",
	"text": "(a) Any person having personal property, or any estate, right, title, or interest in or lien upon any parcel of land, who claims that such property has been partially, unfairly, or unequally assessed in comparison with other property in the (1) city, or (2) county, or (3) in the case of a county containing a city of the first class, the portion of the county excluding the first class city, or that the parcel has been assessed at a valuation greater than its real or actual value, or that the tax levied against the same is illegal, in whole or in part, or has been paid, or that the property is exempt from the tax so levied, may have the validity of the claim, defense, or objection determined by the district court of the county in which the tax is levied or by the Tax Court by personally serving one copy of a petition for such determination upon the county auditor. The county auditor may waive personal service of a petition by: (i) agreeing to accept service through an alternative service method; (ii) designating an alternative service method on the county website; or (iii) acknowledging receipt of a petition served through an alternative service method. An alternative service method includes but is not limited to service by email or by an electronic upload to a website designated by the county. Service may be made by any person, including a party to the action.\n(b) Within 30 days after a petition is served and filed, the county auditor must provide a copy of the petition, if a copy has not already been provided, to the county assessor, county treasurer, and the county attorney. The county assessor shall immediately forward one copy of the petition to the appropriate governmental authority in a home rule charter or statutory city or town in which the property is located if that city or town employs its own certified assessor. On or before the first day of July, the county auditor must send a list of petitioned properties to the school board of the school district in which the property is located. The list must include the name of the petitioner, the identification number of the property, and the estimated market value of the property.\n(c) For all counties, the petitioner must file a copy of the petition and proof of service of the petition in the office of the court administrator of the district court on or before April 30 of the year in which the tax becomes payable. A petition for determination under this section may be transferred by the district court to the Tax Court. An appeal may also be taken to the Tax Court under chapter 271 at any time following receipt of the valuation notice that county assessors or city assessors having the powers of a county assessor are required by section 273.121 to send to persons whose property is to be included on the assessment roll that year, but prior to May 1 of the year in which the taxes are payable.\nMS 1990 [Repealed, 1992 c 511 art 4 s 28]\nThe procedures established by this section are not available to contest the validity or amount of any special assessment made pursuant to chapters 429, 430, any special law or city charter.\nNotwithstanding the April 30 date in subdivision 1, whenever the exempt status, valuation, or classification of real or personal property is changed other than by an abatement or a court decision, and the owner responsible for payment of the tax is not given notice of the change until after February 28 of the year the tax is payable or after July 1 in the case of property subject to section 273.125, subdivision 4, an eligible petitioner, as defined and limited in subdivision 1, has 60 days from the date of mailing of the notice to initiate an appeal of the property's exempt status, classification, or valuation change under this chapter.",
	"repealed": false
}