{
	"id": "360.042",
	"url": "https://www.revisor.mn.gov/statutes/cite/360.042",
	"title": "360.042 JOINT OPERATION; JOINT POWERS BOARD.",
	"text": "All powers, rights, and authority granted to any municipality in sections 360.011 to 360.076, may be exercised and enjoyed by two or more municipalities, or by this state and one or more municipalities therein, acting jointly, either within or without the territorial limits of either or any of said municipalities and within or without this state or any municipality therein acting jointly with any other state or municipality therein, either within or without this state; provided the laws of such other state permit such joint action. If the United States government approves, such joint action may be taken by this state and the Dominion of Canada or its governmental subdivisions.\nFor the purposes of this section only, unless another intention clearly appears or the context otherwise requires, this state shall be included in the term \"municipality,\" and all the powers conferred upon municipalities in sections 360.011 to 360.076, if not otherwise conferred by law, are hereby conferred upon this state when acting jointly with any municipality or municipalities. Where reference is made to the \"governing body\" of a municipality, that term shall mean, as to the state, the commissioner.\nAny two or more municipalities may enter into agreements with each other, duly authorized by ordinance or resolution, as may be appropriate, for joint action pursuant to the provisions of this section. Concurrent action by the governing bodies of the municipalities involved shall constitute joint action.\nEach such agreement shall specify its term; the proportionate interest which each municipality shall have in the property, facilities, and privileges involved; and the proportion of preliminary costs, of costs of acquisition, establishment, construction, enlargement, improvement, and equipment, and of expenses of maintenance, operation, and regulation to be borne by each; and make such other provisions as may be necessary to carry out the provisions of this section. It shall provide for amendments thereof and for conditions and methods of termination, for the disposition of all or any part of the property, facilities, and privileges jointly owned if said property, facilities, and privileges, or any part thereof, shall cease to be used for the purposes herein provided or if the agreement shall be terminated, and for the distribution of the proceeds received upon any such disposition, and of any funds or other property jointly owned and undisposed of, and the assumption or payment of any indebtedness arising from the joint venture which remains unpaid, upon any such disposition or upon a termination of the agreement.\nMunicipalities acting jointly as herein authorized shall create a board from the inhabitants of such municipalities for the purpose of acquiring property for establishing, constructing, enlarging, improving, maintaining, equipping, operating, and regulating the airports and other air navigation facilities and airport protection privileges to be jointly acquired, controlled, and operated. Such board shall consist of members to be appointed by the governing body of each municipality involved, the number to be appointed by each to be provided for by the agreement for the joint venture. Each member shall serve for such time and upon such terms as to compensation, if any, as may be provided for in the agreement.\nEach such board shall organize, select officers for terms to be fixed by the agreement, and adopt and from time to time amend rules of procedure.\nSuch board may exercise, on behalf of the municipalities acting jointly by which it is appointed, all the powers of each of such municipalities granted by sections 360.011 to 360.076, except as herein provided. Real property, airports, restricted landing areas, air protection privileges, or personal property costing in excess of a sum to be fixed by the joint agreement may be acquired, and condemnation proceedings may be instituted, only by authority of the governing bodies of each of the municipalities involved. The total amount of expenditures to be made by the board for any purpose in any calendar year shall be determined by the municipalities involved by the approval by each on or before the preceding December 1st of a budget for the ensuing calendar year. Rules provided for by section 360.038, subdivision 3, shall become effective only upon approval of each of the appointing governing bodies. No real property and no airport, other air navigation facility, or air protection privilege, owned jointly, shall be disposed of by the board, by sale, lease, or otherwise, except by authority of all the appointing governing bodies, but the board may lease space, area, or improvements and grant concessions on airports for aeronautical purposes or purposes incidental thereto, subject to the provisions of section 360.038, subdivision 4.\nEach municipality, acting jointly with another, pursuant to the provisions of this section, is authorized and empowered to enact, concurrently with the other municipalities involved, such ordinances as are provided for by section 360.038, subdivision 3, and to fix by such ordinances penalties for the violation thereof, which ordinances, when so concurrently adopted, shall have the same force and effect within the municipalities and on any property jointly controlled by them or adjacent thereto, whether within or without the territorial limits of either or any of them, as ordinances of each municipality involved, and may be enforced in any one of said municipalities in like manner as are its individual ordinances. The consent of the commissioner to any such ordinance, where the state is a party to the joint venture, shall be equivalent to the enactment of the ordinance by a municipality. The publication provided for in section 360.038, subdivision 3, shall be made in each municipality involved in the manner provided by law or charter for publication of its individual ordinances.\nCondemnation proceedings shall be instituted in the names of the municipalities jointly, and the property acquired shall be held by the municipalities as tenants in common. The provisions of section 360.032, subdivision 2, shall apply to such proceedings.\nFor the purpose of providing funds for necessary expenditures in carrying out the provisions of this section, a joint fund shall be created and maintained, into which each of the municipalities involved shall deposit its proportionate share as provided by the joint agreement. Funds to be deposited shall be provided for by bond issues, tax levies, and appropriations made by each municipality in the same manner as though it were acting separately under the authority of sections 360.011 to 360.076. However, a municipality may issue bonds on behalf of other parties to the joint agreement, which shall be treated as being issued by each of the parties in proportion to their respective proportionate share as provided by the joint agreement. Each municipality shall also pay into the fund the revenues obtained from the ownership, control, and operation of the airports and other air navigation facilities jointly controlled, to be expended as provided in section 360.037, subdivision 3. Revenues in excess of cost of maintenance and operating expenses of the joint properties shall be divided as may be provided in the original agreement for the joint venture. When a county and a city are parties to a joint agreement as provided in subdivision 1 and the city is located in whole or in part within the geographic boundaries of the county, then the county's proportionate share shall be based on the net tax capacity of all property within the county, excepting the net tax capacity of that property located within the city, and any levy for airport purposes by the county shall not be levied against taxable property in the city, other than a levy under section 475.61 to pay debt service on general obligation bonds of the county.\nAll disbursements from such fund shall be made by order of the board in accordance with such rules and regulations and for such purposes as the appointing governing bodies, acting jointly, shall prescribe.\nSpecific performance of the provisions of any joint agreement entered into as provided for in this section may be enforced as against any party thereto by the other party or parties thereto.\nSubject to approval by the United States government, the powers set forth herein shall also apply to any joint airport agreement between the state of Minnesota and the Dominion of Canada or its governmental subdivisions.\nAny airport located outside this state shall be treated under this chapter as an airport located within this state if that airport is acquired, constructed, operated, or maintained pursuant to a joint agreement between a municipality in this state and an adjoining state or municipality therein. The commissioner shall not expend state money to pay the cost of any project at any such airport except to assist a municipality in this state to pay its share of the costs of the project as set forth in a joint agreement.",
	"repealed": false
}