{
	"id": "144E.285",
	"url": "https://www.revisor.mn.gov/statutes/cite/144E.285",
	"title": "144E.285 EDUCATION PROGRAMS.",
	"text": "(a) All education programs for an EMR, EMT, AEMT, or paramedic must be approved by the director.\n(b) To be approved by the director, an education program must:\n(1) submit an application prescribed by the director that includes:\n(i) type of course to be offered;\n(ii) names, addresses, and qualifications of the program medical director, program education coordinator, and instructors;\n(iii) admission criteria for students; and\n(iv) materials and equipment to be used;\n(2) for each course, implement the most current version of the United States Department of Transportation EMS Education Standards, or its equivalent as determined by the director applicable to EMR, EMT, AEMT, or paramedic education;\n(3) have a program medical director and a program coordinator;\n(4) utilize instructors who meet the requirements of section 144E.283 for teaching at least 50 percent of the course content. The remaining 50 percent of the course may be taught by guest lecturers approved by the education program coordinator or medical director;\n(5) retain documentation of program approval by the director, course outline, and student information;\n(6) notify the director of the starting date of a course prior to the beginning of a course; and\n(7) submit the appropriate fee as required under section 144E.29.\nThe National EMS Education Standards established by the National Highway Traffic Safety Administration of the United States Department of Transportation specify the minimum requirements for knowledge and skills for emergency medical responders. An education program applying for approval to teach EMRs must comply with the requirements under subdivision 1, paragraph (b). A medical director of an emergency medical responder group may establish additional knowledge and skill requirements for EMRs.\nIn addition to the requirements under subdivision 1, paragraph (b), an education program applying for approval to teach EMTs must:\n(1) include in the application prescribed by the director the names and addresses of clinical sites, including a contact person and telephone number;\n(2) maintain a written agreement with at least one clinical training site that is of a type recognized by the National EMS Education Standards established by the National Highway Traffic Safety Administration; and\n(3) maintain a minimum average yearly pass rate as set by the director. An education program not meeting this standard must be placed on probation and must comply with a performance improvement plan approved by the director until the program meets the pass-rate standard. While on probation, the education program may continue to provide classes if the program meets the terms of the performance improvement plan, as determined by the director. If an education program that is on probation status fails to meet the pass-rate standard after two years in which an EMT initial course has been taught, the director may take disciplinary action under subdivision 5.\n(a) In addition to the requirements under subdivision 1, paragraph (b), an education program applying for approval to teach AEMTs and paramedics must:\n(1) be administered by an educational institution accredited by the Commission of Accreditation of Allied Health Education Programs (CAAHEP);\n(2) include in the application prescribed by the director the names and addresses of clinical sites, including a contact person and telephone number; and\n(3) maintain a written agreement with a licensed hospital or licensed ambulance service designating a clinical training site.\n(b) An AEMT and paramedic education program that is administered by an educational institution not accredited by CAAHEP, but that is in the process of completing the accreditation process, may be granted provisional approval by the director upon verification of submission of its self-study report and the appropriate review fee to CAAHEP.\n(c) An educational institution that discontinues its participation in the accreditation process must notify the director immediately and provisional approval shall be withdrawn.\nEducation program approval shall expire two years from the date of approval.\nAn education program shall apply to the director for reapproval at least 30 days prior to the expiration date of its approval and must:\n(1) submit an application prescribed by the director specifying any changes from the information provided for prior approval and any other information requested by the director to clarify incomplete or ambiguous information presented in the application;\n(2) comply with the requirements under subdivision 1, paragraph (b), clauses (2) to (7);\n(3) be subject to a site visit by the director;\n(4) for education programs that teach EMRs, comply with the requirements in subdivision 1a;\n(5) for education programs that teach EMTs, comply with the requirements in subdivision 1b; and\n(6) for education programs that teach AEMTs and paramedics, comply with the requirements in subdivision 2 and maintain accreditation with CAAHEP.\n(a) The director may deny, suspend, revoke, place conditions on, or refuse to renew approval of an education program that the director determines:\n(1) violated subdivisions 1 to 4 or rules adopted under sections 144E.001 to 144E.33; or\n(2) misrepresented or falsified information on an application form provided by the director.\n(b) Before taking action under paragraph (a), the director shall give notice to an education program of the right to a contested case hearing under chapter 14. If an education program requests a contested case hearing within 30 days after receiving notice, the director shall initiate a contested case hearing according to chapter 14.\n(c) The administrative law judge shall issue a report and recommendation within 30 days after closing the contested case hearing record. The director shall issue a final order within 30 days after receipt of the administrative law judge's report.\n(d) After six months from the director's decision to deny, revoke, place conditions on, or refuse approval of an education program for disciplinary action, the education program shall have the opportunity to apply to the director for reapproval.\n(a) In addition to any other remedy provided by law, the director may temporarily suspend approval of the education program after conducting a preliminary inquiry to determine whether the director believes that the education program has violated a statute or rule that the director is empowered to enforce and determining that the continued provision of service by the education program would create an imminent risk to public health or harm to others.\n(b) A temporary suspension order prohibiting the education program from providing emergency medical care training shall give notice of the right to a preliminary hearing according to paragraph (d) and shall state the reasons for the entry of the temporary suspension order.\n(c) Service of a temporary suspension order is effective when the order is served on the education program personally or by certified mail, which is complete upon receipt, refusal, or return for nondelivery to the most recent address provided to the director for the education program.\n(d) At the time the director issues a temporary suspension order, the director shall schedule a hearing that shall begin within 60 days after issuance of the temporary suspension order or within 15 working days of the date of the director's receipt of a request for a hearing from the education program, whichever is sooner. The hearing shall be on the sole issue of whether there is a reasonable basis to continue, modify, or lift the temporary suspension. A hearing under this paragraph is not subject to chapter 14.\n(e) Evidence presented by the director or the individual may be in the form of an affidavit. The education program or counsel of record may appear for oral argument.\n(f) Within five working days of the hearing, the director shall issue its order and, if the suspension is continued, notify the education program of the right to a contested case hearing under chapter 14.\n(g) If an education program requests a contested case hearing within 30 days of receiving notice under paragraph (f), the director shall initiate a contested case hearing according to chapter 14. The administrative law judge shall issue a report and recommendation within 30 days after the closing of the contested case hearing record. The director shall issue a final order within 30 days after receipt of the administrative law judge's report.\nThe director may audit education programs approved by the director. The audit may include, but is not limited to, investigation of complaints, course inspection, classroom observation, review of instructor qualifications, and student interviews.",
	"repealed": false
}