{
	"id": "508.671",
	"url": "https://www.revisor.mn.gov/statutes/cite/508.671",
	"title": "508.671 DETERMINATION OF BOUNDARIES.",
	"text": "An owner of registered land may apply by a duly verified petition to the court to have all or some of the boundary lines judicially determined. An owner of unregistered land may apply by a duly verified petition to the court to have all or some of the boundary lines of the unregistered parcel judicially determined under this section, provided the relief requested affects one or more adjoining parcels of registered land. The petition shall contain the full names and post office addresses of all owners of adjoining lands and the legal description of the adjoining lands which are in any manner affected by the boundary determination. At the time of the filing of the petition with the court administrator, a copy of it, duly certified by the court administrator, shall be recorded with the registrar of titles and entered as a memorial on the petitioner's certificate of title, if applicable, and on the certificates of title for any affected adjoining registered lands, and recorded with the county recorder if the petitioner's land or any affected parcels are unregistered lands, and entered in the tract index for the affected lands. When recorded or filed, the certified copy of the petition shall be notice forever to purchasers and encumbrancers of the pendency of the proceeding and of all matters referred to in the court files and records pertaining to the proceeding. The owner shall have the premises surveyed by a licensed land surveyor and shall file in the proceedings a plat of the survey showing the correct location of the boundary line or lines to be determined. There also shall be filed with the court administrator a memorandum abstract, or other evidence satisfactory to the examiner, showing the record owners and encumbrancers of the adjoining lands which are in any manner affected by the boundary line determination. The petition shall be referred to the examiner of titles for examination and report in the manner provided for the reference of initial applications for registration. Notice of the proceeding shall be given to all interested persons by the service of a summons which shall be issued in the form and served in the manner as in initial applications.\nBefore the issuance of any final order determining the location of the owner's boundary lines, the court shall fix and establish the boundaries and direct the establishment of judicial landmarks in the manner provided by section 559.25. The final order shall make reference to the boundary lines that have been determined and to the location of the judicial landmarks that mark the boundary lines. The final order shall refer to the affected registered lands by certificate of title number, and shall refer to the affected abstract lands by legal description. A certified copy of the final order shall be filed by the court administrator with the registrar of titles and county recorder, if applicable, and entered as a memorial on all affected certificates of title. The memorial shall state which of the boundary lines were determined in the district court case. Upon the filing of the final order, the registrar shall omit from future certificates the memorial of the petition for registration of the boundary lines. The county recorder shall enter the certified copy of the final order in the tract index for the affected abstract land. Recording fees under this section shall be paid by the petitioner or prevailing party.\nThe court administrator shall file with the registrar of titles and the county recorder, if boundaries on unregistered land are affected, a certified copy of the plat of the survey which contains a certification by a licensed land surveyor that the boundaries as registered have been marked by judicial landmarks set pursuant to the order of the court. The registrar of titles shall enter the certified copy of the plat of the survey as a memorial upon the certificate of title. The county recorder shall enter the certified copy of the plat of survey in the tract index for the affected unregistered lands.",
	"repealed": false
}