{
	"id": "136A.1276",
	"url": "https://www.revisor.mn.gov/statutes/cite/136A.1276",
	"title": "136A.1276 ALTERNATIVE TEACHER PREPARATION GRANT PROGRAM.",
	"text": "(a) For purposes of this section, the following terms have the meanings given them.\n(b) \"Alternative teacher preparation program\" means an alternative teacher preparation program under section 122A.2451, subdivision 5, or an experimental teacher preparation program under section 122A.09, subdivision 10.\n(c) \"Commissioner\" means the commissioner of the Office of Higher Education.\n(d) \"Program\" means a teacher preparation curriculum leading to specific licensure areas.\n(e) \"Shortage area\" means:\n(1) licensure fields and economic development regions reported by the commissioner of education as experiencing a teacher shortage; and\n(2) economic development regions where there is a shortage of licensed teachers who reflect the racial or ethnic diversity of students in the region.\n(f) \"Unit\" means an institution or defined subdivision of the institution that has primary responsibility for overseeing and delivering teacher preparation programs.\n(a) The commissioner, in consultation with the Professional Educator Licensing and Standards Board, must establish and administer a program annually awarding grants to eligible alternative teacher preparation programs consistent with this section.\n(b) To be eligible to receive a grant, an alternative teacher preparation program must certify that it:\n(1) is working to fill Minnesota's teacher shortage areas; and\n(2) is a school district, charter school, or nonprofit corporation organized under chapter 317A or under section 501(c)(3) of the Internal Revenue Code of 1986 for an education-related purpose that has been operating continuously for at least three years in Minnesota or any other state.\n(c) The commissioner must give priority to applicants based in Minnesota when awarding grants under this section.\n(a) An alternative teacher preparation program receiving a grant under this section must use the grant to:\n(1) establish initial unit approval to become an alternative teacher preparation program;\n(2) expand alternative teacher preparation programs by expanding program approval to other licensure areas identified as shortage areas by the commissioner of education;\n(3) recruit, select, and train teachers who reflect the racial or ethnic diversity of students in Minnesota; or\n(4) establish professional development programs for teachers who have obtained teaching licenses through alternative teacher preparation programs.\nAn alternative teacher preparation program may expend grant funds on regional management and operations, development, and central support services, including financial support and support for technology and human services.\n(b) An alternative teacher preparation program may use grant funds awarded under this section as a match for nonstate funds, subject to paragraph (a).\n(c) Appropriations made to this program do not cancel and are available until expended.\nAn alternative teacher preparation program receiving a grant under this section must submit a report to the commissioner and the Professional Educator Licensing and Standards Board on the grantee's ability to fill teacher shortage areas and positively impact student achievement where data are available and do not identify individual teachers. A grant recipient must submit the report required under this subdivision by January 31, 2018, and each even-numbered year thereafter. The report must include disaggregated data regarding:\n(1) the racial and ethnic diversity of teachers and teacher candidates licensed through the program; and\n(2) program participant placement.",
	"repealed": false
}