{
	"id": "62C.142",
	"url": "https://www.revisor.mn.gov/statutes/cite/62C.142",
	"title": "62C.142 CONTINUATION AND CONVERSION PRIVILEGES FOR FORMER SPOUSES AND CHILDREN.",
	"text": "No subscriber contract of a nonprofit health service plan corporation which, in addition to covering the subscriber, also covers the subscriber's spouse shall contain a provision for termination of coverage for a spouse covered under the subscriber contract solely as a result of a break in the marital relationship except by reason of an entry of a valid decree of dissolution of marriage between the parties.\nAn individual subscriber contract issued as conversion coverage shall be renewable at the option of the former spouse as long as the former spouse is not covered under another qualified plan as defined in section 62E.02, subdivision 4. Any revisions in the table of rate for the individual subscriber contract shall apply to the former spouse's original age at entry and shall apply equally to all similar contracts issued as conversion coverage by the corporation.\nEvery subscriber contract, other than a contract whose continuance is contingent upon continued employment or membership, shall contain a provision which permits continuation of coverage under the contract for the subscriber's former spouse and children upon entry of a valid decree of dissolution of marriage. The coverage may be continued until the earlier of the following dates:\n(a) the subscriber's former spouse becomes covered under any other group health plan; or\n(b) the date coverage would otherwise terminate under the subscriber contract.\nThe contract must require the group contract holder to, upon request, provide the insured with written verification from the insurer of the cost of this coverage promptly at the time of eligibility for this coverage and at any time during the continuation period. In no event shall the amount of premium charged exceed 102 percent of the cost to the plan for such period of coverage for other similarly situated spouses and dependent children with respect to whom the marital relationship has not dissolved, without regard to whether such cost is paid by the employer or employee.\nSubdivision 1 applies to every subscriber contract which is delivered, issued for delivery, renewed or amended on or after July 19, 1977.\nSubdivisions 2 and 2a apply to every subscriber contract which is delivered, issued for delivery, renewed, or amended on or after March 1, 1983.",
	"repealed": false
}