{
	"id": "84.788",
	"url": "https://www.revisor.mn.gov/statutes/cite/84.788",
	"title": "84.788 REGISTRATION.",
	"text": "Unless exempted in subdivision 2, a person may not operate and an owner may not give permission for another to operate an off-highway motorcycle unless the vehicle has been registered under this section.\nRegistration is not required for off-highway motorcycles:\n(1) owned and used by the United States, an Indian tribal government, the state, another state, or a political subdivision;\n(2) registered in another state or country that have not been within this state for more than 30 consecutive days;\n(3) registered under chapter 168, when operated on forest roads to gain access to a state forest campground;\n(4) operated on state or grant-in-aid trails by a nonresident possessing a nonresident off-highway motorcycle state trail pass;\n(5) operated by a person participating in an event for which the commissioner has issued a special use permit; or\n(6) operated on boundary trails and registered in another state or country providing equal reciprocal registration or licensing exemptions for registrants of this state.\n(a) Application for registration or continued registration must be made to the commissioner or an authorized deputy registrar of motor vehicles in a form prescribed by the commissioner. The form must state the name and address of every owner of the off-highway motorcycle.\n(b) A person who purchases from a retail dealer an off-highway motorcycle shall make application for registration to the dealer at the point of sale. The dealer shall issue a dealer temporary 21-day registration permit to each purchaser who applies to the dealer for registration. The dealer shall submit the completed registration applications and fees to the deputy registrar at least once each week. No fee may be charged by a dealer to a purchaser for providing the temporary permit.\n(c) Upon receipt of the application and the appropriate fee, the commissioner or deputy registrar shall issue to the applicant, or provide to the dealer, an assigned registration number or a commissioner or deputy registrar temporary 21-day permit. Once issued, the registration number must be affixed to the motorcycle according to paragraph (f). A dealer subject to paragraph (b) shall provide the registration materials or temporary permit to the purchaser within the 21-day temporary permit period.\n(d) The commissioner shall develop a registration system to register vehicles under this section. A deputy registrar of motor vehicles acting under section 168.33, is also a deputy registrar of off-highway motorcycles. The commissioner of natural resources in agreement with the commissioner of public safety may prescribe the accounting and procedural requirements necessary to ensure efficient handling of registrations and registration fees. Deputy registrars shall strictly comply with the accounting and procedural requirements.\n(e) In addition to other fees prescribed by law, a filing fee of $4.50 is charged for each off-highway motorcycle registration renewal, duplicate or replacement registration card, and replacement decal and a filing fee of $7 is charged for each off-highway motorcycle registration and registration transfer issued by:\n(1) a deputy registrar and must be deposited in the treasury of the jurisdiction where the deputy is appointed, or kept if the deputy is not a public official; or\n(2) the commissioner and must be deposited in the state treasury and credited to the off-highway motorcycle account.\n(f) Unless exempted in paragraph (g), the owner of an off-highway motorcycle must display a registration decal issued by the commissioner. If the motorcycle is licensed as a motor vehicle, a registration decal must be affixed on the upper left corner of the rear license plate. If the motorcycle is not licensed as a motor vehicle, the decal must be attached on the side of the motorcycle and may be attached to the fork tube. The decal must be attached in a manner so that it is visible while a rider is on the motorcycle. The issued decals must be of a size to work within the constraints of the electronic licensing system, not to exceed three inches high and three inches wide.\n(g) Display of a registration decal is not required for an off-highway motorcycle:\n(1) while being operated on private property; or\n(2) while competing in a closed-course competition event.\nThe commissioner shall provide to the registrant a registration card that includes the registration number, the date of registration, the make and serial number of the off-highway motorcycle, the owner's name and address, and additional information the commissioner may require. The registration is not valid unless signed by at least one owner. Information concerning registrations must be kept by the commissioner. Upon a satisfactory showing that the registration card has been lost or destroyed, the commissioner shall issue a replacement registration card upon payment of a fee of $4. The fees collected from replacement registration cards must be credited to the off-highway motorcycle account.\n(a) Application for transfer of ownership of an off-highway motorcycle registered under this section must be made to the commissioner within 15 days of the date of transfer.\n(b) An application for transfer must be executed by the current owner and the purchaser using a bill of sale that includes the vehicle serial number.\n(c) The purchaser is subject to the penalties imposed by section 84.774 if the purchaser fails to apply for transfer of ownership as provided under this subdivision.\n(a) Application for transfer of registration under this section must be made to the commissioner within 15 days of the date of transfer.\n(b) An application for transfer must be executed by the current owner and the purchaser using a bill of sale that includes the vehicle serial number.\n(c) The purchaser is subject to the penalties imposed by section 84.774 if the purchaser fails to apply for transfer of registration as provided under this subdivision.\n(a) The fee for registration of an off-highway motorcycle under this section, other than those registered by a dealer or manufacturer under paragraph (b) or (c), is $45 for three years and $4 for a duplicate or transfer.\n(b) The total registration fee for off-highway motorcycles owned by a dealer and operated for demonstration or testing purposes is $50 per year. Dealer registrations are not transferable.\n(c) The total registration fee for off-highway motorcycles owned by a manufacturer and operated for research, testing, experimentation, or demonstration purposes is $150 per year. Manufacturer registrations are not transferable.\n(d) The fees collected under this subdivision must be deposited in the state treasury and credited to the off-highway motorcycle account.\nAn owner of an off-highway motorcycle must renew registration in a manner prescribed by the commissioner upon payment of the appropriate registration fee in subdivision 6.\nA registration number must be issued without the payment of a fee for off-highway motorcycles owned by the state or political subdivision upon application.\nA political subdivision of this state may not require licensing or registration of off-highway motorcycles covered by sections 84.787 to 84.795.\nA person under the age of 18 may not register an off-highway motorcycle.\nThe commissioner may issue a refund on a registration, not including any issuing fees paid under subdivision 3, paragraph (e), or section 84.027, subdivision 15, paragraph (a), clause (2), if the refund request is received within 12 months of the original registration and:\n(1) the off-highway motorcycle was registered incorrectly by the commissioner or the deputy registrar; or\n(2) the off-highway motorcycle was registered twice, once by the dealer and once by the customer.\n[See Note.]\n(a) An off-highway motorcycle registered under this section may also be registered as a motorcycle under chapter 168 for use on public roads and highways.\n(b) If the off-highway motorcycle was not originally constructed primarily for use on public roads and highways, the off-highway motorcycle must be equipped with mirrors and a headlight, taillight, and horn and be otherwise modified as necessary to meet the requirements of chapter 169, the safety standards of the National Traffic and Motor Safety Act, Code of Federal Regulations, title 49, part 571, and the regulations adopted under that federal act, for motorcycles regarding safety and acceptability to operate on public roads and highways.\n(c) An applicant for registration under chapter 168 must submit a form, prescribed by the commissioner of public safety.\n(d) For the purposes of this subdivision, off-highway motorcycle according to section 84.787, subdivision 7, does not include a golf cart; mini truck; dune buggy; go-cart; moped; pocket bike; gray market vehicle; or vehicle designed and used specifically for lawn maintenance, agriculture, logging, or mining purposes.",
	"repealed": false
}