{
	"id": "151.375",
	"url": "https://www.revisor.mn.gov/statutes/cite/151.375",
	"title": "151.375 INVESTIGATIONAL DRUG USE.",
	"text": "This section may be cited as the \"Right to Try Act.\"\n(a) For the purposes of this section, the following terms have the meanings given them.\n(b) \"Eligible patient\" means a patient who meets the requirements in subdivision 3.\n(c) \"Investigational drug, biological product, or device\" means a drug, biological product, or device that has successfully completed phase 1 of a clinical trial, but has not been approved for general use by the federal Food and Drug Administration (FDA), and is currently under investigation in a FDA clinical trial.\n(d) \"Terminal illness\" means a condition or illness which, to a reasonable degree of medical probability, is not considered reversible and even with the administration of current FDA-approved and available treatments and the administration of life-sustaining procedures will soon result in death.\nIn order for a patient to access an investigational drug, biological product, or device under this section, a physician must document in writing that the patient:\n(1) has a terminal illness;\n(2) has, in consultation with a physician, considered all other treatment options currently approved by the FDA;\n(3) has been given a prescription or recommendation by a physician for an investigational drug, biological product, or device; and\n(4) has given informed consent, in writing, for the use of the investigational drug, biological product, or device, or if the patient is under the age of 18, or lacks the mental capacity to provide informed consent, a parent or legal guardian has given informed consent, in writing, on behalf of the patient.\n(a) A manufacturer of an investigational drug, biological product, or device has the option of making its investigational drug, biological product, or device available to eligible patients under this section.\n(b) Nothing in this section shall be construed to require a manufacturer to make an investigational drug, biological product, or device available.\n(a) A manufacturer may provide an investigational drug, biological product, or device without receiving compensation.\n(b) A manufacturer may require an eligible patient to pay the costs associated with manufacturing the investigational drug, biological product, or device.\nNo health care provider shall be subject to a civil penalty or disciplinary action by any business, occupational, or professional licensing board, solely for providing a prescription or recommendation, or providing treatment to an eligible patient in accordance with this section. Nothing in this section affects a professional licensing board from taking action in response to violations of any other section of law.\nNothing in this section shall be construed to require that the costs associated with an investigational drug, biological product, or device be covered under private health coverage, a state public health care program, the state employee group insurance program, or a program administered by a state or local government agency that provides health care services to inmates residing in a state or county correctional facility.\nNothing in this section shall create a separate private cause of action against any health care provider or entity involved in the care of an eligible patient using an investigational drug, biological product, or device, for any harm done to the patient resulting from the investigational drug, biological product, or device, so long as the health care provider or entity is complying with the requirements of this section.\nThis section does not apply to a person committed to the custody of the commissioner of corrections unless the department's medical director approves the investigational drug, biological product, or device.\nIf any provision of this section or its application to any person or circumstances is held to be invalid, the invalidity of the provision shall not affect any other provision of this section. The provisions of this section are severable.",
	"repealed": false
}