{
	"id": "297A.68",
	"url": "https://www.revisor.mn.gov/statutes/cite/297A.68",
	"title": "297A.68 BUSINESS EXEMPTIONS.",
	"text": "The gross receipts from the sale of, and storage, distribution, use, or consumption of the items contained in this section are specifically exempted from the taxes imposed by this chapter.\n(a) Materials stored, used, or consumed in industrial production of tangible personal property intended to be sold ultimately at retail, are exempt, whether or not the item so used becomes an ingredient or constituent part of the property produced. Materials that qualify for this exemption include, but are not limited to, the following:\n(1) chemicals, including chemicals used for cleaning food processing machinery and equipment;\n(2) materials, including chemicals, fuels, and electricity purchased by persons engaged in industrial production to treat waste generated as a result of the production process;\n(3) fuels, electricity, gas, and steam used or consumed in the production process, except that electricity, gas, or steam used for space heating, cooling, or lighting is exempt if (i) it is in excess of the average climate control or lighting for the production area, and (ii) it is necessary to produce that particular product;\n(4) petroleum products and lubricants;\n(5) packaging materials, including returnable containers used in packaging food and beverage products;\n(6) accessory tools, equipment, and other items that are separate detachable units with an ordinary useful life of less than 12 months used in producing a direct effect upon the product; and\n(7) the following materials, tools, and equipment used in metal-casting: crucibles, thermocouple protection sheaths and tubes, stalk tubes, refractory materials, molten metal filters and filter boxes, degassing lances, and base blocks.\n(b) This exemption does not include:\n(1) machinery, equipment, implements, tools, accessories, appliances, contrivances and furniture and fixtures, except those listed in paragraph (a), clause (6); and\n(2) petroleum and special fuels used in producing or generating power for propelling ready-mixed concrete trucks on the public highways of this state.\n(c) Industrial production includes, but is not limited to, research, development, design or production of any tangible personal property, manufacturing, processing (other than by restaurants and consumers) of agricultural products (whether vegetable or animal), commercial fishing, refining, smelting, reducing, brewing, distilling, printing, mining, quarrying, lumbering, generating electricity, the production of road building materials, and the research, development, design, or production of computer software. Industrial production does not include painting, cleaning, repairing or similar processing of property except as part of the original manufacturing process.\n(d) Industrial production does not include:\n(1) the furnishing of services listed in section 297A.61, subdivision 3, paragraph (g), clause (6), items (i) to (vi) and (viii); or\n(2) the transportation, transmission, or distribution of petroleum, liquefied gas, natural gas, water, or steam, in, by, or through pipes, lines, tanks, mains, or other means of transporting those products. For purposes of this paragraph, \"transportation, transmission, or distribution\" does not include blending of petroleum or biodiesel fuel as defined in section 239.77.\n(a) Materials stored, used, or consumed in providing a taxable service listed in section 297A.61, subdivision 3, paragraph (g), clause (6), intended to be sold ultimately at retail are exempt.\n(b) This exemption includes, but is not limited to:\n(1) chemicals, lubricants, packaging materials, seeds, trees, fertilizers, and herbicides, if these items are used or consumed in providing the taxable service;\n(2) chemicals used to treat waste generated as a result of providing the taxable service;\n(3) accessory tools, equipment, and other items that are separate detachable units used in providing the service and that have an ordinary useful life of less than 12 months; and\n(4) fuel, electricity, gas, and steam used or consumed in the production process, except that electricity, gas, or steam used for space heating, cooling, or lighting is exempt if (i) it is in excess of average climate control or lighting, and (ii) it is necessary to produce that particular service.\n(c) This exemption does not include machinery, equipment, implements, tools, accessories, appliances, contrivances, furniture, and fixtures used in providing the taxable service.\nCoin-operated entertainment and amusement devices including, but not limited to, fortune-telling machines, cranes, foosball and pool tables, video and pinball games, batting cages, rides, photo or video booths, and jukeboxes are exempt when purchased by retailers selling admission to places of amusement and making available amusement devices as provided in section 297A.61, subdivision 3, paragraph (g), clause (1). Coin-operated entertainment and amusement devices do not include vending machines, lottery devices, or gaming devices as described in chapters 297E and 349.\nMill liners, grinding rods, and grinding balls that are substantially consumed in the production of taconite or other ores, metals, or minerals are exempt when sold to or stored, used, or consumed by persons taxed under the in-lieu or gross proceeds provisions of chapter 298.\n(a) Capital equipment is exempt.\n\"Capital equipment\" means machinery and equipment purchased or leased, and used in this state by the purchaser or lessee primarily for manufacturing, fabricating, mining, or refining tangible personal property to be sold ultimately at retail if the machinery and equipment are essential to the integrated production process of manufacturing, fabricating, mining, or refining. Capital equipment also includes machinery and equipment used primarily to electronically transmit results retrieved by a customer of an online computerized data retrieval system.\n(b) Capital equipment includes, but is not limited to:\n(1) machinery and equipment used to operate, control, or regulate the production equipment;\n(2) machinery and equipment used for research and development, design, quality control, and testing activities;\n(3) environmental control devices that are used to maintain conditions such as temperature, humidity, light, or air pressure when those conditions are essential to and are part of the production process;\n(4) materials and supplies used to construct and install machinery or equipment;\n(5) repair and replacement parts, including accessories, whether purchased as spare parts, repair parts, or as upgrades or modifications to machinery or equipment;\n(6) materials used for foundations that support machinery or equipment;\n(7) materials used to construct and install special purpose buildings used in the production process;\n(8) ready-mixed concrete equipment in which the ready-mixed concrete is mixed as part of the delivery process regardless if mounted on a chassis, repair parts for ready-mixed concrete trucks, and leases of ready-mixed concrete trucks; and\n(9) machinery or equipment used for research, development, design, or production of computer software.\n(c) Capital equipment does not include the following:\n(1) motor vehicles taxed under chapter 297B;\n(2) machinery or equipment used to receive or store raw materials;\n(3) building materials, except for materials included in paragraph (b), clauses (6) and (7);\n(4) machinery or equipment used for nonproduction purposes, including, but not limited to, the following: plant security, fire prevention, first aid, and hospital stations; support operations or administration; pollution control; and plant cleaning, disposal of scrap and waste, plant communications, space heating, cooling, lighting, or safety;\n(5) farm machinery and aquaculture production equipment as defined by section 297A.61, subdivisions 12 and 13;\n(6) machinery or equipment purchased and installed by a contractor as part of an improvement to real property;\n(7) machinery and equipment used by restaurants in the furnishing, preparing, or serving of prepared foods as defined in section 297A.61, subdivision 31;\n(8) machinery and equipment used to furnish the services listed in section 297A.61, subdivision 3, paragraph (g), clause (6), items (i) to (vi) and (viii);\n(9) machinery or equipment used in the transportation, transmission, or distribution of petroleum, liquefied gas, natural gas, water, or steam, in, by, or through pipes, lines, tanks, mains, or other means of transporting those products. This clause does not apply to machinery or equipment used to blend petroleum or biodiesel fuel as defined in section 239.77; or\n(10) any other item that is not essential to the integrated process of manufacturing, fabricating, mining, or refining.\n(d) For purposes of this subdivision:\n(1) \"Equipment\" means independent devices or tools separate from machinery but essential to an integrated production process, including computers and computer software, used in operating, controlling, or regulating machinery and equipment; and any subunit or assembly comprising a component of any machinery or accessory or attachment parts of machinery, such as tools, dies, jigs, patterns, and molds.\n(2) \"Fabricating\" means to make, build, create, produce, or assemble components or property to work in a new or different manner.\n(3) \"Integrated production process\" means a process or series of operations through which tangible personal property is manufactured, fabricated, mined, or refined. For purposes of this clause, (i) manufacturing begins with the removal of raw materials from inventory and ends when the last process prior to loading for shipment has been completed; (ii) fabricating begins with the removal from storage or inventory of the property to be assembled, processed, altered, or modified and ends with the creation or production of the new or changed product; (iii) mining begins with the removal of overburden from the site of the ores, minerals, stone, peat deposit, or surface materials and ends when the last process before stockpiling is completed; and (iv) refining begins with the removal from inventory or storage of a natural resource and ends with the conversion of the item to its completed form.\n(4) \"Machinery\" means mechanical, electronic, or electrical devices, including computers and computer software, that are purchased or constructed to be used for the activities set forth in paragraph (a), beginning with the removal of raw materials from inventory through completion of the product, including packaging of the product.\n(5) \"Machinery and equipment used for pollution control\" means machinery and equipment used solely to eliminate, prevent, or reduce pollution resulting from an activity described in paragraph (a).\n(6) \"Manufacturing\" means an operation or series of operations where raw materials are changed in form, composition, or condition by machinery and equipment and which results in the production of a new article of tangible personal property. For purposes of this subdivision, \"manufacturing\" includes the generation of electricity or steam to be sold at retail.\n(7) \"Mining\" means the extraction of minerals, ores, stone, or peat.\n(8) \"Online data retrieval system\" means a system whose cumulation of information is equally available and accessible to all its customers.\n(9) \"Primarily\" means machinery and equipment used 50 percent or more of the time in an activity described in paragraph (a).\n(10) \"Refining\" means the process of converting a natural resource to an intermediate or finished product, including the treatment of water to be sold at retail.\n(11) This subdivision does not apply to telecommunications equipment as provided in subdivision 35a, and does not apply to wire, cable, or poles for telecommunications services.\nSpecial tooling is exempt. \"Special tooling\" means tools, dies, jigs, patterns, gauges, and other special tools that have value and use only for the buyer and for the use for which they are made. An item has value and use only to the buyer if the item is not standard enough to be stocked or ordered from a catalog or other sales literature, but must be produced in accordance with special requirements peculiar to the buyer and not common to someone else whose conditions for possible use of the material are reasonably similar to the buyer's.\nEquipment used for air cooling is exempt, if the equipment is purchased for conversion or replacement of an existing groundwater-based once-through cooling system as required under section 103G.271, subdivision 5.\nPollution control equipment purchased by a steel reprocessing firm is exempt if the equipment is necessary to meet state or federal emission standards. For purposes of this subdivision:\n(1) \"pollution control equipment\" means equipment used for the purpose of eliminating, preventing, or reducing air, land, or water pollution during or as a result of the manufacturing process; and\n(2) \"steel reprocessing firm\" means a firm whose primary business is the recovery of steel from automobiles, appliances, and other steel products and the rerefining of this recovered metal into new steel products.\nThe granting of the privilege of admission to a world championship football game sponsored by the National Football League and to related events sponsored by the National Football League is exempt.\nTangible personal property that is used or consumed in producing any publication regularly issued at average intervals not exceeding three months is exempt, and any such publication is exempt. \"Publication\" includes, but is not limited to, a qualified newspaper as defined by section 331A.02, together with any supplements or enclosures. \"Publication\" does not include magazines and periodicals sold over the counter. Tangible personal property that is used or consumed in producing a publication does not include machinery, equipment, implements, tools, accessories, appliances, contrivances, furniture, and fixtures used in the publication, or fuel, electricity, gas, or steam used for space heating or lighting.\nAdvertising contained in a publication is a nontaxable service and is exempt. Persons who publish or sell newspapers are engaging in a nontaxable service with respect to gross receipts realized from such news-gathering or news-publishing activities, including the sale of advertising.\nMaterials designed to advertise and promote the sale of merchandise or services are exempt if these materials are mailed or transferred to a person outside the state for use solely outside the state. Mailing and reply envelopes and cards and other shipping materials including, but not limited to, boxes, labels, containers, and banding, used exclusively in connection with these advertising and promotional materials are included in this exemption. The exemption applies regardless of where the mailing occurs. The storage of these materials in the state for the purpose of subsequently shipping or otherwise transferring the material out of state is also exempt if the other conditions in this subdivision are met. For purposes of this subdivision, materials that have a primary purpose other than advertising, such as fulfilling a legal obligation or furnishing nonadvertising information, are not materials designed to advertise and promote the sale of merchandise or services even if they do include advertising content.\nWind energy conversion systems, as defined in section 216C.06, subdivision 19, that are used as an electric power source are exempt, and the materials used to manufacture, install, construct, repair, or replace them are exempt.\n(a) Tangible personal property is exempt if all of the following conditions are met:\n(1) the property, without intermediate use, is shipped or transported outside Minnesota by the purchaser or is stored, processed, fabricated or manufactured into, attached to or incorporated into other tangible personal property that is transported or shipped outside Minnesota; and\n(2) the property is used in a trade or business outside Minnesota after being shipped or transported outside of Minnesota, and is not returned to Minnesota, except in the course of interstate commerce; and\n(3) the property is either (i) not subject to tax in the state or country to which it is transported for storage or use, or (ii) to be used in other states or countries as part of a maintenance contract.\n(b) For purposes of this subdivision, storage or processing, fabricating, manufacturing, attaching to, or incorporating into other property is not intermediate use.\nTangible personal property is exempt if all of the following conditions are met:\n(1) it is shipped or brought into Minnesota by a for-hire carrier;\n(2) without use, it is kept in a public warehouse;\n(3) it is kept for the purpose of being later transported outside Minnesota; and\n(4) after storage, it is used solely outside Minnesota, except in the course of interstate commerce.\n[Repealed, 2006 c 259 art 6 s 32]\nPacking materials used to pack and ship household goods and that are provided to and remain with the customer of a for-hire carrier are exempt if the ultimate destination of the goods is outside Minnesota and if the packing materials are not later returned to a point within Minnesota, except in the course of interstate commerce. This exemption does not apply to tools, equipment, pads, or accessories owned or leased by the for-hire carrier.\nRepair, replacement, and rebuilding parts and materials, and lubricants, for the following are exempt:\n(1) ships or vessels used or to be used principally in interstate or foreign commerce; and\n(2) vessels with a gross registered tonnage of at least 3,000 tons.\n[Repealed, 2006 c 259 art 6 s 32]\nThe following petroleum products are exempt:\n(1) products upon which a tax has been imposed and paid under chapter 296A, and for which no refund has been or will be allowed because the buyer used the fuel for nonhighway use;\n(2) products that are used in the improvement of agricultural land by constructing, maintaining, and repairing drainage ditches, tile drainage systems, grass waterways, water impoundment, and other erosion control structures;\n(3) products purchased by a transit system receiving financial assistance under section 174.24, 256B.0625, subdivision 17, or 473.384;\n(4) products purchased by an ambulance service licensed under chapter 144E;\n(5) products used in a passenger snowmobile, as defined in section 296A.01, subdivision 39, for off-highway business use as part of the operations of a resort as provided under section 296A.16, subdivision 2, clause (2);\n(6) products purchased by a state or a political subdivision of a state for use in motor vehicles exempt from registration under section 168.012, subdivision 1, paragraph (b);\n(7) products purchased by providers of transportation to recipients of medical assistance home and community-based services waivers enrolled in day programs, including adult day care, family adult day care, day treatment and habilitation, prevocational services, and structured day services;\n(8) products used in a motor vehicle used exclusively as a mobile medical unit for the provision of medical or dental services by a federally qualified health center, as defined under title 19 of the federal Social Security Act, as amended by section 4161 of the Omnibus Budget Reconciliation Act of 1990; or\n(9) special fuel used for one of the following purposes:\n(i) to power a refrigeration unit mounted on a licensed motor vehicle, provided that the unit has an engine separate from the one used to propel the vehicle and the fuel is used exclusively for the unit;\n(ii) to power an unlicensed motor vehicle that is used solely or primarily to move semitrailers within a cargo yard, warehouse facility, or intermodal facility; or\n(iii) to operate a power take-off unit or auxiliary engine in or on a licensed motor vehicle, whether or not the unit or engine is fueled from the same or a different fuel tank as that from which the motor vehicle is fueled.\nNatural gas to be used as a fuel in vehicles propelled by natural gas is exempt.\n[Repealed, 1Sp2001 c 5 art 12 s 95]\nTranscripts or copies of transcripts of verbatim testimony are exempt if produced and sold by court reporters or other transcribers of legal proceedings to individuals or entities that are parties to or representatives of parties to the proceeding to which the transcript relates.\nAutomatic fire-safety sprinkler systems described in section 273.11, subdivision 6a, are exempt.\nEquipment used for processing solid or hazardous waste at a resource recovery facility, as defined in section 115A.03, subdivision 28, is exempt, including pollution control equipment at a resource recovery facility that burns refuse-derived fuel or mixed municipal solid waste as its primary fuel. An electric generation facility that processes and utilizes waste tires as its primary fuel is a resource recovery facility for the purposes of this section.\n(a) The sale of tangible personal property primarily used in a trade or business is exempt if the sale is not made in the normal course of business of selling that kind of property and if one of the following conditions is satisfied:\n(1) the sale occurs in a transaction subject to or described in section 118, 331, 332, 336, 337, 338, 351, 355, 368, 721, 731, 1031, or 1033 of the Internal Revenue Code, as amended through December 16, 2016;\n(2) the sale is between members of a controlled group as defined in section 1563(a) of the Internal Revenue Code;\n(3) the sale is between a sole member of a disregarded limited liability company and the disregarded limited liability company;\n(4) the sale is a sale of farm machinery;\n(5) the sale is a farm auction sale;\n(6) the sale is a sale of substantially all of the assets of a trade or business; or\n(7) the total amount of gross receipts from the sale of trade or business property made during the calendar month of the sale and the preceding 11 calendar months does not exceed $1,000.\nThe use, storage, distribution, or consumption of tangible personal property acquired as a result of a sale exempt under this subdivision is also exempt.\n(b) For purposes of this subdivision, the following terms have the meanings given.\n(1) \"Disregarded limited liability company\" means a limited liability company that is disregarded as an entity separate from its owner under the Internal Revenue Code.\n(2) A \"farm auction\" is a public auction conducted by a licensed auctioneer if substantially all of the property sold consists of property used in the trade or business of farming and property not used primarily in a trade or business.\n(3) \"Trade or business\" includes the assets of a separate division, branch, or identifiable segment of a trade or business if, before the sale, the income and expenses attributable to the separate division, branch, or identifiable segment could be separately ascertained from the books of account or record (the lease or rental of an identifiable segment does not qualify for the exemption).\n(4) A \"sale of substantially all of the assets of a trade or business\" must occur as a single transaction or a series of related transactions within the 12-month period beginning on the date of the first sale of assets intended to qualify for the exemption provided in paragraph (a), clause (5).\n[Repealed, 2002 c 377 art 3 s 26]\n[Renumbered 297A.67, subd 30]\nMedical supplies purchased by a licensed health care facility or licensed health care professional to provide medical treatment to residents or patients are exempt. The exemption does not apply to durable medical equipment or components of durable medical equipment, laboratory supplies, radiological supplies, and other items used in providing medical services. For purposes of this subdivision, \"medical supplies\" means adhesive and nonadhesive bandages, gauze pads and strips, cotton applicators, antiseptics, eye solution, and other similar supplies used directly on the resident or patient in providing medical services.\nTangible personal property that will be given as prizes to players in games of skill or chance is exempt if the games are conducted at events such as community festivals, fairs, and carnivals and if the events last less than six days. This exemption does not apply to property awarded as prizes in connection with lawful gambling as defined in section 349.12 or the State Lottery.\nTangible personal property primarily used or consumed in the preproduction, production, or postproduction of a television commercial is exempt. Any such commercial, regardless of the medium in which it is transferred, is exempt. \"Preproduction\" and \"production\" include, but are not limited to, all activities related to the preparation for shooting and the shooting of television commercials, including film processing. Equipment rented for the preproduction and production activities is exempt. \"Postproduction\" includes, but is not limited to, all activities related to the finishing and duplication of television commercials. This exemption does not apply to tangible personal property used primarily in administration, general management, or marketing. Machinery and equipment purchased for use in producing such commercials and fuel, electricity, gas, or steam used for space heating or lighting are not exempt under this subdivision.\nCompactors and waste collection containers are exempt if they are purchased by a waste management service provider and are used in providing waste management services as defined in section 297H.01, subdivision 12. A waste management service provider that does not remit tax on customer charges or lease or rental payments for compactors and waste collection containers under chapter 297H is ineligible for this exemption.\nTickets or admissions to places of amusement located outside Minnesota or to athletic events to be held outside Minnesota are exempt.\nA drawing, diagram, or similar or related document or a copy of such a document is exempt if the document:\n(1) is produced and sold by a patent drafter; and\n(2) is for use in:\n(i) a patent, trademark, or copyright application to be filed with government agencies;\n(ii) an application to the federal Food and Drug Administration for approval of a medical device; or\n(iii) a judicial or quasi-judicial proceeding, including mediation and arbitration, relating to the validity of or legal rights under a patent, trademark, or copyright.\nFor purposes of this subdivision, a \"patent drafter\" is a person who prepares illustrative documents required in the preparation of intellectual property applications.\nTangible personal property used or consumed primarily and directly for tramways at ski areas or in snowmaking and snow-grooming operations at ski hills, ski slopes, or ski trails, including machinery, equipment, fuel, electricity, and water additives used in the production and maintenance of machine-made snow, is exempt.\n[Repealed, 2013 c 143 art 8 s 53]\n(a) Telecommunications or pay television services machinery and equipment purchased or leased for use directly by a telecommunications or pay television services provider primarily in the provision of telecommunications or pay television services that are ultimately to be sold at retail are exempt, regardless of whether purchased by the owner, a contractor, or a subcontractor.\n(b) For purposes of this subdivision, \"telecommunications or pay television machinery and equipment\" includes, but is not limited to:\n(1) machinery, equipment, and fixtures utilized in receiving, initiating, amplifying, processing, transmitting, retransmitting, recording, switching, or monitoring telecommunications or pay television services, such as computers, transformers, amplifiers, routers, bridges, repeaters, multiplexers, and other items performing comparable functions;\n(2) machinery, equipment, and fixtures used in the transportation of telecommunications or pay television services, such as radio transmitters and receivers, satellite equipment, microwave equipment, fiber, conduit, and other transporting media, but not wire, cable, or poles;\n(3) ancillary machinery, equipment, and fixtures that regulate, control, protect, or enable the machinery in clauses (1) and (2) to accomplish its intended function, such as auxiliary power supply, test equipment, towers, heating, ventilating, and air conditioning equipment necessary to the operation of the telecommunications or pay television equipment; and software necessary to the operation of the telecommunications or pay television equipment; and\n(4) repair and replacement parts, including accessories, whether purchased as spare parts, repair parts, or as upgrades or modifications to qualified machinery or equipment.\nCharges for the delivery or distribution of direct mail are exempt if the charges are separately stated on an invoice or similar billing document given to the purchaser.\n(a) Purchases of tangible personal property or taxable services by a qualified business, as defined in section 469.310, are exempt if the property or services are primarily used or consumed in a job opportunity building zone designated under section 469.314. For purposes of this subdivision, an aerial camera package, including any camera, computer, and navigation device contained in the package, that is used in an aircraft that is operated under a Federal Aviation Administration Restricted Airworthiness Certificate according to Code of Federal Regulations, title 14, part 21, section 21.25(b)(3), relating to aerial surveying, and that is based, maintained, and dispatched from a job opportunity building zone, qualifies as primarily used or consumed in a job opportunity building zone if the imagery acquired from the aerial camera package is returned to the job opportunity building zone for processing. The exemption for an aerial camera package is limited as provided in this subdivision and the tax must be imposed and collected as if the rate under section 297A.62, subdivision 1, applied and then refunded in the manner provided in section 297A.75. The total amount of the aerial camera package exemption refunded for all taxpayers for all fiscal years is limited to $50,000 in taxes.\n(b) Purchase and use of construction materials and supplies used or consumed in, and equipment incorporated into, the construction of improvements to real property in a job opportunity building zone are exempt if the improvements after completion of construction are to be used in the conduct of a qualified business, as defined in section 469.310. This exemption applies regardless of whether the purchases are made by the business or a contractor.\n(c) The exemptions under this subdivision apply to a local sales and use tax regardless of whether the local sales tax is imposed on the sales taxable as defined under this chapter.\n(d) This subdivision applies to sales, if the purchase was made and delivery received during the duration of the zone.\n(e) Notwithstanding the restriction in paragraph (a), which requires items purchased to be primarily used or consumed in the zone, purchases by a qualified business that is an electrical cooperative located in Meeker County of equipment and materials used for the generation, transmission, and distribution of electrical energy are exempt under this subdivision, except that:\n(1) the exemption for materials and equipment used or consumed outside the zone must not exceed $200,000 in taxes for all taxpayers for all fiscal years; and\n(2) no sales and use tax exemption is allowed for equipment purchased for resale.\nFor purposes of this paragraph, the tax must be imposed and collected as if the rate under section 297A.62, subdivision 1, applied and then refunded in the manner provided in section 297A.75.\n[Repealed, 2014 c 308 art 9 s 94]\n(a) The sale of tangible personal property or services is exempt from tax or a tax rate increase for a period of six months from the effective date of the law change that results in the imposition of the tax or the tax rate increase under this chapter if:\n(1) the act imposing the tax or increasing the tax rate does not have transitional effective date language for existing construction contracts and construction bids; and\n(2) the requirements of paragraph (b) are met.\n(b) A sale is tax exempt under paragraph (a) if it meets the requirements of either clause (1) or (2):\n(1) For a construction contract:\n(i) the goods or services sold must be used for the performance of a bona fide written lump sum or fixed price construction contract;\n(ii) the contract must be entered into before the date the goods or services become subject to the sales tax or the tax rate was increased;\n(iii) the contract must not provide for allocation of future taxes; and\n(iv) for each qualifying contract the contractor must keep documentation of the contract on which an exemption is to be claimed.\n(2) For a construction bid:\n(i) the goods or services sold must be used pursuant to an obligation of a bid or bids;\n(ii) the bid or bids must be submitted and accepted before the date the goods or services became subject to the sales tax or the tax rate was increased;\n(iii) the bid or bids must not be able to be withdrawn, modified, or changed without forfeiting a bond; and\n(iv) for each qualifying bid, the contractor must keep documentation of the bid on which an exemption is to be claimed.\nTree, bush, shrub, and stump removal are exempt when sold to contractors or subcontractors as part of a land clearing contract. For purposes of this subdivision, \"land clearing contract\" means a contract for the removal of trees, bushes, and shrubs, including the removal of roots and stumps, to develop a site. This exemption does not apply to land clearing of a portion of a site to allow for remodeling, improvement, or expansion of an existing structure.\n[Repealed, 2012 c 294 art 2 s 43]\n(a) Purchases of enterprise information technology equipment and computer software for use in a qualified data center, or a qualified refurbished data center, are exempt, except that computer software maintenance agreements are exempt for purchases made after June 30, 2013. The tax on purchases exempt under this paragraph must be imposed and collected as if the rate under section 297A.62, subdivision 1, applied, and then refunded after June 30, 2013, in the manner provided in section 297A.75. This exemption includes enterprise information technology equipment and computer software purchased to replace or upgrade enterprise information technology equipment and computer software in a qualified data center, or a qualified refurbished data center.\n(b) Electricity used or consumed in the operation of a qualified data center or qualified refurbished data center is exempt.\n(c) For purposes of this subdivision, \"qualified data center\" means a facility in Minnesota:\n(1) that is comprised of one or more buildings that consist in the aggregate of at least 25,000 square feet, and that are located on a single parcel or on contiguous parcels, where the total cost of construction or refurbishment, investment in enterprise information technology equipment, and computer software is at least $30,000,000 within a 48-month period. The 48-month period begins no sooner than July 1, 2012, except that costs for computer software maintenance agreements purchased before July 1, 2013, are not included in determining if the $30,000,000 threshold has been met;\n(2) that is constructed or substantially refurbished after June 30, 2012, where \"substantially refurbished\" means that at least 25,000 square feet have been rebuilt or modified, including:\n(i) installation of enterprise information technology equipment; environmental control, computer software, and energy efficiency improvements; and\n(ii) building improvements; and\n(3) that is used to house enterprise information technology equipment, where the facility has the following characteristics:\n(i) uninterruptible power supplies, generator backup power, or both;\n(ii) sophisticated fire suppression and prevention systems; and\n(iii) enhanced security. A facility will be considered to have enhanced security if it has restricted access to the facility to selected personnel; permanent security guards; video camera surveillance; an electronic system requiring pass codes, keycards, or biometric scans, such as hand scans and retinal or fingerprint recognition; or similar security features.\nIn determining whether the facility has the required square footage, the square footage of the following spaces shall be included if the spaces support the operation of enterprise information technology equipment: office space, meeting space, and mechanical and other support facilities. For purposes of this subdivision, \"computer software\" includes, but is not limited to, software utilized or loaded at a qualified data center or qualified refurbished data center, including maintenance, licensing, and software customization.\n(d) For purposes of this subdivision, a \"qualified refurbished data center\" means an existing facility that qualifies as a data center under paragraph (c), clauses (2) and (3), but that is comprised of one or more buildings that consist in the aggregate of at least 25,000 square feet, and that are located on a single parcel or contiguous parcels, where the total cost of construction or refurbishment, investment in enterprise information technology equipment, and computer software is at least $50,000,000 within a 24-month period.\n(e) For purposes of this subdivision, \"enterprise information technology equipment\" means computers and equipment supporting computing, networking, or data storage, including servers and routers. It includes, but is not limited to: cooling systems, cooling towers, and other temperature control infrastructure; power infrastructure for transformation, distribution, or management of electricity used for the maintenance and operation of a qualified data center or qualified refurbished data center, including but not limited to exterior dedicated business-owned substations, backup power generation systems, battery systems, and related infrastructure; and racking systems, cabling, and trays, which are necessary for the maintenance and operation of the qualified data center or qualified refurbished data center.\n(f) A qualified data center or qualified refurbished data center may claim the exemptions in this subdivision for purchases made either within 20 years of the date of its first purchase qualifying for the exemption under paragraph (a), or by June 30, 2042, whichever is earlier.\n(g) The purpose of this exemption is to create jobs in the construction and data center industries.\n(h) This subdivision is effective for sales and purchases made before July 1, 2042.\n(i) The commissioner of employment and economic development must certify to the commissioner of revenue, in a format approved by the commissioner of revenue, when a qualified data center has met the requirements under paragraph (c) or a qualified refurbished data center has met the requirements under paragraph (d). The certification must provide the following information regarding each qualified data center or qualified refurbished data center:\n(1) the total square footage amount;\n(2) the total amount of construction or refurbishment costs and the total amount of qualifying investments in enterprise information technology equipment and computer software;\n(3) the beginning and ending of the applicable period under either paragraph (c) or (d) in which the qualifying expenditures and purchases under clause (2) were made, but in no case shall the period begin before July 1, 2012; and\n(4) the date upon which the qualified data center first met the requirements under paragraph (c) or a qualified refurbished data center first met the requirements under paragraph (d).\n(j) Any refund for sales tax paid on qualifying purchases under this subdivision must not be issued unless the commissioner of revenue has received the certification required under paragraph (i) issued by the commissioner of employment and economic development.\n(k) The commissioner of employment and economic development must annually notify the commissioner of revenue of the qualified data centers that are projected to meet the requirements under paragraph (c) and the qualified refurbished data centers that are projected to meet the requirements under paragraph (d) in each of the next four years. The notification must provide the information required under paragraph (i), clauses (1) to (4), for each qualified data center or qualified refurbished data center.\n(a) When a ticket reseller who purchased a ticket from a seller who is in the business of selling tickets resells the ticket, the ticket reseller must charge tax on the total amount for which the ticket is resold and the following rules apply:\n(1) if the ticket reseller did not use a fully completed exemption certificate to claim the exemption from tax for resale, but instead paid tax on the original purchase, then the ticket reseller may do one of the following:\n(i) seek a refund of that tax under section 289A.50; or\n(ii) pass through to the purchaser the amount of the tax the ticket reseller paid on the original purchase, by giving the purchaser credit for the Minnesota state and local tax paid by the ticket reseller on the ticket reseller's original purchase of the ticket. Credit for the tax cannot exceed either the sales tax paid on the original price of the ticket or the sales tax charged by the ticket reseller to the final purchaser;\n(2) if the ticket reseller did not pay tax on the original purchase, tax is due on the full amount of the ticket when resold, without a credit given to the final purchaser; and\n(3) the ticket reseller must retain records documenting the price and tax paid by the ticket reseller when purchasing the ticket and the price and tax collected when the ticket reseller resells the ticket.\n(b) When a ticket reseller who purchased a ticket from a seller who is not in the business of selling tickets resells the ticket, the ticket reseller must charge tax on the total amount for which the ticket is resold and the following rules apply:\n(1) the ticket reseller may credit its purchaser an amount equal to the tax the ticket reseller would have paid its seller, had the seller been registered to collect tax on its sale of the ticket to the ticket reseller. Credit for the tax cannot exceed either the sales tax paid on the original price of the ticket or the sales tax charged by the ticket reseller to the final purchaser. It is presumed that the original purchase price of the ticket is the face amount of the ticket;\n(2) if no tax was paid on the original purchase, tax is due on the full amount of the ticket when resold, without a credit given to the ticket reseller's purchaser; and\n(3) the ticket reseller must retain records documenting the price and tax paid by the ticket reseller when purchasing the ticket and the price and tax collected when the ticket reseller resells the ticket.\n(c) For purposes of this subdivision, \"ticket reseller\" means a person who:\n(1) purchases admission tickets to a sporting event, theater, musical performance, or place of public entertainment or amusement of any kind;\n(2) resells admission tickets to events under clause (1); and\n(3) is registered to collect tax under this chapter.\n(a) Purchases and use of tangible personal property or taxable services by a qualified business are exempt if:\n(1) the commissioner of employment and economic development certifies to the commissioner of revenue, in a format approved by the commissioner of revenue, that the qualified business meets the requirements under section 116J.8738;\n(2) the business subsidy agreement provides that the exemption under this subdivision applies;\n(3) the property or services are primarily used or consumed at the facility in greater Minnesota identified in the business subsidy agreement; and\n(4) the purchase was made and delivery received during the duration of the business subsidy agreement.\n(b) Purchase and use of construction materials and supplies used or consumed in, and equipment incorporated into, the construction of improvements to real property in greater Minnesota are exempt if the improvements after completion of construction are to be used in the conduct of the trade or business of the qualified business, and the commissioner of employment and economic development certifies to the commissioner of revenue, in a format approved by the commissioner of revenue, that the qualified business meets the requirements under section 116J.8738. This exemption applies regardless of whether the purchases are made by the business or a contractor.\n(c) The exemptions under this subdivision apply to a local sales and use tax.\n(d) The tax on purchases imposed under this subdivision must be imposed and collected as if the rate under section 297A.62 applied, and then refunded in the manner provided in section 297A.75. The total amount refunded for a facility over the certification period is limited to the amount listed in the business subsidy agreement. No more than $7,000,000 may be refunded in a fiscal year for all purchases under this subdivision. Refunds must be allocated on a first-come, first-served basis. If more than $7,000,000 of eligible claims are made in a fiscal year, claims by qualified businesses carry over to the next fiscal year, and the commissioner of revenue must first allocate refunds to qualified businesses eligible for a refund in the preceding fiscal year. Any portion of the balance of funds allocated for refunds under this paragraph does not cancel and shall be carried forward to and available for refunds in subsequent fiscal years. Notwithstanding section 297A.75, subdivision 4, for an eligible refund claim that carries over to a subsequent fiscal year, the interest on the amount carried over must be paid on the refund no sooner than from 90 days after July 1 of the fiscal year in which funds are available for the eligible claim.\nThe purchase of music, either as a digital audio work or in tangible form such as a record or compact disc, by operators that provide the service of making available jukeboxes as amusement devices, as provided in section 297A.61, subdivision 3, paragraph (g), clause (1), is exempt if the music is used exclusively for the jukebox.\n(a) The sale of amenities, including but not limited to food and beverages, parking services, and promotional items, that are included in the sales price of the privilege of admission to athletic events and places of amusement under section 297A.61, subdivision 3, paragraph (m), are exempt when sold by a seller of the privilege of admission that is a professional sports team competing in Major League Baseball, Major League Soccer, the National Basketball Association, the Women's National Basketball Association, the National Football League, or the National Hockey League.\n(b) Under this subdivision, the exempt portion of the sale of the privilege of admission is equal to the purchase price of the amenity if sales or use tax was paid on the amenity when purchased by the seller.\n(c) The seller must retain records documenting the price and tax paid by the seller when purchasing the amenities and the price and tax collected when the seller sells the privilege of admission.\n(d) This subdivision expires July 1, 2030.",
	"repealed": false
}