{
	"id": "97A.421",
	"url": "https://www.revisor.mn.gov/statutes/cite/97A.421",
	"title": "97A.421 VALIDITY AND ISSUANCE OF LICENSES AFTER CONVICTION.",
	"text": "(a) The annual license of a person convicted of a violation of the game and fish laws relating to the license or wild animals covered by the license is void when:\n(1) a second conviction occurs within three years under a license to trap fur-bearing animals, take small game, or to take fish by angling or spearing;\n(2) a second conviction occurs within three years under a minnow dealer's license;\n(3) a second conviction occurs within three years for violations of section 97A.425 that do not involve falsifications or intentional omissions of information required to be recorded, or attempts to conceal unlawful acts within the records;\n(4) two or more misdemeanor convictions occur within a three-year period under a private fish hatchery license;\n(5) the conviction occurs under a license not described in clause (1), (2), or (4) or is for a violation of section 97A.425 not described in clause (3); or\n(6) the conviction is related to assisting a person in the illegal taking, transportation, or possession of wild animals, when acting as a hunting or angling guide.\n(b) Except for big-game licenses and as otherwise provided in this section, for one year after the conviction the person may not obtain the kind of license or take wild animals under a lifetime license, issued under section 97A.473 or 97A.474, relating to the game and fish law violation.\nA person may not obtain a license to take any wild animal or take wild animals under a lifetime license, issued under section 97A.473 or 97A.474, for a period of three years after being convicted of buying or selling game fish, native rough fish, big game, or small game, and the total amount of the sale is $300 or more.\n(a) A person may not obtain a license to take a wild animal and is prohibited from taking wild animals for ten years after the date of conviction of a violation when the restitution value of the wild animals is $2,000 or more.\n(b) A person may not obtain a license to take a wild animal and is prohibited from taking wild animals for five years after the date of conviction of:\n(1) a violation when the restitution value of the wild animals is $1,000 or more, but less than $2,000; or\n(2) a violation when the restitution value of the wild animals exceeds $500 and the violation occurs within ten years of one or more previous license revocations under this subdivision.\n(c) A person may not obtain a license to take the type of wild animals involved in a violation when the restitution value of the wild animals exceeds $500 and is prohibited from taking the type of wild animals involved in the violation for three years after the date of conviction of a violation.\n(d) The time period of multiple revocations under paragraph (a) or (b), clause (2), is consecutive and no wild animals of any kind may be taken during the entire revocation period.\n(e) If a wild animal involved in the conviction is listed as a threatened or endangered wild animal, the revocations under this subdivision do not apply unless more than one animal is taken, possessed, or transported in violation of the game and fish laws.\n(f) The court may not stay or reduce the imposition of license revocation provisions under this subdivision.\n(a) A person may not use a big-game license purchased before conviction, obtain a big-game license, or take big game under a lifetime license, issued under section 97A.473, for three years after the person is convicted of:\n(1) a gross misdemeanor violation under the game and fish laws relating to big game;\n(2) doing an act without a required big-game license; or\n(3) the second violation within three years under the game and fish laws relating to big game.\n(b) A person may not obtain any deer license or take deer under a lifetime license issued under section 97A.473 for one year after the person is convicted of hunting deer with the aid or use of bait under section 97B.328.\n(c) The revocation period under paragraphs (a) and (b) doubles if the conviction is for a deer that is a trophy deer scoring higher than 170 using the scoring method established for wildlife restitution values adopted under section 97A.345.\n(a) A person who is convicted of a violation under paragraph (b) and possessed a firearm with a suppressor may not obtain a hunting license or hunt wild animals for five years from the date of conviction.\n(b) The revocation under this subdivision applies to convictions of:\n(1) trespass as provided in section 97A.315, subdivision 1, paragraph (b);\n(2) hunting game in closed season;\n(3) hunting game more than one-half hour before legal shooting hours or more than one-half hour after legal shooting hours; or\n(4) using artificial lights to spot, locate, or take wild animals while in possession of a firearm.\n(a) A person who is convicted of a violation under paragraph (b) and who possessed night vision or thermal imaging equipment during the violation may not obtain a hunting license or hunt wild animals for five years from the date of conviction.\n(b) The revocation under this subdivision applies to convictions for:\n(1) trespassing;\n(2) hunting game in closed season;\n(3) hunting game in closed hours;\n(4) possessing night vision or thermal imaging equipment while taking wild animals in violation of section 97B.086; or\n(5) possessing unlawful firearms in deer zones in violation of section 97B.041.\nA person convicted of a violation under section 97B.065, relating to hunting while intoxicated or using narcotics, may not obtain a license to hunt with a firearm or by archery or hunt with a firearm or by archery under a lifetime license, issued under section 97A.473 or 97A.474, for five years after conviction.\nWhen a court reports to the commissioner that a person: (1) has failed to appear in court in response to a notice to appear or fails to comply with other orders of the court regarding the appearance or proceedings for a violation of the game and fish laws; or (2) has been convicted of violating a provision of the game and fish laws, has been sentenced to the payment of a fine or had a surcharge levied against them, and refused or failed to comply with that sentence or to pay the fine or surcharge, the commissioner shall suspend the game and fish license and permit privileges of the person until notified by the court that the person has appeared in court under clause (1) or that any fine or surcharge due the court has been paid under clause (2).\nIf the commissioner determines that the public welfare will not be injured, the commissioner may reinstate licenses voided under subdivision 1 and issue licenses to persons ineligible under subdivision 2 or 2a. The commissioner's authority applies only to licenses to:\n(1) maintain and operate fur or game farms, aquatic farms, or private fish hatcheries;\n(2) take fish by commercial netting;\n(3) buy fish from commercial netting licensees; and\n(4) sell or export turtles or live minnows.\nIn this section, the term \"license\" includes an application for a license to take either moose or elk.\nA person who takes a protected wild animal during the time the person is prohibited from obtaining a license to take that animal under this section is guilty of a misdemeanor.",
	"repealed": false
}