{
	"id": "304A.021",
	"url": "https://www.revisor.mn.gov/statutes/cite/304A.021",
	"title": "304A.021 DEFINITIONS.",
	"text": "For the purposes of this chapter, unless the language or context clearly indicates that a different meaning is intended, the words, terms, and phrases defined in this section have the meanings given them.\n\"General benefit corporation\" means a public benefit corporation that elects in its articles to pursue general public benefit and that may state in its articles a specific public benefit purpose it elects to pursue.\n\"General public benefit\" means a net material positive impact from the business and operations of a general benefit corporation on society, the environment, and the well-being of present and future generations.\n\"Independent\" means having no material relationship with a public benefit corporation or a parent, a subsidiary, or other affiliate of a public benefit corporation.\n\"Minimum status vote\" means that the shareholders shall take action by the affirmative vote of the holders of at least two-thirds of all of the issued and outstanding shares.\n\"Organization\" means a domestic or foreign business or nonprofit corporation, limited liability company, whether domestic or foreign, partnership, limited partnership, joint venture, association, trust, estate, enterprise, or other legal or commercial entity.\n\"Public benefit corporation\" means a corporation formed under chapter 302A:\n(1) that has elected to become subject to this chapter; and\n(2) whose status as a public benefit corporation has not been terminated or revoked.\n\"Specific benefit corporation\" means a public benefit corporation that states in its articles a specific public benefit purpose it elects to pursue, but does not include a general benefit corporation that states in its articles a specific public benefit purpose it elects to pursue.\n\"Specific public benefit\" means one or more positive impacts, or reduction of a negative impact, on specified categories of natural persons, entities, communities, or interests, other than shareholders in their capacity as shareholders, as enumerated in the articles of a public benefit corporation.\n\"Third-party standard\" means:\n(1) a publicly available standard or guideline for defining, reporting, and assessing the performance of a business enterprise as a social or benefit corporation;\n(2) promulgated by a natural person or an organization; and\n(3) that is independent of the public benefit corporation.",
	"repealed": false
}