{
	"id": "145.902",
	"url": "https://www.revisor.mn.gov/statutes/cite/145.902",
	"title": "145.902 GIVE LIFE A CHANCE; SAFE PLACE FOR NEWBORNS DUTIES; IMMUNITY.",
	"text": "(a) For purposes of this section, a \"safe place\" means a hospital licensed under sections 144.50 to 144.56, a health care provider who provides urgent care medical services, or an ambulance service licensed under chapter 144E dispatched in response to a 911 call from a mother or a person with the mother's permission to relinquish a newborn infant.\n(b) A safe place shall receive a newborn left with an employee on the premises of the safe place during its hours of operation, provided that:\n(1) the newborn was born within seven days of being left at the safe place, as determined within a reasonable degree of medical certainty; and\n(2) the newborn is left in an unharmed condition.\n(c) The safe place must not inquire as to the identity of the mother or the person leaving the newborn or call the police, provided the newborn is unharmed when presented to the hospital. The safe place may ask the mother or the person leaving the newborn about the medical history of the mother or newborn but the mother or the person leaving the newborn is not required to provide any information. The safe place may provide the mother or the person leaving the newborn with information about how to contact relevant social service agencies.\n(d) A safe place that is a health care provider who provides urgent care medical services shall dial 911, advise the dispatcher that the call is being made from a safe place for newborns, and ask the dispatcher to send an ambulance or take other appropriate action to transport the newborn to a hospital. An ambulance with whom a newborn is left shall transport the newborn to a hospital for care. Hospitals must receive a newborn left with a safe place and make the report as required in subdivision 2.\nWithin 24 hours of receiving a newborn under this section, the hospital must inform the responsible social service agency that a newborn has been left at the hospital, but must not do so in the presence of the mother or the person leaving the newborn. The hospital must provide necessary care to the newborn pending assumption of legal responsibility by the responsible social service agency pursuant to section 260C.139, subdivision 5.\n(a) A safe place with responsibility for performing duties under this section, and any employee, doctor, ambulance personnel, or other medical professional working at the safe place, are immune from any criminal liability that otherwise might result from their actions, if they are acting in good faith in receiving a newborn, and are immune from any civil liability that otherwise might result from merely receiving a newborn.\n(b) A safe place performing duties under this section, or an employee, doctor, ambulance personnel, or other medical professional working at the safe place who is a mandated reporter under chapter 260E, is immune from any criminal or civil liability that otherwise might result from the failure to make a report under that section if the person is acting in good faith in complying with this section.",
	"repealed": false
}