{
	"id": "88.642",
	"url": "https://www.revisor.mn.gov/statutes/cite/88.642",
	"title": "88.642 DECORATIVE MATERIALS.",
	"text": "No person shall cut, harvest, remove, transport, or possess for decorative purposes or for sale more than three decorative trees, more than 100 pounds of decorative boughs, more than 50 spruce stems or branches greater than six inches in length, more than 50 birch stems or branches greater than one-inch large-end diameter, or more than 100 pounds of any other decorative materials without the written consent of the owner or authorized agent of the private or public land on which the decorative materials were cut or harvested. The written consent must contain the legal description of the land where the decorative materials were cut or harvested, as well as the name of the legal owner of the land or the owner's authorized agent. The written consent must be carried by every person cutting, harvesting, removing, possessing, or transporting any decorative materials, or in any way aiding therein, and must be exhibited to any officer at the officer's request at any time.\nAny officer shall have power to inspect any decorative materials when being transported in any vehicle or other means of conveyance or by common carrier, to make an investigation with reference thereto as may be necessary to determine whether or not the provisions of sections 88.641 to 88.648 have been complied with, to stop any vehicle or other means of conveyance found carrying decorative materials upon any public highways of this state, for the purpose of making an inspection and investigation, and to seize and hold subject to the order of the court any decorative materials found being cut, removed, or transported in violation of any provision of sections 88.641 to 88.648. Failure to comply with the requirements of sections 88.641 to 88.648 subjects the decorative materials to seizure and confiscation as contraband in addition to other penalties provided by law.\nNo person, common carrier, decorative materials buyer, or authorized agent shall purchase or otherwise receive for shipment or transportation any decorative materials without recording the seller's or consignor's name and address and the written consent on a form furnished or otherwise approved by the commissioner of natural resources.\nFailure to possess or exhibit a written consent shall be prima facie evidence that no consent was given or exists.\n(a) This section does not apply to decorative materials in the possession of or being transported by a federal, state, or local government official for a legitimate public purpose.\n(b) This section does not apply to a person cutting, harvesting, possessing, or transporting decorative materials cut from the person's own property if the person produces documentation that the person owns the property where the decorative materials were cut.",
	"repealed": false
}