{
	"id": "148.271",
	"url": "https://www.revisor.mn.gov/statutes/cite/148.271",
	"title": "148.271 EXEMPTIONS.",
	"text": "The provisions of sections 148.171 to 148.285 shall not prohibit:\n(1) The furnishing of nursing assistance in an emergency.\n(2) The practice of advanced practice, professional, or practical nursing by any legally qualified advanced practice, registered, or licensed practical nurse of another state who is employed by the United States government or any bureau, division, or agency thereof while in the discharge of official duties.\n(3) The practice of any profession or occupation licensed by the state, other than advanced practice, professional, or practical nursing, by any person duly licensed to practice the profession or occupation, or the performance by a person of any acts properly coming within the scope of the profession, occupation, or license.\n(4) The provision of a nursing or nursing-related service by an unlicensed assistive person who has been delegated or assigned the specific function and is supervised by a registered nurse or monitored by a licensed practical nurse.\n(5) The care of the sick with or without compensation when done in a nursing home covered by the provisions of section 144A.09, subdivision 1.\n(6) Professional nursing practice or advanced practice registered nursing practice by a registered nurse or practical nursing practice by a licensed practical nurse licensed in another state or territory who is in Minnesota as a student enrolled in a formal, structured course of study, such as a course leading to a higher degree, certification in a nursing specialty, or to enhance skills in a clinical field, while the student is practicing in the course.\n(7) Professional or practical nursing practice by a student practicing under the supervision of an instructor while the student is enrolled in a nursing program approved by the board under section 148.251.\n(8) Advanced practice registered nursing as defined in section 148.171, subdivisions 5, 10, 11, 13, and 21, by a registered nurse who is licensed and currently registered in Minnesota or another United States jurisdiction and who is enrolled as a student in a formal graduate education program leading to eligibility for certification and licensure as an advanced practice registered nurse.\n(9) Professional nursing practice or advanced practice registered nursing practice by a registered nurse or advanced practice registered nurse licensed in another state, territory, or jurisdiction who is in Minnesota temporarily:\n(i) providing continuing or in-service education;\n(ii) serving as a guest lecturer;\n(iii) presenting at a conference; or\n(iv) teaching didactic content via distance education to a student located in Minnesota who is enrolled in a formal, structured course of study, such as a course leading to a higher degree or certification in a nursing specialty.",
	"repealed": false
}