{
	"id": "469.40",
	"url": "https://www.revisor.mn.gov/statutes/cite/469.40",
	"title": "469.40 DEFINITIONS.",
	"text": "For the purposes of sections 469.40 to 469.47, the terms defined in this section have the meanings given them.\n\"City\" means the city of Rochester.\n\"County\" means Olmsted County.\n\"Destination Medical Center Corporation,\" \"corporation,\" or \"DMCC\" means the nonprofit corporation created by the city as provided in section 469.41, and organized under chapter 317A.\n\"Destination medical center development district\" or \"development district\" means a geographic area in the city identified in the DMCC development plan in which public infrastructure projects are implemented.\n\"Development plan\" means the plan adopted by the DMCC under section 469.43.\n\"Financial interest\" means a person's direct or indirect ownership or investment interest or compensation arrangement, whether through business, investment, or family, including spouse, children and stepchildren, and other relatives living with the person, as follows:\n(1) ownership or investment interest in the development, acquisition, or construction of a project in the development district;\n(2) compensation arrangement with respect to the development, acquisition, or construction of a project in the development district; or\n(3) potential ownership or investment interest in, or compensation arrangement with respect to, the development, acquisition, or construction of a project in the development district.\n\"Medical business entity\" means a medical business entity with its principal place of business in the city that, as of June 22, 2013, together with all business entities of which it is the sole member or sole shareholder, collectively employs more than 30,000 persons in the state.\n\"Nonprofit economic development agency\" or \"agency\" means the nonprofit agency required under section 469.43 to provide experience and expertise to the DMCC for purposes of developing and marketing the destination medical center.\n\"Project\" means a project to implement the development plan, whether public or private.\n(a) \"Public infrastructure project\" means a project financed in part or in whole with public money in order to support the medical business entity's development plans, as identified in the DMCC development plan. A public infrastructure project may:\n(1) acquire real property and other assets associated with the real property;\n(2) demolish, repair, or rehabilitate buildings;\n(3) remediate land and buildings as required to prepare the property for acquisition or development;\n(4) install, construct, or reconstruct elements of public infrastructure required to support the overall development of the destination medical center development district including but not limited to: streets, roadways, utilities systems and related facilities; utility relocations and replacements; network and communication systems; streetscape improvements; drainage systems; sewer and water systems; subgrade structures and associated improvements; landscaping; facade construction and restoration; design and predesign, including architectural, engineering, and similar services; legal, regulatory, and other compliance services; construction costs, including all materials and supplies; wayfinding and signage; community engagement; transit costs incurred on or after March 16, 2020; and other components of community infrastructure;\n(5) acquire, construct or reconstruct, and equip parking facilities and other facilities to encourage intermodal transportation and public transit;\n(6) install, construct or reconstruct, furnish, and equip parks, cultural, and recreational facilities, facilities to promote tourism and hospitality, conferencing and conventions, and broadcast and related multimedia infrastructure;\n(7) make related site improvements including, without limitation, excavation, earth retention, soil stabilization and correction, and site improvements to support the destination medical center development district;\n(8) prepare land for private development and to sell or lease land;\n(9) provide costs of relocation benefits to occupants of acquired properties; and\n(10) construct and equip all or a portion of one or more suitable structures on land owned by the city for sale or lease to private development; provided, however, that the portion of any structure directly financed by the city as a public infrastructure project must not be sold or leased to a medical business entity.\n(b) A public infrastructure project is not a business subsidy under section 116J.993.\n(c) Public infrastructure project includes the planning, preparation, and modification of the development plan under section 469.43. The cost of that planning, preparation, and any modification is a capital cost of the public infrastructure project.\n\"Year\" means a calendar year, except where otherwise provided.",
	"repealed": false
}