{
	"id": "513.48",
	"url": "https://www.revisor.mn.gov/statutes/cite/513.48",
	"title": "513.48 DEFENSES, LIABILITY, AND PROTECTION OF TRANSFEREE OR OBLIGEE.",
	"text": "(a) A transfer or obligation is not voidable under section 513.44, paragraph (a), clause (1), against a person that took in good faith and for a reasonably equivalent value given the debtor or against any subsequent transferee or obligee.\n(b) To the extent a transfer is avoidable in an action by a creditor under section 513.47, paragraph (a), clause (1), the following rules apply:\n(1) Except as otherwise provided in this section, the creditor may recover judgment for the value of the asset transferred, as adjusted under paragraph (c), or the amount necessary to satisfy the creditor's claim, whichever is less. The judgment may be entered against:\n(i) the first transferee of the asset or the person for whose benefit the transfer was made; or\n(ii) an immediate or mediate transferee of the first transferee, other than:\n(A) a good-faith transferee that took for value; or\n(B) an immediate or mediate good-faith transferee of a person described in subitem (A).\n(2) Recovery pursuant to section 513.47, paragraph (a), clause (1), or paragraph (b), of or from the asset transferred or its proceeds, by levy or otherwise, is available only against a person described in clause (1), item (i) or (ii).\n(c) If the judgment under paragraph (b) is based upon the value of the asset transferred, the judgment must be for an amount equal to the value of the asset at the time of the transfer, subject to adjustment as the equities may require.\n(d) Notwithstanding voidability of a transfer or an obligation under sections 513.41 to 513.51, a good faith transferee or obligee is entitled, to the extent of the value given the debtor for the transfer or obligation, to:\n(1) a lien on or a right to retain an interest in the asset transferred;\n(2) enforcement of an obligation incurred; or\n(3) a reduction in the amount of the liability on the judgment.\n(e) A transfer is not voidable under section 513.44, paragraph (a), clause (2), or 513.45 if the transfer results from:\n(1) termination of a lease upon default by the debtor when the termination is pursuant to the lease and applicable law; or\n(2) enforcement of a security interest in compliance with article 9 of the Uniform Commercial Code, other than acceptance of collateral in full or partial satisfaction of the obligation it secures.\n(f) A transfer is not voidable under section 513.45, paragraph (b):\n(1) to the extent the insider gave new value to or for the benefit of the debtor after the transfer was made, except to the extent the new value was secured by a valid lien;\n(2) if made in the ordinary course of business or financial affairs of the debtor and the insider; or\n(3) if made pursuant to a good faith effort to rehabilitate the debtor and the transfer secured present value given for that purpose as well as an antecedent debt of the debtor.\n(g) The following rules determine the burden of proving matters referred to in this section:\n(1) A party that seeks to invoke paragraph (a), (d), (e), or (f) has the burden of proving the applicability of that subsection.\n(2) Except as otherwise provided in clauses (3) and (4), the creditor has the burden of proving each applicable element of paragraph (b) or (c).\n(3) The transferee has the burden of proving the applicability to the transferee of paragraph (b), clause (1), item (ii), subitem (A) or (B).\n(4) A party that seeks adjustment under paragraph (c) has the burden of proving the adjustment.\n(h) Proof of matters referred to in this section is sufficient if established by a preponderance of the evidence.",
	"repealed": false
}