{
	"id": "148.191",
	"url": "https://www.revisor.mn.gov/statutes/cite/148.191",
	"title": "148.191 OFFICERS; STAFF; POWERS.",
	"text": "The board shall elect from its members a president, a vice-president, and a secretary-treasurer who shall each serve for one year or until a successor is elected and qualifies. The board shall appoint and employ an executive director subject to the terms described in section 214.04, subdivision 2a, and may employ such persons as may be necessary to carry on its work. A majority of the board, including one officer, shall constitute a quorum at any meeting.\n(a) The board is authorized to adopt and, from time to time, revise rules not inconsistent with the law, as may be necessary to enable it to carry into effect the provisions of sections 148.171 to 148.285. The board shall prescribe by rule curricula and standards for schools and courses preparing persons for licensure under sections 148.171 to 148.285. It shall conduct or provide for surveys of such schools and courses at such times as it may deem necessary. It shall approve such schools and courses as meet the requirements of sections 148.171 to 148.285 and board rules. It shall examine, license, and renew the license of duly qualified applicants. It shall hold examinations at least once in each year at such time and place as it may determine. It shall by rule adopt, evaluate, and periodically revise, as necessary, requirements for licensure and for registration and renewal of registration as defined in section 148.231. It shall maintain a record of all persons licensed by the board to practice advanced practice, professional, or practical nursing. It shall cause the prosecution of all persons violating sections 148.171 to 148.285 and have power to incur such necessary expense therefor. It shall register public health nurses who meet educational and other requirements established by the board by rule, including payment of a fee. It shall have power to issue subpoenas, and to compel the attendance of witnesses and the production of all necessary documents and other evidentiary material. Any board member may administer oaths to witnesses, or take their affirmation. It shall keep a record of all its proceedings.\n(b) The board shall have access to hospital, nursing home, and other medical records of a patient cared for by a nurse under review. If the board does not have a written consent from a patient permitting access to the patient's records, the nurse or facility shall delete any data in the record that identifies the patient before providing it to the board. The board shall have access to such other records as reasonably requested by the board to assist the board in its investigation. Nothing herein may be construed to allow access to any records protected by section 145.64. The board shall maintain any records obtained pursuant to this paragraph as investigative data under chapter 13.\n(c) The board may accept and expend grants or gifts of money or in-kind services from a person, a public or private entity, or any other source for purposes consistent with the board's role and within the scope of its statutory authority.\n(d) The board may accept registration fees for meetings and conferences conducted for the purposes of board activities that are within the scope of its authority.\n[Repealed, 1989 c 194 s 22]",
	"repealed": false
}