{
	"id": "160.266",
	"url": "https://www.revisor.mn.gov/statutes/cite/160.266",
	"title": "160.266 STATE BICYCLE ROUTES.",
	"text": "MS 2016 [Repealed, 1Sp2017 c 3 art 3 s 144]\nFor the purposes of this section, \"state bicycle route\" means a linear series of one or more roads or bikeways that is designated for bicycle travel, regardless of whether for exclusive use by bicycles or shared use with other modes of transportation.\nThe commissioner of transportation must identify state bicycle routes primarily on existing road right-of-way and trails. State bicycle routes must be identified in cooperation with road and trail authorities, including the commissioner of natural resources, and with the advice of the active transportation advisory committee under section 174.375. In a metropolitan area, state bicycle routes must be identified in coordination with the plans and priorities established by metropolitan planning organizations, as defined in United States Code, title 23, section 134.\nMS 2016 [Repealed, 1Sp2017 c 3 art 3 s 144]\n(a) The commissioner, in cooperation with road and trail authorities including the commissioner of natural resources, must:\n(1) identify existing bikeways of regional significance that are in reasonable proximity but not connected to the state bicycle routes established under this section; and\n(2) support development of linkages between state bicycle routes established under this section.\n(b) The requirements of this subdivision are a secondary priority for use of funds available under this section following establishment and enhancement of state bicycle routes under this section.\nThe commissioner may contract and enter into agreements with federal agencies, other state agencies, local governments, tribal governments, or private entities to establish, develop, maintain, and operate state bicycle routes and to interpret associated natural and cultural resources.\nShared use paths included within state bicycle routes and not administered by the commissioner of natural resources are eligible for funding from the environment and natural resources trust fund under chapter 116P, from the parks and trails grant program under section 85.535, from the local recreation grants program under section 85.019, subdivision 4b, and from other sources.\nThe Mississippi River Trail bikeway is designated as a state bicycle route. It must originate at Itasca State Park in Clearwater, Beltrami, and Hubbard Counties, then generally parallel the Mississippi River through the cities of Bemidji in Beltrami County, Grand Rapids in Itasca County, Brainerd in Crow Wing County, Little Falls in Morrison County, Sauk Rapids in Benton County, St. Cloud in Stearns County, Minneapolis in Hennepin County, St. Paul in Ramsey County, Hastings in Dakota County, Red Wing in Goodhue County, Wabasha in Wabasha County, Winona in Winona County, and La Crescent in Houston County to Minnesota's boundary with Iowa and there terminate. Where opportunities exist, the bikeway may be designated on both sides of the Mississippi River.\nThe Jim Oberstar Bikeway is designated as a state bicycle route. It must originate in the city of St. Paul in Ramsey County, then proceed north and east to Duluth in St. Louis County, then proceed north and east along the shore of Lake Superior through Grand Marais in Cook County to Minnesota's boundary with Canada, and there terminate.",
	"repealed": false
}