{
	"id": "115A.923",
	"url": "https://www.revisor.mn.gov/statutes/cite/115A.923",
	"title": "115A.923 GREATER MINNESOTA; LANDFILL CLEANUP FEE.",
	"text": "(a) The operator of a mixed municipal solid waste disposal facility outside of the metropolitan area shall charge a fee on solid waste accepted and disposed of at the facility as follows:\n(1) a facility that weighs the waste that it accepts must charge a fee of $2 per cubic yard based on equivalent cubic yards of waste accepted at the entrance of the facility;\n(2) a facility that does not weigh the waste but that measures the volume of the waste that it accepts must charge a fee of $2 per cubic yard of waste accepted at the entrance of the facility; and\n(3) waste residue from recycling facilities at which recyclable materials are separated or processed for the purpose of recycling, or from energy and resource recovery facilities at which solid waste is processed for the purpose of extracting, reducing, converting to energy, or otherwise separating and preparing solid waste for reuse is exempt from the fee imposed by this subdivision if there is at least an 85 percent weight reduction in the solid waste processed.\n(b) To qualify for exemption under paragraph (a), clause (3), waste residue must be brought to a disposal facility separately. The commissioner shall prescribe procedures for determining the amount of waste residue qualifying for exemption.\nThe operator of a disposal facility in greater Minnesota shall remit the fees collected under subdivision 1 to the county or sanitary district where the facility is located, except that the operator of a facility that is owned by a statutory or home rule city shall remit the fees to the city that owns the facility and the operator of a facility that is owned by a joint powers board shall remit the fees to the board. The county, city, joint powers board, or sanitary district may use the revenue from the fees only for the purposes specified in section 115A.919.\n[Repealed, 1990 c 604 art 10 s 32]\n[Repealed, 1990 c 604 art 10 s 32]\n[Repealed, 1990 c 604 art 10 s 32]\n[Repealed, 1990 c 604 art 10 s 32]\n[Repealed, 1994 c 416 art 4 s 5]",
	"repealed": false
}