{
	"id": "103G.515",
	"url": "https://www.revisor.mn.gov/statutes/cite/103G.515",
	"title": "103G.515 EXAMINING AND REPAIRING DAMS AND RESERVOIRS.",
	"text": "The commissioner may examine a reservoir, dam, control structure, or waterway obstruction after receiving a complaint or determining an examination is needed. The commissioner, or an authorized agent, must be granted access at any reasonable time to examine the reservoir, dam, control structure, or waterway obstruction.\n(a) After making an examination, if the commissioner determines that additional engineering investigations are necessary to determine the safety of a dam, reservoir, control structure, or waterway obstruction and the nature and extent of the necessary repairs or alterations, the commissioner must notify the owner to have investigations made at the owner's expense.\n(b) The result of the investigation must be filed with the commissioner for use in determining the condition of the structures and the need for their repair, alteration, or removal.\n(a) If the commissioner determines that the reservoir, dam, control structure, or waterway obstruction is unsafe or needs repair or alteration, the commissioner shall notify the owner of the structure with an order to repair, alter, or remove the structure. The order must be issued in the same manner as if the owner had applied for a permit for the repairs, alterations, or removal.\n(b) The engineering investigations or the work of repair, alteration, or removal must begin and be completed within a reasonable time prescribed by the commissioner.\n(a) The commissioner shall adopt rules which must include a fee schedule to cover the cost of dam inspection and must classify structures to adequately define risks and hazards involved in relation to public health, safety, and welfare.\n(b) The rules may not impose a field inspection fee on any state agency, political subdivision of the state, or federal governmental agency.\nNotwithstanding any provision of this section or of section 103G.511 relating to cost sharing or apportionment, the commissioner, within the limits of legislative appropriation, may assume or pay the entire cost of removal of a privately or publicly owned dam upon determining removal provides the lowest cost solution and:\n(1) that continued existence of the structure presents a significant public safety hazard, or prevents restoration of an important fisheries resource; or\n(2) that public or private property is being damaged due to partial failure of the structure.",
	"repealed": false
}