{
	"id": "123B.935",
	"url": "https://www.revisor.mn.gov/statutes/cite/123B.935",
	"title": "123B.935 ACTIVE TRANSPORTATION SAFETY TRAINING.",
	"text": "(a) Each district must provide public school pupils enrolled in kindergarten through grade 3 with age-appropriate active transportation safety training. At a minimum, the training must include pedestrian safety, including crossing roads.\n(b) Each district must provide public school pupils enrolled in grades 4 through 8 with age-appropriate active transportation safety training. At a minimum, the training must include:\n(1) pedestrian safety, including crossing roads safely using the searching left, right, left for vehicles in traffic technique;\n(2) bicycle safety, including relevant traffic laws, use and proper fit of protective headgear, bicycle parts and safety features, and safe biking techniques; and\n(3) electric-assisted bicycle safety, including that a person under the age of 15 is not allowed to operate an electric-assisted bicycle.\n(c) A nonpublic school may provide nonpublic school pupils enrolled in kindergarten through grade 8 with training as specified in paragraphs (a) and (b).\n(a) Students under subdivision 1, paragraph (a), who are enrolled during the first or second week of school and have not previously received active transportation safety training specified in that paragraph must receive the safety training by the end of the third week of school.\n(b) Students under subdivision 1, paragraph (b), who are enrolled during the first or second week of school and have not previously received active transportation safety training specified in that paragraph must receive the safety training by the end of the sixth week of school.\n(c) Students under subdivision 1, paragraph (a) or (b), who enroll in a school after the second week of school and have not received the appropriate active transportation safety training in their previous school district must undergo the training or receive active transportation safety instructional materials within four weeks of the first day of attendance.\n(d) A district and a nonpublic school may provide kindergarten pupils with active transportation safety training before the first day of school.\n(a) A district may provide active transportation safety training through distance learning.\n(b) A district and a nonpublic school must make reasonable accommodations for the active transportation safety training of pupils known to speak English as a second language and pupils with disabilities.\nThe commissioner of transportation must maintain a comprehensive collection of active transportation safety training materials that meets the requirements under this section.",
	"repealed": false
}