{
	"id": "256.9861",
	"url": "https://www.revisor.mn.gov/statutes/cite/256.9861",
	"title": "256.9861 FRAUD CONTROL; PROGRAM INTEGRITY REINVESTMENT PROJECT.",
	"text": "Within the limits of available state and federal appropriations, the commissioners of human services and children, youth, and families shall make funding available to county agencies for fraud control efforts and require the maintenance of county efforts and financial contributions that were in place during fiscal year 1996.\nEach included county shall develop and submit annual funding, staffing, and operating grant proposals to the commissioners no later than April 30 of each year for the purpose of allocating federal and state funding and appropriations. Each proposal shall provide information on:\n(1) the staffing and funding of the fraud investigation and prosecution operations;\n(2) job descriptions for agency fraud control staff;\n(3) contracts covering outside investigative agencies;\n(4) operational methods to integrate the use of fraud prevention investigation techniques; and\n(5) implementation and utilization of administrative disqualification hearings and diversions by the existing county fraud control and prosecution procedures.\nThe commissioners shall provide written instructions outlining the contents of the proposals to be submitted under this section. Instructions shall be made available 30 days prior to the date by which proposals under subdivision 2 must be submitted. The commissioners shall establish training programs which shall be attended by fraud control staff of all involved counties. The commissioners shall also develop the necessary operational guidelines, forms, and reporting mechanisms which shall be used by the involved counties.\nThe commissioners shall, after consultation with the involved counties, establish standards governing the performance levels of county investigative units based on grant agreements with the county agencies. The standards shall take into consideration and may include investigative caseloads, grant savings levels, the comparison of fraud prevention and prosecution directed investigations, utilization levels of administrative disqualification hearings, the timely reporting and implementation of disqualifications, and the timeliness of the submission of statistical reports.\n(a) State funding shall be made available contingent on counties submitting a plan that is approved by the Departments of Human Services and Children, Youth, and Families. Failure or delay in obtaining that approval shall not, however, eliminate the obligation to maintain fraud control efforts at the June 30, 1996, level. County agency reimbursement shall be made through the settlement provisions applicable to the MFIP, Supplemental Nutrition Assistance Program (SNAP), and medical assistance program.\n(b) Should a county agency fail to comply with the standards set, or fail to meet cost-effectiveness standards developed by the commissioners for any three-month period, the commissioners shall deny reimbursement or administrative costs, after allowing an opportunity to establish compliance.\n(c) Any denial of reimbursement under paragraph (b) is contingent on the commissioners providing written notice, including an offer of technical assistance, within 30 days of the end of the third or subsequent months of noncompliance. The county agency shall be required to submit a corrective action plan to the commissioners within 30 days of receipt of a notice of noncompliance. Failure to submit a corrective action plan or continued deviation from standards of more than ten percent after submission of corrective action plan, will result in denial of funding for each such month during the grant year, or billing of the county agency for program integrity reinvestment project services provided by the commissioners or reallocation of grant funds to other counties. The denial of funding shall apply to the general settlement received by the county agency on a quarterly basis and shall not reduce the grant amount applicable to the program integrity reinvestment project.",
	"repealed": false
}