{
	"id": "360.0753",
	"url": "https://www.revisor.mn.gov/statutes/cite/360.0753",
	"title": "360.0753 TESTING PROCEDURES.",
	"text": "For purposes of this section, the term \"peace officer\" means an employee of a political subdivision or state law enforcement agency who is licensed by the Minnesota Board of Peace Officers Standards and Training, who is charged with the prevention and detection of crime and the enforcement of the general criminal laws of the state, and who has full power of arrest, and shall also include the Minnesota State Patrol and Metropolitan Airports Commission peace officers, but does not include employees of the Department of Natural Resources.\n(a) Any person who operates or attempts to operate an aircraft in or over this state or over any boundary water of this state consents, subject to the provisions of this section and section 360.0752, to a chemical test of that person's blood, breath, or urine for the purpose of determining the presence or amount of alcohol, controlled substances, or intoxicating substances. The test shall be administered at the direction of a peace officer.\n(b) A test of the person's breath may be required when an officer has probable cause to believe the person was operating or attempting to operate an aircraft in violation of section 360.0752 and one of the following conditions exists:\n(1) the person has been lawfully placed under arrest for violation of section 360.0752;\n(2) the person has been involved in an aircraft accident or collision resulting in property damage, personal injury, or death;\n(3) the person has refused to take the screening test provided for by section 360.0752;\n(4) the screening test was administered and recorded an alcohol concentration of 0.04 or more or the presence of a controlled substance listed in Schedule I or II other than marijuana or tetrahydrocannabinols; or\n(5) the officer had probable cause to believe that the person was operating or attempting to operate an aircraft with any amount of alcohol present in the person's body.\n(c) A test of the person's blood or urine may be required by an officer under the conditions described in paragraph (b) if the officer is acting pursuant to a search warrant under sections 626.04 to 626.18.\n(d) At the time a test is requested, the person shall be informed:\n(1) that Minnesota law requires the person to take a test to determine the presence or amount of alcohol or a controlled substance listed in Schedule I or II other than marijuana or tetrahydrocannabinols, or to determine if the person is under the influence of alcohol, controlled substances, or intoxicating substances;\n(2) that whether a test is taken or refused, the person may be subject to criminal prosecution for an alcohol, controlled substance, or intoxicating substance-related offense relating to the operation of an aircraft;\n(3) that if testing is refused, the person may be subject to criminal prosecution because the person refused testing and the person will be disqualified from operating an aircraft for a minimum period of one year;\n(4) if the peace officer has probable cause to believe the person has violated the criminal vehicular homicide and injury laws, that pursuant to a search warrant a test will be taken with or without the person's consent; and\n(5) that, in the case of a breath test, the person has the right to consult with an attorney, but that this right is limited to the extent that it cannot unreasonably delay administration of the test.\nNotwithstanding any contrary provision in this section, a blood or urine test may be conducted only pursuant to a search warrant under sections 626.04 to 626.18, or a judicially recognized exception to the search warrant requirement. When, under the provisions of this section, a search warrant is required for a blood or urine test, that requirement is met if a judicially recognized exception to the search warrant is applicable.\n(a) A peace officer who directs a test pursuant to this section may direct a breath test.\n(b) A peace officer, acting pursuant to a search warrant, may direct a blood or urine test as provided in the warrant. If the warrant authorizes either a blood or urine test, the officer may direct whether the test is of blood or urine. If the person to whom the test is directed objects to the test, the officer shall offer the person an alternative test of either blood or urine.\n(c) A blood or urine test may be required pursuant to a search warrant even after a breath test has been administered if there is probable cause to believe that: (1) there is impairment by a controlled substance or an intoxicating substance that is not subject to testing by a breath test; or (2) a controlled substance listed in Schedule I or II, other than marijuana or tetrahydrocannabinols, is present in the person's body.\n(d) Action under this section may be taken against a person who refuses to take a blood test only if an alternative test was offered and action may be taken against a person who refuses to take a urine test only if an alternative test was offered.\n(a) In the case of a breath test administered using an infrared or other approved breath-testing instrument, as defined in section 169A.03, subdivision 11, the test shall consist of analyses in the following sequence: one adequate breath sample analysis, one control analysis, and a second, adequate breath sample analysis.\n(b) In the case of a test administered using an infrared or other approved breath-testing instrument, a sample is adequate if the instrument analyzes the sample and does not indicate the sample is deficient.\n(c) For purposes of this section, when a test is administered using an infrared or other approved breath-testing instrument, failure of a person to provide two separate, adequate breath samples in the proper sequence constitutes a refusal.\nA person who is unconscious or who is otherwise in a condition rendering the person incapable of refusal is deemed not to have withdrawn the consent provided by subdivision 2 and the test may be given.\n(a) Only a physician, medical technician, physician's trained mobile intensive care paramedic, registered nurse, medical technologist, or laboratory assistant acting at the request of a peace officer may withdraw blood for the purpose of determining the presence or amount of alcohol, controlled substances, or intoxicating substances. This limitation does not apply to the taking of a breath or urine sample. The person tested has the right to have someone of the person's own choosing administer a chemical test or tests in addition to any administered at the direction of a peace officer; provided, that the additional test sample on behalf of the person is obtained at the place where the person is in custody, after the test administered at the direction of a peace officer, and at no expense to the state.\n(b) The failure or inability to obtain an additional test or tests by a person shall not preclude the admission in evidence of the test taken at the direction of a peace officer unless the additional test was prevented or denied by the peace officer.\n(c) The physician, medical technician, physician's trained mobile intensive care paramedic, medical technologist, laboratory assistant, or registered nurse drawing blood at the request of a peace officer for the purpose of determining the presence or concentration of alcohol, controlled substances, or intoxicating substances shall in no manner be liable in any civil or criminal action except for negligence in drawing the blood. The person administering a breath test shall be fully trained in the administration of breath tests pursuant to training given by the commissioner of public safety or the commissioner of transportation.\nIf a person under arrest refuses to permit chemical testing, none shall be given, but the commissioner of transportation, upon the receipt of a certificate of the peace officer that the officer had reasonable and probable grounds to believe the arrested person had been operating or attempting to operate an aircraft in violation of section 360.0752, that in the case of a blood or urine test the officer was acting pursuant to a search warrant, and that the person had refused to permit the test, shall issue a cease and desist order prohibiting the operation of an aircraft for a period of one year. However, if a peace officer has probable cause to believe that the person has violated section 609.2112, 609.2113, or 609.2114, a test may be required and obtained despite the person's refusal. When a test is obtained pursuant to this section after the person refused to submit to testing, the commissioner of transportation shall issue a cease and desist order under this section based on the person's refusal. However, if the test is of the person's blood or urine, the test must have been taken pursuant to a search warrant in order for a cease and desist order to be issued.\nNo cease and desist order under subdivision 7 shall be made until the commissioner notifies the person by certified mail of intention to issue a cease and desist order and allows the person a 20-day period after the date of receiving the notice to request of the commissioner, in writing, a hearing as herein provided. If no request is filed within the 20-day period, the commissioner may then issue a cease and desist order. However, if a request for hearing is filed, no cease and desist order shall be made until final judicial determination resulting in an adverse decision to the person.\nThe hearing shall be before a district court in the county where the arrest occurred, unless there is agreement that the hearing may be held in some other county. The hearing shall be recorded and proceed as in a criminal matter, without the right of trial by jury, and its scope shall cover the issues of whether the peace officer had reasonable and probable grounds to believe the person was operating or attempting to operate an aircraft in violation of section 360.0752; whether the person was lawfully placed under arrest; if the test involved blood or urine, whether a licensed peace officer applied for a search warrant in accordance with the requirements set forth in sections 626.04 to 626.18, and, if so, whether a neutral magistrate reviewed the application for the search warrant and determined there was probable cause to believe that the person violated section 360.0752, and whether the warrant and the process by which it was obtained was valid; whether the person refused to permit the test, and if the person refused whether the person had reasonable grounds for refusing to permit the test; and whether at the time of request for the test the peace officer informed the person that the right to fly will be denied if the person refused to permit the test and of the right to have additional tests made by someone of the person's own choosing. The court shall order either that the denial be rescinded or sustained and refer the order to the commissioner of transportation for further action.\nWhen it has been finally determined that a nonresident's privilege to operate an aircraft in this state has been denied, the commissioner shall give information in writing of the action taken to the appropriate federal authorities and any state in which the nonresident operates an aircraft or has a license to operate an aircraft.",
	"repealed": false
}