{
	"id": "514.08",
	"url": "https://www.revisor.mn.gov/statutes/cite/514.08",
	"title": "514.08 STATEMENT; NOTICE; NECESSITY FOR RECORDING; CONTENTS.",
	"text": "The lien ceases at the end of 120 days after doing the last of the work, or furnishing the last item of skill, material, or machinery, unless within this period:\n(1) a statement of the claim is filed for record with the county recorder or, if registered land, with the registrar of titles of the county in which the improved premises are situated, or, if the claim is made under section 514.04, with the secretary of state; and\n(2) a copy of the statement is served personally or by certified mail on the owner or the owner's authorized agent or the person who entered into the contract with the contractor.\nSuch statement shall be made by or at the instance of the lien claimant, be verified by the oath of some person shown by such verification to have knowledge of the facts stated, and shall set forth:\n(1) a notice of intention to claim and hold a lien, and the amount thereof;\n(2) that such amount is due and owing to the claimant for labor performed, or for skill, material, or machinery furnished, and for what improvement the same was done or supplied;\n(3) the names of the claimant, and of the person for or to whom performed or furnished;\n(4) the dates when the first and last items of the claimant's contribution to the improvement were made;\n(5) a description of the premises to be charged, identifying the same with reasonable certainty;\n(6) the name of the owner thereof at the time of making such statement, according to the best information then had;\n(7) the post office address of the claimant. (The failure to insert such post office address shall not invalidate the lien statement);\n(8) that claimant acknowledges that a copy of the statement must be served personally or by certified mail within the 120-day period provided in this section on the owner, the owner's authorized agent or the person who entered into the contract with the contractor as provided herein; and\n(9) that notice as required by section 514.011, subdivision 2, if any, was given.\nWhen the claimant files the notice, the Social Security number of an individual owner or the Internal Revenue Service taxpayer identification number for an owner other than an individual is not required.",
	"repealed": false
}