{
	"id": "116L.19",
	"url": "https://www.revisor.mn.gov/statutes/cite/116L.19",
	"title": "116L.19 DEFINITIONS.",
	"text": "The definitions in this section apply to sections 116L.19 to 116L.976.\n\"Commissioner\" means the commissioner of employment and economic development.\n\"Department\" means the Department of Employment and Economic Development.\n\"Employment and training services\" means programs, activities, and services related to job training, job placement, and job creation including job service programs, Workforce Investment Act programs, job search, counseling, case management, community work experience programs, displaced homemaker programs as federally defined including the Minnesota Family Resiliency Partnership established under section 116L.96, disadvantaged job training programs, grant diversion, youth employment programs, Conservation Corps, apprenticeship programs, community development corporations, workforce development services to employers, and opportunities industrialization centers.\n\"Income maintenance and support services\" means programs through which the state or its subdivisions provide direct financial or in-kind support to unemployed or underemployed persons, including unemployment benefits, the Minnesota family investment program, general assistance, Supplemental Nutrition Assistance Program (SNAP) benefits, energy assistance, disability determinations, and child care. Income maintenance and support services do not include medical assistance, aging services, social services, community social services, mental health services, or services for the emotionally disturbed, the developmentally disabled, or residents of nursing homes.\nFor purposes of employment and training services, \"Indian tribe\" means a tribe, band, nation, or other organized group or community of Indians that is recognized as eligible for the special programs and services provided by the United States to Indians because of their status as Indians, and for which a reservation exists as is consistent with Public Law 100-485, as amended.\n\"Local service unit\" means a county, counties operating under a joint powers agreement, one or more counties and one or more cities of the first class operating under a joint powers agreement, or a city of the first class.\n\"Public assistance\" means the Minnesota family investment program and general assistance.\n\"Service provider\" means a public, private, or nonprofit agency that is capable of providing or administrating one or more of the employment and training services or income maintenance and support services.",
	"repealed": false
}