{
	"id": "302A.684",
	"url": "https://www.revisor.mn.gov/statutes/cite/302A.684",
	"title": "302A.684 ACTION ON PLAN OF CONVERSION BY CONVERTING CORPORATION.",
	"text": "Subject to section 302A.692, a plan of conversion of a converting corporation must be approved under subdivisions 2 and 3.\nA resolution containing the plan of conversion must be approved by the affirmative vote of a majority, or more if so provided in the converting corporation's organizational documents, of the directors present at a meeting of the board of directors of the converting corporation and must then be submitted at a regular or a special meeting to the shareholders of the converting corporation. Written notice must be given to every shareholder of the converting corporation, whether or not entitled to vote at the meeting, not less than 14 days nor more than 60 days before the meeting. The written notice must state that a purpose of the meeting is to consider the proposed plan of conversion. A copy or short description of the plan of conversion must be included in or enclosed with the notice.\nAt the meeting, a vote of the shareholders must be taken on the proposed plan. The plan of conversion is adopted when approved by the affirmative vote of the holders of a majority of the voting power of all shares entitled to vote. A class or series of shares is entitled to vote as a class or series on the approval of the plan unless otherwise provided in the articles or shareholder control agreement, in which case the articles or shareholder control agreement shall govern such class voting rights to the exclusion of section 302A.137.\nSubject to section 302A.692 and any contractual rights, after a conversion is approved, and at any time before articles of conversion are delivered to the secretary of state for filing under section 302A.686, a converting corporation may amend the plan or abandon the conversion:\n(1) as provided in the plan; or\n(2) except as otherwise prohibited in the plan, by the same consent as was required to approved the plan.",
	"repealed": false
}