{
	"id": "256Q.03",
	"url": "https://www.revisor.mn.gov/statutes/cite/256Q.03",
	"title": "256Q.03 DEFINITIONS.",
	"text": "For the purposes of this chapter, the terms defined in this section have the meanings given them.\n\"ABLE account\" has the meaning given in section 529A(e)(6) of the Internal Revenue Code.\n\"ABLE plan\" or \"plan\" means the qualified ABLE program, as defined in section 529A(b) of the Internal Revenue Code, provided for in this chapter.\n\"Account\" means the formal record of transactions relating to an ABLE plan beneficiary.\n\"Account owner\" means the designated beneficiary of the account.\n\"Annual contribution limit\" has the meaning given in section 529A(b)(2) of the Internal Revenue Code.\n\"Application\" means the form executed by a prospective account owner to enter into a participation agreement and open an account in the plan. The application incorporates by reference the participation agreement.\n\"Board\" means the State Board of Investment.\n\"Commissioner\" means the commissioner of human services.\n\"Contribution\" means a payment directly allocated to an account for the benefit of a beneficiary.\n\"Department\" means the Department of Human Services.\n\"Designated beneficiary\" or \"beneficiary\" has the meaning given in section 529A(e)(3) of the Internal Revenue Code and further defined through regulations issued under that section.\n\"Earnings\" means the total account balance minus the investment in the account.\n\"Eligible individual\" has the meaning given in section 529A(e)(1) of the Internal Revenue Code and further defined through regulations issued under that section.\n\"Executive director\" means the executive director of the State Board of Investment.\n\"Internal Revenue Code\" means the Internal Revenue Code of 1986, as amended.\n\"Investment in the account\" means the sum of all contributions made to an account by a particular date minus the aggregate amount of contributions included in distributions or rollover distributions, if any, made from the account as of that date.\n\"Member of the family\" has the meaning given in section 529A(e)(4) of the Internal Revenue Code.\n\"Participation agreement\" means an agreement to participate in the Minnesota ABLE plan between an account owner and the state through its agencies, the commissioner, and the board.\n\"Person\" means an individual, trust, estate, partnership, association, company, corporation, or the state.\n\"Plan administrator\" means the person selected by the commissioner and the board to administer the daily operations of the ABLE plan and provide record keeping, investment management, and other services for the plan.\n\"Qualified disability expense\" has the meaning given in section 529A(e)(5) of the Internal Revenue Code and further defined through regulations issued under that section.\n\"Qualified distribution\" means a withdrawal from an ABLE account to pay the qualified disability expenses of the beneficiary of the account. A qualified withdrawal may be made by the beneficiary, by an agent of the beneficiary who has the power of attorney, or by the beneficiary's legal guardian.\n\"Rollover distribution\" means a transfer of funds made:\n(1) from one account in another state's qualified ABLE program to an account for the benefit of the same designated beneficiary or an eligible individual who is a family member of the former designated beneficiary; or\n(2) from one account to another account for the benefit of an eligible individual who is a family member of the former designated beneficiary.\n\"Total account balance\" means the amount in an account on a particular date or the fair market value of an account on a particular date.",
	"repealed": false
}