{
	"id": "52.062",
	"url": "https://www.revisor.mn.gov/statutes/cite/52.062",
	"title": "52.062 CREDIT UNIONS; SUSPENSION OF OPERATION.",
	"text": "Whenever the commissioner of commerce shall find that a credit union is engaged in unsafe or unsound practices in conducting its business or that the shares of the members are impaired or are in immediate danger of becoming impaired, or that such credit union has knowingly or negligently permitted any of its officers, directors, committee members, or employees to violate any material provision of any law, bylaw, or rule to which the credit union is subject, the commissioner of commerce may proceed in the manner provided by subdivision 2, 3, or 4.\nThe commissioner of commerce may suspend the operation of the credit union by giving notice to its board of directors by certified mail. Said notice shall include a list of reasons for said suspension and a list of any specific violations of law, bylaw, or rule, and shall specify which operations of the credit union may be continued during the period of suspension. The notice shall also fix a time and place for a hearing before the commissioner of commerce or such person or persons as the commissioner of commerce may designate. The hearing shall be held within 60 days of the notice of suspension. Evidence may be produced at said hearing by any party thereto, and the commissioner of commerce shall base the decision as to the continued suspension of operation of the credit union upon said evidence. If the commissioner of commerce decides to continue the suspension, the commissioner shall give notice of the decision to the board of directors of the credit union.\n[Repealed, 2005 c 118 s 18]\nIn lieu of suspension of the operation of the credit union, the commissioner of commerce and the board of directors of the credit union may agree to execute a consent cease and desist order in which the parties agree to waive the right to a hearing and agree that the credit union shall cease and desist from unsafe or unsound practices, or violations. The order must specify whether credit union operation may continue, and if operation may continue, the conditions under which operation may continue.",
	"repealed": false
}