{
	"id": "148.90",
	"url": "https://www.revisor.mn.gov/statutes/cite/148.90",
	"title": "148.90 BOARD OF PSYCHOLOGY.",
	"text": "(a) The Board of Psychology is created with the powers and duties described in this section. The board has 11 members who consist of:\n(1) four individuals licensed as licensed psychologists who have doctoral degrees in psychology;\n(2) two individuals licensed as licensed psychologists who have master's degrees in psychology;\n(3) two psychologists, not necessarily licensed, who have doctoral degrees in psychology representing different training programs in psychology; and\n(4) three public members.\n(b) After the date on which fewer than 30 percent of the individuals licensed by the board as licensed psychologists qualify for licensure under section 148.907, subdivision 3, paragraph (b), vacancies filled under paragraph (a), clause (2), shall be filled by an individual with either a master's or doctoral degree in psychology licensed or qualified to be licensed as a licensed psychologist.\n(c) After the date on which fewer than 15 percent of the individuals licensed by the board as licensed psychologists qualify for licensure under section 148.907, subdivision 3, paragraph (b), vacancies under paragraph (a), clause (2), shall be filled by an individual with either a master's or doctoral degree in psychology licensed or qualified to be licensed as a licensed psychologist.\n(a) The members of the board shall:\n(1) be appointed by the governor;\n(2) be residents of the state;\n(3) serve for not more than two consecutive terms;\n(4) designate the officers of the board; and\n(5) administer oaths pertaining to the business of the board.\n(b) A public member of the board shall represent the public interest and shall not:\n(1) be a psychologist or have engaged in the practice of psychology;\n(2) be an applicant or former applicant for licensure;\n(3) be a member of another health profession and be licensed by a health-related licensing board as defined under section 214.01, subdivision 2; the commissioner of health; or licensed, certified, or registered by another jurisdiction;\n(4) be a member of a household that includes a psychologist; or\n(5) have conflicts of interest or the appearance of conflicts with duties as a board member.\n(c) At the time of their appointments, at least two members of the board must reside outside of the seven-county metropolitan area.\n(d) At the time of their appointments, at least two members of the board must be members of:\n(1) a community of color; or\n(2) an underrepresented community, defined as a group that is not represented in the majority with respect to race, ethnicity, national origin, sexual orientation, gender identity, or physical ability.\nMembership terms, compensation of members, removal of members, the filling of membership vacancies, and fiscal year and reporting requirements shall be as provided in chapter 214. The provision of staff, administrative services and office space; the review and processing of complaints; the setting of board fees; and other activities relating to board operations shall be conducted according to chapter 214.\n[Repealed, 1975 c 136 s 77]\n[Repealed, 1975 c 136 s 77]",
	"repealed": false
}