{
	"id": "147.091",
	"url": "https://www.revisor.mn.gov/statutes/cite/147.091",
	"title": "147.091 GROUNDS FOR DISCIPLINARY ACTION.",
	"text": "The board may refuse to grant a license, may refuse to grant registration to perform interstate telehealth services, or may impose disciplinary action as described in section 147.141 against any physician. The following conduct is prohibited and is grounds for disciplinary action:\n(a) Failure to demonstrate the qualifications or satisfy the requirements for a license contained in this chapter or rules of the board. The burden of proof shall be upon the applicant to demonstrate such qualifications or satisfaction of such requirements.\n(b) Obtaining a license by fraud or cheating, or attempting to subvert the licensing examination process. Conduct which subverts or attempts to subvert the licensing examination process includes, but is not limited to: (1) conduct which violates the security of the examination materials, such as removing examination materials from the examination room or having unauthorized possession of any portion of a future, current, or previously administered licensing examination; (2) conduct which violates the standard of test administration, such as communicating with another examinee during administration of the examination, copying another examinee's answers, permitting another examinee to copy one's answers, or possessing unauthorized materials; or (3) impersonating an examinee or permitting an impersonator to take the examination on one's own behalf.\n(c) Conviction, during the previous five years, of a felony reasonably related to the practice of medicine or osteopathic medicine. Conviction as used in this subdivision shall include a conviction of an offense which if committed in this state would be deemed a felony without regard to its designation elsewhere, or a criminal proceeding where a finding or verdict of guilt is made or returned but the adjudication of guilt is either withheld or not entered thereon.\n(d) Revocation, suspension, restriction, limitation, or other disciplinary action against the person's medical license in another state or jurisdiction, failure to report to the board that charges regarding the person's license have been brought in another state or jurisdiction, or having been refused a license by any other state or jurisdiction.\n(e) Advertising which is false or misleading, which violates any rule of the board, or which claims without substantiation the positive cure of any disease, or professional superiority to or greater skill than that possessed by another physician.\n(f) Violating a rule promulgated by the board or an order of the board, a state, or federal law which relates to the practice of medicine, or in part regulates the practice of medicine including without limitation sections 604.201, 609.344, and 609.345, or a state or federal narcotics or controlled substance law.\n(g) Engaging in any unethical or improper conduct, including but not limited to:\n(1) conduct likely to deceive or defraud the public;\n(2) conduct likely to harm the public;\n(3) conduct that demonstrates a willful or careless disregard for the health, welfare, or safety of a patient;\n(4) medical practice that is professionally incompetent; and\n(5) conduct that may create unnecessary danger to any patient's life, health, or safety, in any of which cases, proof of actual injury need not be established.\n(h) Failure to provide proper supervision, including but not limited to supervision of a:\n(1) licensed or unlicensed health care provider; and\n(2) physician under any agreement with the board.\n(i) Aiding or abetting an unlicensed person in the practice of medicine, except that it is not a violation of this paragraph for a physician to employ, supervise, or delegate functions to a qualified person who may or may not be required to obtain a license or registration to provide health services if that person is practicing within the scope of that person's license or registration or delegated authority.\n(j) Adjudication by a court of competent jurisdiction, within or outside this state, as:\n(1) mentally incompetent;\n(2) mentally ill;\n(3) developmentally disabled;\n(4) a chemically dependent person;\n(5) a person dangerous to the public;\n(6) a sexually dangerous person; or\n(7) a person who has a sexual psychopathic personality.\nSuch adjudication shall automatically suspend a license for the duration of the adjudication unless the board orders otherwise.\n(k) Conduct that departs from or fails to conform to the minimal standards of acceptable and prevailing medical practice in which case proof of actual injury need not be established.\n(l) Inability to practice medicine with reasonable skill and safety to patients by reason of the following, including but not limited to:\n(1) illness;\n(2) intoxication;\n(3) use of drugs, narcotics, chemicals, or any other type of substance;\n(4) mental condition;\n(5) physical condition;\n(6) diminished cognitive ability;\n(7) loss of motor skills; or\n(8) deterioration through the aging process.\n(m) Revealing a privileged communication from or relating to a patient except when otherwise required or permitted by law.\n(n) Failure by a doctor of osteopathic medicine to identify the school of healing in the professional use of the doctor's name by one of the following terms: osteopathic physician and surgeon, doctor of osteopathic medicine, or D.O.\n(o) Improper management of medical records, including failure to maintain adequate medical records, to comply with a patient's request made pursuant to sections 144.291 to 144.298 or to furnish a medical record or report required by law.\n(p) Fee splitting, including without limitation:\n(1) paying, offering to pay, receiving, or agreeing to receive, a commission, rebate, or remuneration, directly or indirectly, primarily for the referral of patients or the prescription of drugs or devices;\n(2) dividing fees with another physician or a professional corporation, unless the division is in proportion to the services provided and the responsibility assumed by each professional and the physician has disclosed the terms of the division;\n(3) referring a patient to any health care provider as defined in sections 144.291 to 144.298 in which the referring physician has a \"financial or economic interest,\" as defined in section 144.6521, subdivision 3, unless the physician has disclosed the physician's financial or economic interest in accordance with section 144.6521; and\n(4) dispensing for profit any drug or device, unless the physician has disclosed the physician's own profit interest.\nThe physician must make the disclosures required in this clause in advance and in writing to the patient and must include in the disclosure a statement that the patient is free to choose a different health care provider. This clause does not apply to the distribution of revenues from a partnership, group practice, nonprofit corporation, or professional corporation to its partners, shareholders, members, or employees if the revenues consist only of fees for services performed by the physician or under a physician's direct supervision, or to the division or distribution of prepaid or capitated health care premiums, or fee-for-service withhold amounts paid under contracts established under other state law.\n(q) Engaging in abusive or fraudulent billing practices, including violations of the federal Medicare and Medicaid laws or state medical assistance laws.\n(r) Becoming addicted or habituated to a drug or intoxicant.\n(s) Inappropriate prescribing of or failure to properly prescribe a drug or device, including prescribing a drug or device for other than medically accepted therapeutic or experimental or investigative purposes authorized by a state or federal agency.\n(t) Engaging in conduct with a patient which is sexual or may reasonably be interpreted by the patient as sexual, or in any verbal behavior which is seductive or sexually demeaning to a patient.\n(u) Failure to make reports as required by section 147.111 or to cooperate with an investigation of the board as required by section 147.131.\n(v) Knowingly providing false or misleading information that is directly related to the care of that patient unless done for an accepted therapeutic purpose such as the administration of a placebo.\n(w) Aiding suicide or aiding attempted suicide in violation of section 609.215 as established by any of the following:\n(1) a copy of the record of criminal conviction or plea of guilty for a felony in violation of section 609.215, subdivision 1 or 2;\n(2) a copy of the record of a judgment of contempt of court for violating an injunction issued under section 609.215, subdivision 4;\n(3) a copy of the record of a judgment assessing damages under section 609.215, subdivision 5; or\n(4) a finding by the board that the person violated section 609.215, subdivision 1 or 2. The board shall investigate any complaint of a violation of section 609.215, subdivision 1 or 2.\n(x) Practice of a board-regulated profession under lapsed or nonrenewed credentials.\n(y) Failure to repay a state or federally secured student loan in accordance with the provisions of the loan.\n(z) Providing interstate telehealth services other than according to section 147.032.\n(a) The board may not grant a license to practice medicine to any person who has been convicted of a felony-level criminal sexual conduct offense.\n(b) A license to practice medicine is automatically revoked if the licensee is convicted of a felony-level criminal sexual conduct offense.\n(c) A license that has been denied or revoked pursuant to this subdivision is not subject to chapter 364.\n(d) For purposes of this subdivision, \"conviction\" means a plea of guilty, a verdict of guilty by a jury, or a finding of guilty by the court, and \"criminal sexual conduct offense\" means a violation of sections 609.342 to 609.345 or a similar statute in another jurisdiction.\nThe board may investigate allegations and impose disciplinary action as described in section 147.141 against a physician performing utilization review for a pattern of failure to exercise that degree of care that a physician reviewer of ordinary prudence making utilization review determinations for a utilization review organization would use under the same or similar circumstances. As part of its investigative process, the board shall receive consultation or recommendation from physicians who are currently engaged in utilization review activities. The internal and external review processes under sections 62M.06 and 62Q.73 must be exhausted prior to an allegation being brought under this subdivision. Nothing in this subdivision creates, modifies, or changes existing law related to tort liability for medical negligence. Nothing in this subdivision preempts state peer review law protection in accordance with sections 145.61 to 145.67, federal peer review law, or current law pertaining to complaints or appeals.\n(a) For purposes of this subdivision, \"reproductive health care services\" means medical, surgical, counseling, or referral services relating to the human reproductive system, including but not limited to services related to pregnancy, contraception, or the termination of a pregnancy.\n(b) Notwithstanding subdivision 1, paragraph (c) or (d), the board shall not refuse to grant a license to an applicant for licensure, refuse to grant registration to a physician to perform interstate telehealth services, or impose disciplinary action against a physician solely on one or more of the following grounds:\n(1) the applicant or physician provided or assisted in the provision of reproductive health care services in a manner that is lawful in this state and that is within the applicable scope of practice;\n(2) the applicant or physician was convicted in another jurisdiction of a felony resulting from conduct specified in clause (1); or\n(3) the applicant or physician was subject to disciplinary action in another jurisdiction or was refused a license to practice medicine in another jurisdiction resulting from conduct specified in clause (1).\n(a) A license to practice medicine is automatically suspended if (1) a guardian of a licensee is appointed by order of a court pursuant to sections 524.5-101 to 524.5-502, for reasons other than the minority of the licensee; or (2) the licensee is committed by order of a court pursuant to chapter 253B. The license remains suspended until the licensee is restored to capacity by a court and, upon petition by the licensee, the suspension is terminated by the board after a hearing.\n(b) Upon notice to the board of a judgment of, or a plea of guilty to, a felony reasonably related to the practice of patient care, the credentials of the regulated person shall be automatically suspended by the board. The credentials shall remain suspended until, upon petition by the regulated person and after a hearing, the suspension is terminated by the board. The board shall indefinitely suspend or revoke the credentials of the regulated person if, after a hearing, the board finds that the felonious conduct would cause a serious risk of harm to the public.\n(c) For credentials that have been suspended or revoked pursuant to paragraphs (a) and (b), the regulated person may be reinstated to practice, either with or without restrictions, by demonstrating clear and convincing evidence of rehabilitation, as provided in section 364.03. If the regulated person's conviction is subsequently overturned by court decision, the board shall conduct a hearing to review the suspension within 30 days after receipt of the court decision. The regulated person is not required to prove rehabilitation if the subsequent court decision overturns previous court findings of public risk.\n(d) The board may, upon majority vote of a quorum of its members, suspend the credentials of a regulated person without a hearing if the regulated person fails to maintain a current name and address with the board, as described in paragraph (e), while the regulated person is: (1) under board investigation, and a notice of conference has been issued by the board; (2) party to a contested case with the board; (3) party to an agreement for corrective action with the board; or (4) under a board order for disciplinary action. The suspension shall remain in effect until lifted by the board pursuant to the board's receipt of a petition from the regulated person, along with the regulated person's current name and address.\n(e) A person regulated by the board shall maintain a current name and address with the board and shall notify the board in writing within 30 days of any change in name or address. If a name change only is requested, the regulated person must request revised credentials and return the current credentials to the board. The board may require the regulated person to substantiate the name change by submitting official documentation from a court of law or agency authorized under law to receive and officially record a name change. If an address change only is requested, no request for revised credentials is required. If the regulated person's current credentials have been lost, stolen, or destroyed, the person shall provide a written explanation to the board.\nA suspension, revocation, condition, limitation, qualification, or restriction of a license or registration shall be in effect pending determination of an appeal unless the court, upon petition and for good cause shown, shall otherwise order. A revocation of a license pursuant to subdivision 1a is not appealable and shall remain in effect indefinitely.\nIn its discretion, the board may restore and reissue a license to practice medicine, but as a condition thereof may impose any disciplinary or corrective measure which it might originally have imposed.\nIn addition to any other remedy provided by law, the board may, without a hearing, temporarily suspend the license of a physician if the board finds that the physician has violated a statute or rule which the board is empowered to enforce and continued practice by the physician would create a serious risk of harm to the public. The suspension shall take effect upon written notice to the physician, specifying the statute or rule violated. The suspension shall remain in effect until the board issues a final order in the matter after a hearing. At the time it issues the suspension notice, the board shall schedule a disciplinary hearing to be held pursuant to the Administrative Procedure Act. The physician shall be provided with at least 20 days' notice of any hearing held pursuant to this subdivision. The hearing shall be scheduled to begin no later than 30 days after the issuance of the suspension order.\nIn disciplinary actions alleging a violation of subdivision 1, paragraph (c) or (d), a copy of the judgment or proceeding under the seal of the court administrator or of the administrative agency which entered the same shall be admissible into evidence without further authentication and shall constitute prima facie evidence of the contents thereof.\n(a) If the board has probable cause to believe that a regulated person comes under subdivision 1, paragraph (1), it may direct the person to submit to a mental or physical examination. For the purpose of this subdivision every regulated person is deemed to have consented to submit to a mental or physical examination when directed in writing by the board and further to have waived all objections to the admissibility of the examining physicians' testimony or examination reports on the ground that the same constitute a privileged communication. Failure of a regulated person to submit to an examination when directed constitutes an admission of the allegations against the person, unless the failure was due to circumstance beyond the person's control, in which case a default and final order may be entered without the taking of testimony or presentation of evidence. A regulated person affected under this paragraph shall at reasonable intervals be given an opportunity to demonstrate that the person can resume the competent practice of the regulated profession with reasonable skill and safety to the public.\nIn any proceeding under this paragraph, neither the record of proceedings nor the orders entered by the board shall be used against a regulated person in any other proceeding.\n(b) In addition to ordering a physical or mental examination, the board may, notwithstanding section 13.384, 144.651, or any other law limiting access to medical or other health data, obtain medical data and health records relating to a regulated person or applicant without the person's or applicant's consent if the board has probable cause to believe that a regulated person comes under subdivision 1, paragraph (1). The medical data may be requested from a provider, as defined in section 144.291, subdivision 2, paragraph (i), an insurance company, or a government agency, including the Department of Human Services. A provider, insurance company, or government agency shall comply with any written request of the board under this subdivision and is not liable in any action for damages for releasing the data requested by the board if the data are released pursuant to a written request under this subdivision, unless the information is false and the provider giving the information knew, or had reason to believe, the information was false. Information obtained under this subdivision is classified as private under sections 13.01 to 13.87.\n(a) In addition to the provisions of subdivision 1, the board may not issue or renew a license if the commissioner of revenue notifies the board and the licensee or applicant for a license that the licensee or applicant owes the state delinquent taxes in the amount of $500 or more. The board may issue or renew the license only if (1) the commissioner of revenue issues a tax clearance certificate and (2) the commissioner of revenue or the licensee or applicant forwards a copy of the clearance to the board. The commissioner of revenue may issue a clearance certificate only if the licensee or applicant does not owe the state any uncontested delinquent taxes.\n(b) For purposes of this subdivision, the following terms have the meanings given.\n(1) \"Taxes\" are all taxes payable to the commissioner of revenue, including penalties and interest due on those taxes.\n(2) \"Delinquent taxes\" do not include a tax liability if (i) an administrative or court action that contests the amount or validity of the liability has been filed or served, (ii) the appeal period to contest the tax liability has not expired, or (iii) the licensee or applicant has entered into a payment agreement to pay the liability and is current with the payments.\n(c) In lieu of the notice and hearing requirements of subdivision 1, when a licensee or applicant is required to obtain a clearance certificate under this subdivision, a contested case hearing must be held if the licensee or applicant requests a hearing in writing to the commissioner of revenue within 30 days of the date of the notice provided in paragraph (a). The hearing must be held within 45 days of the date the commissioner of revenue refers the case to the Office of Administrative Hearings. Notwithstanding any law to the contrary, the licensee or applicant must be served with 20 days' notice in writing specifying the time and place of the hearing and the allegations against the licensee or applicant. The notice may be served personally or by mail.\n(d) The board shall require all licensees or applicants to provide their Social Security number and Minnesota business identification number on all license applications. Upon request of the commissioner of revenue, the board must provide to the commissioner of revenue a list of all licensees and applicants, including the name and address, Social Security number, and business identification number. The commissioner of revenue may request a list of the licensees and applicants no more than once each calendar year.\nA board review or investigation of a regulated person must not be initiated unless the board has received a complaint or report within seven years from the date of the commission of some portion of the conduct complained of or reported on except for alleged violations of subdivision 1, paragraph (t).",
	"repealed": false
}