{
	"id": "356.633",
	"url": "https://www.revisor.mn.gov/statutes/cite/356.633",
	"title": "356.633 DIRECT ROLLOVERS.",
	"text": "(a) For purposes of this section, the following terms have the meanings given.\n(b) \"Distributee\" means:\n(1) a participant in a covered retirement plan listed in section 356.611, subdivision 6;\n(2) the surviving spouse of a participant;\n(3) the former spouse of the participant who is the alternate payee under a qualified domestic relations order as defined in section 414(p) of the Internal Revenue Code, or who is a recipient of a court-ordered equitable distribution of marital property, as provided in section 518.58; or\n(4) a nonspousal beneficiary of a participant who qualifies for a distribution under the plan and is a designated beneficiary as defined in section 401(a)(9)(E) of the Internal Revenue Code.\n(c) \"Eligible retirement plan\" means:\n(1) an individual retirement account under section 408(a) or 408A of the Internal Revenue Code;\n(2) an individual retirement annuity plan under section 408(b) of the Internal Revenue Code;\n(3) an annuity plan under section 403(a) of the Internal Revenue Code;\n(4) a qualified trust plan under section 401(a) of the Internal Revenue Code that accepts the distributee's eligible rollover distribution;\n(5) an annuity contract under section 403(b) of the Internal Revenue Code;\n(6) an eligible deferred compensation plan under section 457(b) of the Internal Revenue Code, which is maintained by a state or local government and which agrees to separately account for the amounts transferred into the plan;\n(7) in the case of an eligible rollover distribution to a nonspousal beneficiary, an individual account or annuity treated as an inherited individual retirement account under section 402(c)(11) of the Internal Revenue Code; or\n(8) a savings incentive match plan for employees of small employers (SIMPLE) individual retirement account under section 408(p) of the Internal Revenue Code, provided that the rollover distribution is made after the two-year period beginning on the date the distributee first participated in any qualified salary reduction arrangement maintained by the distributee's employer under section 408(p)(2) of the Internal Revenue Code, as described in section 72(t)(6) of the Internal Revenue Code.\n(d) \"Eligible rollover distribution\" means any distribution of all or any portion of the balance to the credit of the distributee. An eligible rollover distribution does not include:\n(1) a distribution that is one of a series of substantially equal periodic payments, receivable annually or more frequently, that is made for the life or life expectancy of the distributee, the joint lives or joint life expectancies of the distributee and the distributee's designated beneficiary, or for a specified period of ten years or more;\n(2) a distribution that is required under section 401(a)(9) of the Internal Revenue Code; or\n(3) any other exception required by law or the Internal Revenue Code.\nExcept as provided in subdivision 3 for after-tax contributions, a distributee may elect, at the time and in the manner prescribed by the plan administrator, to have all or any portion of an eligible rollover distribution paid directly to an eligible retirement plan as specified by the distributee.\nFor distributions of after-tax contributions which are not includable in gross income, the after-tax portion may be transferred only to an individual retirement account or annuity described in section 408(a) or (b) of the Internal Revenue Code, to a Roth individual retirement account described in section 408A of the Internal Revenue Code, to a qualified plan described in either section 401(a) of the Internal Revenue Code, or to an annuity contract described in section 403(b) of the Internal Revenue Code, that agrees to separately account for the amounts transferred, including separately accounting for the portion of the distribution which is includable in gross income and the portion of the distribution which is not includable.",
	"repealed": false
}