{
	"id": "505.03",
	"url": "https://www.revisor.mn.gov/statutes/cite/505.03",
	"title": "505.03 GOVERNMENTAL APPROVAL.",
	"text": "Plats shall, except in cities whose charters provide for official supervision of plats by municipal officers or bodies, together with an abstract, certificate of title, or other satisfactory evidence of title, be presented for approval to the council of the city or town board of towns wherein there reside over 5,000 people in which the land is located; and, if the land is located outside the limits of any city, or such town, then to the board of county commissioners of the county in which the land is located. For purposes of this subdivision, \"satisfactory evidence of title\" must be determined by the city council, town board, or board of county commissioners and must include an abstract of title, certificate of title, title opinion, title commitment, or title policy. Plats that subdivide land are subject to the approval of the elected body of the local governmental units exercising authority over the subdivision of the land. Plats that only delineate existing parcels or comply with a minor subdivision procedure may be approved by a local government official designated by the governing body of the local governmental unit exercising authority over the subdivision of land.\n(a) Any proposed preliminary plat in a city, town, or county, which includes lands abutting upon state rail bank property or upon any existing or established trunk highway or proposed highway which has been designated by a centerline order filed in the office of the county recorder shall first be presented by the city, town, or county to the commissioner of transportation for written comments and recommendations. Preliminary plats in a city or town involving state rail bank property or both a trunk highway and a highway under county jurisdiction shall be submitted by the city or town to the county highway engineer as provided in paragraphs (b) and (c) and to the commissioner of transportation. Plats shall be submitted by the city, town, or county to the commissioner of transportation for review at least 30 days prior to the home rule charter or statutory city, town or county taking final action on the preliminary plat. The commissioner of transportation shall submit the written comments and recommendations to the city, town, or county within 30 days after receipt by the commissioner of such a plat. Final action on such plat by the city, town, or county shall not be taken until after these required comments and recommendations have been received or until the 30-day period has elapsed.\n(b) If any proposed preliminary plat or initial plat filing includes land located in a city or town bordering either state rail bank property or an existing or proposed county road, highway, or county state-aid highway, and the property, road, or highway is designated on a map or county highway plan filed in the office of the county recorder or registrar of titles, then the plat or plat filing must be submitted by the city or town to the county engineer within five business days after receipt by the city or town of the preliminary plat or initial plat filing for written comments and recommendations. The county engineer's review shall be limited to factors of county significance in conformance with adopted county guidelines developed through a public hearing or a comprehensive planning process with comment by the cities and towns. The guidelines must provide for development and redevelopment scenarios, allow for variances, and reflect consideration of city or town adopted guidelines.\n(c) Within 30 days after county receipt from the city or town of the preliminary plat or initial plat filing, the county engineer shall provide to the city or town written comments stating whether the plat meets county guidelines and describing any modifications necessary to bring the plat into conformity with the county guidelines. No city or town may approve a preliminary plat until it has received the county engineer's written comments and recommendations or until the county engineer's comment period has expired, whichever occurs first. Within ten business days following a city's or town's approval of a preliminary plat, the city or town shall submit to the county board notice of its approval, along with a statement addressing the disposition of any written comments or recommendations made by the county engineer. In the event the city or town does not amend the plat to conform to the recommendations made by the county engineer, representatives from the county and city or town shall meet to discuss the differences and determine whether changes to the plat are appropriate prior to final approval. This requirement shall not extend the time deadlines for preliminary or final approval as required under this section, section 15.99 or 462.358, or any other law, nor shall this requirement prohibit final approval as required by this section.\n(d) A legible preliminary drawing or print of a proposed preliminary plat shall be acceptable for purposes of review by the commissioner of transportation or the county highway engineer. To such drawing or print there shall be attached a written statement describing:\n(1) the outlet for and means of disposal of surface waters from the proposed platted area;\n(2) the land use designation or zoning category of the proposed platted area;\n(3) the locations of ingress and egress to the proposed platted area; and\n(4) a preliminary site plan for the proposed platted area, with dimensions to scale, authenticated by a registered engineer or land surveyor, showing:\n(i) the state rail bank property;\n(ii) the existing or proposed state highway, county road, or county highway; and\n(iii) all existing and proposed rights-of-way, easements, general lot layouts, and lot dimensions.\n(e) Failure to obtain the written comments and recommendations of the commissioner of transportation or the county highway engineer shall in no manner affect the title to the lands included in the plat or the platting of said lands. A city, town, or county shall file with the plat, in the office of the county recorder or registrar of titles, a certificate or other evidence showing submission of the preliminary plat to the commissioner or county highway engineer in compliance with this subdivision.\nThe council or board to whom the plat has been presented may, after having notified the proprietor to that effect, employ qualified persons to check and verify the surveys and plat, and to determine the suitability of the plat from the standpoint of community planning, and such persons shall make full reports of their findings. The council or board may require the proprietor to reimburse the city, town or county for the cost of such services; if such services are rendered by a salaried employee of the municipality, the charge therefor may be computed on the basis of such employee's regular hourly, daily, weekly or monthly wages or salary. When the plat has been approved, it shall be so certified to by the city or town clerk or county auditor, as the case may be.",
	"repealed": false
}