{
	"id": "200.031",
	"url": "https://www.revisor.mn.gov/statutes/cite/200.031",
	"title": "200.031 DETERMINATION OF RESIDENCE.",
	"text": "Residence shall be determined in accordance with the following principles, so far as they may be applicable to the facts of the case:\n(1) The residence of an individual is in the precinct where the individual's home is located, from which the individual has no present intention of moving, and to which, whenever the individual is absent, the individual intends to return.\n(2) An individual does not lose residence if the individual leaves home to live temporarily in another state or precinct.\n(3) An individual does not acquire a residence in any precinct of this state if the individual is living there only temporarily, without the intention of making that precinct home.\n(4) If an individual goes into another state or precinct with the intention of making it home or files an affidavit of residence there for election purposes, the individual loses residence in the former precinct.\n(5) If an individual moves to another state with the intention of living there for an indefinite period, the individual loses residence in this state, notwithstanding any intention to return at some indefinite future time.\n(6) Except as otherwise provided in this section, an individual's residence is located in the precinct where the individual's family lives, unless the individual's family is living in that precinct only temporarily.\n(7) If an individual's family lives in one precinct and the individual lives or does business in another, the individual's residence is located in the precinct where the individual's family lives, unless the individual establishes a home in the other precinct and intends to remain there, with or without the individual's family.\n(8) The residence of a single individual is in the precinct where the individual lives and usually sleeps.\n(9) The mere intention to acquire a new residence, is not sufficient to acquire a new residence, unless the individual moves to that location; moving to a new location is not sufficient to acquire a new residence unless the individual intends to remain there.\n(10) The residence of an individual who is working temporarily in any precinct of this state is in the precinct where the individual's permanent home is located.\n(11) The residence of an individual who is living permanently in a soldiers' home or nursing home is in the precinct where the home is located.\n(12) If an individual's home lies in more than one precinct or political subdivision, the residence of the individual is in the precinct in which a majority of the room in which the individual usually sleeps is located.\n(13) If an individual's home is destroyed or rendered uninhabitable by fire or natural disaster, the individual does not lose residence in the precinct where the home is located if the individual intends to return to the home when it is reconstructed or made habitable.",
	"repealed": false
}