{
	"id": "216C.265",
	"url": "https://www.revisor.mn.gov/statutes/cite/216C.265",
	"title": "216C.265 EMERGENCY ENERGY ASSISTANCE; FUEL FUNDS.",
	"text": "(a) The definitions in this subdivision apply to this section.\n(b) \"Energy provider\" means a person who provides heating fuel, including natural gas, electricity, fuel oil, propane, wood, or other form of heating fuel, to residences at retail.\n(c) \"Fuel fund\" means a fund established by an energy provider, the state, or any other entity that collects and distributes money for low-income emergency energy assistance and meets the minimum criteria, including income eligibility criteria, for receiving money from the federal Low-Income Home Energy Assistance Program and the program's Incentive Fund for Leveraging Non-Federal Resources.\nEach energy provider may solicit contributions from its energy customers for deposit in a fuel fund established by the energy provider, a fuel fund established by another energy provider or other entity, or the statewide fuel account established in subdivision 3, for the purpose of providing emergency energy assistance to low-income households that qualify under the federal eligibility criteria of the federal Low-Income Home Energy Assistance Program. Solicitation of contributions from customers may be made at least annually and may provide each customer an opportunity to contribute as part of payment of bills for provision of service or provide an alternate, convenient way for customers to contribute.\nThe commissioner must establish a statewide fuel account. The commissioner may develop and implement a program to solicit contributions, manage the receipts, and distribute emergency energy assistance to low-income households, as defined in the federal Low-Income Home Energy Assistance Program, on a statewide basis. All money remitted to the commissioner for deposit in the statewide fuel account is appropriated to the commissioner for the purpose of developing and implementing the program. No more than ten percent of the money received in the first two years of the program may be used for the administrative expenses of the commissioner to implement the program and no more than five percent of the money received in any subsequent year may be used for administration of the program.\nThe commissioner must appoint an advisory council to advise the commissioner on implementation of this section. At least one-third of the advisory council must be composed of persons from households that are eligible for emergency energy assistance under the federal Low-Income Home Energy Assistance Program. The remaining two-thirds of the advisory council must be composed of persons representing energy providers, customers, local energy assistance providers, existing fuel fund delivery agencies, and community action agencies. Members of the advisory council may receive expenses, but no other compensation, as provided in section 15.059, subdivision 3. Appointment and removal of members is governed by section 15.059.",
	"repealed": false
}