{
	"id": "116U.27",
	"url": "https://www.revisor.mn.gov/statutes/cite/116U.27",
	"title": "116U.27 FILM PRODUCTION CREDIT.",
	"text": "(a) For purposes of this section, the following terms have the meanings given.\n(b) \"Allocation certificate\" means a certificate issued by the commissioner to a taxpayer upon receipt and approval of an initial application for a credit for a project that has not yet been completed.\n(c) \"Application\" means the application for a credit under subdivision 4.\n(d) \"Credit certificate\" means a certificate issued by the commissioner upon receipt and approval of the cost verification report in subdivision 4, paragraph (e).\n(e) \"Director\" means the director of Explore Minnesota.\n(f) \"Eligible production costs\" means eligible production costs as defined in section 116U.26, paragraph (b), clause (1), incurred in Minnesota that are directly attributable to the production of a film project in Minnesota.\n(g) \"Film\" has the meaning given in section 116U.26, paragraph (b), clause (2).\n(h) \"Project\" means a film:\n(1) that includes the promotion of Minnesota;\n(2) for which the taxpayer has expended at least $1,000,000 in any consecutive 12-month period beginning after expenditures are first paid in Minnesota for eligible production costs; and\n(3) to the extent practicable, that employs Minnesota residents.\nTelevision commercials are exempt from the requirement under clause (1).\n(i) \"Promotion of Minnesota\" or \"promotion\" means visible display of a static or animated logo, approved by the director, that promotes Minnesota within its presentation in the end credits for the life of the project.\nA taxpayer is eligible for a credit up to 25 percent of eligible production costs paid in a taxable year. A taxpayer may only claim a credit if the taxpayer was issued a credit certificate under subdivision 4.\nThe recipient of a credit certificate may assign the certificate to another taxpayer before any amount of the credit is claimed. The assignee is allowed the credit under section 290.06, subdivision 39, or 297I.20, subdivision 4. An assignment is not valid unless the assignee notifies the commissioner of revenue within 30 days of the date that the assignment is made. The commissioner of revenue shall prescribe the forms necessary for notifying the commissioner of revenue of the assignment of a credit certificate and for claiming a credit by assignment.\n(a) To qualify for a credit under this section, a taxpayer must submit to the director an application for a credit in the form prescribed by the director, in consultation with the commissioner of revenue.\n(b) Upon approving an application for a credit that meets the requirements of this section, the director shall issue allocation certificates that:\n(1) verify eligibility for the credit;\n(2) state the amount of credit anticipated for the eligible project, with the credit amount up to 25 percent of eligible project costs; and\n(3) state the taxable year in which the credit is allocated.\n(c) The director must not issue allocation certificates for more than $24,950,000 of credits each year. If the entire amount is not allocated in that taxable year, any remaining amount is available for allocation for the four following taxable years until the entire allocation has been made. The director must not award any credits for taxable years beginning after December 31, 2030, and any unallocated amounts cancel on that date.\n(d) The director must allocate credits on a first-come, first-served basis.\n(e) Upon completion of a project, the taxpayer shall submit to the director a report prepared by an independent certified public accountant licensed in the state of Minnesota to verify the amount of eligible production costs related to the project. The report must be prepared in accordance with generally accepted accounting principles. Upon receipt and approval of the cost verification report and other documents required by the director, the director shall determine the final amount of eligible production costs and issue a credit certificate to the taxpayer. The credit may not exceed the anticipated credit amount on the allocation certificate. If the credit is less than the anticipated amount on the allocation credit, the difference is returned to the amount available for allocation under paragraph (c). To claim the credit under section 290.06, subdivision 39, or 297I.20, subdivision 4, a taxpayer must include a copy of the credit certificate as part of the taxpayer's return.\nBy January 15, 2025, the commissioner of revenue, in consultation with the director, must provide a report to the chairs and ranking minority members of the legislative committees with jurisdiction over economic development and taxes. The report must comply with sections 3.195 and 3.197, and must detail the following:\n(1) the amount of credit certifications issued annually;\n(2) the number of applications submitted, the number of allocation certificates issued, the amount of allocation certificates issued, the number of reports submitted upon completion of a project, and the number of credit certificates issued;\n(3) the types of projects eligible for the credit;\n(4) the total economic impact of the credit in Minnesota, including the calendar year over calendar year percentage changes in the number of jobs held by Minnesota residents in businesses having a primary North American Industry Classification System code of 512110 as reported to the commissioner, for calendar years 2019 through 2023;\n(5) the number of taxpayers per tax type which are assignees of credit certificates under subdivision 3;\n(6) annual Minnesota taxes paid by businesses having a primary North American Industry Classification System code of 512110, for taxable years beginning after December 31, 2018, and before January 1, 2024; and\n(7) any other information the commissioner of revenue, in consultation with the director, deems necessary for purposes of claiming and administering the credit.\n[See Note.]\nBeginning in fiscal year 2022, $50,000 is annually appropriated from the general fund to the commissioner of revenue for a transfer to Explore Minnesota for costs associated with personnel and administrative expenses related to administering the credit. This subdivision expires on June 30, 2025.\nSubdivisions 1 to 5 expire January 1, 2031, for taxable years beginning after December 31, 2030.",
	"repealed": false
}