{
	"id": "62J.826",
	"url": "https://www.revisor.mn.gov/statutes/cite/62J.826",
	"title": "62J.826 MEDICAL AND DENTAL PRACTICES; CURRENT STANDARD CHARGES.",
	"text": "(a) The definitions in this subdivision apply to this section.\n(b) \"CDT code\" means a code value drawn from the Code on Dental Procedures and Nomenclature published by the American Dental Association.\n(c) \"Chargemaster\" means the list of all individual items and services maintained by a medical or dental practice for which the medical or dental practice has established a charge.\n(d) \"Commissioner\" means the commissioner of health.\n(e) \"CPT code\" means a code value drawn from the Current Procedural Terminology published by the American Medical Association.\n(f) \"Dental service\" means a service charged using a CDT code.\n(g) \"Diagnostic laboratory testing\" means a service charged using a CPT code within the CPT code range of 80047 to 89398.\n(h) \"Diagnostic radiology service\" means a service charged using a CPT code within the CPT code range of 70010 to 79999 and includes the provision of x-rays, computed tomography scans, positron emission tomography scans, magnetic resonance imaging scans, and mammographies.\n(i) \"Hospital\" means an acute care institution licensed under sections 144.50 to 144.58, but does not include a health care institution conducted for those who rely primarily upon treatment by prayer or spiritual means in accordance with the creed or tenets of any church or denomination.\n(j) \"Medical or dental practice\" means a business that:\n(1) earns revenue by providing medical care or dental services to the public;\n(2) issues payment claims to health plan companies and other payers; and\n(3) may be identified by its federal tax identification number.\n(k) \"Outpatient surgical center\" means a health care facility other than a hospital offering elective outpatient surgery under a license issued under sections 144.50 to 144.58.\n(l) \"Standard charge\" means the regular rate established by the medical or dental practice for an item or service provided to a specific group of paying patients. This includes all of the following:\n(1) the charge for an individual item or service that is reflected on a medical or dental practice's chargemaster, absent any discounts;\n(2) the charge that a medical or dental practice has negotiated with a third-party payer for an item or service;\n(3) the lowest charge that a medical or dental practice has negotiated with all third-party payers for an item or service;\n(4) the highest charge that a medical or dental practice has negotiated with all third-party payers for an item or service; and\n(5) the charge that applies to an individual who pays cash, or cash equivalent, for an item or service.\nThe following medical or dental practices must make available to the public a list of their current standard charges for all items and services, as reflected in the medical or dental practice's chargemaster, provided by the medical or dental practice:\n(1) hospitals;\n(2) outpatient surgical centers; and\n(3) any other medical or dental practice that has revenue of greater than $50,000,000 per year and that derives the majority of its revenue by providing one or more of the following services:\n(i) diagnostic radiology services;\n(ii) diagnostic laboratory testing;\n(iii) orthopedic surgical procedures, including joint arthroplasty procedures within the CPT code range of 26990 to 27899;\n(iv) ophthalmologic surgical procedures, including cataract surgery coded using CPT code 66982 or 66984, or refractive correction surgery to improve visual acuity;\n(v) anesthesia services commonly provided as an ancillary to services provided at a hospital, outpatient surgical center, or medical practice that provides orthopedic surgical procedures or ophthalmologic surgical procedures;\n(vi) oncology services, including radiation oncology treatments within the CPT code range of 77261 to 77799 and drug infusions; or\n(vii) dental services.\n(a) A medical or dental practice that is subject to this section must make available to the public current standard charges using the format and data elements specified in the currently effective version of the Hospital Price Transparency Sample Format (Tall) (CSV) and related data dictionary recommended for hospitals by the Centers for Medicare and Medicaid Services (CMS). If CMS modifies or replaces the specifications for this format, the form of this file must be modified or replaced to conform with the new CMS specifications by the date specified by CMS for compliance with its new specifications. All prices included in the file must be expressed as dollar amounts. The data must be in the form of a comma separated values file which can be directly imported, without further editing or remediation, into a relational database table which has been designed to receive these files. The medical or dental practice must make the file available to the public in a manner specified by the commissioner.\n(b) A medical or dental practice must test its file for compliance with paragraph (a) before making the file available to the public.\n(c) A hospital must comply with this section no later than January 1, 2024. A medical or dental practice that meets the requirements in subdivision 2, clause (3), or an outpatient surgical center must comply with this section no later than January 1, 2025.",
	"repealed": false
}