{
	"id": "145A.061",
	"url": "https://www.revisor.mn.gov/statutes/cite/145A.061",
	"title": "145A.061 CRIMINAL BACKGROUND STUDIES.",
	"text": "The commissioner of health may develop agreements to conduct criminal background studies on each person who registers as a volunteer in the Minnesota Responds Medical Reserve Corps and applies for membership in the Minnesota behavioral health or mobile medical teams. The background study is for the purpose of determining the applicant's suitability and eligibility for membership. Each applicant must provide written consent authorizing the Department of Health to obtain the applicant's state criminal background information.\nBefore denying the applicant the opportunity to serve as a health volunteer due to information obtained from a background study, the commissioner shall provide the applicant with the opportunity to complete, or challenge the accuracy of, the criminal justice information reported to the commissioner. The applicant shall have 30 calendar days to correct or complete the record prior to the commissioner taking final action based on the report.\nThe commissioner may deny an application from any applicant who has been convicted of any of the following crimes:\nSection 609.185 (murder in the first degree); section 609.19 (murder in the second degree); section 609.195 (murder in the third degree); section 609.20 (manslaughter in the first degree); section 609.205 (manslaughter in the second degree); section 609.25 (kidnapping); section 609.2661 (murder of an unborn child in the first degree); section 609.2662 (murder of an unborn child in the second degree); section 609.2663 (murder of an unborn child in the third degree); section 609.342 (criminal sexual conduct in the first degree); section 609.343 (criminal sexual conduct in the second degree); section 609.344 (criminal sexual conduct in the third degree); section 609.345 (criminal sexual conduct in the fourth degree); section 609.3451 (criminal sexual conduct in the fifth degree); section 609.3453 (criminal sexual predatory conduct); section 609.352 (solicitation of children to engage in sexual conduct); section 609.352 (communication of sexually explicit materials to children); section 609.365 (incest); section 609.377 (felony malicious punishment of a child); section 609.378 (felony neglect or endangerment of a child); section 609.561 (arson in the first degree); section 609.562 (arson in the second degree); section 609.563 (arson in the third degree); section 609.749, subdivision 3, 4, or 5 (felony harassment or stalking); section 152.021 (controlled substance crimes in the first degree); section 152.022 (controlled substance crimes in the second degree); section 152.023 (controlled substance crimes in the third degree); section 152.024 (controlled substance crimes in the fourth degree); section 152.025 (controlled substance crimes in the fifth degree); section 243.166 (violation of predatory offender registration law); section 617.23, subdivision 2, clause (1), or subdivision 3, clause (1) (indecent exposure involving a minor); section 617.246 (use of minors in sexual performance); section 617.247 (possession of pornographic work involving minors); section 609.221 (assault in the first degree); section 609.222 (assault in the second degree); section 609.223 (assault in the third degree); section 609.2231 (assault in the fourth degree); section 609.224 (assault in the fifth degree); section 609.2242 (domestic assault); section 609.2247 (domestic assault by strangulation); section 609.228 (great bodily harm caused by distribution of drugs); section 609.23 (mistreatment of persons confined); section 609.231 (mistreatment of residents or patients); section 609.2325 (criminal abuse); section 609.233 (criminal neglect); section 609.2335 (financial exploitation of a vulnerable adult); section 609.234 (failure to report); section 609.24 (simple robbery); section 609.245 (aggravated robbery); section 609.247 (carjacking); section 609.255 (false imprisonment); section 609.322 (solicitation, inducement, and promotion of prostitution and sex trafficking); section 609.324, subdivision 1 (hiring or engaging minors in prostitution); section 609.465 (presenting false claims to a public officer or body); section 609.466 (medical assistance fraud); section 609.52 (felony theft); section 609.82 (felony fraud in obtaining credit); section 609.527 (felony identity theft); section 609.582 (felony burglary); section 609.611 (felony insurance fraud); section 609.625 (aggravated forgery); section 609.63 (forgery); section 609.631 (felony check forgery); section 609.66, subdivision 1e (felony drive-by shooting); section 609.71 (felony riot); section 609.713 (terroristic threats); section 609.72, subdivision 3 (disorderly conduct by a caregiver against a vulnerable adult); section 609.821 (felony financial transaction card fraud); section 609.855, subdivision 5 (shooting at or in a public transit vehicle or facility); or aiding and abetting, attempting, or conspiring to commit any of the offenses in this subdivision.\nFor purposes of this section, an applicant is considered to have been convicted of a crime if the applicant was convicted, or otherwise found guilty, including by entering an Alford plea; was found guilty but the adjudication of guilt was stayed or withheld; or was convicted but the imposition or execution of a sentence was stayed.\nAll state criminal history record information or data obtained by the commissioner from the Bureau of Criminal Apprehension is private data on individuals under section 13.02, subdivision 12, and restricted to the exclusive use of the commissioner for the purpose of evaluating an applicant's eligibility for participation in the behavioral health or mobile field medical team.\nThe commissioner may deny a volunteer membership on a mobile medical team or behavioral health team for any reason, and is only required to communicate the reason when membership is denied as a result of information received from a criminal background study. The commissioner is exempt from the Criminal Offenders Rehabilitation Act under chapter 364 in the selection of volunteers for any position or activity including the Minnesota Responds Medical Reserve Corps, the Minnesota behavioral health team, and the mobile medical team.",
	"repealed": false
}