{
	"id": "116A.13",
	"url": "https://www.revisor.mn.gov/statutes/cite/116A.13",
	"title": "116A.13 LETTING CONTRACT.",
	"text": "After the filing of the order ordering the improvement, the auditor and the county board, in the instance of a county system, and the auditors of the respective counties, or a majority of them, in the instance of a judicial system, shall proceed to let the job of constructing the system. In judicial systems the auditors shall hold the letting at the office of the auditor of the county in which the proceedings are pending.\nIf it shall appear at the expiration of 30 days from the filing of the order ordering the improvement, that one or more appeals have been taken involving the question of damages, no contract shall be let until the appeals have been determined, unless ordered by the board or court. Application for such order may be made by the auditor or auditors or any interested person. If application be made by some person other than an auditor, then the auditor or auditors shall be given five days' notice of hearing upon such application.\nThe auditor of the county in which the proceedings are pending shall give notice of the letting of the contract by publication in a newspaper in such county stating the time and place where the contract shall be let. When the estimated cost of construction is more than $3,000, the auditor shall also advertise such letting in a trade paper. Such notice shall state the approximate amount of work and the estimated cost thereof and shall invite bids for the work as one job or in sections. The right shall be reserved to reject any and all bids. The notice shall require that each bid be accompanied by a certified check or a bond furnished by an approved surety bonding corporation payable to the auditor or auditors for not less than ten percent of the bid, as security that the bidder will enter into a contract and give a bond as required by section 116A.15.\nThe engineer shall attend the letting and no bid shall be accepted without the engineer's approval as to compliance with plans and specifications.\nThe job may be let in one job, or in sections, or separately for labor and material, and may be let to the lowest responsible bidder or bidders therefor. Alternatively, the contract may be awarded to the vendor or contractor offering the best value under a request for proposals as described in section 16C.28, subdivision 1, paragraph (a), clause (2), and paragraph (c).\nBids shall not be entertained which in the aggregate exceed by more than 30 percent the total estimated cost of construction.\nThe auditor, with such chair, or auditors, as the case may be, shall contract, in the name of the county, or in the names of the respective counties, each acting by and through its auditor, with the party to whom such work or any part thereof is let, requiring that party to construct the same in the time and manner and according to the plans and specifications and the contract provisions as set forth in sections 116A.01 to 116A.26.",
	"repealed": false
}