{
	"id": "412.221",
	"url": "https://www.revisor.mn.gov/statutes/cite/412.221",
	"title": "412.221 SPECIFIC POWERS OF COUNCIL.",
	"text": "The council shall have power to procure the books to be kept by the officers, and such furniture, property, stationery, printing, and office supplies as are necessary for city purposes.\nThe council shall have power to make such contracts as may be deemed necessary or desirable to make effective any power possessed by the council. The city may purchase personal property through a conditional sales contract and real property through a contract for deed under which contracts the seller is confined to the remedy of recovery of the property in case of nonpayment of all or part of the purchase price, which shall be payable over a period of not to exceed five years. When the contract price of property to be purchased by contract for deed or conditional sales contract exceeds 0.24177 percent of the estimated market value of the city, the city may not enter into such a contract for at least ten days after publication in the official newspaper of a council resolution determining to purchase property by such a contract; and, if before the end of that time a petition asking for an election on the proposition signed by voters equal to ten percent of the number of voters at the last regular city election is filed with the clerk, the city may not enter into such a contract until the proposition has been approved by a majority of the votes cast on the question at a regular or special election.\nThe council shall have power to construct or acquire structures needed for city purposes, to control, protect, and insure the public buildings, property, and records.\nMS 1961 [Repealed, 1963 c 798 s 16]\nThe council shall have power to provide for the prosecution or defense of actions or proceedings at law in which the city may be interested and it may employ counsel for the purpose.\nThe council shall have power to lay out, open, change, widen or extend streets, alleys, parks, squares, and other public ways and grounds and to grade, pave, repair, control, and maintain the same; to establish and maintain drains, canals, and sewers; to alter, widen or straighten watercourses; to lay, repair, or otherwise improve or discontinue sidewalks, paths, and crosswalks. It shall have power by ordinance to regulate the use of streets and other public grounds, to prevent encumbrances or obstructions, and to require the owners or occupants of buildings and the owners of vacant lots to remove any snow, ice, dirt, or rubbish from the sidewalks adjacent thereto and in default thereof to cause such encumbrances, obstructions, or substances to be removed and the cost to be assessed against the property as a special assessment.\nThe council shall have power to provide for lighting the streets, buildings, or grounds by gas, electricity or other means, and to contract with anyone engaged in the business of furnishing gas or electric service for the supply of such service to the city and its inhabitants.\nThe council shall have power to provide for, and by ordinance regulate, the setting out and protection of trees, shrubs, and flowers in the city or upon its property.\nThe council shall have power to acquire by purchase, gift, devise, condemnation or otherwise, hold and manage cemetery grounds, to enclose, lay out and ornament such grounds and sell and convey lots therein. It may by ordinance regulate cemeteries and the disposal of dead bodies.\nThe council shall have power to establish markets, provide public scales, and appoint a weighmaster. It may by ordinance regulate markets and the use of scales and restrain sales in streets.\nThe council shall have power to provide and by ordinance regulate the use of wells, cisterns, reservoirs, waterworks, and other means of water supply.\nThe council shall have power to establish harbor and dock limits and by ordinance regulate the location, construction and use of piers, docks, wharves, and boat houses on navigable waters and fix rates of wharfage. The council may construct and maintain public docks and warehouses and by ordinance regulate their use.\nThe council shall have power to acquire and operate ferries across any river flowing through or by the city.\nThe council shall have power to acquire, improve and operate, and by ordinance regulate tourist camps and automobile parking facilities.\nThe council shall have power to provide free musical entertainment.\nThe council shall have power to provide hospitals. The council of any city operating a municipal hospital may by ordinance establish a hospital board with such powers and duties of hospital management and operation as the council confers upon it; and the council may, by vote of all five members, abolish any board so established. The board shall consist of five members, each appointed by the mayor with the consent of the council for a term of five years. Terms of the first members shall be so arranged that the term of one member expires each year. Any vacancy shall be filled for the unexpired portion of the term in which it occurs. Any member may be removed by the mayor with the consent of the council for cause after a hearing.\nThe council may by ordinance authorize the hospital board to establish a separate fund in the city treasury into which all of its revenues shall be deposited. The hospital board shall, in the same manner as the council under section 412.271, subdivision 1, and to the same extent, audit claims to be paid from the fund. The secretary of the board shall draw an order upon the treasurer for the proper amount allowed by the board. Upon counter signature by the president of the board and presentation, orders shall be paid by the treasurer.\nThe council shall have power to establish a fire department, appoint its officers and members and prescribe their duties, and provide fire apparatus. It shall have power to adopt such ordinances as are reasonable and expedient to prevent, control, or extinguish fires.\nThe council shall have power by ordinance to name or rename the streets and public places of the city and to number or renumber the lots and blocks of the city, or any part thereof. It may make and record a consolidated plat of the city.\nThe council shall have power by ordinance to restrain or license and regulate auctioneers, transient merchants and dealers, hawkers, peddlers, solicitors, and canvassers.\nThe council shall have power by ordinance to license and regulate baggage wagons, dray drivers, taxicabs, and automobile rental agencies and liveries. An ordinance to license or regulate taxicabs or small vehicle passenger service must meet the requirements under section 221.091, subdivision 2.\nThe council shall have power by ordinance to regulate the keeping of animals, to restrain their running at large, to authorize their impounding and sale or summary destruction, and to establish pounds, and to license and regulate riding academies.\n(a) The council shall have power by ordinance:\n(1) to prohibit or regulate slaughterhouses;\n(2) to prevent the bringing, depositing, or leaving within the city of any unwholesome substance or deposit of solid waste within the city not otherwise authorized by law, to require the owners or occupants of lands to remove unwholesome substances or the unauthorized deposit of solid waste and if it is not removed to provide for its removal at the expense of the owner or occupant, which expense shall be a lien upon the property and may be collected as a special assessment;\n(3) to provide for or regulate the disposal of sewage, garbage, and other refuse; and\n(4) to provide for the cleaning of, and removal of obstructions from, any waters in the city and to prevent their obstruction or pollution.\n(b) The council may also seek civil penalties and damages from persons responsible for unauthorized deposit of solid waste under section 115A.99, which, if unpaid, may be imposed as a lien on property owned by the responsible persons and collected as a special assessment.\n(c) The council may establish a community health board as defined in section 145A.02, subdivision 5, with all the powers of such boards under the general laws.\nThe council shall have power by ordinance to define nuisances and provide for their prevention or abatement.\nThe council shall have power by ordinance to regulate and prevent noise or other disorder.\nThe council shall have power by ordinance to prevent or license and regulate the exhibition of circuses, theatrical performances, amusements, or shows of any kind, and the keeping of billiard tables and bowling alleys, to prohibit gambling and gambling devices, and to license, regulate or prohibit devices commonly used for gambling purposes.\nThe council shall have power by ordinance to restrain and punish vagrants, prostitutes, and persons guilty of lewd conduct.\nThe council shall have power by ordinance to license and regulate the operation of public dance halls and the conduct of public dances.\nThe council shall have power by ordinance to regulate the construction of buildings.\nMS 1961 [Repealed, 1965 c 670 s 14]\nThe council shall have power by ordinance to license and regulate restaurants and public eating houses, except that a restaurant or delicatessen in a grocery store is subject only to regulation under chapter 28A.\nThe council shall have power by ordinance to require the owner of any property abutting on or adjacent to any street in which sewer and water mains have been laid to install a toilet in any dwelling or commercial establishment upon such property and connect it with the sewer and water mains and in default thereof to provide for the installation of such toilet and charging the cost against the property as a special assessment.\nThe council shall have power to provide for the government and good order of the city, the suppression of vice and immorality, the prevention of crime, the protection of public and private property, the benefit of residence, trade, and commerce, and the promotion of health, safety, order, convenience, and the general welfare by such ordinances not inconsistent with the Constitution and laws of the United States or of this state as it shall deem expedient.\nWhen the council has sole authority to decide whether the city should join a special district or similar independent governmental body having taxing powers within the city, the council shall have authority to submit to the voters at a regular or special election the question of whether the municipality should join such a body. The results of the election on the question so submitted shall be advisory to the council only and shall have no binding effect upon its decision to join or withdraw from the special district or similar independent body.\nThe council shall have the power to provide decorations, signs, plaques, and attached accessories for public streets, buildings, and parks.",
	"repealed": false
}