{
	"id": "326B.112",
	"url": "https://www.revisor.mn.gov/statutes/cite/326B.112",
	"title": "326B.112 BLEACHER SAFETY.",
	"text": "(a) For purposes of this section, the following terms have the meanings given.\n(b) \"Place of public accommodation\" means a public or privately owned sports or entertainment arena, gymnasium, auditorium, stadium, hall, special event center in a public park, or other facility for public assembly.\n(c) \"Bleacher\" refers to any tiered or stepped seating facility, whether temporary or permanent, used in a place of public accommodation for the seating of its occupants.\nAll places of public accommodation must comply with the provisions of this section.\nIn places of public accommodation using bleacher seating, all bleachers or bleacher open spaces over 55 inches above grade or the floor below, and all bleacher guardrails if any part of the guardrail is over 30 inches above grade or the floor below must conform to the following safety requirements:\n(1) the open space between bleacher footboards, seats, and guardrails must not exceed four inches, unless approved safety nets are installed, except that retractable bleachers already in place as of January 1, 2001, may have open spaces not exceeding nine inches and any bleachers owned by the University of Minnesota, the Minnesota State Colleges and Universities, or a private college or university may have open spaces not exceeding nine inches;\n(2) bleachers must have vertical perimeter guardrails with no more than four-inch rail spacing between vertical rails or other approved guardrails that address climbability and are designed to prevent accidents; and\n(3) the state building official shall determine whether the safety nets and guardrail climbability meet the requirements of the alternate design section of the State Building Code. All new bleachers manufactured, installed, sold, or distributed after January 1, 2001, must comply with the State Building Code in effect and this subdivision.\n(a) A statutory or home rule charter city that does not have in effect an ordinance adopting the State Building Code is responsible for enforcement in the city of the code's requirements for bleacher safety. In all other areas where there is no ordinance in effect adopting the State Building Code, the county is responsible for enforcement of the code's requirements for bleacher safety.\n(b) Municipalities that have not adopted the code may enforce the code requirements for bleacher safety by either entering into a joint powers agreement for enforcement with another municipality that has adopted the code or contracting for enforcement with a qualified and certified building official or state licensed design professional to enforce the code.\n(c) Municipalities, school districts, organizations, individuals, and other persons operating or owning places of public accommodation with bleachers that are subject to the safety requirements in subdivision 3 shall provide a signed certification of compliance to the commissioner by January 1, 2002. For bleachers subject to the exception in subdivision 3, clause (1), entities covered by this paragraph must have on file a bleacher safety management plan and amortization schedule. The certification shall be prepared by a qualified and certified building official or state licensed design professional and shall certify that the bleachers have been inspected and are in compliance with the requirements of this section and are structurally sound. For bleachers owned by a school district or nonpublic school, the person the district or nonpublic school designates to be responsible for buildings and grounds may make the certification.\nThe commissioner, in addition to other remedies provided for violations of this chapter, shall forbid use of bleachers not in compliance with this section.\nBleacher footboards and guardrails must be reinspected at least every five years and a structural inspection must be made at least every ten years. Inspections may be completed in the same manner as provided in subdivision 4. This section does not preclude a municipal authority from establishing additional reinspections under the State Building Code.",
	"repealed": false
}