{
	"id": "147D.05",
	"url": "https://www.revisor.mn.gov/statutes/cite/147D.05",
	"title": "147D.05 PROFESSIONAL CONDUCT.",
	"text": "(a) A licensed traditional midwife shall provide an initial and ongoing screening to ensure that each client receives safe and appropriate care. A licensed traditional midwife shall only accept and provide care to those women who are expected to have a normal pregnancy, labor, and delivery. As part of the initial screening to determine whether any contraindications are present, the licensed traditional midwife must take a detailed health history that includes the woman's social, medical, surgical, menstrual, gynecological, contraceptive, obstetrical, family, nutritional, and drug/chemical use histories. If a licensed traditional midwife determines at any time during the course of the pregnancy that a woman's condition may preclude attendance by a traditional midwife, the licensed traditional midwife must refer the client to a licensed health care provider. As part of the initial and ongoing screening, a licensed traditional midwife must provide or recommend that the client receive the following services, if indicated, from an appropriate health care provider:\n(1) initial laboratory pregnancy screening, including blood group and type, antibody screen, Indirect Coombs, rubella titer, CBC with differential and syphilis serology;\n(2) gonorrhea and chlamydia cultures;\n(3) screening for sickle cell;\n(4) screening for hepatitis B and human immunodeficiency virus (HIV);\n(5) maternal serum alpha-fetoprotein test and ultrasound;\n(6) Rh antibody and glucose screening at 28 weeks gestation;\n(7) mandated newborn screening;\n(8) Rh screening of the infant for maternal RhoGAM treatment; and\n(9) screening for premature labor.\n(b) A client must make arrangements to have the results of any of the tests described in paragraph (a) sent to the licensed traditional midwife providing services to the client. The licensed traditional midwife must include these results in the client's record.\nA licensed traditional midwife must prepare a written plan with each client to ensure continuity of care throughout pregnancy, labor, and delivery. The written plan must incorporate the conditions under which the medical consultation plan, including the transfer of care or transport of the client, may be implemented.\nA licensed traditional midwife must comply with all applicable state and municipal requirements regarding public health.\nA licensed traditional midwife must maintain a client record on each client, including:\n(1) a copy of the informed consent form described in section 147D.07;\n(2) evidence of an initial client screening described in this section;\n(3) a copy of the written plan described in subdivision 2;\n(4) a record of prenatal and postpartum care provided to the client at each visit; and\n(5) a detailed record of the labor and delivery process.\nAll records maintained on each client by a licensed traditional midwife are subject to sections 144.291 to 144.298.",
	"repealed": false
}