{
	"id": "88.33",
	"url": "https://www.revisor.mn.gov/statutes/cite/88.33",
	"title": "88.33 HEARINGS; NOTICE; SERVICE; DATE; ADJOURNMENTS.",
	"text": "Upon the filing of this report, the auditor shall, within ten days thereafter, fix a date for final hearing on the petition and the engineer's and appraisers' reports and call a special meeting of the county board for that date by giving notice, as required by law therefor, which hearing shall be not less than 30 days from the date of the notice. The notice shall specify the time and place for the hearing upon the petition and the reports of the engineer and the appraisers, and shall notify and require all parties in any manner interested to show cause before the county board, at the time and place specified in the notice, why an order should not be made confirming the reports of the engineer and the appraisers and ordering and directing that the improvement petitioned for be made, and fixing and determining the amount and extent of the improvement and the amount and value of the benefits or damages resulting to any land in consequence of the improvement. This notice shall contain the names of the owners of the land as shown in the petition, together with a description of the land by 40-acre tracts or governmental lots, the amount of the estimated benefits and damages to each tract or parcel, and state that the engineer's and the appraisers' reports have been filed in the office of the auditor subject to inspection by any parties interested. Copies of this notice shall be mailed by the auditor to all parties named in the petition, if their addresses are known to the auditor, at least 15 days prior to the date of the hearing. This notice shall also be served by publication for three successive weeks in any legal newspaper published in the county, which newspaper shall be designated by the auditor. In all cases in which for any cause the notice shall not be given or is legally defective, as given, the auditor shall fix another date for hearing in accordance with sections 88.28 to 88.46, so that the hearing upon the petition and the engineer's and the appraisers' reports may be held at the earliest possible date, at either a special or a regular meeting of the county board. When any final order of the county board in any case shall have been set aside, annulled, or declared void by any court by reason of failure to give proper notice of the hearing, the county board may, at any time within one year after the rendering of such judgment, upon application of the petitioners, order a special hearing before it upon the petition and the reports; and, thereupon the auditor shall cause a new and proper notice to be published and mailed, as hereinbefore specified, for rehearing upon the petition and these reports. At the rehearing the county board may proceed as in cases of original hearing. Any hearing may be adjourned from day to day until completed.",
	"repealed": false
}