{
	"id": "126C.15",
	"url": "https://www.revisor.mn.gov/statutes/cite/126C.15",
	"title": "126C.15 BASIC SKILLS REVENUE; COMPENSATORY EDUCATION REVENUE.",
	"text": "(a) The basic skills revenue under section 126C.10, subdivision 4, must be reserved and used to meet the educational needs of pupils who enroll under-prepared to learn and whose progress toward meeting state or local content or performance standards is below the level that is appropriate for learners of their age. Basic skills revenue may also be used for programs designed to prepare children and their families for entry into school whether the student first enrolls in kindergarten or first grade.\n(b) For fiscal years prior to fiscal year 2024, any of the following may be provided to meet these learners' needs:\n(1) direct instructional services under the assurance of mastery program according to section 124D.66;\n(2) remedial instruction in reading, language arts, mathematics, other content areas, or study skills to improve the achievement level of these learners;\n(3) additional teachers and teacher aides to provide more individualized instruction to these learners through individual tutoring, lower instructor-to-learner ratios, or team teaching;\n(4) a longer school day or week during the regular school year or through a summer program that may be offered directly by the site or under a performance-based contract with a community-based organization;\n(5) comprehensive and ongoing staff development consistent with district and site plans according to section 122A.60 and to implement plans under section 120B.12, subdivision 4a, for teachers, teacher aides, principals, and other personnel to improve their ability to identify the needs of these learners and provide appropriate remediation, intervention, accommodations, or modifications;\n(6) instructional materials, digital learning, and technology appropriate for meeting the individual needs of these learners;\n(7) programs to reduce truancy, encourage completion of high school, enhance self-concept, provide health services, provide nutrition services, provide a safe and secure learning environment, provide coordination for pupils receiving services from other governmental agencies, provide psychological services to determine the level of social, emotional, cognitive, and intellectual development, and provide counseling services, guidance services, and social work services;\n(8) bilingual programs, bicultural programs, and programs for English learners;\n(9) all-day kindergarten;\n(10) early education programs, parent-training programs, school readiness programs, kindergarten programs for four-year-olds, voluntary home visits under section 142D.10, subdivision 4, and other outreach efforts designed to prepare children for kindergarten;\n(11) extended school day and extended school year programs; and\n(12) substantial parent involvement in developing and implementing remedial education or intervention plans for a learner, including learning contracts between the school, the learner, and the parent that establish achievement goals and responsibilities of the learner and the learner's parent or guardian.\n(c) For fiscal year 2024 and later, a district's basic skills revenue must be used for:\n(1) remedial instruction and necessary materials in reading, language arts, mathematics, other content areas, or study skills to improve the achievement level of these learners;\n(2) additional teachers and teacher aides to provide more individualized instruction to these learners through individual tutoring, lower instructor-to-learner ratios, or team teaching;\n(3) a longer school day or week during the regular school year or through a summer program that may be offered directly by the site or under a performance-based contract with a community-based organization;\n(4) programs to reduce truancy; provide counseling services, guidance services, and social work services; and provide coordination for pupils receiving services from other governmental agencies;\n(5) bilingual programs, bicultural programs, and programs for English learners;\n(6) early education programs, parent-training programs, early childhood special education, school readiness programs, kindergarten programs for four-year-olds, voluntary home visits under section 142D.10, subdivision 4, and other outreach efforts designed to prepare children for kindergarten;\n(7) transition programs operated by school districts for special education students until the age of 22;\n(8) substantial parent involvement in developing and implementing remedial education or intervention plans for a learner, including learning contracts between the school, the learner, and the parent that establish achievement goals and responsibilities of the learner and the learner's parent or guardian; and\n(9) professional development for teachers on meeting the needs of English learners, using assessment tools and data to monitor student progress, and reducing the use of exclusionary discipline, and training for tutors and staff in extended day programs to enhance staff's knowledge in content areas.\n(a) A district or cooperative must allocate at least 80 percent of its compensatory revenue to each school building in the district or cooperative where the children who have generated the revenue are served unless the school district or cooperative has received permission under Laws 2005, First Special Session chapter 5, article 1, section 50, to allocate compensatory revenue according to student performance measures developed by the school board.\n(b) A district or cooperative may allocate no more than 20 percent of the amount of compensatory revenue that the district receives to school sites according to a plan adopted by the school board. The money reallocated under this paragraph must be spent for the purposes listed in subdivision 1, but may be spent on students in any grade, including students attending school readiness or other prekindergarten programs.\n(c) For the purposes of this section and section 126C.05, subdivision 3, \"building\" means education site as defined in section 123B.04, subdivision 1.\n(d) Notwithstanding section 123A.26, subdivision 1, compensatory revenue generated by students served at a cooperative unit shall be paid to the cooperative unit.\n(e) A district or cooperative with school building openings, school building closings, changes in attendance area boundaries, or other changes in programs or student demographics between the prior year and the current year may reallocate compensatory revenue among sites to reflect these changes. A district or cooperative must report to the department any adjustments it makes according to this paragraph and the department must use the adjusted compensatory revenue allocations in preparing the report required under section 123B.76, subdivision 3, paragraph (c).\nA school site decision-making team, as defined in section 123B.04, subdivision 2, paragraph (a), or the instruction and curriculum advisory committee under section 120B.11, if the school has no school site decision team, shall recommend how the compensatory education revenue will be used to carry out the purpose of this section. A school district that has received permission under Laws 2005, First Special Session chapter 5, article 1, section 50, to allocate compensatory revenue according to school performance measures shall share its plan for the distribution of compensatory revenue with the school site decision team.\nEach district and cooperative unit that receives basic skills revenue shall maintain separate accounts to identify expenditures for salaries and programs related to basic skills revenue.\n(a) By February 1 annually, the commissioner of education must report to the legislature the expenditures of each district that received basic skills revenue in the previous fiscal year under subdivision 1. The report must conform to uniform financial and reporting standards established for this purpose and provide a breakdown by functional area.\n(b) A district must also report whether programs funded with compensatory revenue are consistent with best practices demonstrated to improve student achievement.\n(c) The Department of Education and regional centers of excellence must identify and provide to schools best practices for implementing programs for each use of revenue specified in subdivision 1.",
	"repealed": false
}