{
	"id": "142G.12",
	"url": "https://www.revisor.mn.gov/statutes/cite/142G.12",
	"title": "142G.12 ELIGIBILITY; MINNESOTA RESIDENCE.",
	"text": "To be eligible for MFIP, an assistance unit must have established residency in this state which means the assistance unit is present in the state and intends to remain here. A person who lives in this state and who entered this state with a job commitment or to seek employment in this state, whether or not that person is currently employed, meets the criteria in this subdivision.\nAn assistance unit is considered to have established residency in this state only when a child or caregiver has resided in this state for at least 30 consecutive days with the intention of making the person's home here and not for any temporary purpose. The birth of a child in Minnesota to a member of the assistance unit does not automatically establish the residency in this state under this subdivision of the other members of the assistance unit. Time spent in a shelter for battered women shall count toward satisfying the 30-day residency requirement.\n(a) A county shall waive the 30-day residency requirement where unusual hardship would result from denial of assistance.\n(b) For purposes of this section, unusual hardship means an assistance unit:\n(1) is without alternative shelter; or\n(2) is without available resources for food.\n(c) For purposes of this subdivision, the following definitions apply (1) \"metropolitan statistical area\" is as defined by the U.S. Census Bureau; (2) \"alternative shelter\" includes any shelter that is located within the metropolitan statistical area containing the county and for which the family is eligible, provided the assistance unit does not have to travel more than 20 miles to reach the shelter and has access to transportation to the shelter. Clause (2) does not apply to counties in the Minneapolis-St. Paul metropolitan statistical area.\n(d) Applicants are considered to meet the residency requirement under subdivision 2 if they once resided in Minnesota and:\n(1) joined the United States armed services, returned to Minnesota within 30 days of leaving the armed services, and intend to remain in Minnesota; or\n(2) left to attend school in another state, paid nonresident tuition or Minnesota tuition rates under a reciprocity agreement, and returned to Minnesota within 30 days of graduation with the intent to remain in Minnesota.\n(e) The 30-day residence requirement is met when:\n(1) a minor child or a minor caregiver moves from another state to the residence of a relative caregiver; and\n(2) the relative caregiver has resided in Minnesota for at least 30 consecutive days and:\n(i) the minor caregiver applies for and receives MFIP; or\n(ii) the relative caregiver applies for assistance for the minor child but does not choose to be a member of the MFIP assistance unit.\nMigrant workers, as defined in section 142G.02, and their immediate families are exempt from the requirements of subdivisions 1 and 2, provided the migrant worker provides verification that the migrant family worked in this state within the last 12 months and earned at least $1,000 in gross wages during the time the migrant worker worked in this state.\nIf any subdivision in this section is enjoined from implementation or found unconstitutional by any court of competent jurisdiction, the remaining subdivisions shall remain valid and shall be given full effect.",
	"repealed": false
}