{
	"id": "18H.15",
	"url": "https://www.revisor.mn.gov/statutes/cite/18H.15",
	"title": "18H.15 VIOLATIONS.",
	"text": "(a) An entity who offers to distribute nursery stock that is uncertified, uninspected, or falsely labeled or advertised possesses an illegal regulated commodity that is considered infested or infected with plant pests and subject to regulatory action and control. If the commissioner determines that the provisions of this section have been violated, the commissioner may order the destruction of all of the plants unless the entity:\n(1) provides proper phytosanitary preclearance, phytosanitary certification, or nursery stock certification;\n(2) agrees to have the plants, plant materials, or nursery stock returned to the consignor; and\n(3) provides proper documentation, certification, or compliance to support advertising claims.\n(b) The plant owner is liable for all costs associated with a withdrawal-from-distribution order or the quarantine, treatment, or destruction of plants. The commissioner is not liable for actual or incidental costs incurred by an entity due to the commissioner's actions. The commissioner must be reimbursed by the owner of the plants for the actual expenses incurred in carrying out a withdrawal-from-distribution order or the quarantine, treatment, or destruction of any plants.\n(c) It is unlawful for an entity to:\n(1) misrepresent, falsify, or knowingly distribute, sell, advertise, or display damaged, mislabeled, misrepresented, infested, or infected nursery stock;\n(2) fail to obtain a nursery certificate as required by the commissioner;\n(3) fail to renew a nursery certificate, but continue business operations;\n(4) misrepresent or falsify a nursery certificate;\n(5) refuse to submit to a nursery inspection;\n(6) fail to provide the cooperation necessary to conduct a successful nursery inspection;\n(7) offer for sale uncertified nursery stock;\n(8) possess an illegal regulated commodity;\n(9) violate or disobey a commissioner's order;\n(10) violate a quarantine issued by the commissioner;\n(11) fail to obtain phytosanitary certification for plant material or nursery stock brought into Minnesota;\n(12) deface, mutilate, or destroy a nursery stock certificate, phytosanitary certificate, or phytosanitary preclearance certificate, or other commissioner mark, permit, or certificate;\n(13) fail to notify the commissioner of an uncertified shipment of nursery stock;\n(14) transport uncertified nursery stock in Minnesota; or\n(15) sell nursery stock to an uncertified live plant dealer who is required to be certified.",
	"repealed": false
}