{
	"id": "473.3994",
	"url": "https://www.revisor.mn.gov/statutes/cite/473.3994",
	"title": "473.3994 LIGHT RAIL TRANSIT; DESIGN PLANS.",
	"text": "MS 1988 [Repealed, 1989 c 339 s 24]\nFor each proposed light rail transit facility in the metropolitan area, the governor must designate either the Metropolitan Council or the state of Minnesota acting through the commissioner of transportation as the entity responsible for planning, designing, acquiring, constructing, and equipping the facility. Notwithstanding such designation, the commissioner and the council may enter into one or more cooperative agreements with respect to the planning, designing, acquiring, constructing, or equipping of a particular light rail transit facility that provide for the parties to exercise their respective authorities in support of the project in a manner that best serves the project and the public.\nBefore final design plans are prepared for a light rail transit facility in the metropolitan area, the responsible authority and the regional railroad authority or authorities in whose jurisdiction the line or lines are located must hold a public hearing on the physical design component of the preliminary design plans. The responsible authority and the regional railroad authority or authorities in whose jurisdiction the line or lines are located must provide appropriate public notice of the hearing and publicity to ensure that affected parties have an opportunity to present their views at the hearing. The responsible authority shall summarize the proceedings and testimony and maintain the record of a hearing held under this section, including any written statements submitted.\nAt least 30 days before the hearing under subdivision 2, the responsible authority shall submit the physical design component of the preliminary design plans to the governing body of each statutory and home rule charter city, county, and town in which the route is proposed to be located. The city, county, or town shall hold a public hearing. Within 45 days after the hearing under subdivision 2, the city, county, or town shall review and approve or disapprove the plans for the route to be located in the city, county, or town. A local unit of government that disapproves the plans shall describe specific amendments to the plans that, if adopted, would cause the local unit to withdraw its disapproval. Failure to approve or disapprove the plans in writing within 45 days after the hearing is deemed to be approval, unless an extension of time is agreed to by the city, county, or town and the responsible authority.\nIf the governing body of one or more cities, counties, or towns disapproves the preliminary design plans within the period allowed under subdivision 3, the council shall hold a hearing on the plans, giving the commissioner of transportation, if the responsible authority, any disapproving local governmental units, and other persons an opportunity to present their views on the plans. The council may conduct independent study as it deems desirable and may mediate and attempt to resolve disagreements about the plans. Within 60 days after the hearing, the council shall review the plans and shall decide what amendments to the plans, if any, must be made to accommodate the objections presented by the disapproving local governmental units. Amendments to the plans as decided by the council must be made before continuing the planning and designing process.\n(a) If the final design plans incorporate a substantial change from the preliminary design plans with respect to location, length, or termini of routes; general dimension, elevation, or alignment of routes and crossings; location of tracks above ground, below ground, or at ground level; or station locations, before beginning construction, the responsible authority shall submit the changed component of the final design plans to the governing body of each statutory and home rule city, county, and town in which the changed component is proposed to be located. Within 60 days after the submission of the plans, the city, county, or town shall review and approve or disapprove the changed component located in the city, county, or town. A local unit of government that disapproves the change shall describe specific amendments to the plans that, if adopted, would cause the local unit to withdraw its disapproval. Failure to approve or disapprove the changed plans in writing within the time period is deemed to be approval, unless an extension is agreed to by the city, county, or town and the responsible authority.\n(b) If the governing body of one or more cities, counties, or towns disapproves the changed plans within the period allowed under paragraph (a), the council shall review the final design plans under the same procedure and with the same effect as provided in subdivision 4 for preliminary design plans.\nMS 1992 [Repealed, 1993 c 353 s 20]\nIf the commissioner is the responsible authority, before proceeding with construction of a light rail transit facility, the commissioner must submit preliminary and final design plans to the Metropolitan Council. The council must review the plans for consistency with the council's development guide and approve the plans.\nThis section does not diminish or replace the authority of the council under section 473.173.\n(a) Before submitting an application for federal assistance for light rail transit facilities in the metropolitan area, the Metropolitan Council must prepare an estimate of the amount of operating subsidy which will be required to operate light rail transit in the corridor to which the federal assistance would be applied. The estimate must indicate the amount of operating subsidy estimated to be required in each of the first ten years of operation of the light rail transit facility. If the commissioner of transportation is the responsible authority, the commissioner must provide information requested by the council that is necessary to make the estimate.\n(b) The council must review and evaluate the estimate developed under paragraph (a) with regard to the effect of operating the light rail transit facility on the currently available mechanisms for financing transit in the metropolitan area.\n(a) The responsible authority must establish a Corridor Management Committee to advise the responsible authority in the design and construction of light rail transit in each corridor to be constructed. The Corridor Management Committee for each corridor shall consist of the following members:\n(1) one member appointed by each city and county in which the corridor is located;\n(2) the commissioner of transportation or a designee of the commissioner;\n(3) two members appointed by the Metropolitan Council, one of whom shall be designated as the chair of the committee;\n(4) one member appointed by the Metropolitan Airports Commission, if the designated corridor provides direct service to the Minneapolis-St. Paul International Airport; and\n(5) one member appointed by the president of the University of Minnesota, if the designated corridor provides direct service to the university.\n(b) The Corridor Management Committee shall advise the responsible authority on issues relating to environmental review, preliminary design, preliminary engineering, final design, implementation method, and construction of light rail transit in the corridor.\nMS 1996 [Repealed, 1998 c 404 s 84]\nMS 1998 [Repealed, 1999 c 230 s 46]\nMS 2006 [Repealed, 2008 c 287 art 1 s 126]\nIf the commissioner of transportation is the responsible authority for a particular light rail transit facility, the commissioner must transfer to the Metropolitan Council all facilities constructed and all equipment and property acquired in developing the facility upon completion of construction.",
	"repealed": false
}