{
	"id": "469.095",
	"url": "https://www.revisor.mn.gov/statutes/cite/469.095",
	"title": "469.095 COMMISSIONERS; APPOINTMENT, TERMS, VACANCIES, PAY, REMOVAL.",
	"text": "Except as provided in subdivision 2, paragraph (d), an economic development authority shall consist of either three, five, or seven commissioners who shall be appointed after the enabling resolution provided for in section 469.093 becomes effective. The resolution must indicate the number of commissioners constituting the authority.\n(a) Three-member authority: the commissioners constituting a three-member authority, one of whom must be a member of the city council, shall be appointed by the mayor with the approval of the city council. Those initially appointed shall be appointed for terms of two, four, and six years, respectively. Thereafter all commissioners shall be appointed for six-year terms.\n(b) Five-member authority: the commissioners constituting a five-member authority, two of whom must be members of the city council, shall be appointed by the mayor with the approval of the city council. Those initially appointed shall be appointed for terms of two, three, four, five, and six years respectively. Thereafter all commissioners shall be appointed for six-year terms.\n(c) Seven-member authority: the commissioners constituting a seven-member authority, two of whom must be members of the city council, shall be appointed by the mayor with the approval of the city council. Those initially appointed shall be appointed for terms of one, two, three, four, and five years respectively and two members for six years. Thereafter all commissioners shall be appointed for six-year terms.\n(d) The enabling resolution may provide that the members of the city council shall serve as the commissioners.\n(e) The enabling resolution may provide for the appointment of members of the city council in excess of the number required in paragraphs (a), (b), and (c).\n(f) A vacancy is created in the membership of an authority when a city council member of the authority ends council membership. A vacancy for this or another reason must be filled for the balance of the unexpired term, in the manner in which the original appointment was made. The city council may set the term of the commissioners who are members of the city council to coincide with their term of office as members of the city council.\nAn authority may be increased from three to five or seven members, or from five to seven members by a resolution adopted by the city council following the procedure provided for modifying the enabling resolution in section 469.093.\nA commissioner, including the president, shall be paid for attending each regular or special meeting of the authority in an amount to be determined by the city council. In addition to receiving pay for meetings, the commissioners may be reimbursed for actual expenses incurred in doing official business of the authority. All money paid for compensation or reimbursement must be paid out of the authority's budget.\nA commissioner may be removed by the city council for inefficiency, neglect of duty, or misconduct in office. A commissioner shall be removed only after a hearing. A copy of the charges must be given to the commissioner at least ten days before the hearing. The commissioner must be given an opportunity to be heard in person or by counsel at the hearing. When written charges have been submitted against a commissioner, the city council may temporarily suspend the commissioner. If the city council finds that those charges have not been substantiated, the commissioner shall be immediately reinstated. If a commissioner is removed, a record of the proceedings, together with the charges and findings, shall be filed in the office of the city clerk.",
	"repealed": false
}