{
	"id": "354.46",
	"url": "https://www.revisor.mn.gov/statutes/cite/354.46",
	"title": "354.46 PAYMENTS AFTER DEATH.",
	"text": "(a) If a basic member who has at least 18 months of allowable service credit and who has an average salary as defined in section 354.44, subdivision 6, equal to or greater than $75 dies prior to retirement or if a former basic member who, at the time of death, was totally and permanently disabled and receiving disability benefits pursuant to section 354.48 dies before attaining age 65 or reaching the five-year anniversary of the effective date of the disability benefit, whichever is later, the surviving spouse and dependent children of the basic member or former basic member are entitled to receive a monthly benefit as follows:\n(b) Payments for the benefit of any dependent child under the age of 22 years must be made to the surviving parent, or if there be none, to the legal guardian of the child. The maximum monthly benefit must not exceed $1,000 for any one family, and the minimum benefit per family must not be less than 50 percent of the basic member's average salary, subject to the foregoing maximum. The surviving dependent children's benefit must be reduced pro tanto when any surviving child is no longer dependent.\n(c) If the basic member and the surviving spouse are killed in a common disaster and if the total of all survivors benefits payable pursuant to this subdivision is less than the accumulated deductions plus interest payable, the surviving dependent children shall receive the difference in a lump-sum payment.\n(d) If the survivor benefits provided in this subdivision exceed in total the monthly average salary of the deceased basic member, these benefits must be reduced to an amount equal to the deceased basic member's monthly average salary.\n(e) Prior to payment of any survivor benefit pursuant to this subdivision, in lieu of that benefit, the surviving spouse may elect to receive the joint and survivor annuity provided pursuant to subdivision 2, or may elect to receive a refund of accumulated deductions with interest in a lump sum as provided pursuant to section 354.47, subdivision 1. If there are any surviving dependent children, the surviving spouse may elect to receive the refund of accumulated deductions only with the consent of the district court of the district in which the surviving dependent child or children reside.\n(a) If the active or deferred member was at least age 55 and had credit for at least three years of allowable service on the date of death, the surviving spouse is entitled to the second portion of a 100 percent joint and survivor annuity specified under section 354.45, based on the age of the active or deferred member at the time of death and the age of the surviving spouse at the time the benefit accrues.\n(b) If the active or deferred member was under age 55 and had credit for at least 30 years of allowable service on the date of death, the surviving spouse may elect to receive the second portion of a 100 percent joint and survivor annuity based on the age of the active or deferred member on the date of death and the age of the surviving spouse at the time the benefit accrues. If section 354.44, subdivision 6, applies, the annuity is payable using the full early retirement reduction under section 354.44, subdivision 6, paragraph (c), clause (2), to age 55 and one-half of the early retirement reduction from age 55 to the age payment begins.\n(c) If the active or deferred member was under age 55 and had credit for at least three years of allowable service on the date of death, but did not yet qualify for retirement, the surviving spouse may elect to receive the second portion of a 100 percent joint and survivor annuity based on the age of the active or deferred member at the time of death and the age of the surviving spouse at the time the benefit accrues. If section 354.44, subdivision 6, applies, the annuity is calculated using the full early retirement reduction under section 354.44, subdivision 6, to age 55 and one-half of the early retirement reduction from age 55 to the age the annuity begins.\n(d) The surviving spouse eligible for surviving spouse benefits under this subdivision may apply for the annuity any time after the member's death. The benefit may not begin to accrue more than six months before the date the application is filed with the executive director and may not accrue before the member's death. The benefit is payable for life. Any benefit under this subdivision is in lieu of benefits under subdivision 1, if applicable, and in lieu of a refund of accumulated member contributions under section 354.47, subdivision 1.\n(e) For purposes of this subdivision, a designated beneficiary must be a former spouse or a biological or adopted child of the member.\n(a) In lieu of the 100 percent optional annuity under subdivision 2, or a refund under section 354.47, subdivision 1, the surviving spouse of a deceased member may elect to receive survivor coverage in a term certain of five, ten, 15, or 20 years, but monthly payments must not exceed 75 percent of the average high-five monthly salary of the deceased member. The monthly term certain annuity must be actuarially equivalent to the 100 percent optional annuity under subdivision 2.\n(b) If a surviving spouse elects a term certain payment and dies before the expiration of the specified term certain period, the commuted value of the remaining annuity payments must be paid in a lump sum to the surviving spouse's estate.\nIf there is no surviving spouse eligible for benefits under subdivision 2, each dependent child as defined in section 354.05, subdivision 8a, is eligible for monthly surviving child benefits. Surviving child benefits to a dependent child must be paid from the date of the member's death to the date the dependent child attains age 20 if the child is under age 15 on the date of the member's death. If the child is 15 years or older on the date of the member's death, the surviving child benefit is payable for five years. The dependent surviving child benefit is an amount that is actuarially equivalent to the value of a 100 percent optional annuity under subdivision 2 calculated using the age of the member and age of the dependent child as of the date of death in lieu of the age of the member and the spouse. If there is more than one dependent child, each dependent child is entitled to receive a proportionate share of the actuarial value of the member's account.\nIf a former member dies after retirement, the former member or a designated beneficiary shall be entitled to the annuity payment due for the full month during which death occurs if no optional or reversionary annuity was designated by the member. If an optional or reversionary annuity has been designated by the member, a death benefit shall be paid in accordance with the provisions of such annuity as described in section 354.45.\n[Repealed, 1974 c 289 s 59]\nA member who is single or, if the member is married, a member and the spouse of the member jointly, may make a specification in writing on a form prescribed by the executive director that the benefits provided in subdivision 2, or in section 354.47, subdivision 1, must be paid only to a designated beneficiary or to designated beneficiaries. For purposes of subdivision 2, a designated beneficiary may only be either a former spouse or a biological or an adopted child of the member.\n(a) A beneficiary designation and an application for benefits under this section must be in writing on a form prescribed by the executive director.\n(b) Sections 354.55, subdivision 11, and 356.311 apply to a deferred annuity payable under this section.\n(c) Unless otherwise specified, the annuity must be computed under section 354.44, subdivision 2 or 6, whichever is applicable.\n(d) Each designated beneficiary eligible for a lifetime benefit under this subdivision may apply for an annuity any time after the member's death. The benefit may not begin to accrue more than six months before the date the application is filed with the executive director and may not accrue before the member's death.\nA survivor benefit under subdivision 1, 2, 2a, or 2b, is eligible for postretirement adjustments under section 356.415.",
	"repealed": false
}