{
	"id": "165.07",
	"url": "https://www.revisor.mn.gov/statutes/cite/165.07",
	"title": "165.07 INTERSTATE BRIDGE.",
	"text": "The purpose of this section is to connect the highway system of this state with the highway system of adjoining states by means of interstate bridges.\nWhen any trunk highway, county state-aid highway, or municipal state-aid street leads to or connects with an interstate bridge, other than an interstate bridge owned privately or operated as a toll bridge, the bridge or so much thereof as lies within the boundaries of this state shall be part of the highway or street leading to it.\nAny road authority, including the road authority of any city having jurisdiction over a highway or street connecting with an interstate bridge owned by an adjoining state or political subdivision thereof, may acquire the bridge or any portion thereof from the adjoining state or political subdivision thereof upon such terms and conditions as the road authority deems just and equitable.\nAny road authority, including the road authority of any city, having jurisdiction over any highway or street connecting with an interstate bridge that is owned privately or operated as a toll bridge, may acquire the bridge in cooperation with the authorized authorities of the adjoining state connected by the bridge, when the road authority determines that the acquisition is required in the interests of public travel. The bridge may be acquired by purchase, gift, or eminent domain proceedings as provided by law.\nRoad authorities, including road authorities of cities having jurisdiction over any highway or street connecting with an interstate bridge shall cooperate with the authorized authorities of the adjoining state connected by the bridge in the maintenance, improvement, or reconstruction of the bridge. If any highway or street runs to boundary waters of this state and an adjoining state where no interstate bridge exists, the road authorities, in cooperation with the authorized authorities of the adjoining state, may construct and thereafter maintain an interstate bridge connecting the highway or street with the highway system of the adjoining state when the road authority determines that the bridge is necessary in the interests of public travel. The location of the bridge shall be determined by the road authority in cooperation with the authorities of the adjoining state.\nCounties, towns and cities bordering on boundary waters of this state may jointly acquire, construct, reconstruct, improve, or maintain an interstate bridge in cooperation with the authorized authorities of the adjoining state; provided that county state-aid highway funds or municipal state-aid street funds shall not be expended on interstate bridges other than those connecting with a county state-aid highway or municipal state-aid street.\nThe road authorities, including the road authorities of cities, may enter into equitable agreements with the authorized authorities of adjoining states in all matters pertaining to interstate bridges.\nWhen any route of the trunk highway system runs into or through any city owning an interstate bridge connecting such city with the highway system of an adjoining state, the commissioner shall specifically locate the route so that it shall run to the state boundary over the bridge.",
	"repealed": false
}