{
	"id": "136A.827",
	"url": "https://www.revisor.mn.gov/statutes/cite/136A.827",
	"title": "136A.827 REFUNDS.",
	"text": "For the purposes of this section, \"student\" means the party to the contract, whether the party is the student, the student's parent or guardian, or other person on behalf of the student.\nEvery private career school shall notify each student, in writing, of acceptance or rejection. In the event that the student is rejected by the private career school, all tuition, fees and other charges shall be refunded.\nLicensed private career schools conducting programs not exceeding 40 hours in length shall not be required to make a full refund once a program has commenced and shall be allowed to prorate any refund based on the actual length of the program as stated in the private career school catalog or advertisements and the number of hours attended by the student.\n(a) Notwithstanding anything to the contrary, a private career school that uses a written contract or enrollment agreement shall refund all tuition, fees and other charges paid by a student, if the student gives notice of cancellation within five business days after the day on which the contract was executed regardless of whether the program has started.\n(b) When a student has been accepted by the private career school and has entered into a contractual agreement with the private career school and gives notice of cancellation following the fifth business day after the date of execution of contract, but before the start of the program in the case of resident private career schools, or before the first lesson has been serviced by the private career school in the case of distance education private career schools, all tuition, fees and other charges, except 15 percent of the total cost of the program but not to exceed $50, shall be refunded to the student.\n(a) A private career school shall refund all tuition, fees and other charges paid by a student if the student gives notice of cancellation within five business days after the day on which the student is accepted by the private career school regardless of whether the program has started.\n(b) When a student has been accepted by the private career school and gives notice of cancellation following the fifth business day after the day of acceptance by the private career school, but before the start of the program, in the case of resident private career schools, or before the first lesson has been serviced by the private career school, in the case of distance education private career schools, all tuition, fees and other charges, except 15 percent of the total cost of the program but not to exceed $50, shall be refunded to the student.\n(a) When a student has been accepted by a private career school and gives notice of cancellation after the program of instruction has begun, the student is entitled to a refund if, at the last documented date of attendance, the student has not completed at least 75 percent of the entire program of instruction. For purposes of this subdivision, program of instruction is calculated under paragraph (c) or (d). Program of instruction does not mean one term, a payment period, a module, or any other portion of the entire instructional program.\n(b) A notice of cancellation from a student under this subdivision must be confirmed in writing by the private career school and mailed to the student's last known address. The confirmation from the school must state that the school has withdrawn the student from enrollment, and if this action was not the student's intent, the student must contact the school.\n(c) The length of a program of instruction for a program that has a defined calendar start and end date that does not change after the program has begun equals the number of days from the first scheduled date of the program through the last scheduled date of the program. To calculate the completion percentage, divide the number of calendar days from the first date of the program through the student's last documented date of attendance by the length of the program of instruction, and truncate the result after the second digit following the decimal point. If the completion percentage is less than 75 percent, the private career school may retain:\n(1) tuition, fees, and charges equal to the total of tuition, fees, and charges multiplied by the completion percentage; plus\n(2) the initial program application fees, not to exceed $50; plus\n(3) the lesser of (i) 25 percent of the total tuition, or (ii) $100.\n(d) The length of a program of instruction for a program that is measured in clock hours equals the number of clock hours the student was scheduled to attend. To calculate the completion percentage, divide the number of clock hours that the student actually attended by the length of the program of instruction, and truncate the result after the second digit following the decimal point. If the completion percentage is less than 75 percent, the private career school may retain:\n(1) tuition, fees, and charges equal to the total of tuition, fees, and charges multiplied by the completion percentage; plus\n(2) the initial program application fees, not to exceed $50; plus\n(3) the lesser of (i) 25 percent of the total tuition, or (ii) $100.\nThe fair market retail price, if separately stated in the catalog and contract or enrollment agreement, of equipment or supplies furnished to the student, which the student fails to return in condition suitable for resale, and which may reasonably be resold, within ten business days following cancellation may be retained by the private career school and may be deducted from the total cost for tuition, fees and all other charges when computing refunds.\nAn overstatement of the fair market retail price of any equipment or supplies furnished the student shall be considered inconsistent with this provision.\nEach private career school shall acknowledge in writing any valid notice of cancellation within ten business days after the receipt of such notice and within 30 business days shall refund to the student any amounts due and arrange for termination of the student's obligation to pay any sum in excess of that due under the cancellation and refund policy.\nA private career school cannot make its refund policy conditional upon compliance with the school's regulations or rules of conduct.\nNotice of cancellation shall be the date a student notifies a private career school of the student's intention to withdraw or otherwise leave the program of study. The student is not required to provide a written notice. The private career school may require a student to provide the student's notification only to specific offices or personnel at the school as long as this requirement is documented as part of the \"Student's Right to Cancel\" in all places that the information appears, including on the private career school's website. The date of the notice of cancellation may or may not be the same date as the student's last documented date of attendance. If a student has not attended class for a period of 14 consecutive days without contacting the private career school to provide notice of cancellation or otherwise make arrangements concerning the absence, the student is considered to have withdrawn from the private career school for all purposes as of the student's last documented date of attendance.\nThe date of execution of the contract or enrollment agreement shall be presumed to be the date of delivery of the notice of acceptance; and if delivered by mail, the postmark date of the letter of acceptance.\nA private career school shall not negotiate any promissory instrument received as payment of tuition or other charge prior to completion of 50 percent of the program, except that prior to that time, instruments may be transferred by assignment to purchasers who shall be subject to all defenses available against the private career school named as payee.\nIf a student's enrollment in a private career school is canceled for any reason, the private career school shall notify any agency known to the private career school to be providing financial aid to the student of the cancellation within 30 days.\nIn the event a private career school closes for any reason during a term and interrupts and terminates classes during that term, all tuition for the term shall be refunded to the students or the appropriate state or federal agency or private lender that provided any funding for the term and any outstanding obligation of the student for the term is canceled.",
	"repealed": false
}