{
	"id": "89.018",
	"url": "https://www.revisor.mn.gov/statutes/cite/89.018",
	"title": "89.018 HERITAGE FORESTS.",
	"text": "(a) The commissioner may establish, by written order published in the State Register, heritage forest areas within counties named under this subdivision if:\n(1) the commissioner determines that establishment is consistent with the purposes of the heritage forest; and\n(2) the county board has submitted a resolution to the commissioner delineating and requesting establishment of the heritage forest areas of the county.\n(b) The named counties for the Big Woods Heritage Forest are:\n(1) Blue Earth;\n(2) Carver;\n(3) Dakota;\n(4) Hennepin;\n(5) Le Sueur;\n(6) McLeod;\n(7) Meeker;\n(8) Nicollet;\n(9) Rice;\n(10) Sibley;\n(11) Scott;\n(12) Waseca; and\n(13) Wright.\n(c) The commissioner may terminate the heritage forest status of an area within a county if the commissioner determines that the termination would be in the public interest and the county board has submitted a resolution to the commissioner requesting termination.\n(a) Within areas established as a heritage forest under subdivision 1, the commissioner may:\n(1) designate, by written order published in the State Register, any commissioner-administered state-owned lands as heritage forest lands for management purposes, including lands that have previously been designated for another purpose;\n(2) accept donations of land, including easements under subdivision 3, for heritage forest management;\n(3) manage lands designated by local governments for heritage forest management; and\n(4) contract with other agencies or organizations for management services, including any required monitoring activities.\n(b) Lands designated under paragraph (a), clause (1), that were previously designated by law or by the commissioner continue to be subject to requirements and uses authorized under the previous designation.\n(a) The commissioner or a political subdivision may individually or jointly acquire heritage forest land for conservation purposes in areas established under subdivision 1 by entering into easements with landowners. The easements must be conservation easements as defined in section 84C.01, clause (1), except the easements may be made possessory as well as nonpossessory if agreed upon by the landowner and the commissioner or political subdivision.\n(b) In an easement agreement between the commissioner or political subdivision and a landowner, the landowner must agree:\n(1) to place forest lands in the program for the period of the easement;\n(2) to implement a heritage forest stewardship plan as provided in the easement agreement;\n(3) not to alter the heritage forest by developing the land, cutting timber that is not identified in the forest stewardship plan, or otherwise destroying the heritage forest character of the easement area;\n(4) to allow the commissioner or political subdivision or agents of the commissioner or political subdivision access to the land for monitoring activities;\n(5) not to adopt a practice specified by the commissioner or political subdivision in the easement as a practice that would tend to defeat the purposes of the heritage forest; and\n(6) to additional provisions included in the easement that the commissioner or political subdivision determines are consistent with the purposes of the heritage forest program.\n(c) A limited-term easement may be converted to a permanent easement or renewed at the end of the easement period by mutual agreement of the commissioner or political subdivision and the landowner.\n(d) If during the easement period the landowner sells or otherwise disposes of the ownership or right of occupancy of the land, the new landowner must continue the easement under the same terms or conditions.\n(e) If during the limited-term easement period the landowner sells or otherwise disposes of the ownership or right of occupancy of the land, the new landowner may continue the easement under the same terms or conditions.\n(f) The commissioner or political subdivision may terminate an easement by mutual agreement with the landowner if the commissioner or political subdivision determines that the termination would be in the public interest. The commissioner or political subdivision may agree to modification of an agreement if the commissioner or political subdivision determines the modification is desirable to implement the heritage forest program.\nPrivate landowners may establish their lands as heritage forest land by having a heritage forest stewardship plan prepared and by completing a stewardship registration agreement. A stewardship registration agreement is a nonbinding commitment by a landowner to provide stewardship to forested lands. In a stewardship registration agreement, a landowner acknowledges an intent to implement a heritage forest stewardship plan. If the landowner sells or otherwise disposes of the ownership or right of occupancy of the land, the commissioner shall terminate the stewardship registration agreement. A new owner must enter into a new stewardship registration agreement to continue recognition of the forest land as heritage forest. The commissioner may terminate a stewardship registration agreement by mutual agreement of the landowner if the commissioner determines the termination would be in the public interest.\nThe establishment of a heritage forest shall not, by itself, impose any additional restrictions upon the commissioner of transportation or a local road authority, to construct, improve, or maintain a highway, as defined in section 160.02, subdivision 26.\nNothing in this chapter shall be used to authorize the acceptance of grants or agreements that would preempt state regulation and control of state lands.\nDesignations under subdivisions 1 and 2 are not subject to the rulemaking provisions of chapter 14 and section 14.386 does not apply.",
	"repealed": false
}