{
	"id": "176.611",
	"url": "https://www.revisor.mn.gov/statutes/cite/176.611",
	"title": "176.611 MAINTENANCE OF STATE COMPENSATION REVOLVING FUND.",
	"text": "The state compensation revolving fund shall be maintained as provided in the following subdivisions.\nEvery department of the state shall reimburse the fund for money paid for its claims and the costs of administering the revolving fund at such times and in such amounts as the commissioner of administration shall certify has been paid out of the fund on its behalf. The heads of the departments shall anticipate these payments by including them in their budgets. In addition, the commissioner of administration, with the approval of the commissioner of management and budget, may require an agency to make advance payments to the fund sufficient to cover the agency's estimated obligation for a period of at least 60 days. Reimbursements and other money received by the commissioner of administration under this subdivision must be credited to the state compensation revolving fund.\nTo reduce long-term costs, minimize impairment to agency operations and budgets, and distribute risk of claims, the commissioner of administration shall maintain a separate account within the state compensation revolving fund. The account shall be used to pay for lump-sum or annuitized settlements, structured claim settlements, and legal, medical, indemnity, or other claim costs that might pose a significant burden for agencies. The commissioner of administration, with the approval of the commissioner of management and budget, may establish criteria and procedures for payment from the account on an agency's behalf. The commissioner of administration may assess agencies on a reimbursement or premium basis from time to time to ensure adequate account reserves. The account consists of appropriations from the general fund, receipts from billings to agencies, and credited investment gains or losses attributable to balances in the account. The State Board of Investment shall invest the assets of the account according to section 11A.24.\n[Repealed, 1986 c 461 s 37]\nTo maintain an ongoing balance sufficient to pay sums currently due for benefits and administrative costs, the commissioner of management and budget, upon request of the commissioner of administration, may transfer money from the general fund to the state compensation revolving fund. Before requesting the transfer, the commissioner of administration must decide there is not enough money in the fund for an immediate, necessary expenditure. The amount necessary to make the transfer is appropriated from the general fund to the commissioner of management and budget. The commissioner of administration shall make schedules to repay the transferred money to the general fund. The repayment may not extend beyond five years.\n[Repealed, 1986 c 461 s 37]\n[Repealed, 1974 c 355 s 14]\n[Repealed, 1974 c 355 s 14]\nThe revolving fund consists of $3,437,690 appropriated from the general fund and other funds, along with credited investment gains or losses attributable to balances in the account. The State Board of Investment shall invest the fund's assets according to section 11A.24.",
	"repealed": false
}