{
	"id": "115A.916",
	"url": "https://www.revisor.mn.gov/statutes/cite/115A.916",
	"title": "115A.916 MOTOR VEHICLE FLUIDS AND FILTERS; PROHIBITIONS.",
	"text": "(a) A person may not knowingly place motor oil, brake fluid, power steering fluid, transmission fluid, motor oil filters, or motor vehicle antifreeze:\n(1) in solid waste or in a solid waste management facility other than a recycling facility or a household hazardous waste collection facility;\n(2) in or on the land, unless approved by the agency; or\n(3) in or on the waters of the state, in a subsurface sewage treatment system as defined in section 115.55, or in a stormwater or wastewater collection or treatment system except as described in paragraph (c).\n(b) For the purposes of this section, \"antifreeze\" does not include small amounts of antifreeze contained in water used to flush the cooling system of a vehicle after the antifreeze has been drained and does not include deicer that has been used on the exterior of a vehicle.\n(c) A person may place waste motor vehicle antifreeze in a wastewater collection or treatment system permitted by the agency, unless prohibited by the operator of the system, if the person:\n(1) generates an annual average of less than 50 gallons per month of waste motor vehicle antifreeze; and\n(2) keeps records of the amount of waste antifreeze generated. Records must be maintained on site and made available for inspection for a minimum of three years following generation of the waste antifreeze.\n(d) Notwithstanding paragraph (a), motor oil filters and portions of motor oil filters may be processed at a permitted mixed municipal solid waste resource recovery facility that directly burns the waste if:\n(1) the facility is subject to an industrial waste management plan that addresses management of motor oil filters and the owner or operator of the facility can demonstrate to the satisfaction of the commissioner that the facility is in compliance with that plan;\n(2) the facility recovers ferrous metal after incineration for recycling as part of its operation; and\n(3) the motor oil filters are collected separately from mixed municipal solid waste and are not combined with it except for the purpose of incinerating the waste.\n(e) The commissioner of the Pollution Control Agency, in conjunction with industry organizations representing automotive repair businesses and antifreeze recycling businesses and environmental organizations shall work together to develop and promote opportunities to recycle waste motor vehicle antifreeze and to review the impact of alternative antifreeze disposal or recycling methods on businesses and the environment.",
	"repealed": false
}