{
	"id": "473.5111",
	"url": "https://www.revisor.mn.gov/statutes/cite/473.5111",
	"title": "473.5111 TRANSFER, DISPOSAL OF NONMETROPOLITAN INTERCEPTOR.",
	"text": "In this section, the definitions in this subdivision apply, except as otherwise expressly provided or indicated by the context.\n(a) The term \"in good operating condition\" with reference to an interceptor means that the facility is currently operational and that the pipes or sewer mains portion only of the facility is expected to have structural integrity, as appropriate for the proposed use of the pipe, for a period of ten or more years after the date of a determination or certification of good operating condition under this section.\n(b) The term \"interceptor\" has the meaning given it in section 473.121, subdivision 23, and includes a designated portion of an interceptor.\n(c) The term \"local government unit,\" with respect to an interceptor that is a storm sewer, means a local governmental unit as defined in section 473.121, subdivision 6. The term local government unit, with respect to an interceptor that is not a storm sewer, means a local government unit as defined in section 473.501, subdivision 3.\n(d) The term \"storm sewer\" means a facility that currently carries exclusively water runoff, surface water, or other drainage, rather than sewage.\n(e) The term \"use as a local facility\" includes use as either a sanitary sewer or a storm sewer.\nThe council may determine that an interceptor is no longer needed to implement the council's comprehensive plan for the collection, treatment, and disposal of sewage in the metropolitan area. If the council makes the determination, it may use the procedures in this section to sell, transfer, abandon, or otherwise dispose of the interceptor.\n(a) If the council uses the procedures in this section, it must, with regard to each interceptor for which the determination is made in subdivision 2, determine whether or not the interceptor continues to be of benefit for use as a local facility for one or more local government units. If the council determines that the interceptor does not continue to be of benefit as a local facility, it must notify each local government unit in which the interceptor is located, of this determination.\n(b) Such a government unit may notify the council in writing within 90 days from receipt of notice that it believes the interceptor provides a local benefit to the government unit and that it desires to take possession of the interceptor. The council may extend the time for a government unit to provide this notice. If a government unit delivers a written notice to the council in accordance with this paragraph, the council must transfer the interceptor at no cost to the government unit by preparing and transmitting a bill of sale for the facility and quitclaim deeds for any property rights associated with the facility that are no longer needed for the council's purposes. Upon receipt of the bill of sale, the government unit is the owner of the interceptor and thereafter responsible for its operation and maintenance.\n(c) If the council does not receive notice from a government unit under paragraph (b), the council may sell, transfer, abandon, or otherwise dispose of the interceptor in such manner as it may deem fit.\nIf the council determines that an interceptor continues to be of benefit for use as a local facility for one or more local government units, it must designate those units that are so benefited and the portions of the interceptor that should properly be transferred to the benefited units. It must also determine whether the interceptor is in good operating condition and, if not, the necessary repairs, and their cost, needed to put the interceptor in good operating condition. The council must provide written notice to each designated unit of the council's determinations in this subdivision.\n(a) The council's preliminary determinations under subdivision 4 may be contested by a local government unit which has been designated by the council under that subdivision. The unit has 90 days from receiving notice of the council's determinations under subdivision 4 within which to make a written request to the council for a hearing on the council's determinations. The unit in its request for hearing must specify the determinations with which it disagrees and its position with regard to those determinations. If within 90 days no designated unit has requested a hearing in writing, the council's preliminary determinations become its final decision with respect to the determinations under subdivision 4 and the final decision is binding on all designated units. If a designated unit requests a hearing, the request for hearing must be granted and the hearing must be conducted by the Office of Administrative Hearings in the manner provided by chapter 14 for contested cases. The subject of the hearing must extend only to those council determinations under subdivision 4 for which a hearing has been requested. The council and all local government units designated by the council under subdivision 4 are parties to the contested case proceeding.\n(b) Charges of the Office of Administrative Hearings must be divided equally among the council and those parties who requested a hearing under paragraph (a). Otherwise, each party is responsible for its own costs and expenses in the proceeding.\n(c) After receipt of the report of the Office of Administrative Hearings, the council must make a final decision with respect to the determinations in subdivision 4. Any party to the contested case proceeding who is aggrieved by the final decision of the council may make a judicial appeal in the manner provided in chapter 14 for contested cases.\n(a) If the council's final decision after a proceeding under subdivision 5 is that the interceptor does not continue to be of benefit for use as a local facility, it may sell, transfer, abandon, or otherwise dispose of the interceptor in such manner as it may deem fit.\n(b) If the council's final decision is that the interceptor continues to be of benefit for use as a local facility, but is not in good operating condition, it may either:\n(1) continue to operate the interceptor until sold, transferred, abandoned, or otherwise disposed of in such manner as it may deem fit; or\n(2) repair the interceptor as necessary to put the interceptor in good operating condition, certify that it is in good operating condition, and proceed under subdivision 7.\n(c) If the council's final decision is that the interceptor continues to be of benefit for use as a local facility and is in good operating condition, it must proceed under subdivision 7.\n(a) This subdivision applies if an interceptor designated in subdivision 2 continues to be of benefit as a local facility and is determined or, after repair is certified, by the council to be in good operating condition.\n(b) The council and each local government unit that has been determined to have a benefit in accordance with the procedures in this section must negotiate and enter into an agreement governing transfer of an interceptor that has been determined to have benefit for use as a local facility.\n(c) The agreement may provide for the council to share in the cost of emergency repairs to the transferred interceptor for an agreed warranty period not exceeding ten years beyond the later of:\n(1) the date of the preliminary council determination of good operating condition in subdivision 4; or\n(2) the date of the certification in subdivision 6, paragraph (b), clause (2).\n(d) The agreement may also contain arrangements between one or more local government units concerning shared use, ownership, operation, or maintenance of the transferred interceptor.\n(e) If the interceptor is not a storm sewer and is not transferred in its entirety to local government units, the council must charge a local benefit charge for the portions of the interceptor not transferred.\n(f) The charge must begin on the later of:\n(1) two years from the date of the determination in subdivision 2; or\n(2) the day after the completion of any contested case proceeding under subdivision 5, including any judicial appeals.\n(g) The local benefit charge must be:\n(1) based on the costs of overhead, operation, maintenance, rehabilitation, and debt service of that portion of the interceptor not transferred;\n(2) charged to all local government units which have not taken ownership of their allocated portion of the interceptor; and\n(3) allocated in accordance with the final decision of the council under subdivision 5.\n(h) The local benefit charge is considered a charge payable by the local government unit to the council under section 473.521 and must continue to be paid by the local government unit until the interceptor is transferred to it.\n(i) If the facility is a storm sewer and is not transferred in its entirety to the benefited local government unit or units by the later of:\n(1) two years from the date of the determination in subdivision 2; or\n(2) the day after the completion of any contested case proceeding under subdivision 5, including any judicial appeals,\nthen the facility is transferred effective on the later of the dates in clauses (1) and (2), by operation of law, to the unit or units determined to have a benefit in accordance with the procedures under this section.\n(j) The transfer is not dependent on an agreement between the council and the local government unit or units and is at no cost to the receiving unit.\n(k) The local government unit is thereafter the owner of the interceptor and responsible for its operation and maintenance.\n(l) The council must prepare and transmit to the appropriate government unit or units bills of sale for the facility, and quitclaim deeds for any property rights associated with the facility which are no longer needed for the council's purposes.\nUntil such time as an interceptor is sold, transferred, abandoned, or otherwise disposed of under this section, the council has all powers under this chapter to operate, maintain, and repair the interceptor. After transfer of an interceptor, the council has all powers under this chapter to provide emergency repairs under any agreed warranty period incorporated into a transfer agreement under subdivision 7.",
	"repealed": false
}