{
	"id": "256B.0949",
	"url": "https://www.revisor.mn.gov/statutes/cite/256B.0949",
	"title": "256B.0949 EARLY INTENSIVE DEVELOPMENTAL AND BEHAVIORAL INTERVENTION BENEFIT.",
	"text": "This section authorizes the early intensive developmental and behavioral intervention (EIDBI) benefit to provide early intensive intervention to a person with an autism spectrum disorder or a related condition. This benefit must provide coverage for a comprehensive, multidisciplinary evaluation, ongoing progress monitoring, and medically necessary early intensive treatment of autism spectrum disorder or a related condition. Nothing in this section shall preclude coverage for other medical assistance benefits based on a person's diagnosis of an autism spectrum disorder or a related condition, including, but not limited to, coverage under section 256B.0943 of children's therapeutic services and supports.\n(a) The terms used in this section have the meanings given in this subdivision.\n(b) \"Advanced certification\" means a person who has completed advanced certification in an approved modality under subdivision 13, paragraph (b).\n(c) \"Agency\" means the legal entity that is enrolled with Minnesota health care programs as a medical assistance provider according to Minnesota Rules, part 9505.0195, to provide EIDBI services and that has the legal responsibility to ensure that its employees or contractors carry out the responsibilities defined in this section. Agency includes a licensed individual professional who practices independently and acts as an agency.\n(d) \"Autism spectrum disorder or a related condition\" or \"ASD or a related condition\" means either autism spectrum disorder (ASD) as defined in the current version of the Diagnostic and Statistical Manual of Mental Disorders (DSM) or a condition that is found to be closely related to ASD, as identified under the current version of the DSM, and meets all of the following criteria:\n(1) is severe and chronic;\n(2) results in impairment of adaptive behavior and function similar to that of a person with ASD;\n(3) requires treatment or services similar to those required for a person with ASD; and\n(4) results in substantial functional limitations in three core developmental deficits of ASD: social or interpersonal interaction; functional communication, including nonverbal or social communication; and restrictive or repetitive behaviors or hyperreactivity or hyporeactivity to sensory input; and may include deficits or a high level of support in one or more of the following domains:\n(i) behavioral challenges and self-regulation;\n(ii) cognition;\n(iii) learning and play;\n(iv) self-care; or\n(v) safety.\n(e) \"Person\" means a person under 21 years of age.\n(f) \"Clinical supervision\" means the overall responsibility for the control and direction of EIDBI service delivery, including individual treatment planning, staff supervision, individual treatment plan progress monitoring, and treatment review for each person. Clinical supervision is provided by a qualified supervising professional (QSP) who takes full professional responsibility for the service provided by each supervisee.\n(g) \"Commissioner\" means the commissioner of human services, unless otherwise specified.\n(h) \"Comprehensive multidisciplinary evaluation\" or \"CMDE\" means a comprehensive evaluation of a person to determine medical necessity for EIDBI services based on the requirements in subdivision 5.\n(i) \"Department\" means the Department of Human Services, unless otherwise specified.\n(j) \"Early intensive developmental and behavioral intervention benefit\" or \"EIDBI benefit\" means a variety of individualized, intensive treatment modalities approved and published by the commissioner that are based in behavioral and developmental science consistent with best practices on effectiveness.\n(k) \"Generalizable goals\" means results or gains that are observed during a variety of activities over time with different people, such as providers, family members, other adults, and people, and in different environments including, but not limited to, clinics, homes, schools, and the community.\n(l) \"Incident\" means when any of the following occur:\n(1) an illness, accident, or injury that requires first aid treatment;\n(2) a bump or blow to the head; or\n(3) an unusual or unexpected event that jeopardizes the safety of a person or staff, including a person leaving the agency unattended.\n(m) \"Individual treatment plan\" or \"ITP\" means the person-centered, individualized written plan of care that integrates and coordinates person and family information from the CMDE for a person who meets medical necessity for the EIDBI benefit. An individual treatment plan must meet the standards in subdivision 6.\n(n) \"Legal representative\" means the parent of a child who is under 18 years of age, a court-appointed guardian, or other representative with legal authority to make decisions about service for a person. For the purpose of this subdivision, \"other representative with legal authority to make decisions\" includes a health care agent or an attorney-in-fact authorized through a health care directive or power of attorney.\n(o) \"Mental health professional\" means a staff person who is qualified according to section 245I.04, subdivision 2.\n(p) \"Person-centered\" means a service that both responds to the identified needs, interests, values, preferences, and desired outcomes of the person or the person's legal representative and respects the person's history, dignity, and cultural background and allows inclusion and participation in the person's community.\n(q) \"Qualified EIDBI provider\" means a person who is a QSP or a level I, level II, or level III treatment provider.\nAn EIDBI service is available to a person enrolled in medical assistance who:\n(1) has a diagnosis of ASD or a related condition that meets the criteria of subdivision 4; and\n(2) meets the criteria for medical necessity for the EIDBI benefit.\nThe person's and family's primary spoken language and culture, values, goals, and preferences must be reflected throughout the covered services. The CMDE provider and QSP must determine how to adapt the evaluation, treatment recommendations, and individual treatment plan to the person's and family's culture, values, and language preferences. A provider must have a limited English proficiency (LEP) plan in compliance with title VI of the Civil Rights Act of 1964, United States Code, title 42, section 2000d to 2000d-7.\n(a) A diagnosis of ASD or a related condition must:\n(1) be based upon current DSM criteria including direct observations of the person and information from the person's legal representative or primary caregivers;\n(2) be completed by either (i) a licensed physician, advanced practice registered nurse, or physician assistant, or (ii) a mental health professional; and\n(3) meet the requirements of a standard diagnostic assessment according to section 245I.10, subdivision 6.\n(b) Additional assessment information may be considered to complete a diagnostic assessment including specialized tests administered through special education evaluations and licensed school personnel, and from professionals licensed in the fields of medicine, speech and language, psychology, occupational therapy, and physical therapy. A diagnostic assessment may include treatment recommendations.\n(a) A CMDE must be completed to determine medical necessity of EIDBI services. For the commissioner to authorize EIDBI services, the CMDE provider must submit the CMDE to the commissioner and the person or the person's legal representative as determined by the commissioner. Information and assessments must be performed, reviewed, and relied upon for the eligibility determination, treatment and services recommendations, and treatment plan development for the person.\n(b) The CMDE provider must review the diagnostic assessment to confirm the person has an eligible diagnosis and the diagnostic assessment meets standards required under subdivision 4. If the CMDE provider elects to complete the diagnostic assessment at the same time as the CMDE, the CMDE provider must certify that the CMDE meets all standards as required under subdivision 4.\n(c) The CMDE must:\n(1) include an assessment of the person's developmental skills, functional behavior, needs, and capacities based on direct observation of the person which must be administered by a CMDE provider, include medical or assessment information from the person's physician, advanced practice registered nurse, or physician assistant, and may also include input from family members, school personnel, child care providers, or other caregivers, as well as any medical or assessment information from other licensed professionals such as rehabilitation or habilitation therapists, licensed school personnel, or mental health professionals;\n(2) include and document the person's legal representative's or primary caregiver's preferences for involvement in the person's treatment; and\n(3) provide information about the range of current EIDBI treatment modalities recognized by the commissioner.\nA CMDE provider must:\n(1) be a licensed physician, an advanced practice registered nurse, a physician assistant, a mental health professional, or a clinical trainee who is qualified according to section 245I.04, subdivision 6;\n(2) have at least 2,000 hours of clinical experience in the evaluation and treatment of people with ASD or a related condition or equivalent documented coursework at the graduate level by an accredited university in the following content areas: ASD or a related condition diagnosis, ASD or a related condition treatment strategies, and child development; and\n(3) be able to diagnose, evaluate, or provide treatment within the provider's scope of practice and professional license.\n(a) The QSP, level I treatment provider, or level II treatment provider who integrates and coordinates person and family information from the CMDE and ITP progress monitoring process to develop the ITP must develop and monitor the ITP.\n(b) Each person's ITP must be:\n(1) culturally and linguistically appropriate, as required under subdivision 3a, individualized, and person-centered; and\n(2) based on the diagnosis and CMDE information specified in subdivisions 4 and 5.\n(c) The ITP must specify:\n(1) the medically necessary treatment and service;\n(2) the treatment modality that shall be used to meet the goals and objectives, including:\n(i) baseline measures and projected dates of accomplishment;\n(ii) the frequency, intensity, location, and duration of each service provided;\n(iii) the level of legal representative or primary caregiver training and counseling;\n(iv) any change or modification to the physical and social environments necessary to provide a service;\n(v) significant changes in the person's condition or family circumstance;\n(vi) techniques that support and are consistent with the person's communication mode and learning style;\n(vii) the name of the QSP; and\n(viii) progress monitoring results and goal mastery data; and\n(3) the discharge criteria that must be used and a defined transition plan that meets the requirement of paragraph (g).\n(d) Implementation of the ITP must be supervised by a QSP.\n(e) The ITP must be submitted to the commissioner and the person or the person's legal representative for approval in a manner determined by the commissioner for this purpose.\n(f) A service included in the ITP must meet all applicable requirements for medical necessity and coverage.\n(g) To terminate service, the provider must send notice of termination to the person or the person's legal representative. The transition period begins when the person or the person's legal representative receives notice of termination from the EIDBI service and ends when the EIDBI service is terminated. Up to 30 days of continued service is allowed during the transition period. Services during the transition period shall be consistent with the ITP. The transition plan must include:\n(1) protocols for changing service when medically necessary;\n(2) how the transition will occur;\n(3) the time allowed to make the transition; and\n(4) a description of how the person or the person's legal representative will be informed of and involved in the transition.\n(a) An ITP progress monitoring must be submitted after each six months of treatment, or more frequently as determined by the CMDE provider or QSP, to determine if progress is being made toward targeted functional and generalizable goals specified in the ITP. Based on the results of ITP progress monitoring, the ITP must be adjusted as needed and must document that the EIDBI service continues to be medically necessary for the person or the person is referred to other services.\n(b) The ITP progress monitoring must include:\n(1) input from the person's legal representative or the person's primary caregiver;\n(2) an observation of the person that is performed by the QSP, level I treatment provider, or level II treatment provider and may include input from licensed special education staff or other licensed health care provider;\n(3) documentation of the person's current level of performance on primary treatment goal domains including when a goal or objective is achieved, changed, or discontinued;\n(4) any significant change in the person's condition or family circumstances;\n(5) any treatment plan modification and the rationale for any change made, including treatment modality, intensity, frequency, and duration; and\n(6) recommendations for continued treatment.\n(c) The ITP progress monitoring must be submitted to the commissioner and the person or the person's legal representative in a manner determined by the commissioner for the reauthorization of EIDBI services.\n(d) A person who continues to make reasonable progress toward treatment goals as specified in the ITP is eligible to continue receiving EIDBI services.\n(e) A person's treatment shall continue during the ITP progress monitoring using the process determined under this subdivision. Treatment may continue during an appeal pursuant to section 256.045.\nBefore making revisions to the EIDBI benefit or proposing statutory changes to this section, the commissioner must consult with stakeholders and consider recommendations from the Department of Human Services Early Intensive Developmental and Behavioral Intervention Advisory Council, the early intensive developmental and behavioral intervention learning collaborative, and the Departments of Health, Education, Employment and Economic Development, and Human Services. Revisions and proposed statutory changes subject to this subdivision include, but are not limited to, the following components:\n(1) a definition of the qualifications, standards, and roles of the treatment team, including recommendations after stakeholder consultation on whether board-certified behavior analysts and other professionals certified in other treatment approaches recognized by the department or trained in ASD or a related condition and child development should be added as professionals qualified to provide EIDBI clinical supervision or other functions under medical assistance;\n(2) refinement of uniform parameters for CMDE and ongoing ITP progress monitoring standards;\n(3) the design of an effective and consistent process for assessing the person's and the person's legal representative's and the person's caregiver's preferences and options to participate in the person's early intervention treatment and efficacy of methods to involve and educate the person's legal representative and caregiver in the treatment of the person;\n(4) formulation of a collaborative process in which professionals have opportunities to collectively inform provider standards and qualifications; standards for CMDE; medical necessity determination; efficacy of treatment apparatus, including modality, intensity, frequency, and duration; and ITP progress monitoring processes to support quality improvement of EIDBI services;\n(5) coordination of this benefit and its interaction with other services provided by the Departments of Human Services, Health, Employment and Economic Development, and Education;\n(6) evaluation, on an ongoing basis, of EIDBI services outcomes and efficacy of treatment modalities provided to people under this benefit; and\n(7) as provided under subdivision 17, determination of the availability of qualified EIDBI providers with necessary expertise and training in ASD or a related condition throughout the state to assess whether there are sufficient professionals to provide timely access and prevent delay in the CMDE and treatment of a person with ASD or a related condition.\n(a) The commissioner may revise covered treatment modalities as needed based on outcome data and other evidence. EIDBI treatment modalities approved by the department must:\n(1) cause no harm to the person or the person's family;\n(2) be individualized and person-centered;\n(3) be developmentally appropriate and highly structured, with well-defined goals and objectives that provide a strategic direction for treatment;\n(4) be based in recognized principles of developmental and behavioral science;\n(5) utilize sound practices that are replicable across providers and maintain the fidelity of the specific modality;\n(6) demonstrate an evidentiary basis;\n(7) have goals and objectives that are measurable, achievable, and regularly evaluated and adjusted to ensure that adequate progress is being made;\n(8) be provided intensively with a high staff-to-person ratio; and\n(9) include participation by the person and the person's legal representative in decision making, knowledge building and capacity building, and developing and implementing the person's ITP.\n(b) Before revisions in department recognized treatment modalities become effective, the commissioner must provide public notice of the changes, the reasons for the change, and a 30-day public comment period to those who request notice through an electronic list accessible to the public on the department's website.\n(a) The commissioners of human services and education must develop the capacity to coordinate services and information including diagnostic, functional, developmental, medical, and educational assessments; service delivery; and progress evaluations across health and education sectors.\n(b) An EIDBI service provided under this section is not intended to replace a service provided in school or other settings. A person's ITP must document that EIDBI services coordinate with, but do not include or replace, special education and related services defined in the person's individualized education plan (IEP), or individualized family service plan (IFSP), when the service is available under the Individuals with Disabilities Education Improvement Act of 2004, United States Code, title 20, chapter 33, through a local education agency. This provision does not preclude EIDBI treatment during school hours. A program for birth to three years of age and additional resources must also coordinate with EIDBI services. A resource for a person over 18 years of age must also be coordinated with EIDBI services under this section.\n(c) The commissioner shall integrate medical authorization procedures for an EIDBI service with authorization procedures for other health and mental health services and home and community-based services to ensure that the person receives services that are the most appropriate and effective in meeting the person's needs.\n(a) This section shall apply to state plan services under title XIX of the Social Security Act when federal approval is granted under a 1915(i) waiver or other authority which allows children eligible for medical assistance through the TEFRA option under section 256B.055, subdivision 12, to qualify and includes children eligible for medical assistance in families over 150 percent of the federal poverty guidelines.\n(b) The commissioner may use the federal authority for a Medicaid state plan amendment under Early and Periodic Screening Diagnosis and Treatment (EPSDT), United States Code, title 42, section 1396D(R)(5), or other Medicaid provision for any aspect or type of treatment covered in this section if new federal guidance is helpful in achieving one or more of the purposes of this section in a cost-effective manner. Notwithstanding subdivisions 2 and 3, any treatment services submitted for federal approval under EPSDT shall include appropriate medical criteria to qualify for the service and shall cover children through 20 years of age.\nAfter approval of the EIDBI benefit under this section by the Centers for Medicare and Medicaid Services, the commissioner shall provide statewide training on the benefit for culturally and linguistically diverse communities. Training for EIDBI providers on culturally appropriate practices must be online, accessible, and available in multiple languages. The training for families, lead agencies, advocates, and other interested parties must provide information about the EIDBI benefit and how to access it.\n(a) The services described in paragraphs (b) to (l) are eligible for reimbursement by medical assistance under this section. Services must be provided by a qualified EIDBI provider and supervised by a QSP. An EIDBI service must address the person's medically necessary treatment goals and must be targeted to develop, enhance, or maintain the individual developmental skills of a person with ASD or a related condition to improve functional communication, including nonverbal or social communication, social or interpersonal interaction, restrictive or repetitive behaviors, hyperreactivity or hyporeactivity to sensory input, behavioral challenges and self-regulation, cognition, learning and play, self-care, and safety.\n(b) EIDBI treatment must be delivered consistent with the standards of an approved modality, as published by the commissioner. EIDBI modalities include:\n(1) applied behavior analysis (ABA);\n(2) developmental individual-difference relationship-based model (DIR/Floortime);\n(3) early start Denver model (ESDM);\n(4) PLAY project;\n(5) relationship development intervention (RDI); or\n(6) additional modalities not listed in clauses (1) to (5) upon approval by the commissioner.\n(c) An EIDBI provider may use one or more of the EIDBI modalities in paragraph (b), clauses (1) to (5), as the primary modality for treatment as a covered service, or several EIDBI modalities in combination as the primary modality of treatment, as approved by the commissioner. An EIDBI provider that identifies and provides assurance of qualifications for a single specific treatment modality, including an EIDBI provider with advanced certification overseeing implementation, must document the required qualifications to meet fidelity to the specific model in a manner determined by the commissioner.\n(d) Each qualified EIDBI provider must identify and provide assurance of qualifications for professional licensure certification, or training in evidence-based treatment methods, and must document the required qualifications outlined in subdivision 15 in a manner determined by the commissioner.\n(e) CMDE is a comprehensive evaluation of the person's developmental status to determine medical necessity for EIDBI services and meets the requirements of subdivision 5. The services must be provided by a qualified CMDE provider.\n(f) EIDBI intervention observation and direction is the clinical direction and oversight of EIDBI services by the QSP, level I treatment provider, or level II treatment provider, including developmental and behavioral techniques, progress measurement, data collection, function of behaviors, and generalization of acquired skills for the direct benefit of a person. EIDBI intervention observation and direction informs any modification of the current treatment protocol to support the outcomes outlined in the ITP.\n(g) Intervention is medically necessary direct treatment provided to a person with ASD or a related condition as outlined in their ITP. All intervention services must be provided under the direction of a QSP. Intervention may take place across multiple settings. The frequency and intensity of intervention services are provided based on the number of treatment goals, person and family or caregiver preferences, and other factors. Intervention services may be provided individually or in a group. Intervention with a higher provider ratio may occur when deemed medically necessary through the person's ITP.\n(1) Individual intervention is treatment by protocol administered by a single qualified EIDBI provider delivered to one person.\n(2) Group intervention is treatment by protocol provided by one or more qualified EIDBI providers, delivered to at least two people who receive EIDBI services.\n(3) Higher provider ratio intervention is treatment with protocol modification provided by two or more qualified EIDBI providers delivered to one person in an environment that meets the person's needs and under the direction of the QSP or level I provider.\n(h) ITP development and ITP progress monitoring is development of the initial, annual, and progress monitoring of an ITP. ITP development and ITP progress monitoring documents provide oversight and ongoing evaluation of a person's treatment and progress on targeted goals and objectives and integrate and coordinate the person's and the person's legal representative's information from the CMDE and ITP progress monitoring. This service must be reviewed and completed by the QSP, and may include input from a level I provider or a level II provider.\n(i) Family caregiver training and counseling is specialized training and education for a family or primary caregiver to understand the person's developmental status and help with the person's needs and development. This service must be provided by the QSP, level I provider, or level II provider.\n(j) A coordinated care conference is a voluntary meeting with the person and the person's family to review the CMDE or ITP progress monitoring and to integrate and coordinate services across providers and service-delivery systems to develop the ITP. This service may include the CMDE provider, QSP, a level I provider, or a level II provider.\n(k) Travel time is allowable billing for traveling to and from the person's home, school, a community setting, or place of service outside of an EIDBI center, clinic, or office from a specified location to provide in-person EIDBI intervention, observation and direction, or family caregiver training and counseling. The person's ITP must specify the reasons the provider must travel to the person.\n(l) Medical assistance covers medically necessary EIDBI services and consultations delivered via telehealth, as defined under section 256B.0625, subdivision 3b, in the same manner as if the service or consultation was delivered in person.\nA person or the person's legal representative has the right to:\n(1) protection as defined under the health care bill of rights under section 144.651;\n(2) designate an advocate to be present in all aspects of the person's and person's family's services at the request of the person or the person's legal representative;\n(3) be informed of the agency policy on assigning staff to a person;\n(4) be informed of the opportunity to observe the person while receiving services;\n(5) be informed of services in a manner that respects and takes into consideration the person's and the person's legal representative's culture, values, and preferences in accordance with subdivision 3a;\n(6) be free from seclusion and restraint, except for emergency use of manual restraint in emergencies as defined in section 245D.02, subdivision 8a;\n(7) be under the supervision of a responsible adult at all times;\n(8) be notified by the agency within 24 hours if an incident occurs or the person is injured while receiving services, including what occurred and how agency staff responded to the incident;\n(9) request a voluntary coordinated care conference;\n(10) request a CMDE provider of the person's or the person's legal representative's choice; and\n(11) be free of all prohibitions as defined in Minnesota Rules, part 9544.0060.\n(a) A QSP must be employed by an agency and be:\n(1) a licensed mental health professional who has at least 2,000 hours of supervised clinical experience or training in examining or treating people with ASD or a related condition or equivalent documented coursework at the graduate level by an accredited university in ASD diagnostics, ASD developmental and behavioral treatment strategies, and typical child development; or\n(2) a developmental or behavioral pediatrician who has at least 2,000 hours of supervised clinical experience or training in examining or treating people with ASD or a related condition or equivalent documented coursework at the graduate level by an accredited university in the areas of ASD diagnostics, ASD developmental and behavioral treatment strategies, and typical child development.\n(b) A level I treatment provider must be employed by an agency and:\n(1) have at least 2,000 hours of supervised clinical experience or training in examining or treating people with ASD or a related condition or equivalent documented coursework at the graduate level by an accredited university in ASD diagnostics, ASD developmental and behavioral treatment strategies, and typical child development or an equivalent combination of documented coursework or hours of experience; and\n(2) have or be at least one of the following:\n(i) a master's degree in behavioral health or child development or related fields including, but not limited to, mental health, special education, social work, psychology, speech pathology, or occupational therapy from an accredited college or university;\n(ii) a bachelor's degree in a behavioral health, child development, or related field including, but not limited to, mental health, special education, social work, psychology, speech pathology, or occupational therapy, from an accredited college or university, and advanced certification in a treatment modality recognized by the department;\n(iii) a board-certified behavior analyst as defined by the Behavior Analyst Certification Board or a qualified behavior analyst as defined by the Qualified Applied Behavior Analysis Credentialing Board; or\n(iv) a board-certified assistant behavior analyst with 4,000 hours of supervised clinical experience that meets all registration, supervision, and continuing education requirements of the certification.\n(c) A level II treatment provider must be employed by an agency and must be:\n(1) a person who has a bachelor's degree from an accredited college or university in a behavioral or child development science or related field including, but not limited to, mental health, special education, social work, psychology, speech pathology, or occupational therapy; and meets at least one of the following:\n(i) has at least 1,000 hours of supervised clinical experience or training in examining or treating people with ASD or a related condition or equivalent documented coursework at the graduate level by an accredited university in ASD diagnostics, ASD developmental and behavioral treatment strategies, and typical child development or a combination of coursework or hours of experience;\n(ii) has certification as a board-certified assistant behavior analyst from the Behavior Analyst Certification Board or a qualified autism service practitioner from the Qualified Applied Behavior Analysis Credentialing Board;\n(iii) is a registered behavior technician as defined by the Behavior Analyst Certification Board or an applied behavior analysis technician as defined by the Qualified Applied Behavior Analysis Credentialing Board; or\n(iv) is certified in one of the other treatment modalities recognized by the department; or\n(2) a person who has:\n(i) an associate's degree in a behavioral or child development science or related field including, but not limited to, mental health, special education, social work, psychology, speech pathology, or occupational therapy from an accredited college or university; and\n(ii) at least 2,000 hours of supervised clinical experience in delivering treatment to people with ASD or a related condition. Hours worked as a mental health behavioral aide or level III treatment provider may be included in the required hours of experience; or\n(3) a person who has at least 4,000 hours of supervised clinical experience in delivering treatment to people with ASD or a related condition. Hours worked as a mental health behavioral aide or level III treatment provider may be included in the required hours of experience; or\n(4) a person who is a graduate student in a behavioral science, child development science, or related field and is receiving clinical supervision by a QSP affiliated with an agency to meet the clinical training requirements for experience and training with people with ASD or a related condition; or\n(5) a person who is at least 18 years of age and who:\n(i) is fluent in a non-English language or is an individual certified by a Tribal Nation;\n(ii) completed the level III EIDBI training requirements; and\n(iii) receives observation and direction from a QSP or level I treatment provider at least once a week until the person meets 1,000 hours of supervised clinical experience.\n(d) A level III treatment provider must be employed by an agency, have completed the level III training requirement, be at least 18 years of age, and have at least one of the following:\n(1) a high school diploma or commissioner of education-selected high school equivalency certification;\n(2) fluency in a non-English language or Tribal Nation certification;\n(3) one year of experience as a primary personal care assistant, community health worker, waiver service provider, or special education assistant to a person with ASD or a related condition within the previous five years; or\n(4) completion of all required EIDBI training within six months of employment.\n[See Note.]\n(a) An agency delivering an EIDBI service under this section must:\n(1) enroll as a medical assistance Minnesota health care program provider according to Minnesota Rules, part 9505.0195, and section 256B.04, subdivision 21, and meet all applicable provider standards and requirements;\n(2) demonstrate compliance with federal and state laws for EIDBI service;\n(3) verify and maintain records of a service provided to the person or the person's legal representative as required under Minnesota Rules, parts 9505.2175 and 9505.2197;\n(4) demonstrate that while enrolled or seeking enrollment as a Minnesota health care program provider the agency did not have a lead agency contract or provider agreement discontinued because of a conviction of fraud; or did not have an owner, board member, or manager fail a state or federal criminal background check or appear on the list of excluded individuals or entities maintained by the federal Department of Human Services Office of Inspector General;\n(5) have established business practices including written policies and procedures, internal controls, and a system that demonstrates the organization's ability to deliver quality EIDBI services;\n(6) have an office located in Minnesota or a border state;\n(7) conduct a criminal background check on an individual who has direct contact with the person or the person's legal representative;\n(8) report maltreatment according to section 626.557 and chapter 260E;\n(9) comply with any data requests consistent with the Minnesota Government Data Practices Act, sections 256B.064 and 256B.27;\n(10) provide training for all agency staff on the requirements and responsibilities listed in the Maltreatment of Minors Act, chapter 260E, and the Vulnerable Adult Protection Act, section 626.557, including mandated and voluntary reporting, nonretaliation, and the agency's policy for all staff on how to report suspected abuse and neglect;\n(11) have a written policy to resolve issues collaboratively with the person and the person's legal representative when possible. The policy must include a timeline for when the person and the person's legal representative will be notified about issues that arise in the provision of services;\n(12) provide the person's legal representative with prompt notification if the person is injured while being served by the agency. An incident report must be completed by the agency staff member in charge of the person. A copy of all incident and injury reports must remain on file at the agency for at least five years from the report of the incident; and\n(13) before starting a service, provide the person or the person's legal representative a description of the treatment modality that the person shall receive, including the staffing certification levels and training of the staff who shall provide a treatment.\n(b) When delivering the ITP, and annually thereafter, an agency must provide the person or the person's legal representative with:\n(1) a written copy and a verbal explanation of the person's or person's legal representative's rights and the agency's responsibilities;\n(2) documentation in the person's file the date that the person or the person's legal representative received a copy and explanation of the person's or person's legal representative's rights and the agency's responsibilities; and\n(3) reasonable accommodations to provide the information in another format or language as needed to facilitate understanding of the person's or person's legal representative's rights and the agency's responsibilities.\nAn early intensive developmental and behavioral intervention services agency must fulfill any background studies requirements under this section by initiating a background study through the commissioner's NETStudy system as provided under sections 245C.03, subdivision 15, and 245C.10, subdivision 17.\n(a) In consultation with the Early Intensive Developmental and Behavioral Intervention Advisory Council and stakeholders, including agencies, professionals, parents of people with ASD or a related condition, and advocacy organizations, the commissioner shall determine if a shortage of EIDBI providers exists. For the purposes of this subdivision, \"shortage of EIDBI providers\" means a lack of availability of providers who meet the EIDBI provider qualification requirements under subdivision 15 that results in the delay of access to timely services under this section, or that significantly impairs the ability of a provider agency to have sufficient providers to meet the requirements of this section. The commissioner shall consider geographic factors when determining the prevalence of a shortage. The commissioner may determine that a shortage exists only in a specific region of the state, multiple regions of the state, or statewide. The commissioner shall also consider the availability of various types of treatment modalities covered under this section.\n(b) The commissioner, in consultation with the Early Intensive Developmental and Behavioral Intervention Advisory Council and stakeholders, must establish processes and criteria for granting an exception under this paragraph. The commissioner may grant an exception only if the exception would not compromise a person's safety and not diminish the effectiveness of the treatment. The commissioner may establish an expiration date for an exception granted under this paragraph. The commissioner may grant an exception for the following:\n(1) EIDBI provider qualifications under this section;\n(2) medical assistance provider enrollment requirements under section 256B.04, subdivision 21; or\n(3) EIDBI provider or agency standards or requirements.\n(c) If the commissioner, in consultation with the Early Intensive Developmental and Behavioral Intervention Advisory Council and stakeholders, determines that a shortage no longer exists, the commissioner must submit a notice that a shortage no longer exists to the chairs and ranking minority members of the senate and the house of representatives committees with jurisdiction over health and human services. The commissioner must post the notice for public comment for 30 days. The commissioner shall consider public comments before submitting to the legislature a request to end the shortage declaration. The commissioner shall not declare the shortage of EIDBI providers ended without direction from the legislature to declare it ended.",
	"repealed": false
}