{
	"id": "342.62",
	"url": "https://www.revisor.mn.gov/statutes/cite/342.62",
	"title": "342.62 PACKAGING.",
	"text": "All cannabis flower, cannabis products, lower-potency hemp edibles, and hemp-derived consumer products sold to customers or patients must be packaged as required by this section and rules adopted under this chapter.\nFor the purposes of this section and section 342.64, \"appeal to individuals under 21 years of age\" means any of the following:\n(1) the use of images depicting toys or robots;\n(2) the use of any images depicting fruits or vegetables, except when used to accurately describe ingredients or flavors contained in a product;\n(3) the use of any images bearing a likeness to characters or phrases that are popularly used to advertise to children; or\n(4) the use of brand names or close imitations of brand names of candies, cereals, sweets, chips, or other food products typically marketed to children.\n(a) Except as provided in paragraph (b), all cannabis flower, cannabis products, lower-potency hemp edibles, and hemp-derived consumer products sold to customers or patients must be:\n(1) prepackaged in packaging or a container that is child-resistant, tamper-evident, and opaque; or\n(2) placed in packaging or a container that is plain, child-resistant, tamper-evident, and opaque at the final point of sale to a customer.\n(b) The requirement that packaging be child-resistant does not apply to a lower-potency hemp edible that is intended to be consumed as a beverage.\n(c) If a cannabis product, lower-potency hemp edible, or a hemp-derived consumer product is packaged in a manner that includes more than a single serving, each serving must be indicated by scoring, wrapping, or other indicators designating the individual serving size. If the item is a lower-potency hemp edible, serving indicators must meet the requirements of section 342.46, subdivision 6, paragraph (b).\n(d) Edible cannabis products and lower-potency hemp edibles containing more than a single serving must be prepackaged or placed at the final point of sale in packaging or a container that is resealable.\n(a) Cannabis flower, cannabis products, lower-potency hemp edibles, or hemp-derived consumer products sold to customers or patients must not be packaged in a manner that:\n(1) bears a reasonable resemblance to any commercially available product that does not contain cannabinoids, whether the manufacturer of the product holds a registered trademark or has registered the trade dress; or\n(2) is designed to appeal to individuals under 21 years of age.\n(b) Packaging for cannabis flower, cannabis products, lower-potency hemp edibles, and hemp-derived consumer products must not contain or be coated with any perfluoroalkyl substance.\n(c) Edible cannabis products and lower-potency hemp edibles must not be packaged in a material that is not approved by the United States Food and Drug Administration for use in packaging food.\nNo person shall sell, offer for sale, or facilitate the sale of empty packaging that, if used, would be a violation of any provision of this section. Enforcement of this subdivision is subject to section 8.31.",
	"repealed": false
}