{
	"id": "299D.01",
	"url": "https://www.revisor.mn.gov/statutes/cite/299D.01",
	"title": "299D.01 DIVISION OF STATE PATROL.",
	"text": "A division in the Department of Public Safety to be known as the Division of State Patrol is created, under the supervision and control of the chief supervisor, who shall be appointed by the commissioner and serve at the commissioner's pleasure in the unclassified service of the state civil service.\nThe chief supervisor, with the approval of the commissioner, may appoint a chief assistant supervisor who shall serve at the chief supervisor's pleasure in the unclassified service. The salary of the chief supervisor and the salary of the chief assistant supervisor is fixed by the commissioner of public safety except when such salaries are otherwise expressly provided for by law. The chief assistant supervisor may perform and exercise every power, duty, and responsibility imposed by law upon the chief supervisor when authorized so to do by the commissioner of public safety. If the chief assistant supervisor is removed from the chief assistant supervisor's position for other than cause as defined in section 299D.03, the chief assistant supervisor shall be reinstated to the position held in the patrol prior to being promoted to the position of chief assistant supervisor and shall otherwise be subject to the provisions of subdivision 12 of said section.\nSubject to the provisions of this section and to other applicable laws the commissioner of public safety shall organize the division, employ such persons for the Minnesota State Patrol including assistant supervisors and sergeants in the manner and in the number otherwise authorized by law and such other employees and agents as the commissioner may deem necessary to discharge the functions of the division, define the duties of such employees and agents and to delegate to them such of the commissioner's powers, duties, and responsibilities, which are not specifically fixed by law, subject to the commissioner's control and under such conditions as the commissioner may prescribe. Appointments to exercise delegated power shall be by written order filed with the secretary of state. Except for the chief supervisor, the chief assistant supervisor and State Patrol officers of the Minnesota State Patrol, the other employees and agents listed in this section are in the classified service of the state civil service.\nBefore entering upon the duties of office the chief supervisor of the Minnesota State Patrol shall take and subscribe an oath.\n[Repealed, 1996 c 310 s 1]\nSubject to the other provisions of Laws 1969, chapter 1129, the powers and duties now vested in or imposed upon the commissioner of transportation with reference to the Minnesota Highway Patrol are transferred to, vested in, and imposed upon the commissioner of public safety. The powers and duties of the commissioner of transportation with reference thereto are hereby abolished.\nThe legislature by Laws 1969, chapter 1129, article I, is transferring the Minnesota Highway Patrol to the Department of Public Safety and in so doing is not enlarging or increasing the statutory duties of the personnel thereof, and no part of Laws 1969, chapter 1129 shall be construed as in any way indicating an increase or change in such powers and duties of that organization.\nThe commissioner of transportation shall furnish the Minnesota State Patrol such quarters as may be necessary for the performance of the duties imposed upon it by law and as the governor shall direct.",
	"repealed": false
}