{
	"id": "518A.53",
	"url": "https://www.revisor.mn.gov/statutes/cite/518A.53",
	"title": "518A.53 INCOME WITHHOLDING.",
	"text": "(a) For the purpose of this section, the following terms have the meanings provided in this subdivision unless otherwise stated.\n(b) \"Payor of funds\" means any person or entity that provides funds to an obligor, including an employer as defined under chapter 24 of the Internal Revenue Code, section 3401(d), an independent contractor, payor of worker's compensation benefits or unemployment benefits, or a financial institution as defined in section 13B.06.\n(c) \"Business day\" means a day on which state offices are open for regular business.\n(d) \"Arrears\" has the meaning given in section 518A.26, subdivision 3.\nThis section applies to all support orders issued by a court or an administrative tribunal and orders for or notices of withholding issued by the public authority.\nEvery support order must address income withholding. Whenever a support order is initially entered or modified, the full amount of the support order must be subject to income withholding from the income of the obligor. If the obligee or obligor applies for either full IV-D services or for income withholding only services from the public authority responsible for child support enforcement, the full amount of the support order must be withheld from the income of the obligor and forwarded to the public authority. Every order for support or maintenance shall provide for a conspicuous notice of the provisions of this section that complies with section 518.68, subdivision 2. An order without this notice remains subject to this section. This section applies regardless of the source of income of the person obligated to pay the support or maintenance.\nA payor of funds shall implement income withholding according to this section upon receipt of an order for or notice of withholding. The notice of withholding shall be on a form provided by the commissioner of children, youth, and families.\n(a) The commissioner of children, youth, and families shall prepare and make available to the courts a notice of services that explains child support and maintenance collection services available through the public authority, including income withholding, and the fees for such services. Upon receiving a petition for dissolution of marriage or legal separation, the court administrator shall promptly send the notice of services to the petitioner and respondent at the addresses stated in the petition.\n(b) Either the obligee or obligor may at any time apply to the public authority for either full IV-D services or for income withholding only services.\n(c) For those persons applying for income withholding only services, a monthly service fee of $15 must be charged to the obligor. This fee is in addition to the amount of the support order and shall be withheld through income withholding. The public authority shall explain the service options in this section to the affected parties and encourage the application for full child support collection services.\n(d) If the obligee is not a current recipient of public assistance as defined in section 518A.81, the person who applied for services may at any time choose to terminate either full IV-D services or income withholding only services regardless of whether income withholding is currently in place. The obligee or obligor may reapply for either full IV-D services or income withholding only services at any time.\n(e) When a person terminates IV-D services, if an arrearage for public assistance as defined in section 518A.81 exists, the public authority may continue income withholding, as well as use any other enforcement remedy for the collection of child support, until all public assistance arrears are paid in full. Income withholding shall be in an amount equal to 20 percent of the support order in effect at the time the services terminated, unless the court has ordered a specific monthly payback amount to be applied toward the arrears. If a support order includes a specific monthly payback amount, income withholding shall be for the specific monthly payback amount ordered.\n(a) An order for or notice of withholding is binding on a payor of funds upon receipt. Withholding must begin no later than the first pay period that occurs after 14 days following the date of receipt of the order for or notice of withholding. In the case of a financial institution, preauthorized transfers must occur in accordance with a court-ordered payment schedule.\n(b) A payor of funds shall withhold from the income payable to the obligor the amount specified in the order or notice of withholding and amounts specified under subdivisions 6 and 9 and shall remit the amounts withheld to the public authority within seven business days of the date the obligor is paid the remainder of the income. The payor of funds shall include with the remittance the Social Security number of the obligor, the case type indicator as provided by the public authority and the date the obligor is paid the remainder of the income. A payor of funds may combine all amounts withheld from one pay period into one payment to each public authority, but shall separately identify each obligor making payment.\n(c) A payor of funds shall not discharge, or refuse to hire, or otherwise discipline an employee as a result of wage or salary withholding authorized by this section. A payor of funds shall be liable to the obligee for any amounts required to be withheld. A payor of funds that fails to withhold or transfer funds in accordance with this section is also liable to the obligee for interest on the funds at the rate applicable to judgments under section 549.09, computed from the date the funds were required to be withheld or transferred. A payor of funds is liable for reasonable attorney fees of the obligee or public authority incurred in enforcing the liability under this paragraph. A payor of funds that has failed to comply with the requirements of this section is subject to contempt sanctions under section 518A.73. If the payor of funds is an employer or independent contractor and violates this subdivision, a court may award the obligor twice the wages lost as a result of this violation. If a court finds a payor of funds violated this subdivision, the court shall impose a civil fine of not less than $500. The liabilities in this paragraph apply to intentional noncompliance with this section.\n(d) If a single employee is subject to multiple withholding orders or multiple notices of withholding for the support of more than one child, the payor of funds shall comply with all of the orders or notices to the extent that the total amount withheld from the obligor's income does not exceed the limits imposed under the Consumer Credit Protection Act, United States Code, title 15, section 1673(b), giving priority to amounts designated in each order or notice as current support as follows:\n(1) if the total of the amounts designated in the orders for or notices of withholding as current support exceeds the amount available for income withholding, the payor of funds shall allocate to each order or notice an amount for current support equal to the amount designated in that order or notice as current support, divided by the total of the amounts designated in the orders or notices as current support, multiplied by the amount of the income available for income withholding; and\n(2) if the total of the amounts designated in the orders for or notices of withholding as current support does not exceed the amount available for income withholding, the payor of funds shall pay the amounts designated as current support, and shall allocate to each order or notice an amount for past due support, equal to the amount designated in that order or notice as past due support, divided by the total of the amounts designated in the orders or notices as past due support, multiplied by the amount of income remaining available for income withholding after the payment of current support.\n(e) When an order for or notice of withholding is in effect and the obligor's employment is terminated, the obligor and the payor of funds shall notify the public authority of the termination within ten days of the termination date. The termination notice shall include the obligor's home address and the name and address of the obligor's new payor of funds, if known.\n(f) A payor of funds may deduct one dollar from the obligor's remaining salary for each payment made pursuant to an order for or notice of withholding under this section to cover the expenses of withholding.\n(a) If income withholding is ineffective due to the obligor's method of obtaining income, the court shall order the obligor to identify a child support deposit account owned solely by the obligor, or to establish an account, in a financial institution located in this state for the purpose of depositing court-ordered child support payments. The court shall order the obligor to execute an agreement with the appropriate public authority for preauthorized transfers from the obligor's child support account payable to an account of the public authority. The court shall order the obligor to disclose to the court all deposit accounts owned by the obligor in whole or in part in any financial institution. The court may order the obligor to disclose to the court the opening or closing of any deposit account owned in whole or in part by the obligor within 30 days of the opening or closing. The court may order the obligor to execute an agreement with the appropriate public authority for preauthorized transfers from any deposit account owned in whole or in part by the obligor to the obligor's child support deposit account if necessary to satisfy court-ordered child support payments. The court may order a financial institution to disclose to the court the account number and any other information regarding accounts owned in whole or in part by the obligor. An obligor who fails to comply with this subdivision, fails to deposit funds in at least one deposit account sufficient to pay court-ordered child support, or stops payment or revokes authorization of any preauthorized transfer is subject to contempt of court procedures under chapter 588.\n(b) A financial institution shall execute preauthorized transfers for the deposit accounts of the obligor in the amount specified in the order and amounts required under this section as directed by the public authority. A financial institution is liable to the obligee if funds in any of the obligor's deposit accounts identified in the court order equal the amount stated in the preauthorization agreement but are not transferred by the financial institution in accordance with the agreement.\n(a) This subdivision applies to support orders that do not contain provisions for income withholding.\n(b) For cases in which the public authority is providing child support enforcement services to the parties, the income withholding under this subdivision shall take effect without prior judicial notice to the obligor and without the need for judicial or administrative hearing. Withholding shall result when:\n(1) the obligor requests it in writing to the public authority;\n(2) the obligee or obligor serves on the public authority a copy of the notice of income withholding, a copy of the court's order, an application, and the fee to use the public authority's collection services; or\n(3) the public authority commences withholding according to section 518A.46, subdivision 5, paragraph (a), clause (5).\n(c) For cases in which the public authority is not providing child support services to the parties, income withholding under this subdivision shall take effect when an obligee requests it by making a written motion to the court and the court finds that previous support has not been paid on a timely consistent basis or that the obligor has threatened expressly or otherwise to stop or reduce payments.\n(d) Within two days after the public authority commences withholding under this subdivision, the public authority shall send to the obligor at the obligor's last known address, notice that withholding has commenced. The notice shall include the information provided to the payor of funds in the notice of withholding.\n(a) The obligor may contest withholding under subdivision 7 on the limited grounds that the withholding or the amount withheld is improper due to mistake of fact. If the obligor chooses to contest the withholding, the obligor must do so no later than 15 days after the employer commences withholding, upon proper motion pursuant to section 484.702 and the rules of the expedited child support process.\n(b) The income withholding must remain in place while the obligor contests the withholding.\n(c) If the court finds a mistake in the amount of the arrearage to be withheld, the court shall continue the income withholding, but it shall correct the amount of the arrearage to be withheld.\n(a) An order for or notice of withholding under this section or execution or garnishment upon a judgment for child support arrearage or preadjudicated expenses shall have priority over an attachment, execution, garnishment, or wage assignment and shall not be subject to the statutory limitations on amounts levied against the income of the obligor. Amounts withheld from an employee's income must not exceed the maximum permitted under the Consumer Credit Protection Act, title 15 of the United States Code, section 1673(b).\n(b) If more than one order for or notice of withholding exists involving the same obligor and child, the public authority shall enforce the most recent order or notice. An order for or notice of withholding that was previously implemented according to this section shall end as of the date of the most recent order. The public authority shall notify the payor of funds to withhold under the most recent withholding order or notice.\n(a) This section does not prevent the court from ordering the payor of funds to withhold amounts to satisfy the obligor's previous arrearage in support order payments. This remedy shall not operate to exclude availability of other remedies to enforce judgments. The employer or payor of funds shall withhold from the obligor's income an additional amount equal to 20 percent of the monthly child support or maintenance obligation until the arrearage is paid, unless the court has ordered a specific monthly payback amount toward the arrears. If a support order includes a specific monthly payback amount, the employer or payor of funds shall withhold from the obligor's income an additional amount equal to the specific monthly payback amount ordered until all arrearages are paid.\n(b) Notwithstanding any law to the contrary, funds from income sources included in section 518A.26, subdivision 8, whether periodic or lump sum, are not exempt from attachment or execution upon a judgment for child support arrearage.\n(c) Absent an order to the contrary, if an arrearage exists at the time a support order would otherwise terminate, income withholding shall continue in effect or may be implemented in an amount equal to the support order plus an additional 20 percent of the monthly child support obligation, until all arrears have been paid in full.\nBefore transmittal to the obligor of a lump-sum payment of $500 or more including, but not limited to, severance pay, accumulated sick pay, vacation pay, bonuses, commissions, or other pay or benefits, a payor of funds:\n(1) who has been served with an order for or notice of income withholding under this section shall:\n(i) notify the public authority of the lump-sum payment that is to be paid to the obligor;\n(ii) hold the lump-sum payment for 30 days after the date on which the lump-sum payment would otherwise have been paid to the obligor, notwithstanding sections 176.221, 176.225, 176.521, 181.08, 181.101, 181.11, 181.13, and 181.145; and\n(iii) upon order of the court, and after a showing of past willful nonpayment of support, pay any specified amount of the lump-sum payment to the public authority for future support; or\n(2) shall pay the lessor of the amount of the lump-sum payment or the total amount of the judgment and arrearages upon service by United States mail of a sworn affidavit from the public authority or a court order that includes the following information:\n(i) that a judgment entered pursuant to section 548.091, subdivision 1a, exists against the obligor, or that other support arrearages exist;\n(ii) the current balance of the judgment or arrearage; and\n(iii) that a portion of the judgment or arrearage remains unpaid.\n(a) Upon receipt of an order for support entered in another state and the specified documentation from an authorized agency, the public authority shall implement income withholding. A payor of funds in this state shall withhold income under court orders for withholding issued by other states or territories.\n(b) An employer receiving an income withholding notice from another state shall withhold and distribute the funds as directed in the withholding notice and shall apply the law of the obligor's principal place of employment when determining:\n(1) the employer's fee for processing an income withholding notice;\n(2) the maximum amount permitted to be withheld from the obligor's income; and\n(3) deadlines for implementing and forwarding the child support payment.\n(c) An obligor may contest withholding under this subdivision pursuant to section 518C.506.\nAn order terminating income withholding must specify the effective date of the order and reference the initial order or decree that establishes the support obligation and shall be entered once the following conditions have been met:\n(1) the obligor serves written notice of the application for termination of income withholding by mail upon the obligee at the obligee's last known mailing address, and a duplicate copy of the application is served on the public authority;\n(2) the application for termination of income withholding specifies the event that terminates the support obligation, the effective date of the termination of the support obligation, and the applicable provisions of the order or decree that established the support obligation;\n(3) the application includes the complete name of the obligor's payor of funds, the business mailing address, the court action and court file number, and the support and collections file number, if known; and\n(4) after receipt of the application for termination of income withholding, the obligee or the public authority fails within 20 days to request a contested hearing on the issue of whether income withholding of support should continue clearly specifying the basis for the continued support obligation and, ex parte, to stay the service of the order terminating income withholding upon the obligor's payor of funds, pending the outcome of the contested hearing.\nIf the public authority determines that income withholding is no longer applicable, the public authority shall notify the obligee and the obligor of intent to terminate income withholding.\nFive days following notification to the obligee and obligor, the public authority shall issue a notice to the payor of funds terminating income withholding, without a requirement for a court order unless the obligee has requested an expedited child support hearing under section 484.702.\nTo carry out the provisions of this section, the public authority responsible for child support enforcement may contract for services, including the use of electronic funds transfer.\n(a) If the public authority is providing child support and maintenance enforcement services and child support or maintenance is not assigned under section 518A.81, the court may waive the requirements of this section if:\n(1) one party demonstrates and the court determines there is good cause to waive the requirements of this section or to terminate an order for or notice of income withholding previously entered under this section. The court must make written findings to include the reasons income withholding would not be in the best interests of the child. In cases involving a modification of support, the court must also make a finding that support payments have been timely made; or\n(2) the obligee and obligor sign a written agreement providing for an alternative payment arrangement which is reviewed and entered in the record by the court.\n(b) If the public authority is not providing child support and maintenance enforcement services and child support or maintenance is not assigned under section 518A.81, the court may waive the requirements of this section if the parties sign a written agreement.\n(c) If the court waives income withholding, the obligee or obligor may at any time request income withholding under subdivision 7.\nA payor of funds who complies with an income withholding order or notice of withholding according to this chapter or chapter 518C, that appears regular on its face shall not be subject to civil liability to any individual or agency for taking action in compliance with the order or notice.\nOrders or notices for withholding under this section may be transmitted for enforcement purposes by electronic means.\nThe public authority shall make reasonable efforts to ensure that automated enforcement remedies take into consideration the time periods allowed under this section.",
	"repealed": false
}