{
	"id": "296A.15",
	"url": "https://www.revisor.mn.gov/statutes/cite/296A.15",
	"title": "296A.15 PAYMENT OF TAX.",
	"text": "(a) Except as provided in paragraph (e), on or before the 23rd day of each month, every person who is required to pay a gasoline tax shall file with the commissioner a report, in the form and manner prescribed by the commissioner, showing the number of gallons of petroleum products received by the reporter during the preceding calendar month, and other information the commissioner may require. A written report is deemed to have been filed as required in this subdivision if postmarked on or before the 23rd day of the month in which the tax is payable.\n(b) The number of gallons of gasoline must be reported in United States standard liquid gallons, 231 cubic inches, except that the commissioner may upon written application and for cause shown permit the distributor to report the number of gallons of gasoline as corrected to a temperature of 60-degrees Fahrenheit. If the application is granted, all gasoline covered in the application and allowed by the commissioner must continue to be reported by the distributor on the adjusted basis for a period of one year from the date of the granting of the application. The number of gallons of petroleum products other than gasoline must be reported as originally invoiced. Each report must show separately the number of gallons of aviation gasoline received by the reporter during each calendar month and the number of gallons of gasoline sold to a dealer of aviation gasoline during each calendar month.\n(c) Each report must also include the amount of gasoline tax on gasoline received by the reporter during the preceding month. In computing the tax a deduction of 2.5 percent of the quantity of gasoline received by a distributor shall be made for evaporation and loss. At the time of reporting, the reporter shall submit satisfactory evidence that one-third of the 2.5 percent deduction has been credited or paid to dealers on quantities sold to them.\n(d) Each report shall contain a confession of judgment for the amount of the tax shown due to the extent not timely paid.\n(e) Under certain circumstances and with the approval of the commissioner, taxpayers may be allowed to file reports annually.\nPersons required to pay a petroleum tank release cleanup fee under section 115C.08, subdivision 3, must file a report with the commissioner of revenue. Each report must include the amount of fees due on petroleum products. Reports must be filed in the form and manner prescribed by the commissioner. A written report is considered filed as required if postmarked on or before the 23rd day of the month in which the fee is payable.\nOn or before the 23rd day of each month, distributors, special fuel dealers, and bulk purchasers shall file a report in the form and manner prescribed by the commissioner. Reports shall contain information as follows:\n(a) Distributors of undyed diesel fuel and undyed kerosene must file a monthly tax return with the commissioner listing all purchases or receipts of undyed diesel fuel and undyed kerosene. Distributors may be allowed to take a credit or credits under section 296A.16, subdivision 1.\n(b) Distributors and dealers of special fuel other than undyed diesel fuel or undyed kerosene shall report the total number of gallons delivered to them during the preceding calendar month and shall pay the special fuel excise tax due to the commissioner. The invoice must show the true and correct name and address of the purchaser, and the purchaser's signature. The report shall contain other information as the commissioner may require.\n(c) Distributors and dealers of special fuel other than undyed diesel fuel or undyed kerosene must pay the special fuel excise tax on all special fuel delivered or sold into the supply tank of an aircraft or licensed motor vehicle and shall file a report with the commissioner. The report shall show the total number of gallons delivered or sold into the supply tank of an aircraft or licensed motor vehicle during the preceding calendar month and the special fuel excise tax due shall be paid to the commissioner. Any person delivering special fuel on which the excise tax has not previously been paid into the supply tank of an aircraft or a licensed motor vehicle shall report such delivery and shall pay or collect and pay to the commissioner the excise tax on the special fuel so delivered.\n(d) Distributors and special fuel dealers may, subject to the approval of the commissioner, elect to pay to the commissioner the special fuel excise tax on all special fuel delivered or sold into the supply tank of an aircraft or licensed motor vehicle. Under this option, an invoice must be issued at the time of each delivery showing the name and address of the purchaser, date of sale, number of gallons, price per gallon, and total amount of sale. A separate sales ticket book shall be maintained for special fuel sales. The tax is also imposed on all special fuel held in storage on the effective date of this election.\n(e) Bulk purchasers shall report and pay the special fuel excise tax on all special fuel, including alternative fuels, except undyed diesel fuel or undyed kerosene purchased by them for storage during the preceding calendar month. In such cases as the commissioner may permit, credit for the excise tax due or previously paid on special fuel not used in aircraft or licensed motor vehicles may be allowed in computing tax liability. The report shall contain other information as the commissioner may require.\n(f) In computing the special fuel excise tax due, a deduction of one percent of the quantity of special fuel on which tax is due shall be made for evaporation and loss.\n(g) Each report shall contain a confession of judgment for the amount of the tax shown due to the extent not timely paid.\n(a) Any person who buys aviation gasoline, including from a dealer of aviation gasoline, or special fuel for aircraft use, and who has paid the excise taxes due directly or indirectly through the amount of the tax being included in the price, or otherwise, and uses said gasoline or special fuel in motor vehicles or knowingly sells it to any person for use in motor vehicles shall, on or before the 23rd day of the month following that in which such gasoline or special fuel was so used or sold, report the fact of the use or sale to the commissioner in the form and manner prescribed by the commissioner.\n(b) Any person who buys gasoline and who has paid the motor vehicle gasoline excise tax directly or indirectly through the amount of the tax being included in the price of the gasoline, or otherwise, who knowingly sells such gasoline to any person to be used for the purpose of producing or generating power for propelling aircraft, or who receives, stores, or withdraws from storage gasoline to be used for that purpose, shall, on or before the 23rd day of the month following that in which such gasoline was so sold, stored, or withdrawn from storage, report the fact of the sale, storage, or withdrawal from storage to the commissioner in the form and manner prescribed by the commissioner.\nNotwithstanding the provisions of this chapter, a farmer who uses gasoline or any special fuel on which a tax has not been paid shall report and pay the tax on all gasoline or special fuel delivered into the supply tank of a licensed motor vehicle during the preceding calendar year. The tax must be reported and paid in the form and manner prescribed by the commissioner together with any refund claim filed by the taxpayer under section 296A.16. If no refund claim is filed, the tax must be reported and paid annually by March 15 or more frequently, as the commissioner may prescribe. Any producer qualifying under this subdivision is exempt from the licensing requirements in section 296A.03, subdivision 1.\nPersons required to pay an inspection fee under section 239.101 must file a report with the commissioner of revenue. Each report must include the amount of inspection fees due on petroleum products. Reports must be filed in the form and manner prescribed by the commissioner. A written report is considered filed as required if postmarked on or before the 23rd day of the month in which the fee is payable.\nAll remittances must be made by electronic means.\nThe commissioner may require that returns or reports be filed electronically. For purposes of this chapter, the name of the taxpayer, the name of the taxpayer's authorized agent, or the taxpayer's identification number constitutes a signature when transmitted as part of the information on returns or reports filed by electronic means by the taxpayer or at the taxpayer's direction. \"Electronic means\" includes, but is not limited to, the use of a touch-tone telephone to transmit return or report information in a manner prescribed by the commissioner.",
	"repealed": false
}