{
	"id": "144.122",
	"url": "https://www.revisor.mn.gov/statutes/cite/144.122",
	"title": "144.122 LICENSE, PERMIT, AND SURVEY FEES.",
	"text": "(a) The state commissioner of health, by rule, may prescribe procedures and fees for filing with the commissioner as prescribed by statute and for the issuance of original and renewal permits, licenses, registrations, and certifications issued under authority of the commissioner. The expiration dates of the various licenses, permits, registrations, and certifications as prescribed by the rules shall be plainly marked thereon. Fees may include application and examination fees and a penalty fee for renewal applications submitted after the expiration date of the previously issued permit, license, registration, and certification. The commissioner may also prescribe, by rule, reduced fees for permits, licenses, registrations, and certifications when the application therefor is submitted during the last three months of the permit, license, registration, or certification period. Fees proposed to be prescribed in the rules shall be first approved by the Department of Management and Budget. All fees proposed to be prescribed in rules shall be reasonable. The fees shall be in an amount so that the total fees collected by the commissioner will, where practical, approximate the cost to the commissioner in administering the program. All fees collected shall be deposited in the state treasury and credited to the state government special revenue fund unless otherwise specifically appropriated by law for specific purposes.\n(b) The commissioner may charge a fee for voluntary certification of medical laboratories and environmental laboratories, and for environmental and medical laboratory services provided by the department, without complying with paragraph (a) or chapter 14. Fees charged for environment and medical laboratory services provided by the department must be approximately equal to the costs of providing the services.\n(c) The commissioner may develop a schedule of fees for diagnostic evaluations conducted at clinics held by the services for children with disabilities program. All receipts generated by the program are annually appropriated to the commissioner for use in the maternal and child health program.\n(d) The commissioner shall set license fees for hospitals and nursing homes that are not boarding care homes at the following levels:\nThe commissioner shall set license fees for outpatient surgical centers, boarding care homes, supervised living facilities, assisted living facilities, and assisted living facilities with dementia care at the following levels:\nFees collected under this paragraph are nonrefundable. The fees are nonrefundable even if received before July 1, 2017, for licenses or registrations being issued effective July 1, 2017, or later.\n(e) Unless prohibited by federal law, the commissioner of health shall charge applicants the following fees to cover the cost of any initial certification surveys required to determine a provider's eligibility to participate in the Medicare or Medicaid program:\nThese fees shall be submitted at the time of the application for federal certification and shall not be refunded. All fees collected after the date that the imposition of fees is not prohibited by federal law shall be deposited in the state treasury and credited to the state government special revenue fund.\n(f) Notwithstanding section 16A.1283, the commissioner may adjust the fees assessed on assisted living facilities and assisted living facilities with dementia care under paragraph (d), in a revenue-neutral manner in accordance with the requirements of this paragraph:\n(1) a facility seeking to renew a license shall pay a renewal fee in an amount that is up to ten percent lower than the applicable fee in paragraph (d) if residents who receive home and community-based waiver services under chapter 256S and section 256B.49 comprise more than 50 percent of the facility's capacity in the calendar year prior to the year in which the renewal application is submitted; and\n(2) a facility seeking to renew a license shall pay a renewal fee in an amount that is up to ten percent higher than the applicable fee in paragraph (d) if residents who receive home and community-based waiver services under chapter 256S and section 256B.49 comprise less than 50 percent of the facility's capacity during the calendar year prior to the year in which the renewal application is submitted.\nThe commissioner may annually adjust the percentages in clauses (1) and (2), to ensure this paragraph is implemented in a revenue-neutral manner. The commissioner shall develop a method for determining capacity thresholds in this paragraph in consultation with the commissioner of human services and must coordinate the administration of this paragraph with the commissioner of human services for purposes of verification.\n(g) The commissioner shall charge hospitals an annual licensing base fee of $1,826 per hospital, plus an additional $23 per licensed bed or bassinet fee. Revenue shall be deposited to the state government special revenue fund and credited toward trauma hospital designations under sections 144.605 and 144.6071.",
	"repealed": false
}