{
	"id": "148E.085",
	"url": "https://www.revisor.mn.gov/statutes/cite/148E.085",
	"title": "148E.085 VOLUNTARY TERMINATION LICENSE STATUS.",
	"text": "(a) A licensee may apply for voluntary termination of a license if the licensee:\n(1) submits a completed, signed application on a form that the board has provided. For electronic applications, a \"signed application\" means providing an attestation that the board has specified. An application that the applicant has not completed and signed is void. The board must return the application to the applicant. No fee is required to voluntarily terminate a license; and\n(2) demonstrates to the satisfaction of the board that the licensee is not engaged in the practice of social work as defined in section 148E.010, subdivisions 6 and 11, in any setting except when the individual is exempt from licensure according to section 148E.065.\n(b) By submitting an application for voluntary termination, an applicant authorizes the board to:\n(1) investigate any information provided or requested in the application. The board may request that the applicant provide additional information, verification, or documentation;\n(2) determine if the applicant has met the continuing education requirements specified in section 148E.130; and\n(3) determine whether the applicant has met the supervision requirements specified in sections 148E.100 to 148E.125.\nA licensee who has voluntarily terminated a license: (1) may restore the license according to section 148E.080; or (2) may reapply for a license according to section 148E.055.\nA licensee who has voluntarily terminated a license: (1) must not use the credentials LSW, LGSW, LISW, or LICSW; and (2) must not practice, attempt to practice, offer to practice, or advertise or hold out as authorized to practice social work, except when the individual is exempt from licensure according to section 148E.065.\nThe board may resolve any pending complaints against a licensee before approving a request for voluntary termination. The board may take action according to sections 148E.255 to 148E.290 against a licensee who voluntarily terminated their license based on conduct occurring before the license was voluntarily terminated.",
	"repealed": false
}