{
	"id": "114D.25",
	"url": "https://www.revisor.mn.gov/statutes/cite/114D.25",
	"title": "114D.25 ADMINISTRATION; POLLUTION CONTROL AGENCY.",
	"text": "(a) The Pollution Control Agency, in accordance with federal TMDL requirements, shall:\n(1) identify impaired waters and propose a list of the waters for review and approval by the United States Environmental Protection Agency;\n(2) develop and approve TMDLs for listed impaired waters and submit the approved TMDLs to the United States Environmental Protection Agency for final approval; and\n(3) propose to delist waters from the Environmental Protection Agency impaired waters list.\n(b) A TMDL must include a statement of the facts and scientific data supporting the TMDL and a list of potential implementation options, including:\n(1) a range of estimates of the cost of implementation of the TMDL; and\n(2) for point sources, the individual wasteload data and the estimated cost of compliance addressed by the TMDL.\n(c) The implementation information need not be sent to the United States Environmental Protection Agency for review and approval.\nThe approval of a TMDL by the Pollution Control Agency is a final decision of the agency for purposes of section 115.05, and is subject to the contested case procedures of sections 14.57 to 14.62 in accordance with agency procedural rules. The agency shall not submit an approved TMDL to the United States Environmental Protection Agency until the time for commencing judicial review has run or the judicial review process has been completed. A TMDL is not subject to the rulemaking requirements of chapter 14, including section 14.386.\nBefore submitting a TMDL to the United States Environmental Protection Agency, the Pollution Control Agency shall comply with the notice and procedure requirements of this section. If a contested case proceeding is not required for a proposed TMDL, the agency may submit the TMDL to the United States Environmental Protection Agency no earlier than 30 days after the notice required in subdivision 4. If a contested case proceeding is required for a TMDL, the TMDL may be submitted to the United States Environmental Protection Agency after the contested case proceeding and appeal process is completed.\nThe Pollution Control Agency shall give notice of its intention to submit a TMDL to the United States Environmental Protection Agency. The notice must be given by publication in the State Register and by United States mail to persons who have registered their names with the agency. The notice must include either a copy of the proposed TMDL or an easily readable and understandable description of its nature and effect and an announcement of how free access to the proposed TMDL can be obtained. In addition, the agency shall make reasonable efforts to notify persons or classes of persons who may be significantly affected by the TMDL by giving notice of its intention in newsletters, newspapers, or other publications, or through other means of communication. The notice must include a statement informing the public:\n(1) that the public has 30 days in which to submit comment in support of or in opposition to the proposed TMDL and that comment is encouraged;\n(2) that each comment should identify the portion of the proposed TMDL addressed, the reason for the comment, and any change proposed;\n(3) of the manner in which persons must request a contested case proceeding on the proposed TMDL;\n(4) that the proposed TMDL may be modified if the modifications are supported by the data and facts; and\n(5) the date on which the 30-day comment period ends.\nThe Pollution Control Agency may enter into agreements with any qualified public agency setting forth the terms and conditions under which that agency is authorized to develop a third-party TMDL. In determining whether the public agency is qualified to develop a third-party TMDL, the Pollution Control Agency shall consider the technical and administrative qualifications of the public agency, cost, and shall avoid any potential organizational conflict of interest, as defined in section 16C.02, subdivision 10a, of the public agency with respect to the development of the third-party TMDL. A third-party TMDL is subject to modification and approval by the Pollution Control Agency, and must be approved by the Pollution Control Agency before it is submitted to the United States Environmental Protection Agency. The Pollution Control Agency shall only consider authorizing the development of third-party TMDLs consistent with the goals, policies, and priorities determined under section 114D.20.\nThe commissioner of the Pollution Control Agency must allow at least 60 days for public comment after publishing the draft impaired waters list required under the federal Clean Water Act. In making impairment designations, the Pollution Control Agency must use available water-quality data that takes into consideration recent relevant pollutant reductions resulting from controls on municipal point sources and nonpoint sources.",
	"repealed": false
}