{
	"id": "84D.01",
	"url": "https://www.revisor.mn.gov/statutes/cite/84D.01",
	"title": "84D.01 DEFINITIONS.",
	"text": "For the purposes of this chapter, the following terms have the meanings given them.\n\"Aquatic invasive species affirmation\" means an affirmation of the summary of the aquatic invasive species laws of this chapter that is part of watercraft licenses and nonresident fishing licenses, as provided in section 84D.106.\n\"Aquatic macrophyte\" means macro algae or a macroscopic nonwoody plant, either a submerged, floating leafed, floating, or emergent plant that naturally grows in water.\n\"Aquatic plant\" means a plant, including algae and submerged, floating leafed, floating, or emergent plants, that naturally grows in water, saturated soils, or seasonally saturated soils.\n\"Commissioner\" means the commissioner of the Department of Natural Resources.\n\"Decontaminate\" means to wash, drain, dry, or thermally or otherwise treat water-related equipment in order to remove or destroy aquatic invasive species using the \"Recommended Uniform Minimum Protocols and Standards for Watercraft Interception Programs for Dreissenid Mussels in the Western United States\" (September 2009) prepared for the Western Regional Panel on Aquatic Nuisance Species, or other protocols developed by the commissioner.\n\"Department\" means the Department of Natural Resources.\n[Repealed, 2004 c 243 s 41]\n\"Eurasian watermilfoil\" means Myriophyllum spicatum and its hybrids.\n[Repealed, 2004 c 243 s 41]\n\"Infested waters\" means waters of the state listed by the commissioner under sections 84D.03, subdivision 1, and 84D.12.\n[Renumbered subd 8d]\n\"Inspect\" means to examine water-related equipment to determine whether aquatic invasive species, aquatic macrophytes, or water is present and includes removal, drainage, decontamination, collection and sampling, or treatment to prevent the transportation and spread of aquatic invasive species, aquatic macrophytes, and water.\n\"Inspector\" means: (1) an individual trained and authorized by the commissioner to inspect water-related equipment under section 84D.105, subdivision 2, paragraph (a); or (2) a conservation officer or a licensed peace officer.\n\"Introduce\" means to place, release, or allow the escape of a nonnative species into a free-living state. Introduce does not include:\n(1) the immediate return of a nonnative species to waters of the state from which the nonnative species was removed; or\n(2) the seasonal return of nonnative species attached to water-related equipment, such as a dock or boat lift, that has been stored on riparian property and directly returned to the same waters of the state from which the water-related equipment was removed.\n\"Introduction\" means the placement, release, or escape of a nonnative species into a free-living state.\n\"Invasive species\" means a nonnative species that:\n(1) causes or may cause economic or environmental harm or harm to human health; or\n(2) threatens or may threaten natural resources or the use of natural resources in the state.\n[Repealed, 1999 c 92 s 11]\n\"Native species\" means an animal or plant species naturally present and reproducing within this state or that naturally expands from its historic range into this state.\n\"Naturalize\" means to establish a self-sustaining population of nonnative species in the wild outside of its natural range.\n\"Nonnative species\" means a species that is not a native species.\n\"Prohibited invasive species\" means a nonnative species that has been designated as a prohibited invasive species in a rule adopted by the commissioner under section 84D.12.\n\"Purple loosestrife\" means Lythrum salicaria, Lythrum virgatum, or combinations thereof.\n\"Regulated invasive species\" means a nonnative species that has been designated as a regulated invasive species in a rule adopted by the commissioner under section 84D.12.\n\"Service provider\" means an individual who or entity that:\n(1) decontaminates, installs, or removes water-related equipment or structures into or from waters of the state for hire or as a service provided as a benefit of membership in a yacht club, boat club, marina, or similar organization; or\n(2) rents or leases water-related equipment that will be used in, placed into, or removed from waters of the state.\nService provider does not include a person working under the supervision of an individual with a valid service provider permit issued under section 84D.108.\n\"Transport\" means to cause or attempt to cause a species to be carried or moved into or within the state, and includes accepting or receiving the species for transportation or shipment. Transport does not include:\n(1) the movement of infested water or a nonnative species within a water of the state or to a connected water of the state where the species being transported is already present; or\n(2) the movement of a nonnative species attached to water-related equipment or other water-related structures from a water of the state to the shore of riparian property on that water or the return of water-related equipment or structures from the shore into the same water of the state.\n\"Unlisted nonnative species\" means a nonnative species that has not been designated as a prohibited invasive species, a regulated invasive species, or an unregulated nonnative species in a rule adopted by the commissioner under section 84D.12.\n\"Unregulated nonnative species\" means a nonnative species that has been designated as an unregulated nonnative species in a rule adopted by the commissioner under section 84D.12.\n\"Water-related equipment\" means a motor vehicle, boat, watercraft, dock, boat lift, raft, vessel, trailer, tool, implement, device, or any other associated equipment or container, including but not limited to portable bait containers, live wells, ballast tanks except for those vessels permitted under the Pollution Control Agency vessel discharge program, bilge areas, and water-hauling equipment that is capable of containing or transporting aquatic invasive species, aquatic macrophytes, or water.\n\"Watercraft\" means a contrivance used or designed for navigation on water and includes seaplanes.\n\"Waters of the state\" has the meaning given in section 97A.015, subdivision 54.\n\"Wild animal\" has the meaning given under section 97A.015, subdivision 55.\n[Repealed, 2013 c 121 s 59]",
	"repealed": false
}