{
	"id": "204C.20",
	"url": "https://www.revisor.mn.gov/statutes/cite/204C.20",
	"title": "204C.20 BALLOTS; NUMBER TO BE COUNTED.",
	"text": "The election judges shall determine the number of ballots to be counted by tallying the number of signed voter's certificates or the number of names entered in the election register. The election judges shall then remove all the ballots from the box. Without considering how the ballots are marked, the election judges shall ascertain that each ballot is separate and shall count them to determine whether the number of ballots in the box corresponds with the number of ballots to be counted.\nIf two or more ballots are found folded together like a single ballot, the election judges shall lay them aside until all the ballots in the box have been counted. If it is evident from the number of ballots to be counted that the ballots folded together were cast by one voter, the election judges shall preserve but not count them. If the number of ballots in one box exceeds the number to be counted, the election judges shall examine all the ballots in the box to ascertain that all are properly marked with the initials of the election judges. If any ballots are not properly marked with the initials of the election judges, the election judges shall preserve but not count them; however, if the number of ballots does not exceed the number to be counted, the absence of either or both sets of initials of the election judges does not, by itself, disqualify the vote from being counted and must not be the basis of a challenge in a recount. If there is still an excess of properly marked ballots, the election judges shall replace them in the box, and one election judge, without looking, shall withdraw from the box a number of ballots equal to the excess. The withdrawn ballots shall not be counted but shall be preserved as provided in subdivision 4.\nIf the election judges find in a ballot box any ballots that are not the kind properly belonging in it, they shall lay those ballots aside. If the number of ballots found in any box equals or exceeds the number of ballots to be counted, the ballots which should have been placed in that box, but which are found in another box, shall not be counted. If the number of ballots found in a box is less than the number of ballots to be counted, and a number of ballots equal to or less than the deficiency and properly belonging in that box are found in another box, the latter ballots shall be counted. If the number of ballots found in another box exceeds the deficiency, the excess ballots shall be placed in the proper ballot box and, without looking, an election judge shall withdraw a number of ballots equal to the deficiency and the withdrawn ballots shall then be counted.\nWhen the final count of ballots agrees with the number of ballots to be counted, those ballots not counted shall be attached to a certificate made by the election judges which states why the ballots were not counted. The certificate and uncounted ballots shall be sealed in a separate envelope and returned to the county auditor or municipal or school district clerk from whom they were received.\nIn precincts using ballot tabulators, once the final count of ballots agrees with the number of ballots to be counted, election judges must immediately prepare the summary statement in accordance with section 204C.24 and seal the ballots in accordance with section 204C.25 for return to the county auditor.",
	"repealed": false
}