{
	"id": "152.0275",
	"url": "https://www.revisor.mn.gov/statutes/cite/152.0275",
	"title": "152.0275 CERTAIN CONTROLLED SUBSTANCE OFFENSES; RESTITUTION; PROHIBITIONS ON PROPERTY USE; NOTICE PROVISIONS.",
	"text": "(a) As used in this subdivision:\n(1) \"clandestine lab site\" means any structure or conveyance or outdoor location occupied or affected by conditions or chemicals typically associated with the manufacturing of methamphetamine;\n(2) \"emergency response\" includes, but is not limited to, removing and collecting evidence, securing the site, removal, remediation, and hazardous chemical assessment or inspection of the site where the relevant offense or offenses took place, regardless of whether these actions are performed by the public entities themselves or by private contractors paid by the public entities, or the property owner;\n(3) \"remediation\" means proper cleanup, treatment, or containment of hazardous substances or methamphetamine at or in a clandestine lab site, and may include demolition or disposal of structures or other property when an assessment so indicates; and\n(4) \"removal\" means the removal from the clandestine lab site of precursor or waste chemicals, chemical containers, or equipment associated with the manufacture, packaging, or storage of illegal drugs.\n(b) A court may require a person convicted of manufacturing or attempting to manufacture a controlled substance or of an illegal activity involving a precursor substance, where the response to the crime involved an emergency response, to pay restitution to all public entities that participated in the response. The restitution ordered may cover the reasonable costs of their participation in the response.\n(c) In addition to the restitution authorized in paragraph (b), a court may require a person convicted of manufacturing or attempting to manufacture a controlled substance or of illegal activity involving a precursor substance to pay restitution to a property owner who incurred removal or remediation costs because of the crime.\n(a) As used in this subdivision:\n(1) \"clandestine lab site\" has the meaning given in subdivision 1, paragraph (a);\n(2) \"property\" means publicly or privately owned real property including buildings and other structures, motor vehicles as defined in section 609.487, subdivision 2a, public waters, and public rights-of-way;\n(3) \"remediation\" has the meaning given in subdivision 1, paragraph (a); and\n(4) \"removal\" has the meaning given in subdivision 1, paragraph (a).\n(b) A peace officer who arrests a person at a clandestine lab site shall notify the appropriate county or local health department, state duty officer, and child protection services of the arrest and the location of the site.\n(c) A county or local health department or sheriff shall order that any property or portion of a property that has been found to be a clandestine lab site and contaminated by substances, chemicals, or items of any kind used in the manufacture of methamphetamine or any part of the manufacturing process, or the by-products or degradates of manufacturing methamphetamine be prohibited from being occupied or used until it has been assessed and remediated as provided in the Department of Health's clandestine drug labs general cleanup guidelines. The remediation shall be accomplished by a contractor who will make the verification required under paragraph (e).\n(d) Unless clearly inapplicable, the procedures specified in chapter 145A and any related rules adopted under that chapter addressing the enforcement of public health laws, the removal and abatement of public health nuisances, and the remedies available to property owners or occupants apply to this subdivision.\n(e) Upon the proper removal and remediation of any property used as a clandestine lab site, the contractor shall verify to the property owner and the applicable authority that issued the order under paragraph (c) that the work was completed according to the Department of Health's clandestine drug labs general cleanup guidelines and best practices. The contractor shall provide the verification to the property owner and the applicable authority within five days from the completion of the remediation. Following this, the applicable authority shall vacate its order.\n(f) If a contractor issues a verification and the property was not remediated according to the Department of Health's clandestine drug labs general cleanup guidelines, the contractor is liable to the property owner for the additional costs relating to the proper remediation of the property according to the guidelines and for reasonable attorney fees for collection of costs by the property owner. An action under this paragraph must be commenced within six years from the date on which the verification was issued by the contractor.\n(g) If the applicable authority determines under paragraph (c) that a motor vehicle has been contaminated by substances, chemicals, or items of any kind used in the manufacture of methamphetamine or any part of the manufacturing process, or the by-products or degradates of manufacturing methamphetamine and if the authority is able to obtain the certificate of title for the motor vehicle, the authority shall notify the registrar of motor vehicles of this fact and in addition, forward the certificate of title to the registrar. The authority shall also notify the registrar when it vacates its order under paragraph (e).\n(h) The applicable authority issuing an order under paragraph (c) shall record with the county recorder or registrar of titles of the county where the clandestine lab is located an affidavit containing the name of the owner, a legal description of the property where the clandestine lab was located, and a map drawn from available information showing the boundary of the property and the location of the contaminated area on the property that is prohibited from being occupied or used that discloses to any potential transferee:\n(1) that the property, or portion of the property, was the site of a clandestine lab;\n(2) the location, condition, and circumstances of the clandestine lab, to the full extent known or reasonably ascertainable; and\n(3) that the use of the property or some portion of it may be restricted as provided by paragraph (c).\nIf an inaccurate drawing or description is filed, the authority, on request of the owner or another interested person, shall file a supplemental affidavit with a corrected drawing or description.\nIf the authority vacates its order under paragraph (e), the authority shall record an affidavit that contains the recording information of the above affidavit and states that the order is vacated. Upon filing the affidavit vacating the order, the affidavit and the affidavit filed under this paragraph, together with the information set forth in the affidavits, cease to constitute either actual or constructive notice.\n(i) If proper removal and remediation has occurred on the property, an interested party may record an affidavit indicating that this has occurred. Upon filing the affidavit described in this paragraph, the affidavit and the affidavit filed under paragraph (h), together with the information set forth in the affidavits, cease to constitute either actual or constructive notice. Failure to record an affidavit under this section does not affect or prevent any transfer of ownership of the property.\n(j) The county recorder or registrar of titles must record all affidavits presented under paragraph (h) or (i) in a manner that ensures their disclosure in the ordinary course of a title search of the subject property.\n(k) The commissioner of health shall post on the Internet contact information for each local community health services administrator.\n(l) Each local community health services administrator shall maintain information related to property within the administrator's jurisdiction that is currently or was previously subject to an order issued under paragraph (c). The information maintained must include the name of the owner, the location of the property, the extent of the contamination, the status of the removal and remediation work on the property, and whether the order has been vacated. The administrator shall make this information available to the public either upon request or by other means.\n(m) Before signing an agreement to sell or transfer real property, the seller or transferor must disclose in writing to the buyer or transferee if, to the seller's or transferor's knowledge, methamphetamine production has occurred on the property. If methamphetamine production has occurred on the property, the disclosure shall include a statement to the buyer or transferee informing the buyer or transferee:\n(1) whether an order has been issued on the property as described in paragraph (c);\n(2) whether any orders issued against the property under paragraph (c) have been vacated under paragraph (j); or\n(3) if there was no order issued against the property and the seller or transferor is aware that methamphetamine production has occurred on the property, the status of removal and remediation on the property.\n(n) Unless the buyer or transferee and seller or transferor agree to the contrary in writing before the closing of the sale, a seller or transferor who fails to disclose, to the best of their knowledge, at the time of sale any of the facts required, and who knew or had reason to know of methamphetamine production on the property, is liable to the buyer or transferee for:\n(1) costs relating to remediation of the property according to the Department of Health's clandestine drug labs general cleanup guidelines and best practices; and\n(2) reasonable attorney fees for collection of costs from the seller or transferor.\nAn action under this paragraph must be commenced within six years after the date on which the buyer or transferee closed the purchase or transfer of the real property where the methamphetamine production occurred.\n(o) This section preempts all local ordinances relating to the sale or transfer of real property designated as a clandestine lab site.",
	"repealed": false
}