{
	"id": "469.111",
	"url": "https://www.revisor.mn.gov/statutes/cite/469.111",
	"title": "469.111 LOCAL OR AREA AGENCIES; ESTABLISHMENT.",
	"text": "In order to carry out the purposes of sections 469.109 to 469.123, any municipality or group of municipalities may establish a public body, corporate and politic, to be known as the municipal or area redevelopment agency in and for that municipality or group of municipalities. No such agency shall be established until the governing body of the municipality shall by resolution find that the area is a rural area as defined herein, or:\n(1) that there has existed in the area substantial and persistent unemployment for an extended period of time;\n(2) that the rate of unemployment, excluding unemployment due primarily to temporary or seasonal factors, is currently six percent or more as determined by available state or federal statistics; and\n(3) that conditions of chronic unemployment, underdevelopment of natural resources, and economic depression are not likely to be alleviated without public financial or planning assistance to provide the economic opportunity for private, industrial, recreational, commercial, or manufacturing enterprises.\nIn making the determinations under this subdivision, the governing body shall consider, among other relevant factors, the number of low income farm families in the surrounding farm areas, the proportion that such low income families are to the total farm families in such areas, the relationship of the income levels of the families in each such area to the general levels of income in the United States, the current and prospective employment opportunities in each such area, the extent of migration out of the area, and the proportion of the population of each such area which has been receiving public assistance from the federal government or from the state.\nThe governing body of a municipality shall consider such a resolution only after a public hearing thereon after notice appropriate to inform the public given not less than ten nor more than 30 days prior to the date of the hearing. Opportunity to be heard shall be granted to all residents of the municipality and its environs and to all other interested persons. The resolution shall be published in the same manner in which ordinances are published in the municipality.\nWhen the resolution becomes effective it shall be deemed sufficient and conclusive for all purposes.\nWhen the resolution becomes effective the clerk of the municipality shall file a certified copy thereof with the state agency. In any suit, action, or proceeding involving the validity or enforcement of, or relating to any contract of a local agency, the agency shall be conclusively deemed to have become established and authorized to exercise its powers upon that filing. Proof of the resolution and of that filing may be made in any such suit, action, or proceeding by a certificate of the commissioner of employment and economic development.\nA local agency shall be governed by a board of commissioners appointed by the mayor or head of the municipality with the approval of its governing body. The board shall consist of five commissioners who shall be residents of the area of operation of the local agency and shall be appointed initially for terms of one, two, three, four, and five years respectively. Thereafter all commissioners shall be appointed for five-year terms. Each vacancy in an unexpired term shall be filled in the same manner in which the original appointment was made. No public officer or employee shall be eligible to serve as a commissioner, but a commissioner may be a notary public.\nThe commissioners shall hold office until their successors have been appointed and qualified. A certificate of appointment of each commissioner shall be filed with the clerk of the municipality and a certified copy thereof shall be transmitted to the state agency.",
	"repealed": false
}