{
	"id": "473.3993",
	"url": "https://www.revisor.mn.gov/statutes/cite/473.3993",
	"title": "473.3993 LIGHT RAIL TRANSIT FACILITY PLANS; DEFINITIONS.",
	"text": "The definitions in this section apply to sections 473.3993 to 473.3997.\n\"Preliminary design plan\" means a light rail transit plan that identifies:\n(1) preliminary plans for the physical design of facilities, including location, length, and termini of routes; general dimension, elevation, alignment, and character of routes and crossings; whether the track is elevated, on the surface, or below ground; approximate station locations; and related park and ride, parking, and other transportation facilities; and a plan for disability access; and\n(2) preliminary plans for intermodal coordination with bus operations and routes; ridership; capital costs; operating costs and revenues, and sources of funds for operating subsidies; funding for final design, construction, and operation; and an implementation method.\nThe preliminary design plan includes the preliminary or draft environmental impact statement for the light rail transit facilities proposed.\n\"Preliminary engineering plan\" means a light rail transit plan that includes the items in the preliminary design plan for the facilities proposed for construction, but with greater detail and specificity to satisfy final environmental impact statement requirements.\n(a) \"Final design plan\" means a light rail transit plan that includes the items in the preliminary design plan and the preliminary engineering plan for the facilities proposed but with greater detail and specificity needed for construction. The final design plan must include, at a minimum:\n(1) final plans for the physical design of facilities, including the right-of-way definition; environmental impacts and mitigation measures; intermodal coordination with bus operations and routes; and civil engineering plans for vehicles, track, stations, parking, and access, including disability access; and\n(2) final plans for civil engineering for electrification, communication, and other similar facilities; operational rules, procedures, and strategies; capital costs; ridership; operating costs and revenues, and sources of funds for operating subsidies; financing for construction and operation; an implementation method; and other similar matters.\n(b) The final design plan must be stated with sufficient particularity and detail to allow the proposer to begin the acquisition and construction of operable facilities. If a design-build implementation method is proposed, instead of civil engineering plans the final design plan must state detailed design criteria and performance standards for the facilities.\n\"Responsible authority\" means either the Metropolitan Council or the state of Minnesota acting through the commissioner of transportation, as designated by the governor under section 473.3994, subdivision 1a, for a particular light rail transit facility.",
	"repealed": false
}