{
	"id": "61B.25",
	"url": "https://www.revisor.mn.gov/statutes/cite/61B.25",
	"title": "61B.25 PLAN OF OPERATION.",
	"text": "The purpose of the plan of operation is to assure the fair, reasonable, and equitable administration of the association under sections 61B.18 to 61B.32. Amendments to the plan of operation must be submitted to the commissioner and become effective upon the commissioner's written approval or 30 days after submission if the commissioner has not disapproved. If the association fails to submit suitable amendments to the plan, the commissioner shall, after notice and hearing, adopt reasonable rules necessary or advisable to implement sections 61B.18 to 61B.32. The rules shall continue in force until modified by the commissioner or superseded by amendments submitted by the association and approved by the commissioner.\nAll member insurers shall comply with the plan of operation.\nThe plan of operation must, in addition to requirements specified in sections 61B.18 to 61B.32:\n(1) establish procedures for handling the assets of the association;\n(2) establish the amount and method of reimbursing members of the board of directors under section 61B.22;\n(3) establish regular places and times for meetings including telephone conference calls of the board of directors or of the executive committee;\n(4) establish procedures for records to be kept of all financial transactions of the association, its agents, and the board of directors;\n(5) establish procedures for selecting the board of directors;\n(6) establish any additional procedures for assessments under section 61B.24; and\n(7) contain additional provisions necessary or proper for the execution of the powers and duties of the association.\nThe plan of operation may provide that any or all powers and duties of the association, except those under sections 61B.23, subdivision 13, clause (3), and 61B.24, are delegated to a corporation, association, or other organization which performs or will perform functions similar to those of this association, or its equivalent, in two or more states. The corporation, association, or organization shall be reimbursed for any payments made on behalf of the association and shall be paid for its performance of any function of the association. A delegation under this subdivision shall take effect only with the approval of both the board of directors and the commissioner, and may be made only to a corporation, association, or organization which extends protection not substantially less favorable and effective than that provided by sections 61B.18 to 61B.32.",
	"repealed": false
}