{
	"id": "11A.17",
	"url": "https://www.revisor.mn.gov/statutes/cite/11A.17",
	"title": "11A.17 MINNESOTA SUPPLEMENTAL INVESTMENT FUND.",
	"text": "(a) The purpose of the supplemental investment fund is to provide an investment vehicle for the assets of various public retirement plans and funds.\n(b) The state board shall determine and make available investment accounts within the supplemental investment fund. These accounts shall include an appropriate array of diversified investment options for participants of the public retirement plans under subdivision 5.\n(c) The assets of the supplemental investment fund must be invested by the state board in types of investments permitted under section 11A.24.\n(d) The state board shall make available a volunteer firefighter account for the statewide lump-sum volunteer firefighter plan under section 353G.02.\n(a) The assets of the supplemental investment fund consist of the money certified and transmitted to the state board from the participating public retirement plans and funds and from the statewide volunteer firefighter plan under section 353G.08.\n(b) With the exception of the assets of the statewide volunteer firefighter fund, the assets must be used to purchase investment shares in the investment accounts as specified by the plan or fund. The assets of the statewide volunteer firefighter fund must be invested in the volunteer firefighter account.\n(c) These accounts must be valued at least on a monthly basis but may be valued more frequently as determined by the State Board of Investment.\nThe supplemental investment fund shall be managed by the state board.\n[Repealed, 2014 c 296 art 13 s 28]\nAny public retirement plan or fund authorized or required by law to invest its assets in the supplemental investment fund may from time to time as provided by law certify moneys to the state board for the purchase of investment shares in the investment accounts of the supplemental investment account. The state board shall credit each purchase of investment shares to the appropriate participating public retirement plan or fund and shall confirm each purchase in writing to the appropriate plan or fund. Each participating public retirement plan or fund shall maintain adequate records to account for money certified to the supplemental investment fund.\nEach public retirement plan or fund which has certified money to the state board for investment in the supplemental investment fund shall have a participation in each investment account of the fund in which it has money invested. The participation shall be determined by the ratio of the number of shares credited to the public retirement plan or fund to the total number of shares in that account.\nThe state board shall allocate shares in the investment account or accounts at least monthly following the receipt of the funds for purchase of shares from the public retirement plan or fund as specified in the certification. The purchase price for shares shall be determined using the procedure specified in subdivision 9.\nThe state board shall redeem shares in the investment account or accounts on the first business day after the valuation date next following the receipt of the request for redemption of shares from the public retirement plan or fund. The redemption value for shares shall be determined using the procedure specified in subdivision 9. Money representing the value of the redeemed shares shall be transmitted to the public retirement plan or fund making the request.\n(a) The value of shares for each investment account, excluding a money market account, must be determined by dividing the total market value of the securities constituting the respective account by the total number of shares then outstanding in the investment account.\n(b) The value of shares in a money market account must be $1 a share.\nThe state board may specify the required forms for certifications of money for investment and requests for redemption of investment shares and may require the filing of any other documents which it deems necessary.\n[Repealed, 1998 c 390 art 2 s 21 para (a)]\nAnnually, by July 2, the state board shall prepare and shall issue a prospectus for the supplemental investment fund with separate exhibits for each investment account. The exhibit for each account must include its investment objectives, asset allocation, and past investment performance. Upon request, the board shall provide a list of each security in the fund and show the following items, whichever are applicable:\n(1) the purchase price of the security;\n(2) the current market value of the security;\n(3) the current dividend or interest rate of the security;\n(4) the rating of a debt security issued by a nationally recognized rating agency if it is other than a security issued or guaranteed by the United States government.\nThe state board shall transmit sufficient copies of the prospectus to each public retirement plan or fund participating in the supplemental investment account to meet the plan or fund's distribution requirements. The prospectus must be filed with the director of the Legislative Reference Library as provided by section 3.195.\n[Repealed, 1988 c 453 s 12]\n[Repealed, 1988 c 453 s 12]\n[Repealed, 1998 c 390 art 2 s 21 para (a)]",
	"repealed": false
}