{
	"id": "103I.111",
	"url": "https://www.revisor.mn.gov/statutes/cite/103I.111",
	"title": "103I.111 LOCAL AUTHORITY OVER WELLS AND BORINGS.",
	"text": "(a) The commissioner of health may enter into an agreement with a community health board to delegate all or part of the inspection, reporting, and enforcement duties authorized under provisions of this chapter pertaining to permitting, construction, repair, and sealing of wells and elevator borings.\n(b) A community health board may delegate its powers and duties to other community health boards within its jurisdiction. An agreement to delegate powers and duties of a community health board must be approved by the commissioner and is subject to subdivision 3.\n(a) Agreements authorized under this section must be in writing and signed by the delegating authority and the designated agent.\n(b) The agreement must list criteria the delegating authority will use to determine if the designated agent's performance meets appropriate standards and is sufficient to replace performance by the delegating authority.\n(c) The agreement may specify minimum staff requirements and qualifications, set procedures for the assessment of costs, and provide for termination procedures if the delegating authority finds that the designated agent fails to comply with the agreement.\n(d) A designated agent must not perform licensing, inspection, or enforcement duties under the agreement in territory outside its jurisdiction unless approved by the governing body for that territory through a separate agreement.\n(e) The scope of agreements established under this section is limited to duties and responsibilities agreed upon by the parties. The agreement may provide for automatic renewal and for notice of intent to terminate by either party.\n(f) During the life of the agreement, the delegating authority shall not perform duties that the designated agent is required to perform under the agreement, except inspections necessary to determine compliance with the agreement and this section or as agreed to by the parties.\n(g) The delegating authority shall consult with, advise, and assist a designated agent in the performance of its duties under the agreement.\n(h) This section does not alter the responsibility of the delegating authority for the performance of duties specified in law.\nA community health board under a delegation agreement with the commissioner may charge permit and notification fees, including a fee for well sealing, in excess of the fees specified in section 103I.208 if the fees do not exceed the total direct and indirect costs to administer the delegated duties.\nA political subdivision may adopt ordinances to enforce and administer powers and duties delegated under this section. The ordinances may not be inconsistent with or be less restrictive than standards in state law or rule. Ordinances adopted by the governing body of a statutory or home rule charter city or town may not be inconsistent with or be less restrictive than ordinances adopted by the county board. The commissioner shall review ordinances proposed under a delegation agreement. The commissioner shall approve ordinances if the commissioner determines the ordinances are not inconsistent with and not less restrictive than the provisions of this chapter.\nA community health board under a delegation agreement with the commissioner may require permits in lieu of the notifications required under sections 103I.205 and 103I.301.\nNotwithstanding any other law, a political subdivision may not regulate the construction, repair, or sealing of wells or borings unless the commissioner delegates authority under subdivisions 1 and 2.\nThis chapter does not limit the authority of a local unit of government to prohibit mineral exploration within its boundaries, require permits from explorers, or impose reasonable requirements and fees upon explorers, that are consistent with other law.\n(a) The governing body of a county, municipality, statutory or home rule charter city, or town may regulate open wells and recharging basins in a manner not inconsistent with this chapter and rules and may provide penalties for the violations. The use or maintenance of an open well or recharging basin that endangers the safety of a considerable number of persons may be defined as a public nuisance and abated as a public nuisance.\n(b) The abatement of the public nuisance may include covering the open well or recharging basin or surrounding the open well or recharging basin with a protective fence.\nA well or boring that is required to be sealed under section 103I.301 but is not sealed is a public health nuisance. A county may abate the unsealed well or boring with the same authority of a community health board to abate a public health nuisance under section 145A.04, subdivision 8.\n(a) A political subdivision may not require a licensed well contractor to pay a license or registration fee.\n(b) The commissioner of health must provide a political subdivision with a list of licensed well contractors upon request.\nA municipality may regulate all drilling, except well, elevator boring, and exploratory drilling that is subject to the provisions of this chapter, above, in, through, and adjacent to subsurface areas designated for mined underground space development and existing mined underground space. The regulations may prohibit, restrict, control, and require permits for the drilling.",
	"repealed": false
}