{
	"id": "62M.02",
	"url": "https://www.revisor.mn.gov/statutes/cite/62M.02",
	"title": "62M.02 DEFINITIONS.",
	"text": "For the purposes of this chapter, the terms defined in this section have the meanings given them.\n\"Adverse determination\" means a decision by a utilization review organization relating to an admission, extension of stay, or health care service that is partially or wholly adverse to the enrollee, including:\n(1) a decision to deny an admission, extension of stay, or health care service on the basis that it is not medically necessary; or\n(2) an authorization for a health care service that is less intensive than the health care service specified in the original request for authorization.\n\"Appeal\" means a formal request, either orally or in writing, to reconsider an adverse determination regarding an admission, extension of stay, or other health care service.\n\"Attending dentist\" means the dentist with primary responsibility for the dental care provided to an enrollee.\n\"Attending health care professional\" means the health care professional providing care within the scope of the professional's practice and with primary responsibility for the care provided to an enrollee. Attending health care professional shall include only physicians; chiropractors; dentists; mental health professionals as defined in section 245.462, subdivision 18, or 245.4871, subdivision 27; podiatrists; and advanced practice registered nurses.\n\"Authorization\" means a determination by a utilization review organization that an admission, extension of stay, or other health care service has been reviewed and that, based on the information provided, it satisfies the utilization review requirements of the applicable health benefit plan and the health plan company or commissioner will then pay for the covered benefit, provided the preexisting limitation provisions, the general exclusion provisions, and any deductible, co-payment, coinsurance, or other policy requirements have been met.\n\"Claims administrator\" means an entity that reviews and determines whether to pay claims to enrollees or providers based on the contract provisions of the health plan contract. Claims administrators may include insurance companies licensed under chapter 60A to offer, sell, or issue a policy of accident and sickness insurance as defined in section 62A.01; a health service plan licensed under chapter 62C; a health maintenance organization licensed under chapter 62D; a community integrated service network licensed under chapter 62N; an accountable provider network operating under chapter 62T; a fraternal benefit society operating under chapter 64B; a multiple employer welfare arrangement, as defined in section 3 of the Employee Retirement Income Security Act of 1974 (ERISA), United States Code, title 29, section 1103, as amended.\n\"Claimant\" means the enrollee who files a claim for benefits or a provider of services who, pursuant to a contract with a claims administrator, files a claim on behalf of an enrollee or covered person.\n\"Clinical criteria\" means the written policies, rules, clinical protocols, medical protocols, or any other criteria or rationale used by the utilization review organization to determine whether a health care service is authorized.\n\"Commissioner\" means, effective January 1, 2026, for the sections specified in section 62M.01, subdivision 3, paragraph (c), the commissioner of human services, unless otherwise specified.\n\"Concurrent review\" means utilization review conducted during an enrollee's hospital stay or course of treatment and has the same meaning as continued stay review.\n\"Discharge planning\" means the process that assesses an enrollee's need for treatment after hospitalization in order to help arrange for the necessary services and resources to effect an appropriate and timely discharge.\n\"Emergency services\" has the meaning given in section 62Q.55, subdivision 3.\n\"Enrollee\" means:\n(1) an individual covered by a health benefit plan and includes an insured policyholder, subscriber, contract holder, member, covered person, or certificate holder; or\n(2) effective January 1, 2026, for the sections specified in section 62M.01, subdivision 3, paragraph (c), a recipient receiving coverage through fee-for-service under chapters 256B and 256L.\n(a) \"Health benefit plan\" means:\n(1) a policy, contract, or certificate issued by a health plan company for the coverage of medical, dental, or hospital benefits; or\n(2) effective January 1, 2026, for the sections specified in section 62M.01, subdivision 3, paragraph (c), coverage of medical, dental, or hospital benefits through fee-for-service under chapters 256B and 256L, as specified by the commissioner on the agency's public website or through other forms of recipient and provider guidance.\n(b) A health benefit plan does not include coverage that is:\n(1) limited to disability or income protection coverage;\n(2) automobile medical payment coverage;\n(3) supplemental to liability insurance;\n(4) designed solely to provide payments on a per diem, fixed indemnity, or nonexpense incurred basis;\n(5) credit accident and health insurance issued under chapter 62B;\n(6) blanket accident and sickness insurance as defined in section 62A.11;\n(7) accident only coverage issued by a licensed and tested insurance agent; or\n(8) workers' compensation.\n\"Health plan company\" means a health plan company as defined in section 62Q.01, subdivision 4, and includes an accountable provider network operating under chapter 62T.\n\"Inpatient admissions to hospitals\" includes admissions to all acute medical, surgical, obstetrical, psychiatric, and chemical dependency inpatient services at a licensed hospital facility, as well as other licensed inpatient facilities including skilled nursing facilities, residential treatment centers, and free standing rehabilitation facilities.\n\"Medically necessary care\" has the meaning given in section 62Q.53.\n\"Outpatient services\" means procedures or services performed on a basis other than as an inpatient, and includes obstetrical, psychiatric, chemical dependency, dental, and chiropractic services.\n\"Prior authorization\" means utilization review conducted prior to the delivery of a service, including an outpatient service.\n\"Prospective review\" means utilization review conducted prior to an enrollee's inpatient stay.\n\"Provider\" means a licensed health care facility, physician, or other health care professional that delivers health care services to an enrollee.\n\"Quality assessment program\" means a structured mechanism that monitors and evaluates a utilization review organization's program and provides management intervention to support compliance with the requirements of this chapter.\nMS 2018 [Repealed, 2020 c 114 art 1 s 22]\n\"Utilization review\" means the evaluation of the necessity, appropriateness, and efficacy of the use of health care services, procedures, and facilities, by a person or entity other than the attending health care professional, for the purpose of determining the medical necessity of the service or admission. Utilization review also includes prior authorization and review conducted after the admission of the enrollee. It includes situations where the enrollee is unconscious or otherwise unable to provide advance notification. Utilization review does not include a referral or participation in a referral process by a participating provider unless the provider is acting as a utilization review organization.\n\"Utilization review organization\" means an entity including but not limited to an insurance company licensed under chapter 60A to offer, sell, or issue a policy of accident and sickness insurance as defined in section 62A.01; a prepaid limited health service organization issued a certificate of authority and operating under sections 62A.451 to 62A.4528; a health service plan licensed under chapter 62C; a health maintenance organization licensed under chapter 62D; a community integrated service network licensed under chapter 62N; an accountable provider network operating under chapter 62T; a fraternal benefit society operating under chapter 64B; a joint self-insurance employee health plan operating under chapter 62H; a multiple employer welfare arrangement, as defined in section 3 of the Employee Retirement Income Security Act of 1974 (ERISA), United States Code, title 29, section 1103, as amended; a third-party administrator licensed under section 60A.23, subdivision 8, which conducts utilization review and authorizes or makes adverse determinations regarding an admission, extension of stay, or other health care services for a Minnesota resident; effective January 1, 2026, for the sections specified in section 62M.01, subdivision 3, paragraph (c), the commissioner of human services for purposes of delivering services through fee-for-service under chapters 256B and 256L; any other entity that provides, offers, or administers hospital, outpatient, medical, prescription drug, or other health benefits to individuals treated by a health professional under a policy, plan, or contract; or any entity performing utilization review that is affiliated with, under contract with, or conducting utilization review on behalf of, a business entity in this state. Utilization review organization does not include a clinic or health care system acting pursuant to a written delegation agreement with an otherwise regulated utilization review organization that contracts with the clinic or health care system. The regulated utilization review organization is accountable for the delegated utilization review activities of the clinic or health care system.",
	"repealed": false
}