{
	"id": "289A.08",
	"url": "https://www.revisor.mn.gov/statutes/cite/289A.08",
	"title": "289A.08 FILING REQUIREMENTS FOR INDIVIDUAL INCOME, FIDUCIARY INCOME, CORPORATE FRANCHISE, MINING COMPANY, AND ENTERTAINMENT TAXES.",
	"text": "(a) A taxpayer must file a return for each taxable year the taxpayer is required to file a return under section 6012 of the Internal Revenue Code or meets the requirements under paragraph (d) to file a return, except that:\n(1) an individual who is not a Minnesota resident for any part of the year is not required to file a Minnesota income tax return if the individual's gross income derived from Minnesota sources as determined under sections 290.081, paragraph (a), and 290.17, is less than the filing requirements for a single individual who is a full year resident of Minnesota;\n(2) an individual who is a Minnesota resident is not required to file a Minnesota income tax return if the individual's gross income derived from Minnesota sources as determined under section 290.17, less the subtractions allowed under section 290.0132, subdivisions 12 and 15, is less than the filing requirements for a single individual who is a full-year resident of Minnesota.\n(b) The decedent's final income tax return, and other income tax returns for prior years where the decedent had gross income in excess of the minimum amount at which an individual is required to file and did not file, must be filed by the decedent's personal representative, if any. If there is no personal representative, the return or returns must be filed by the transferees, as defined in section 270C.58, subdivision 3, who receive property of the decedent.\n(c) The term \"gross income,\" as it is used in this section, has the same meaning given it in section 290.01, subdivision 20.\n(d) The commissioner of revenue must annually determine the gross income levels at which individuals are required to file a return for each taxable year based on the amounts allowed as a deduction under section 290.0123.\n(e) Notwithstanding paragraph (a), an individual must file a Minnesota income tax return for each taxable year that the taxpayer has made an election to receive advance payments of the child tax credit under section 290.0661, subdivision 8.\n(a) The trustee or other fiduciary of property held in trust must file a return with respect to the taxable net income of the trust or estate if it exceeds an amount determined by the commissioner and if the trust belongs to the class of taxable persons.\n(b) The receivers, trustees in bankruptcy, or assignees operating the business or property of a taxpayer must file a return with respect to the taxable net income of the taxpayer if a return is required.\n(a) A corporation that is subject to the state's jurisdiction to tax under section 290.014, subdivision 5, must file a return.\n(b) Members of a unitary business that are required to file a combined report on one return must designate a member of the unitary business to be responsible for tax matters, including the filing of returns, the payment of taxes, additions to tax, penalties, interest, or any other payment, and for the receipt of refunds of taxes or interest paid in excess of taxes lawfully due. The designated member must be a member of the unitary business that is filing the single combined report and either:\n(1) a corporation that is subject to the taxes imposed by chapter 290; or\n(2) a corporation that is not subject to the taxes imposed by chapter 290:\n(i) Such corporation consents by filing the return as a designated member under this clause to remit taxes, penalties, interest, or additions to tax due from the members of the unitary business subject to tax, and receive refunds or other payments on behalf of other members of the unitary business. The member designated under this clause is a \"taxpayer\" for the purposes of this chapter and chapter 270C, and is liable for any liability imposed on the unitary business under this chapter and chapter 290.\n(ii) If the state does not otherwise have the jurisdiction to tax the member designated under this clause, consenting to be the designated member does not create the jurisdiction to impose tax on the designated member, other than as described in item (i).\n(iii) The member designated under this clause must apply for a business tax account identification number.\n(c) The commissioner shall adopt rules for the filing of one return on behalf of the members of an affiliated group of corporations that are required to file a combined report. All members of an affiliated group that are required to file a combined report must file one return on behalf of the members of the group under rules adopted by the commissioner.\n(d) If a corporation claims on a return that it has paid tax in excess of the amount of taxes lawfully due, that corporation must include on that return information necessary for payment of the tax in excess of the amount lawfully due by electronic means.\nAn exempt organization that is subject to tax on unrelated business income under section 290.05, subdivision 3, must file a return for each taxable year in which the organization is required to file a return under section 6012 of the Internal Revenue Code because of the receipt of unrelated business income. If an organization is required to file a return under federal law but has no federal tax liability for the taxable year, the commissioner may provide that the filing requirement under this paragraph is satisfied by filing a copy of the taxpayer's federal return.\nA return under this section must cover a 12-month period, except in the following cases:\n(1) A return made by or for a taxpayer in existence for less than the whole of a taxable year must cover the part of the taxable year the taxpayer was in existence;\n(2) A taxpayer who, in keeping books, regularly computes income on the basis of an annual period that varies from 52 to 53 weeks and ends always on the same day of the week, and ends always (i) on the date that day of the week last occurs in a calendar month or (ii) on the date that day of the week falls that is nearest to the last day of a calendar month, may compute the taxpayer's net income and taxable net income on the basis of that annual period in accordance with rules prescribed by the commissioner. If the effective date or the applicability of a provision of this chapter or chapter 290 is expressed in terms of taxable years beginning or ending with reference to a named date that is the first or last day of a month, a taxable year must be treated as beginning with the first day of the calendar month beginning nearest to the first day of that taxable year, or as ending with the last day of the calendar month ending nearest to the last day of that taxable year, as the case may be;\n(3) A taxpayer who changes from one taxable year to another must make a return for the fractional parts of the year, under section 290.32.\nIndividuals who are married to each other must file a joint Minnesota income tax return if they filed a joint federal income tax return. If the spouses have elected to file separate federal income tax returns, they must file separate Minnesota income tax returns. This election to file a joint or separate return must be changed if they change their election for federal purposes. In the event taxpayers desire to change their election, the change must be done in the manner and on the form prescribed by the commissioner.\nThe determination of whether an individual is married shall be made under the provisions of section 7703 of the Internal Revenue Code.\n(a) The commissioner may allow a partnership with nonresident partners to file a composite return and to pay the tax on behalf of nonresident partners who have no other Minnesota source income. This composite return must include the names, addresses, Social Security numbers, income allocation, and tax liability for the nonresident partners electing to be covered by the composite return.\n(b) The computation of a partner's tax liability must be determined by multiplying the income allocated to that partner by the highest rate used to determine the tax liability for individuals under section 290.06, subdivision 2c. Nonbusiness deductions, standard deductions, or personal exemptions are not allowed. The computation of a partner's net investment income tax liability must be computed under section 290.033.\n(c) The partnership must submit a request to use this composite return filing method for nonresident partners. The requesting partnership must file a composite return in the form prescribed by the commissioner of revenue. The filing of a composite return is considered a request to use the composite return filing method.\n(d) The electing partner must not have any Minnesota source income other than the income from the partnership, other electing partnerships, and other qualifying entities electing to file and pay the pass-through entity tax under subdivision 7a. If it is determined that the electing partner has other Minnesota source income, the inclusion of the income and tax liability for that partner under this provision will not constitute a return to satisfy the requirements of subdivision 1. The tax paid for the individual as part of the composite return is allowed as a payment of the tax by the individual on the date on which the composite return payment was made. If the electing nonresident partner has no other Minnesota source income, filing of the composite return is a return for purposes of subdivision 1.\n(e) This subdivision does not negate the requirement that an individual pay estimated tax if the individual's liability would exceed the requirements set forth in section 289A.25. The individual's liability to pay estimated tax is, however, satisfied when the partnership pays composite estimated tax in the manner prescribed in section 289A.25.\n(f) If an electing partner's share of the partnership's gross income from Minnesota sources is less than the filing requirements for a nonresident under this subdivision, the tax liability is zero. However, a statement showing the partner's share of gross income must be included as part of the composite return.\n(g) The election provided in this subdivision is only available to a partner who has no other Minnesota source income and who is either (1) a full-year nonresident individual or (2) a trust or estate that does not claim a deduction under either section 651 or 661 of the Internal Revenue Code.\n(h) A corporation defined in section 290.9725 and its nonresident shareholders may make an election under this paragraph. The provisions covering the partnership apply to the corporation and the provisions applying to the partner apply to the shareholder.\n(i) Estates and trusts distributing current income only and the nonresident individual beneficiaries of the estates or trusts may make an election under this paragraph. The provisions covering the partnership apply to the estate or trust. The provisions applying to the partner apply to the beneficiary.\n(j) For the purposes of this subdivision, \"income\" has the meaning given in section 290.01, subdivision 19, paragraph (h).\n(a) For the purposes of this subdivision, the following terms have the meanings given:\n(1) \"income\" has the meaning given in section 290.01, subdivision 19, paragraph (i). The income of a resident qualifying owner of a qualifying entity that is a partnership or limited liability company taxed as a partnership under the Internal Revenue Code is not subject to allocation outside this state as provided for resident individuals under section 290.17, subdivision 1, paragraph (a). The income of a nonresident qualifying owner of a qualifying entity and the income of a resident qualifying owner of a qualifying entity that is an S corporation, including a qualified subchapter S subsidiary organized under section 1361(b)(3)(B) of the Internal Revenue Code, are allocated and assigned to this state as provided for nonresident partners and shareholders under sections 290.17, 290.191, and 290.20;\n(2) \"qualifying entity\" means a partnership, limited liability company taxed as a partnership or S corporation, or S corporation including a qualified subchapter S subsidiary organized under section 1361(b)(3)(B) of the Internal Revenue Code that has at least one qualifying owner. Qualifying entity does not include a publicly traded partnership, as defined in section 7704 of the Internal Revenue Code; and\n(3) \"qualifying owner\" means:\n(i) a resident or nonresident individual or estate that is a partner, member, or shareholder of a qualifying entity;\n(ii) a resident or nonresident trust that is a shareholder of a qualifying entity that is an S corporation; or\n(iii) a disregarded entity that has a qualifying owner as its single owner.\n(b) For taxable years beginning after December 31, 2020, a qualifying entity may elect to file a return and pay the pass-through entity tax imposed under paragraph (c). The election:\n(1) must be made on or before the due date or extended due date of the qualifying entity's pass-through entity tax return;\n(2) must exclude partners, members, shareholders, or owners who are not qualifying owners;\n(3) may only be made by qualifying owners who collectively hold more than 50 percent of the ownership interests in the qualifying entity held by qualifying owners;\n(4) is binding on all qualifying owners who have an ownership interest in the qualifying entity; and\n(5) once made is irrevocable for the taxable year.\n(c) Subject to the election in paragraph (b), a pass-through entity tax is imposed on a qualifying entity in an amount equal to the sum of the tax liability of each qualifying owner.\n(d) The amount of a qualifying owner's tax liability under paragraph (c) is the amount of the qualifying owner's income multiplied by the highest tax rate for individuals under section 290.06, subdivision 2c. The computation of a qualifying owner's net investment income tax liability must be computed under section 290.033. When making this determination:\n(1) nonbusiness deductions, standard deductions, or personal exemptions are not allowed; and\n(2) a credit or deduction is allowed only to the extent allowed to the qualifying owner.\n(e) The amount of each credit and deduction used to determine a qualifying owner's tax liability under paragraph (d) must also be used to determine that qualifying owner's income tax liability under chapter 290.\n(f) This subdivision does not negate the requirement that a qualifying owner pay estimated tax if the qualifying owner's tax liability would exceed the requirements set forth in section 289A.25. The qualifying owner's liability to pay estimated tax on the qualifying owner's tax liability as determined under paragraph (d) is, however, satisfied when the qualifying entity pays estimated tax in the manner prescribed in section 289A.25 for composite estimated tax.\n(g) A qualifying owner's adjusted basis in the interest in the qualifying entity, and the treatment of distributions, is determined as if the election to pay the pass-through entity tax under paragraph (b) is not made.\n(h) To the extent not inconsistent with this subdivision, for purposes of this chapter, a pass-through entity tax return must be treated as a composite return and a qualifying entity filing a pass-through entity tax return must be treated as a partnership filing a composite return.\n(i) The provisions of subdivision 17 apply to the election to pay the pass-through entity tax under this subdivision.\n(j) If a nonresident qualifying owner of a qualifying entity making the election to file and pay the tax under this subdivision has no other Minnesota source income, filing of the pass-through entity tax return is a return for purposes of subdivision 1, provided that the nonresident qualifying owner must not have any Minnesota source income other than the income from the qualifying entity, other electing qualifying entities, and other partnerships electing to file a composite return under subdivision 7. If it is determined that the nonresident qualifying owner has other Minnesota source income, the inclusion of the income and tax liability for that owner under this provision will not constitute a return to satisfy the requirements of subdivision 1. The tax paid for the qualifying owner as part of the pass-through entity tax return is allowed as a payment of the tax by the qualifying owner on the date on which the pass-through entity tax return payment was made.\n(k) Once a credit is claimed by a qualifying owner under section 290.06, subdivision 40, a qualifying entity cannot receive a refund for tax paid under this subdivision for any amounts claimed under that section by the qualifying owners. Once a credit is claimed under section 290.06, subdivision 40, any refund must be claimed in conjunction with a return filed by the qualifying owner.\n(l) This subdivision expires at the same time and on the same terms as section 164(b)(6)(B) of the Internal Revenue Code, except that the expiration of this subdivision does not affect the commissioner's authority to audit or power of examination and assessments for credits claimed under this section.\nAn entertainment entity subject to the tax imposed by section 290.9201 shall file an annual return for the calendar year with the commissioner.\n[Repealed, 1993 c 375 art 2 s 36]\nThe return must specifically set forth the items of gross income, deductions, credits against the tax, and any other data necessary for computing the amount of any item required for determining the amount of the net income tax liability. The return must be filed in the form and manner the commissioner prescribes. The filing of a return required under this section is considered an assessment. The return must be signed by the taxpayer in the case of an individual's return, by both spouses in the case of a joint return, by someone designated by the corporation, partnership, entertainment entity, or mining company in the case of a corporate, composite income, entertainment, or occupation tax return, and by the trustee, receiver, or other fiduciary in the case of a fiduciary's return.\n(a) The return must state:\n(1) the name of the taxpayer, or taxpayers, if the return is a joint return, and the address of the taxpayer in the same name or names and same address as the taxpayer has used in making the taxpayer's income tax return to the United States;\n(2) the date or dates of birth of the taxpayer or taxpayers;\n(3) the Social Security number of the taxpayer, or taxpayers, if a Social Security number has been issued by the United States with respect to the taxpayers; and\n(4) the amount of the taxable income of the taxpayer as it appears on the federal return for the taxable year to which the Minnesota state return applies.\n(b) The taxpayer must attach to the taxpayer's Minnesota state income tax return a copy of the federal income tax return that the taxpayer has filed or is about to file for the period.\n[Repealed, 1993 c 375 art 2 s 36]\nThe commissioner shall provide a long form individual income tax return and may provide a short form individual income tax return. The returns shall be in a form that is consistent with the provisions of chapter 290, notwithstanding any other law to the contrary. The nongame wildlife checkoff provided in section 290.431 and the dependent care credit provided in section 290.067 must be included on the short form. The commissioner must provide information on local use taxes in the individual income tax instruction booklet. The commissioner must provide this information in the same section of the booklet that provides information on the state use tax.\nThe commissioner shall insert securely in the individual income tax return form or instruction booklet distributed for an odd-numbered year a voter registration form, returnable to the secretary of state. The form shall be designed according to rules adopted by the secretary of state. This requirement applies to forms and booklets supplied to post offices, banks, and other outlets, as well as to those mailed directly to taxpayers.\nA mining company must file an annual return.\n(a) A \"tax preparer\" or \"preparer,\" as defined in section 270C.445, subdivision 2, who is a tax return preparer for purposes of section 6011(e) of the Internal Revenue Code, and who reasonably expects to prepare more than ten Minnesota individual income, corporate franchise, S corporation, partnership, or fiduciary income tax returns for the prior year must file all Minnesota individual income, corporate franchise, S corporation, partnership, or fiduciary income tax returns prepared for that year by electronic means.\n(b) Paragraph (a) does not apply to a return if the taxpayer has indicated on the return that the taxpayer did not want the return filed by electronic means.\n(c) For each return that is not filed electronically by a tax preparer or preparer under this subdivision, including returns filed under paragraph (b), a paper filing fee of $5 is imposed upon the preparer. The fee is collected from the preparer in the same manner as income tax. The fee does not apply to returns that the commissioner requires to be filed in paper form.\nThe commissioner shall prescribe the content, format, and manner of the returns and other documents pursuant to section 270C.30. This does not authorize the commissioner to require individual income taxpayers to file individual income tax returns electronically.\n(a) The commissioner must offer all individual income taxpayers the opportunity to elect to receive information about a taxpayer receipt via email or United States mail. In the manner selected by the taxpayer, the commissioner must provide the taxpayer with information about how to access the taxpayer receipt website established under section 16A.067. The commissioner must allow a taxpayer to elect not to receive information about the receipt.\n(b) Both the long and short forms described in subdivision 13 must include the opportunity to elect to receive information about the receipt.",
	"repealed": false
}