{
	"id": "428A.03",
	"url": "https://www.revisor.mn.gov/statutes/cite/428A.03",
	"title": "428A.03 SERVICE CHARGE AUTHORITY; NOTICE, HEARING REQUIREMENT.",
	"text": "Service charges may be imposed by the city within the special service district at a rate or amount sufficient to produce the revenues required to provide special services in the district. To determine the appropriate rate for a service charge based on net tax capacity, taxable property or net tax capacity must be determined without regard to captured or original net tax capacity under section 469.177 or to the distribution or contribution value under section 473F.08. Service charges may not be imposed to finance a special service if the service is ordinarily provided by the city from its general fund revenues unless the service is provided in the district at an increased level. In that case, a service charge may be imposed only in the amount needed to pay for the increased level of service. A service charge may not be imposed on the receipts from the sale of intoxicating liquor, food, or lodging. Before the imposition of service charges in a district, for each calendar year, a hearing must be held under section 428A.02 and notice must be given and must be mailed to any owner, individual, or business organization subject to a service charge. For purposes of this section, the notice shall also include:\n(1) a statement that all interested persons will be given an opportunity to be heard at the hearing regarding a proposed service charge;\n(2) the estimated cost of improvements to be paid for in whole or in part by service charges imposed under this section, the estimated cost of operating and maintaining the improvements during the first year and upon completion of the improvements, the proposed method and source of financing the improvements, and the annual cost of operating and maintaining the improvements;\n(3) the proposed rate or amount of the proposed service charge to be imposed in the district during the calendar year and the nature and character of special services to be rendered in the district during the calendar year in which the service charge is to be collected; and\n(4) a statement that the petition requirements of section 428A.08 have either been met or do not apply to the proposed service charge.\nWithin six months of the public hearing, the city may adopt a resolution imposing a service charge within the district not exceeding the amount or rate expressed in the notice issued under this section.\nUpon a request of the city, the county auditor must certify the most recent net tax capacity of the taxable property subject to service charges within the special service district.\nProperty exempt from taxation by section 272.02 is exempt from any service charges based on net tax capacity imposed under sections 428A.01 to 428A.10.\nService charges imposed under sections 428A.01 to 428A.10 are not included in the calculation of levies or limits on levies imposed under law or charter.\nService charges may not be imposed on a unit in a common interest community for a service that is ordinarily provided by the unit's owner's association unless an increased level of service is provided by the special service district. A unit in a common interest community is defined under section 515B.1-103, clause (10), and also includes common interest communities under chapters 515 and 515A that were established prior to the enactment of the Minnesota Common Interest Ownership Act under chapter 515B.",
	"repealed": false
}