{
	"id": "352F.04",
	"url": "https://www.revisor.mn.gov/statutes/cite/352F.04",
	"title": "352F.04 AUGMENTATION RATES FOR TERMINATED PRIVATIZED EMPLOYEES; RETURN TO COVERAGE.",
	"text": "The deferred annuity of a terminated hospital employee is subject to augmentation under Minnesota Statutes 1994, section 352.72, subdivision 2, except that the rate of augmentation to be applied each January 1 is set by this subdivision. For augmentation through December 31, 2018, the rate of augmentation is set under Minnesota Statutes 2016, section 352.04, subdivision 1. For augmentation beginning January 1, 2019, the rate of augmentation is the following:\nAugmentation for each year is effective as of January 1 of that year.\nThe enhanced augmentation rates specified in subdivision 1 do not apply if the terminated hospital employee:\n(1) became covered again by a retirement plan enumerated in section 356.30, subdivision 3, on or before June 30, 2015; or\n(2) begins receipt of a retirement annuity under chapter 352 before age 62 while employed by the employer which assumed operations of the medical facility or other public employing unit or purchased the medical facility or other public employing unit.\n(a) If a terminated hospital employee becomes covered by a retirement plan enumerated in section 356.30, subdivision 3, the employee shall be entitled to whichever of the following annuities produces the highest monthly payment:\n(1) the deferred annuity and augmentation to which the employee would have been entitled under subdivision 1 reduced by the dollar amount of any annuity earned under any enumerated retirement plan after the effective date defined in section 352F.02, subdivision 3;\n(2) a combined service annuity calculated under section 356.30; or\n(3) an annuity calculated under section 352.72 for coverage by more than one retirement system using the augmentation rates in section 352.72, subdivision 2, paragraph (a).\n(b) This subdivision applies to any terminated hospital employee who begins to receive a retirement annuity under chapter 352 on or after July 1, 2015.",
	"repealed": false
}