{
	"id": "45.30",
	"url": "https://www.revisor.mn.gov/statutes/cite/45.30",
	"title": "45.30 CONTINUING EDUCATION.",
	"text": "Continuing education consists of approved courses that impart appropriate and related knowledge in the field for which approval is requested. The burden of demonstrating that courses impart appropriate and related knowledge is upon the person seeking approval or credit. The commissioner may approve any educational offering approved by the regulatory agency of another state if it does not conflict with Minnesota law, and any courses leading to a nationally recognized professional designation used by licensees regulated by this chapter.\nCourse examinations are required for interactive Internet courses but are not required for other continuing education courses unless they are required by the education provider. When certain prelicense courses are permitted to be used for continuing education, the licensee must pass the same examination as is required for those taking the course for prelicensing.\nTextbooks are not required to be used for continuing education courses unless the course is also approved as a prelicense course. If textbooks are not used, students are to be provided with a syllabus containing, at a minimum, the course title, the times and dates of the course offering, the names and addresses or telephone numbers of the course coordinator and instructor, and a detailed outline of the subject materials to be covered. Any written or printed material given to students must be of readable quality and contain accurate and current information.\n(a) Upon completion of approved courses, students must earn one hour of continuing education credit for each hour approved by the commissioner. Continuing education courses must be attended in their entirety in order to receive credit for the number of approved hours.\n(b) Qualified instructors will earn three hours of continuing education credit for each classroom hour of approved instruction that they deliver (1) independently, or (2) as part of a team presentation in a course of two hours or less, if they attend the course in its entirety. For licensees other than appraisers, no more than one-half of the continuing education hours required for renewal of a license may be earned as a qualified instructor at the rate of three hours of continuing education credit for each classroom hour of approved instruction. For licensed appraisers, no more than one-half of the continuing education hours required for renewal of a license may be earned as a qualified instructor. No credit will be earned if the licensee has previously obtained credit for the same course as either a student or instructor during the same licensing period.\n(c) A licensee must not receive credit for more than eight hours of continuing education in one day.\nThe following courses will not be approved for credit:\n(1) courses designed solely to prepare students for passing a license examination;\n(2) courses in mechanical office or business skills, including typing, speed reading, or other machines or equipment. Computer skills courses are allowed, if appropriate and related to the industry to which the courses are directed;\n(3) courses in sales promotion, including meetings held in conjunction with the general business of the licensee;\n(4) courses in motivation, salesmanship, psychology, time management, or communication, except as prescribed in prelicense training;\n(5) courses related to office management or intended to improve the operation of the licensee's business; and\n(6) courses that are primarily intended to impart knowledge of specific products of specific companies, if the use of the product or products relates to the sales promotion or marketing of one or more of the products discussed.\n(a) Courses must be approved by the commissioner in advance. A course that is required by federal criteria or a reciprocity agreement to receive a substantive review will be approved or disapproved on the basis of its compliance with the provisions of laws and rules relating to the appropriate industry. At the commissioner's discretion, a course that is not required by federal criteria or a reciprocity agreement to receive a substantive review may be approved based on a qualified provider's certification on a form specified by the commissioner that the course complies with the provisions of this chapter and the laws and rules relating to the appropriate industry. For the purposes of this section, a \"qualified provider\" is one of the following: (1) a degree-granting institution of higher learning located within this state; (2) a private school licensed by the Minnesota Office of Higher Education; or (3) when conducting courses for its members, a bona fide trade association that staffs and maintains in this state a physical location that contains course and student records and that has done so for not less than three years. The commissioner may review any approved course and may cancel its approval with regard to all future offerings. The commissioner must make the final determination as to accreditation and assignment of credit hours for courses. Courses must be at least one hour in length, except courses for real estate appraisers must be at least two hours in length.\nApproval will not include time spent on meals or other unrelated activities.\n(b) Courses must be submitted at least 30 days before the initial proposed course offering.\n(c) Approval must be granted for a subsequent offering of identical continuing education courses without requiring a new application. The commissioner must deny future offerings of courses if they are found not to be in compliance with the laws relating to course approval.\n(d) When either the content of an approved course or its method of instruction changes, the course is no longer approved for license education credit. A new application must be submitted for the changed course if the education provider intends to offer it for license education credit.\nApproved courses leading to the achievement or maintenance of a professional designation listed in section 60K.36, subdivision 4a, qualify for continuing education.\n(a) All course offerings must be open to any interested individuals. Access may be restricted by the education provider based on class size only, except that access to a course offering sponsored by, offered by, or affiliated with an insurance company or agency may be restricted to agents of the company or agency. Courses must not be approved if attendance is restricted to any particular group of people, except for company-sponsored courses allowed by statute.\n(b) Notwithstanding paragraph (a), attendance at approved courses leading to the achievement or maintenance of a professional designation listed in section 60K.36, subdivision 4a, may be limited to those producers seeking the professional designation or those producers who have met prerequisite coursework for the course offering. Courses leading to the achievement or maintenance of a professional designation listed in section 60K.36, subdivision 4a, may require a prerequisite such as candidacy for the designation or sequential coursework relating to the attainment or maintenance of the designation. A course leading to the achievement or maintenance of a professional designation listed in section 60K.36, subdivision 4a, is not considered to be company sponsored unless it is provided by an insurance company.",
	"repealed": false
}