{
	"id": "79.561",
	"url": "https://www.revisor.mn.gov/statutes/cite/79.561",
	"title": "79.561 DISAPPROVAL OF RATES OR RATING PLANS.",
	"text": "The commissioner may disapprove a rate and rating plan or amendment thereto prior to its effective date, as provided under section 79.56, subdivision 1, if the commissioner determines that it is excessive, inadequate, or unfairly discriminatory. If the commissioner disapproves any rate or rating plan filing or amendment thereto, the commissioner shall advise the filing insurer what rate and rating plan the commissioner has reason to believe would be in compliance with section 79.55, and the reasons for that determination. An insurer may not implement a rate and rating plan or amendment thereto which has been disapproved under this subdivision. If the commissioner disapproves any rate and rating plan filing or amendment thereto, an insurer may use its current rate and rating plan for writing any workers' compensation insurance in this state. Following any disapproval, the commissioner and insurer may reach agreement on a rate or rating plan filing or amendment thereto. Notwithstanding any law to the contrary, in such cases, the rate or rating plan filing or amendment thereto may be implemented by the insurer immediately.\nIf an insurer's rate or rating plan filing or amendment thereto is disapproved under subdivision 1, the insurer may request a contested case hearing under chapter 14. The insurer shall have the burden of proof to justify that its rate and rating plan or amendment thereto is in compliance with section 79.55. The hearing must be scheduled promptly and in no case later than three months from the date of disapproval or else the rate and rating plan or amendment thereto shall be considered effective and may be implemented by the insurer. A determination pursuant to chapter 14 must be made within 90 days following the closing of the hearing record.\nThe commissioner may retain consultants, including a consulting actuary or other experts, that the commissioner determines necessary for purposes of this chapter. The salary limit set by section 43A.17 does not apply to a consulting actuary retained under this subdivision. A consulting actuary shall be a fellow in the casualty actuarial society and shall have demonstrated experience in workers' compensation insurance ratemaking. Any individual not so qualified shall not render an opinion or testify on actuarial aspects of a filing, including but not limited to, data quality, loss development, and trending. The commissioner may determine the costs necessary for implementing and conducting a contested case hearing under subdivision 2, including, but not limited to, retaining any consulting actuaries and experts, and those costs shall be reimbursed by the special compensation fund.",
	"repealed": false
}