{
	"id": "126C.40",
	"url": "https://www.revisor.mn.gov/statutes/cite/126C.40",
	"title": "126C.40 CAPITAL LEVIES.",
	"text": "(a) When an independent or a special school district or a group of independent or special school districts finds it economically advantageous to rent or lease a building or land for any instructional purposes or for school storage or furniture repair, and it determines that the operating capital revenue authorized under section 126C.10, subdivision 13, is insufficient for this purpose, it may apply to the commissioner for permission to make an additional capital expenditure levy for this purpose. An application for permission to levy under this subdivision must contain financial justification for the proposed levy, the terms and conditions of the proposed lease, and a description of the space to be leased and its proposed use.\n(b) The criteria for approval of applications to levy under this subdivision must include: the reasonableness of the price, the appropriateness of the space to the proposed activity, the feasibility of transporting pupils to the leased building or land, conformity of the lease to the laws and rules of the state of Minnesota, and the appropriateness of the proposed lease to the space needs and the financial condition of the district. The commissioner must not authorize a levy under this subdivision in an amount greater than the cost to the district of renting or leasing a building or land for approved purposes. The proceeds of this levy must not be used for custodial or other maintenance services. A district may not levy under this subdivision for the purpose of leasing or renting a district-owned building or site to itself.\n(c) For agreements finalized after July 1, 1997, a district may not levy under this subdivision for the purpose of leasing: (1) a newly constructed building used primarily for regular kindergarten, elementary, or secondary instruction; or (2) a newly constructed building addition or additions used primarily for regular kindergarten, elementary, or secondary instruction that contains more than 20 percent of the square footage of the previously existing building.\n(d) Notwithstanding paragraph (b), a district may levy under this subdivision for the purpose of leasing or renting a district-owned building or site to itself only if the amount is needed by the district to make payments required by a lease purchase agreement, installment purchase agreement, or other deferred payments agreement authorized by law, and the levy meets the requirements of paragraph (c). A levy authorized for a district by the commissioner under this paragraph may be in the amount needed by the district to make payments required by a lease purchase agreement, installment purchase agreement, or other deferred payments agreement authorized by law, provided that any agreement include a provision giving the school districts the right to terminate the agreement annually without penalty.\n(e) The total levy under this subdivision for a district for any year must not exceed $212 times the adjusted pupil units for the fiscal year to which the levy is attributable.\n(f) For agreements for which a review and comment have been submitted to the Department of Education after April 1, 1998, the term \"instructional purpose\" as used in this subdivision excludes expenditures on stadiums.\n(g) The commissioner of education may authorize a school district to exceed the limit in paragraph (e) if the school district petitions the commissioner for approval. The commissioner shall grant approval to a school district to exceed the limit in paragraph (e) for not more than five years if the district meets the following criteria:\n(1) the school district has been experiencing pupil enrollment growth in the preceding five years;\n(2) the purpose of the increased levy is in the long-term public interest;\n(3) the purpose of the increased levy promotes colocation of government services; and\n(4) the purpose of the increased levy is in the long-term interest of the district by avoiding over construction of school facilities.\n(h) A school district that is a member of an intermediate school district or other cooperative unit under section 123A.24, subdivision 2, or a joint powers district under section 471.59 may include in its authority under this section the costs associated with leases of administrative and classroom space for programs of the intermediate school district or other cooperative unit under section 123A.24, subdivision 2, or joint powers district under section 471.59. This authority must not exceed $65 times the adjusted pupil units of the member districts. This authority is in addition to any other authority authorized under this section. The intermediate school district, other cooperative unit, or joint powers district may specify which member districts will levy for lease costs under this paragraph.\n(i) Notwithstanding paragraph (a), a district may levy under this subdivision for the purpose of leasing administrative space if the district can demonstrate to the satisfaction of the commissioner that the lease cost for the administrative space is no greater than the lease cost for instructional space that the district would otherwise lease. The commissioner must deny this levy authority unless the district passes a resolution stating its intent to lease instructional space under this section if the commissioner does not grant authority under this paragraph. The resolution must also certify that the lease cost for administrative space under this paragraph is no greater than the lease cost for the district's proposed instructional lease.\n(j) Notwithstanding paragraph (a), a district may levy under this subdivision for the district's proportionate share of deferred maintenance expenditures for a district-owned building or site leased to a cooperative unit under section 123A.24, subdivision 2, or a joint powers district under section 471.59 for any instructional purposes or for school storage.\nA district may annually levy the amount needed to make payments required by a lease purchase agreement, installment purchase agreement, or other deferred payment agreement authorized by Minnesota Statutes 1989 Supplement, section 465.71, if:\n(1) the agreement was approved by the commissioner before July 1, 1990, according to Minnesota Statutes 1989 Supplement, section 275.125, subdivision 11d; or\n(2) the district levied in 1989 for the payments.\nA district that has an agreement according to section 123A.30 or 123A.32 may levy for the repair costs, as approved by the department of a building located in another district that is a party to the agreement.\n[Expired]\nFor energy loans approved after March 1, 1998, under sections 216C.37 and 298.292 to 298.298, school districts must annually transfer from the general fund to the debt redemption fund the amount sufficient to pay interest and principal on the loans.\n(a) Upon application to, and approval by, the commissioner in accordance with the procedures and limits in subdivision 1, paragraphs (a) and (b), a district, as defined in this subdivision, may:\n(1) purchase real or personal property under an installment contract or may lease real or personal property with an option to purchase under a lease purchase agreement, by which installment contract or lease purchase agreement title is kept by the seller or vendor or assigned to a third party as security for the purchase price, including interest, if any; and\n(2) annually levy the amounts necessary to pay the district's obligations under the installment contract or lease purchase agreement.\n(b) The obligation created by the installment contract or the lease purchase agreement must not be included in the calculation of net debt for purposes of section 475.53, and does not constitute debt under other law. An election is not required in connection with the execution of the installment contract or the lease purchase agreement.\n(c) The proceeds of the levy authorized by this subdivision must not be used to acquire a facility to be primarily used for athletic or school administration purposes.\n(d) For the purposes of this subdivision, \"district\" means:\n(1) Special School District No. 1, Minneapolis, Independent School District No. 625, St. Paul, Independent School District No. 709, Duluth, or Independent School District No. 535, Rochester, if the district's achievement and integration plan has been determined by the commissioner to be in compliance with Department of Education rules relating to equality of educational opportunity and where the acquisition, as defined in section 475.51, subdivision 7, of property under this subdivision is approved in the form and manner prescribed by the commissioner to contribute to the implementation of the approved achievement and integration plan; or\n(2) other districts eligible for revenue under section 124D.862 if the facility acquired under this subdivision is to be primarily used for a joint program the commissioner determines is being undertaken to implement the districts' approved achievement and integration plan.\n(e) Notwithstanding subdivision 1, the prohibition against a levy by a district to lease or rent a district-owned building to itself does not apply to levies otherwise authorized by this subdivision.\n(f) For the purposes of this subdivision, any references in subdivision 1 to building or land shall include personal property.\n(g) Projects funded under this subdivision that require an expenditure in excess of $500,000 per school site if the school district has a capital loan outstanding, or $2,000,000 per school site if the school district does not have a capital loan outstanding, are subject to review and comment under section 123B.71, subdivision 8, in the form and manner prescribed by the commissioner. Provided no referendum for bonds is required, the school board must discuss the commissioner's determination of a review and comment and the district's approved achievement and integration plan findings at a regular or special school board meeting within 45 days of the commissioner's determination. A school board's failure to comply with the discussion requirement in this paragraph shall not otherwise affect the legality, validity, or binding nature of any school district action or obligation not subject to referendum.",
	"repealed": false
}