{
	"id": "6.581",
	"url": "https://www.revisor.mn.gov/statutes/cite/6.581",
	"title": "6.581 STATE AUDITOR ENTERPRISE FUND.",
	"text": "[Repealed, 1Sp2017 c 4 art 2 s 66]\nWhen full-time personnel are not available, the state auditor may contract with a private entity for accounting and other technical services. Notwithstanding any law to the contrary, the acquisition of equipment may include duplicating equipment to be used in producing the reports issued by the Office of the State Auditor.\nThe state auditor may adjust the schedule of charges for the examinations performed so that the charges are sufficient to cover all costs of the examinations performed and that the aggregate charges collected are sufficient to pay all salaries and other expenses, including the charges for the use of the equipment used in connection with the reimbursable examinations performed, and the cost of contracting for accounting and other technical services. The schedule of charges shall be based on an estimate of the cost of performing reimbursable examinations including, but not limited to, salaries, office overhead, equipment, authorized contracts, and other expenses. The state auditor may allocate a proportionate part of the total costs to an hourly or daily charge for each person or class of persons engaged in the performance of an examination. The schedule of charges shall reflect an equitable charge for the expenses incurred in the performance of any given examination. The state auditor shall review and adjust the schedule of charges for the examinations performed at least annually. All schedules of charges must be approved by the commissioner of management and budget before the charges are adopted to ensure that the amount collected is sufficient to pay all the costs connected with the examinations performed during the fiscal year.\nAt least 30 days before implementing increased charges for examinations, the state auditor must report the proposed increases to the chairs and ranking minority members of the committees in the house of representatives and the senate with jurisdiction over the budget of the state auditor. By January 15 of each odd-numbered year, the state auditor must report to the chairs and ranking minority members of the legislative committees and divisions with primary jurisdiction over the budget of the state auditor a summary of anticipated revenues, and expenditures related to examinations for the biennium ending June 30 of that year. The report must also include for the biennium the number of full-time equivalents, by division, employed by the Office of the State Auditor, any audit rate changes stated as a percentage, the number of audit reports issued, and the number of counties audited.",
	"repealed": false
}