{
	"id": "82.73",
	"url": "https://www.revisor.mn.gov/statutes/cite/82.73",
	"title": "82.73 STANDARDS OF CONDUCT.",
	"text": "Every real estate office and branch office shall have a current copy of this chapter and chapter 83 and the rules adopted under those chapters, available for the use of licensees. Access to the statutes and rules required by this section may be made available through an electronic agent.\nThe methods, acts, or practices set forth in subdivisions 1 and 3 and sections 82.67; 82.70; 82.71; 82.74; and 82.81, subdivision 10, are standards of conduct governing the activities of real estate brokers and salespersons. Failure to comply with these standards shall constitute grounds for license denial, suspension, or revocation, or for censure of the licensee.\n(a) Supervision of personnel. A broker shall adequately supervise the activities of the broker's salespersons and employees. Supervision includes the ongoing monitoring of listing agreements, purchase agreements, other real estate-related documents which are prepared or drafted by the broker's salespersons or employees or which are otherwise received by the broker's office, and the review of all trust account books and records. If an individual broker maintains more than one place of business, each place of business shall be under the broker's direction and supervision. If a brokerage maintains more than one place of business, each place of business shall be under the direction and supervision of an individual broker licensed to act on behalf of the brokerage.\nThe primary broker shall maintain records specifying the name of each broker responsible for the direction and supervision of each place of business. If an individual broker, who may be the primary broker, is responsible for supervising more than one place of business, the primary broker shall, upon written request of the commissioner, file a written statement specifying the procedures which have been established to ensure that all salespersons and employees are adequately supervised. Designation of another broker to supervise a place of business does not relieve the primary broker of the ultimate responsibility for the actions of licensees.\n(b) Preparation and safekeeping of documents. A broker is responsible for the preparation, custody, safety, and accuracy of all real estate contracts, documents, and records, even though another person may be assigned these duties by the broker.\n(c) Documentation and resolution of complaints. A broker shall investigate and attempt to resolve complaints made regarding the practices of any individual licensed to the broker and shall maintain, with respect to each individual licensed to the broker, a complaint file containing all material relating to any complaints received in writing for a period of three years.\n(d) Disclosure of listed property information. A broker may allow any unlicensed person, who is authorized by the broker, to disclose any factual information pertaining to the properties listed with the broker, if the factual information is provided to the unlicensed person in written form by the broker representing or assisting the seller(s).\n(e) Property management functions for individually owned or entity-owned real estate. A broker shall not be responsible for supervising, nor shall the licensee be responsible for operating, within the scope of the brokerage or within the requirements of this chapter, activities that would be considered property management, including leasing, maintenance, and repair, so long as the real estate being managed is \"individually owned\" or \"entity-owned\" as defined below:\n(1) \"individually owned\" real estate is real property in which the licensee holds an ownership interest; and\n(2) \"entity-owned\" real estate is real property owned by a corporation, limited liability company, partnership, or trust, within which entity the licensee holds an ownership interest as an owner, trustee, partner, or officer, or in another beneficiary capacity.",
	"repealed": false
}