{
	"id": "504B.425",
	"url": "https://www.revisor.mn.gov/statutes/cite/504B.425",
	"title": "504B.425 JUDGMENT.",
	"text": "(a) If the court finds that the complaint in section 504B.395 has been proved, it may, in its discretion, take any of the actions described in paragraphs (b) to (g), either alone or in combination.\n(b) The court may order the landlord to remedy the violation or violations found by the court to exist if the court is satisfied that corrective action will be undertaken promptly.\n(c) The court may order the residential tenant to remedy the violation or violations found by the court to exist and deduct the cost from the rent subject to the terms as the court determines to be just.\n(d) The court may appoint an administrator with powers described in section 504B.445, and:\n(1) direct that rents due:\n(i) on and from the day of entry of judgment, in the case of petitioning residential tenants or housing-related neighborhood organizations; and\n(ii) on and from the day of service of the judgment on all other residential and commercial tenants of the residential building, if any,\nshall be deposited with the administrator appointed by the court; and\n(2) direct that the administrator use the rents collected to remedy the violations found to exist by the court by paying the debt service, taxes, and insurance, and providing the services necessary to the ordinary operation and maintenance of the residential building which the landlord is obligated to provide but fails or refuses to provide.\n(e) The court may find the extent to which any uncorrected violations impair the residential tenants' use and enjoyment of the property contracted for and order the rent abated accordingly. If the court enters judgment under this paragraph, the parties shall be informed and the court shall determine the amount by which the rent is to be abated.\n(f) After termination of administration, the court may continue the jurisdiction of the court over the residential building for a period of one year and order the landlord to maintain the residential building in compliance with all applicable state, county, and city health, safety, housing, building, fire prevention, and housing maintenance codes.\n(g) The court may grant any other relief it deems just and proper, including a judgment against the landlord for reasonable attorney fees, not to exceed $500, in the case of a prevailing residential tenant or neighborhood organization. The $500 limitation does not apply to awards made under section 549.211 or other specific statutory authority.",
	"repealed": false
}