{
	"id": "90.251",
	"url": "https://www.revisor.mn.gov/statutes/cite/90.251",
	"title": "90.251 TIMBER SCALING.",
	"text": "The commissioner shall institute scaling and check scaling procedures for state timber sufficient to protect the interest of the state. This will include the assignment of a trained timber scaling specialist in the classified service to be responsible for check scaling and to develop scaling and check scaling techniques and standards. The scaling and check scaling techniques and standards shall be approved by the commissioner. Check scaling shall also be accomplished by other forestry supervisors with reports forwarded to the timber scaling specialist. The timber scaling specialist shall report any scaling deficiencies or trespass to the commissioner. Any deficiencies requiring the attention of the attorney general or State Executive Council will be forwarded to these offices by the commissioner. All timber cut on lands in the charge of the commissioner, except as expressly provided otherwise by the commissioner shall be scaled. No timber may be scaled until it is first properly identified as specified in the permit. All scaling shall be done upon the land from which the timber was cut; provided that the state appraiser, subject to the approval of the commissioner, may designate in writing to a permit holder another location where such timber may be scaled, counted or measured; all logs individually scaled shall be numbered consecutively, and the number of each entered upon the minutes of the scaler; allowance shall be made for defects to make the timber equivalent to merchantable timber. No state timber shall be removed from the land where it was cut until it has been so scaled or counted except as herein provided. Any person removing timber from the land where it was cut, or from the place designated, before it has been so scaled or counted is guilty of trespass.\nThe scaler or state appraiser shall make separate reports to the commissioner of all such timber scaled, covering the respective permits. Each report shall describe the land on which the timber was cut, the quantities of each kind or species of timber, the total number of feet or other units of measurement, as the case may be.\nFinal examination of lands and timber covered by any permit shall be made by a state appraiser at or subsequent to the expiration of the permit or of any cutting season and it shall be the duty of such appraiser to ascertain and report the amount of any timber covered by the permit and cut and left on the land or left standing thereon, but the appraiser shall not report any timber cut and left which has been marked as scaled.\nNo state timber shall ever be scaled for or on behalf of the state by any person except a state appraiser or scaler except as provided otherwise by the commissioner, and as far as practicable the scaler and appraiser shall not be the same person for any timber cut under a permit. No scale, count, measurement, or estimate of state timber officially made and reported by any state appraiser or scaler shall ever be changed or altered by any other person, nor superseded or set aside in any manner except as expressly provided in this chapter. Reappraisals of unsold state land or timber may be made when deemed advisable by the commissioner. Except as herein expressly provided and as generally authorized by section 16D.09, no claim of the state for timber from state lands shall ever be settled or discharged for less than the full amount thereof as shown by the scale or estimate of scalers, or of state appraisers, as the case may be.",
	"repealed": false
}