{
	"id": "323A.1001",
	"url": "https://www.revisor.mn.gov/statutes/cite/323A.1001",
	"title": "323A.1001 STATEMENT OF QUALIFICATION.",
	"text": "(a) A partnership may become a limited liability partnership pursuant to this section.\n(b) The terms and conditions on which a partnership becomes a limited liability partnership must be approved by the vote necessary to amend the partnership agreement except, in the case of a partnership agreement that expressly considers obligations to contribute to the partnership, the vote necessary to amend those provisions.\n(c) After the approval required by subsection (b), a partnership may become a limited liability partnership by filing a statement of qualification. The statement must contain:\n(1) the name of the partnership;\n(2) the street address, including the zip code, of the partnership's chief executive office and, if different, the street address, including the zip code, of an office in this state, if any;\n(3) if the partnership does not have an office in this state, the name and street address, including the zip code, of the partnership's agent for service of process. If an agent for service of process is listed, the limited liability partnership shall comply with section 5.36;\n(4) a statement that the partnership elects to be a limited liability partnership; and\n(5) a deferred effective date, if any.\n(d) The agent of a limited liability partnership for service of process must be an individual who is a resident of this state or other person authorized to do business in this state.\n(e) The status of a partnership as a limited liability partnership is effective on the later of the filing of the statement or a date specified in the statement. The status remains effective, regardless of changes in the partnership, until it is canceled pursuant to section 323A.0105(d) or revoked pursuant to section 323A.1003.\n(f) The status of a partnership as a limited liability partnership and the liability of its partners is not affected by errors or later changes in the information required to be contained in the statement of qualification under subsection (c).\n(g) The filing of a statement of qualification establishes that a partnership has satisfied all conditions precedent to the qualification of the partnership as a limited liability partnership.\n(h) An amendment or cancellation of a statement of qualification is effective when it is filed or on a deferred effective date specified in the amendment or cancellation.\n(i) A statement of qualification may include the information necessary to make an election under section 319B.03, subdivision 2, and to update that information as provided in section 319B.03, subdivision 3.",
	"repealed": false
}