{
	"id": "325D.53",
	"url": "https://www.revisor.mn.gov/statutes/cite/325D.53",
	"title": "325D.53 PROHIBITED CONTRACTS, COMBINATIONS, AND CONSPIRACIES.",
	"text": "Without limiting section 325D.51, the following shall be deemed to restrain trade or commerce unreasonably and are unlawful:\n(1) A contract, combination, or conspiracy between two or more persons in competition:\n(a) for the purpose or with the effect of affecting, fixing, controlling or maintaining the market price, rate, or fee of any commodity or service;\n(b) affecting, fixing, controlling, maintaining, limiting, or discontinuing the production, manufacture, mining, sale or supply of any commodity, or the sale or supply of any service, for the purpose or with the effect of affecting, fixing, controlling, or maintaining the market price, rate, or fee of the commodity or service; or\n(c) allocating or dividing customers or markets, functional or geographical, for any commodity or service.\n(2) A contract, combination, or conspiracy between two or more persons whereby, in the letting of any public contract, (a) the price quotation of any bid is fixed or controlled, (b) one or more persons refrains from the submission of a bid, or (c) competition is in any other manner restrained.\n(3) A contract, combination, or conspiracy between two or more persons refusing to deal with another person, except a refusal to deal by associations, trading boards, or exchanges when predicated upon a failure to comply with rules of membership.\nWithout limiting section 325D.51, the following, when performed by a person within the jurisdiction of this state, and directly affecting business in this state (excluding any business employing, controlling, controlled by or under common control with such person), shall be deemed to restrain trade or commerce unreasonably and are unlawful:\n(1) Requiring any United States person to be excluded from a business transaction on the basis of that person's sex, race, color, religion, ancestry or national origin or on the basis that the person conducts or has conducted business with persons of a particular race, sex, color, religion, ancestry or national origin, or on the basis that the person has done business in a particular country.\n(2) Giving, as part of any business transaction, any statement, certification or other document to the effect that the giver of the statement, certification or other document has complied with a policy imposed by any person, nation, or international organization requiring exclusion from any business transaction, or discrimination against, any United States person on the basis of race, sex, color, religion, ancestry or national origin or on the basis that the person conducts or has conducted business with persons of a particular race, sex, color, religion, ancestry or national origin, or on the basis that the person has done business in a particular country.\n(3) Granting, accepting or processing any letter of credit or other document which evidences the transfer of funds or credit, or entering into any contract for the exchange of goods or services, where the letter of credit, contract, or other document contains any provision which requires any person to discriminate against or to certify that the person has not dealt with any other United States person on the basis of race, sex, color, religion, ancestry or national origin, or on the basis that the person conducts or has conducted business with persons of a particular race, sex, color, religion, ancestry or national origin, or on the basis that the person has done business in a particular country.\n(4) As part of any business transaction, complying, or agreeing to comply, or certifying or giving other assurance of compliance or agreement to comply, with a policy imposed by another party requiring discrimination against, or refusal to deal with, any United States person, group of United States persons, or list of United States persons, on the basis of race, sex, color, religion, ancestry or national origin or on the basis that the person, group of persons or list of persons conducts or has conducted business with persons of a particular race, sex, color, religion, ancestry or national origin, or on the basis that the person has done business in a particular country.\nProvided, however, that the provisions of subdivisions 2 and 3 shall not apply to (a) any letter of credit, contract, or other document which contains any provisions pertaining to a labor dispute or an unfair labor practice if the other provisions of such letter of credit, contract, or other document do not violate the provisions of subdivisions 2 and 3; (b) the requiring of association with a particular employer or a particular group as a requisite to obtaining group rates or discount on insurance, recreational activities, or other similar benefits; (c) any act which is an unfair discriminatory practice under section 363A.03, subdivision 48, and for which a remedy is provided under chapter 363A; (d) persons exempted or acts excepted from the provisions of chapter 363A pursuant to sections 363A.20 to 363A.26; and 363A.38; (e) any agreement, letter of credit, contract or other document which contains any specification as to the country of origin of goods or services sold in a business transaction, or as to the vessels to carry the goods, or the route by which the goods may be shipped, if the other provisions of such agreement, letter of credit, contract, or other document do not violate the provisions of subdivisions 2 and 3; (f) compliance by a person resident in a foreign country, or agreement by such person to comply, with the export laws of that country with respect to activities exclusively therein; provided further, however, that the mere ownership of an entity located outside the United States by a person within the jurisdiction of this state shall not make such entity a person within the jurisdiction of this state.\nThe exemption contained in section 325D.55, subdivision 2, shall not apply to actions made unlawful under this subdivision. Provided, however, that the provisions of this subdivision shall not apply to any action made lawful by legislation of the United States of America or executive order of the President of the United States of America which affirmatively preempts the provisions of subdivisions 2 and 3.\nAny agreement containing a written or verbal term providing that one or more parties to the agreement will violate the previous subdivision 2 is null and void, and no party to such an agreement may recover in an action for goods or money due by reason of such an agreement or by reason of money paid or goods shipped pursuant to such an agreement.",
	"repealed": false
}