{
	"id": "518A.36",
	"url": "https://www.revisor.mn.gov/statutes/cite/518A.36",
	"title": "518A.36 PARENTING EXPENSE ADJUSTMENT.",
	"text": "(a) The parenting expense adjustment under this section reflects the presumption that while exercising parenting time, a parent is responsible for and incurs costs of caring for the child, including, but not limited to, food, clothing, transportation, recreation, and household expenses. Every child support order shall specify the percentage of parenting time granted to or presumed for each parent. For purposes of this section, the percentage of parenting time means the percentage of time a child is scheduled to spend with the parent during a calendar year according to a court order averaged over a two-year period. Parenting time includes time with the child whether it is designated as visitation, physical custody, or parenting time. The percentage of parenting time may be determined by calculating the number of overnights or overnight equivalents that a parent spends with a child pursuant to a court order. For purposes of this section, overnight equivalents are calculated by using a method other than overnights if the parent has significant time periods on separate days where the child is in the parent's physical custody and under the direct care of the parent but does not stay overnight. The court may consider the age of the child in determining whether a child is with a parent for a significant period of time.\n(b) If there is not a court order awarding parenting time, the court shall determine the child support award without consideration of the parenting expense adjustment. If a parenting time order is subsequently issued or is issued in the same proceeding, then the child support order shall include application of the parenting expense adjustment.\n(a) For the purposes of this section, the following terms have the meanings given:\n(1) \"parent A\" means the parent with whom the child or children will spend the least number of overnights under the court order; and\n(2) \"parent B\" means the parent with whom the child or children will spend the greatest number of overnights under the court order.\n(b) The court shall apply the following formula to determine which parent is the obligor and calculate the basic support obligation:\n(1) raise to the power of three the approximate number of annual overnights the child or children will likely spend with parent A;\n(2) raise to the power of three the approximate number of annual overnights the child or children will likely spend with parent B;\n(3) multiply the result of clause (1) times parent B's share of the combined basic support obligation as determined in section 518A.34, paragraph (b), clause (5);\n(4) multiply the result of clause (2) times parent A's share of the combined basic support obligation as determined in section 518A.34, paragraph (b), clause (5);\n(5) subtract the result of clause (4) from the result of clause (3); and\n(6) divide the result of clause (5) by the sum of clauses (1) and (2).\n(c) If the result is a negative number, parent A is the obligor, the negative number becomes its positive equivalent, and the result is the basic support obligation. If the result is a positive number, parent B is the obligor and the result is the basic support obligation.\nIf the parenting time is equal and the parental incomes for determining child support of the parents also are equal, no basic support shall be paid unless the court determines that the expenses for the child are not equally shared.",
	"repealed": false
}