{
	"id": "168.012",
	"url": "https://www.revisor.mn.gov/statutes/cite/168.012",
	"title": "168.012 VEHICLES EXEMPT FROM TAX OR LICENSE FEES.",
	"text": "(a) The following vehicles are exempt from the provisions of this chapter requiring payment of tax and registration fees, except as provided in subdivision 1c:\n(1) vehicles owned and used solely in the transaction of official business by the federal government, the state, or any political subdivision;\n(2) vehicles owned and used exclusively by educational institutions and used solely in the transportation of pupils to and from those institutions;\n(3) vehicles used solely in driver education programs at nonpublic high schools;\n(4) vehicles owned by nonprofit charities and used exclusively to transport disabled persons for charitable, religious, or educational purposes;\n(5) vehicles owned by nonprofit charities and used exclusively for disaster response and related activities;\n(6) vehicles owned by ambulance services licensed under section 144E.10 that are equipped and specifically intended for emergency response or providing ambulance services; and\n(7) vehicles owned by a commercial driving school licensed under section 171.34, or an employee of a commercial driving school licensed under section 171.34, and the vehicle is used exclusively for driver education and training.\n(b) Provided the general appearance of the vehicle is unmistakable, the following vehicles are not required to register or display number plates:\n(1) vehicles owned by the federal government;\n(2) fire apparatuses, including fire-suppression support vehicles, owned or leased by the state or a political subdivision;\n(3) police patrols owned or leased by the state or a political subdivision; and\n(4) ambulances owned or leased by the state or a political subdivision.\n(c) Unmarked vehicles used in general police work, liquor investigations, or arson investigations, and passenger automobiles, pickup trucks, and buses owned or operated by the Department of Corrections or by conservation officers of the Division of Enforcement and Field Service of the Department of Natural Resources, must be registered and must display appropriate license number plates, furnished by the registrar at cost. Original and renewal applications for these license plates authorized for use in general police work and for use by the Department of Corrections or by conservation officers must be accompanied by a certification signed by the appropriate chief of police if issued to a police vehicle, the appropriate sheriff if issued to a sheriff's vehicle, the commissioner of corrections if issued to a Department of Corrections vehicle, or the appropriate officer in charge if issued to a vehicle of any other law enforcement agency. The certification must be on a form prescribed by the commissioner and state that the vehicle will be used exclusively for a purpose authorized by this section.\n(d) Unmarked vehicles used by the Departments of Revenue and Labor and Industry, fraud unit, in conducting seizures or criminal investigations must be registered and must display passenger vehicle classification license number plates, furnished at cost by the registrar. Original and renewal applications for these passenger vehicle license plates must be accompanied by a certification signed by the commissioner of revenue or the commissioner of labor and industry. The certification must be on a form prescribed by the commissioner and state that the vehicles will be used exclusively for the purposes authorized by this section.\n(e) Unmarked vehicles used by the Division of Disease Prevention and Control of the Department of Health must be registered and must display passenger vehicle classification license number plates. These plates must be furnished at cost by the registrar. Original and renewal applications for these passenger vehicle license plates must be accompanied by a certification signed by the commissioner of health. The certification must be on a form prescribed by the commissioner and state that the vehicles will be used exclusively for the official duties of the Division of Disease Prevention and Control.\n(f) Unmarked vehicles used by staff of the Gambling Control Board in gambling investigations and reviews must be registered and must display passenger vehicle classification license number plates. These plates must be furnished at cost by the registrar. Original and renewal applications for these passenger vehicle license plates must be accompanied by a certification signed by the board chair. The certification must be on a form prescribed by the commissioner and state that the vehicles will be used exclusively for the official duties of the Gambling Control Board.\n(g) Unmarked vehicles used in general investigation, surveillance, supervision, and monitoring by the Department of Human Services' Office of Special Investigations' staff; the Minnesota Sex Offender Program's executive director and the executive director's staff; and the Office of Inspector General's staff, including, but not limited to, county fraud prevention investigators, must be registered and must display passenger vehicle classification license number plates, furnished by the registrar at cost. Original and renewal applications for passenger vehicle license plates must be accompanied by a certification signed by the commissioner of human services. The certification must be on a form prescribed by the commissioner and state that the vehicles must be used exclusively for the official duties of the Office of Special Investigations' staff; the Minnesota Sex Offender Program's executive director and the executive director's staff; and the Office of the Inspector General's staff, including, but not limited to, contract and county fraud prevention investigators.\n(h) Each state hospital and institution for persons who are mentally ill and developmentally disabled may have one vehicle without the required identification on the sides of the vehicle. The vehicle must be registered and must display passenger vehicle classification license number plates. These plates must be furnished at cost by the registrar. Original and renewal applications for these passenger vehicle license plates must be accompanied by a certification signed by the hospital administrator. The certification must be on a form prescribed by the commissioner and state that the vehicles will be used exclusively for the official duties of the state hospital or institution.\n(i) Each county social service agency may have vehicles used for child and vulnerable adult protective services without the required identification on the sides of the vehicle. The vehicles must be registered and must display passenger vehicle classification license number plates. These plates must be furnished at cost by the registrar. Original and renewal applications for these passenger vehicle license plates must be accompanied by a certification signed by the agency administrator. The certification must be on a form prescribed by the commissioner and state that the vehicles will be used exclusively for the official duties of the social service agency.\n(j) Unmarked vehicles used in general investigation, surveillance, supervision, and monitoring by tobacco inspector staff of the Department of Human Services' Alcohol and Drug Abuse Division for the purposes of tobacco inspections, investigations, and reviews must be registered and must display passenger vehicle classification license number plates, furnished at cost by the registrar. Original and renewal applications for passenger vehicle license plates must be accompanied by a certification signed by the commissioner of human services. The certification must be on a form prescribed by the commissioner and state that the vehicles will be used exclusively by tobacco inspector staff for the duties specified in this paragraph.\n(k) All other motor vehicles must be registered and display tax-exempt number plates, furnished by the registrar at cost, except as provided in subdivision 1c. All vehicles required to display tax-exempt number plates must have the name of the state department or political subdivision, nonpublic high school operating a driver education program, licensed commercial driving school, or other qualifying organization or entity, plainly displayed on both sides of the vehicle. This identification must be in a color giving contrast with that of the part of the vehicle on which it is placed and must endure throughout the term of the registration. The identification must not be on a removable plate or placard and must be kept clean and visible at all times; except that a removable plate or placard may be utilized on vehicles leased or loaned to a political subdivision or to a nonpublic high school driver education program.\nNotwithstanding the provisions of this section, or any other law to the contrary, motor vehicles of the conservation officer service need not be specially marked in any way.\nMS 2010 [Repealed, 2012 c 287 art 4 s 50]\nThe annual administrative fee for a tax-exempt vehicle under this section is $5. The license plate fee for a tax-exempt vehicle, except a trailer, is $10 for two plates per vehicle, payable only on the first tax-exempt registration of the vehicle. The registration period for a tax-exempt vehicle is biennial. The administrative fee is due on March 1 biennially and payable the preceding January 1, with validating stickers issued at time of payment. Replacement plates are subject to the fees in section 168.12.\nUnmarked passenger vehicles used by the State Lottery for the purpose of conducting security or criminal investigations or ensuring that lottery retailers are in compliance with law and with their contracts are not required to display tax-exempt number plates, but must be registered and must display passenger vehicle license plates. The registrar shall furnish the license plates to the director of the State Lottery at cost. On applying for initial registration or renewal of a registration under this subdivision, the director of the State Lottery must certify, on a form prescribed by the registrar and signed by the director, that the vehicles will be used exclusively for the purposes of this subdivision.\nImplements of husbandry, as defined in section 168A.01, subdivision 8, and tractors used solely for agricultural purposes or tractors, together with trailers or wagons thereto attached, occasionally hauling agricultural products or necessary commodities used on the farm from said farm to and from the usual marketplace of the owner, tractors for drawing threshing machinery and implements of husbandry temporarily moved upon the highway, shall not be taxed as motor vehicles using the public streets and highways and shall be exempt from the provisions of this chapter.\nFarm trailers with a gross weight of less than 10,000 pounds, drawn by a passenger automobile or farm truck and used exclusively for transporting agricultural products from farm to farm and to and from the usual marketplace of the owner, shall not be taxed as motor vehicles using the public streets and highways and shall be exempt from the provisions of this chapter.\nA trailer used exclusively to carry liquid or dry fertilizer for use on a farm shall not be taxed as a motor vehicle using the public streets and highways and shall be exempt from the provisions of this chapter.\nMS 2012 [Expired, 2008 c 350 art 1 s 8]\nElectric-assisted bicycles must not be taxed as motor vehicles using the public streets and highways, and are exempt from the provisions of this chapter.\nSpecial mobile equipment and snowmobiles shall not be taxed as motor vehicles using the public streets and highways, and shall be exempt from the provisions of this chapter.\nMotorized golf carts and four-wheel all-terrain vehicles operated under permit and on roadways designated pursuant to section 169.045 are exempt from the provisions of this chapter.\nBunkhouses, supply cars, shop cars, and other similar camp equipment mounted on trailers and used by highway construction contractors exclusively at construction camp sites shall not be taxed as motor vehicles using the public streets and highways and shall be exempt from the provisions of this chapter. Such trailers with such mounted bunkhouses, supply cars, shop cars, and other similar camp equipment thereon shall be listed and taxed as personal property.\nMotor vehicles, which are used primarily for the purpose of carrying sawing machines; well-drilling machines, pump hoists, and other equipment registered under chapter 103I; barn sprayers or corn shellers permanently attached to them, shall not be subject to the registration tax as herein provided, but shall be listed for taxation as personal property as provided by law. The exemption in this subdivision for well-drilling machines, pump hoists, and other equipment registered under chapter 103I applies regardless of whether the well-drilling machine, pump hoist, or other equipment is also carrying materials related to its operation.\nMotor vehicles operated for testing under section 168.25 are not subject to registration taxes under this chapter.\nAll motor vehicle fire apparatuses and ambulances operated without profit while owned by a farmers' cooperative association, a body of farmers, a volunteer fire department or association, or a group of citizens, and used solely for the extinguishment of fire in the community in which it is so owned and employed or, in the case of an ambulance used only for the benefit of the community in which it is owned or employed, shall be exempt from taxation.\n(a) The owner of a motor vehicle that during any calendar year, or in the case of a vehicle registered under section 168.017 during the registration period provided for in that section, is not operated on a public highway is exempt from the provisions of this chapter requiring registration, payment of tax, and penalties for tax nonpayment, but only if the owner of the vehicle first files a verified written application with the registrar, correctly describing the vehicle and certifying that it has not been operated upon a public highway.\n(b) A motor vehicle domiciled in a foreign state, legally licensed in that state, and owned by a Minnesota resident is exempt from this chapter; except that it is subject to section 168.181, subdivision 3, provided, that this exemption does not conflict with any existing reciprocal agreement with the state in which the vehicle is domiciled.\nEvery passenger automobile, travel trailer, other than manufactured homes, or passenger car utility trailer duly registered in any foreign state, district, territory, or country and displaying all license number plates or like insignia required by the laws of such state, district, territory, or country shall be exempt from the provisions of this chapter during the first 60 days of residence of the owner in this state; provided that if the 60-day period expires after the 15th day of any month, the remainder of that month shall be deemed to be within the 60-day period and provided further that any such vehicles shall become subject to the provisions of this chapter immediately upon transfer of the ownership of such vehicles or upon expiration of the registration.\nManufactured homes and park trailers shall not be taxed as motor vehicles using the public streets and highways and shall be exempt from the motor vehicle tax provisions of this chapter. Except as provided in section 273.125, manufactured homes and park trailers shall be taxed as personal property. The provisions of Minnesota Statutes 1957, section 272.02 or any other act providing for tax exemption shall be inapplicable to manufactured homes and park trailers, except such manufactured homes as are held by a licensed dealer or limited dealer, as defined in section 327B.04, and exempted as inventory under subdivision 9a. Travel trailers not conspicuously displaying current registration plates on the property tax assessment date shall be taxed as manufactured homes if occupied as human dwelling places.\nManufactured homes, as defined in section 327.31, subdivision 6, shall be considered as dealer inventory on the January 2 assessment date, if the home is:\n(1) listed as inventory and held by a licensed or limited dealer;\n(2) unoccupied and not available for rent;\n(3) connected or not connected to utilities when located in a manufactured home park; and\n(4) connected or not connected to utilities when located at a dealer's sales center.\nThe exemption under this subdivision is allowable for up to five assessment years after the date a home is initially claimed as dealer inventory.\nIf a vehicle is used for a purpose which would make it exempt pursuant to subdivision 1 but title is held by a seller or a vendor or is assigned to a third party under a lease agreement or a lease purchase agreement or installment sale permitted under section 465.71, exemption shall be determined by the use rather than the holder of the title.\nSemitrailers as defined in section 168.002, subdivision 30, shall not be taxed as a motor vehicle using the public streets and highways and shall display a number plate for identification purposes only.\nMS 2004 [Repealed, 1Sp2005 c 6 art 2 s 48]\n(a) A passenger automobile, one-ton pickup truck, motorcycle, or recreational vehicle registered by a veteran with a total service-connected disability, as defined in section 171.01, subdivision 51, is not subject to:\n(1) registration taxes under this chapter;\n(2) administrative fees imposed under subdivision 1c;\n(3) filing fees and surcharges imposed under section 168.33, subdivision 7; or\n(4) plate and validation sticker fees imposed under this chapter, including but not limited to:\n(i) fees under section 168.12, subdivision 5;\n(ii) fees identified in any section authorizing special plates; and\n(iii) transfer fees.\n(b) The exemptions under this subdivision apply to a motor vehicle that is jointly registered by a qualifying veteran and a spouse or domestic partner.\n(c) The fees identified under paragraph (a), clause (4), do not include:\n(1) a fee for personalized plates under section 168.12, subdivision 2a; or\n(2) a required contribution or donation for a special plate, including but not limited to a contribution under sections 168.1255, subdivision 1, clause (6); 168.1258, subdivision 1, clause (4); 168.1259, subdivision 2, clause (5); 168.1287, subdivision 1, clause (5); 168.129, subdivision 1, clause (5); 168.1295, subdivision 1, paragraph (a), clause (5); 168.1296, subdivision 1, paragraph (a), clause (5); and 168.1299, subdivision 1, clause (3).\n(d) A qualifying veteran may register no more than two motor vehicles at the same time with the exemptions under this subdivision. Nothing in this paragraph prevents registration of additional motor vehicles as otherwise provided in this chapter.",
	"repealed": false
}