{
	"id": "65A.28",
	"url": "https://www.revisor.mn.gov/statutes/cite/65A.28",
	"title": "65A.28 DISCLOSURE AND FILING REQUIREMENTS.",
	"text": "Each insurer writing homeowner's insurance for property located in the metropolitan area or a statutory or home rule charter city of the first class shall compile and file annually with the commissioner on or before May 1 a report for the preceding calendar year. This report shall contain the following information reported by postal zip code areas for each zip code area located in a city of the first class which contains property for which the insurer wrote, declined to write, or canceled homeowner's insurance:\n(a) the number of policies written;\n(b) the number of policies canceled;\n(c) the number of policies nonrenewed; and\n(d) the number of applications for homeowner's insurance declined.\nIf the commissioner determines that additional information is necessary to effectuate the purposes of sections 65A.27 to 65A.29 and 72A.20, subdivision 13, the commissioner may require, by rule:\n(i) that the required information be reported for additional areas of the state, or\n(ii) that additional types of information, including premium and claims data, be reported for some or all of the areas subject to the reporting requirements.\nIf the commissioner has reason to believe that an insurance company or insurance agent has violated section 72A.20, subdivision 13 or 14, the commissioner may issue an order requiring the company or agent to compile and submit within a reasonable time information on its homeowner's insurance marketing, underwriting, or rating practices for a specific geographic area or areas. This information may be in addition to the types and categories of information required to be reported by this section or rules promulgated under subdivision 4.\nThe commissioner shall make the reports filed pursuant to subdivision 1 available for public inspection.\nAny insurer required to report under this section which fails to file a report, containing the data and within the time prescribed by this section or rules promulgated under subdivision 4, shall be subject to a penalty of $10 for each day in default. Any penalty imposed under this section may be recovered in a civil action brought by and in the name of the state.\nThe commissioner may prescribe rules necessary to carry out the purposes of this section. The rules may provide for classifications, differentiations, adjustments or exceptions, as in the judgment of the commissioner are necessary and proper to effectuate the purposes of, prevent circumvention or evasion of, or to facilitate compliance with this section.",
	"repealed": false
}