{
	"id": "62I.16",
	"url": "https://www.revisor.mn.gov/statutes/cite/62I.16",
	"title": "62I.16 STABILIZATION RESERVE FUND.",
	"text": "There is created a stabilization reserve fund. Each policyholder shall pay to the association a stabilization reserve fund charge of 33 percent of each premium payment due for insurance through the association. This charge shall be separately stated in the policy. The association shall cancel the policy of any policyholder who fails to pay the stabilization reserve fund charge.\nThe association shall promptly pay into the stabilization reserve fund all fund charges it collects from its policyholders.\nAll money paid into the fund shall be separately accounted for by the board of directors. The money held in the fund may be invested. All investment income shall be credited to the fund. All expenses of the administration of the fund shall be charged against the fund. Any stabilization reserve fund charges from a particular policy year must be returned to policyholders after all claims and expense obligations from that particular policy year are satisfied.\nThe board of directors may, upon their own motion or upon application of any applicant or insured, exempt any group from the payment of the stabilization reserve charge. The exemption shall be granted only to those groups who are unable to obtain insurance coverage in the private market as a result of the private market's refusal to write coverage for that group rather than because of loss experiences or risks posed by the applicant or insured as an individual. It shall be presumed that a group is qualified for this exemption if more than 20 percent of the members of that group are unable to obtain the insurance coverage that they seek. The board of directors shall also consider granting exemption if any members of the same group are unable to obtain coverage in the private market even though no claims have been made against them or payments made on their behalf by any insurer within the last three years.\nIn addition to determining the basic rate for coverages to be offered, the association shall also develop a surcharge plan or similar method for adjusting the rate to be charged to those persons who have had claims made against them. The surcharge plan shall take into effect the risk posed to the association by the applicant or the insured. The surcharge plan shall be sufficient to provide for the sound financial operation of the plan based upon commonly agreed-upon actuarial principles.",
	"repealed": false
}