{
	"id": "66A.42",
	"url": "https://www.revisor.mn.gov/statutes/cite/66A.42",
	"title": "66A.42 DOMESTIC INSURANCE CORPORATIONS MAY BECOME MUTUAL CORPORATIONS.",
	"text": "Any domestic insurance corporation heretofore or hereafter incorporated for the transaction of the kinds of business authorized and permitted by section 60A.06, subdivision 1, and having capital stock may become a mutual corporation and to that end may formulate and carry out a plan for the acquisition by it of its outstanding capital stock, and for the mutualization of such corporation, as follows:\n(a) Such plan shall have been adopted by vote of a majority of the directors of such company.\n(b) Such plan shall have been submitted to the commissioner of commerce and shall have been approved as conforming to the requirements of this section and section 66A.43 and as not prejudicial to the policyholders of such company or to the insuring public.\n(c) Such plan shall have been approved by a vote of stockholders representing a majority of the outstanding capital stock at a meeting of stockholders called for that purpose. Stockholders may vote in person or by proxy filed with the company at least five days before the meeting at which it is to be used. Notice of such meeting shall be given by mailing such notice from the home office of such company at least 30 days prior to such meeting in a sealed envelope, postage prepaid, directed to each stockholder at the address shown on the stock records of the company.\n(d) Such plan shall have been approved by a majority of the votes cast by policyholders (whether or not members) who vote at a meeting called for that purpose. Eligibility of policyholders, whether or not members of the company, and the number of votes to which each is entitled, shall be determined by the laws of Minnesota relating to the rights of members of domestic mutual insurance companies to vote at company meetings. Policyholders may vote in person or by proxy filed with the company at least five days before the meeting at which it is to be used. Notice of such meeting shall be given by mailing such notice from the home office of such company at least 30 days prior to such meeting in a sealed envelope, postage prepaid, directed to each policyholder at the address shown on the policy records of the company. Such meeting shall be conducted in such manner as may be provided for in such plan, with the approval of the commissioner. The commissioner shall supervise and direct the methods and procedure of said meeting and appoint an adequate number of inspectors to conduct the voting at said meeting, who shall have power to determine all questions concerning the verification of the ballots, the ascertaining of the validity thereof, the qualifications of the voters and the canvass of the vote. Such inspectors, or any one thereof designated by the commissioner, shall certify to the commissioner and to such company the result of such vote, and with respect thereto shall act under such rules as shall be prescribed by the commissioner. All necessary expenses incurred by the commissioner, or incurred with the commissioner's approval by the inspectors appointed, shall be paid by such company upon the certificate of the commissioner.\n(e) Approval of the plan by stockholders and policyholders as above provided may be given at a joint meeting thereof.\n(f) Such plan may specify the purchase price to be paid by such company for shares of its capital stock, and in such case the price so specified shall be adhered to. If such plan does not specify the price to be paid for such shares, such company shall first obtain the approval of the commissioner for every payment made for the acquisition of any shares of its capital stock.\n(g) Such plan may authorize the board of directors of the company to provide for participation in the surplus of the company by holders of policies which do not by their terms provide for such participation or which provide for a limited participation only, and may include appropriate proceedings to confer upon policyholders the right to vote at meetings of the company. Policyholders upon whom the right to vote is so conferred shall have the same voting rights and shall be entitled to the same notice of annual meeting as members of domestic mutual insurance companies.\n(h) Before approving any such plan or any such payment, the commissioner shall be satisfied, by making investigation or such evidence as the commissioner may require, that such company, after deducting the aggregate sum appropriated by such plan for the acquisition of any part or all of its capital stock, and in the case of any payment not fixed by such plan and subject to approval as aforesaid, after deducting also the amount of such payment, will be possessed of admitted assets in an amount equal to the sum of (1) and (2) as follows:\n(1) Its entire liabilities, including the net value of its outstanding contracts computed as provided by law, and (2) the contingency reserve deemed by the commissioner necessary to protect its policyholders and the insuring public, in view of the past experience of such company, the character of its assets, its present management and its probable future earnings.\nThe commissioner's action in refusing to give any approval required by this section shall be subject to review by any court of competent jurisdiction.\nSuch plan may be amended by vote of stockholders representing a majority of the outstanding capital stock and by a majority of the votes cast by policyholders who vote at the meeting, but in such case the plan shall not become effective until approved, as amended, by vote of a majority of the directors of such company and by the commissioner.",
	"repealed": false
}