{
	"id": "145.901",
	"url": "https://www.revisor.mn.gov/statutes/cite/145.901",
	"title": "145.901 MATERNAL DEATH STUDIES.",
	"text": "The commissioner of health may conduct maternal death studies to assist the planning, implementation, and evaluation of medical, health, and welfare service systems and to reduce the numbers of preventable maternal deaths in Minnesota.\n(a) The commissioner of health has access to medical data as defined in section 13.384, subdivision 1, paragraph (b), medical examiner data as defined in section 13.83, subdivision 1, and health records created, maintained, or stored by providers as defined in section 144.291, subdivision 2, paragraph (c), without the consent of the subject of the data, and without the consent of the parent, spouse, other guardian, or legal representative of the subject of the data, when the subject of the data is a woman who died during a pregnancy or within 12 months of a fetal death, a live birth, or other termination of a pregnancy.\nThe commissioner has access only to medical data and health records related to deaths that occur on or after July 1, 2000, including the names of the providers, clinics, or other health services such as family home visiting programs; the women, infants, and children (WIC) program; prescription monitoring programs; and behavioral health services, where care was received before, during, or related to the pregnancy or death. The commissioner has access to records maintained by a medical examiner, a coroner, or hospitals or to hospital discharge data, for the purpose of providing the name and location of any pre-pregnancy, prenatal, or other care received by the subject of the data up to one year after the end of the pregnancy.\n(b) The provider or responsible authority that creates, maintains, or stores the data shall furnish the data upon the request of the commissioner. The provider or responsible authority may charge a fee for providing the data, not to exceed the actual cost of retrieving and duplicating the data.\n(c) The commissioner shall make a good faith reasonable effort to notify the parent, spouse, other guardian, or legal representative of the subject of the data before collecting data on the subject. For purposes of this paragraph, \"reasonable effort\" means one notice is sent by certified mail to the last known address of the parent, spouse, guardian, or legal representative informing the recipient of the data collection and offering a public health nurse support visit if desired.\n(d) The commissioner does not have access to coroner or medical examiner data that are part of an active investigation as described in section 13.83.\n(e) The commissioner may request and receive from a coroner or medical examiner the name of the health care provider that provided prenatal, postpartum, or other health services to the subject of the data.\n(f) The commissioner may access Department of Human Services data to identify sources of care and services to assist with the evaluation of welfare systems, including housing, to reduce preventable maternal deaths.\n(g) The commissioner may request and receive law enforcement reports or incident reports related to the subject of the data.\nAfter the commissioner has collected all data about a subject of a maternal death study needed to perform the study, the data from source records obtained under subdivision 2, other than data identifying the subject, must be transferred to separate records to be maintained by the commissioner. Notwithstanding section 138.17, after the data have been transferred, all source records obtained under subdivision 2 possessed by the commissioner must be destroyed.\n(a) Data provided to the commissioner from source records under subdivision 2, including identifying information on individual providers, data subjects, or their children, and data derived by the commissioner under subdivision 3 for the purpose of carrying out maternal death studies, are classified as confidential data on individuals or confidential data on decedents, as defined in sections 13.02, subdivision 3, and 13.10, subdivision 1, paragraph (a).\n(b) Information classified under paragraph (a) shall not be subject to discovery or introduction into evidence in any administrative, civil, or criminal proceeding. Such information otherwise available from an original source shall not be immune from discovery or barred from introduction into evidence merely because it was utilized by the commissioner in carrying out maternal death studies.\n(c) Summary data on maternal death studies created by the commissioner, which does not identify individual data subjects or individual providers, shall be public in accordance with section 13.05, subdivision 7.\n(d) Data provided by the commissioner of human services to the commissioner of health under this section retain the same classification the data held when retained by the commissioner of human services, as required under section 13.03, subdivision 4, paragraph (c).\n(a) The commissioner of health shall convene a Maternal Mortality Review Committee to conduct maternal death study reviews, make recommendations, and publicly share summary information. The commissioner shall appoint members to the review committee, and membership may include but is not limited to medical examiners or coroners, representatives of health care institutions that provide care to pregnant women, obstetric and midwifery practitioners, Medicaid representatives, representatives of state agencies, individuals from communities with disparate rates of maternal mortality, and other subject matter experts as appropriate. Committee membership shall not exceed 25 members. The review committee shall review data from source records obtained under subdivision 2, other than data identifying the subject or the provider.\n(b) A person attending a Maternal Mortality Review Committee meeting shall not disclose what transpired at the meeting, except as necessary to carry out the purposes of the review committee. The proceedings and records of the review committee are protected nonpublic data as defined in section 13.02, subdivision 13. Discovery and introduction into evidence in legal proceedings of case review committee proceedings and records, and testimony in legal proceedings by review committee members and persons presenting information to the review committee, shall occur in compliance with the requirements in section 142A.03, subdivision 7, paragraph (e).",
	"repealed": false
}