{
	"id": "115C.021",
	"url": "https://www.revisor.mn.gov/statutes/cite/115C.021",
	"title": "115C.021 RESPONSIBLE PERSON.",
	"text": "Except as provided in subdivisions 2 to 5, a person is responsible for a release from a tank if the person is an owner or operator of the tank at any time during or after the release.\nAn owner of a tank is not responsible for a release from the tank if the owner can establish that:\n(1) the tank was in place but the owner did not know or have reason to know of its existence at the time the owner first acquired right, title, or interest in the tank; and\n(2) the owner did not by failure to report under section 115.061 or other action significantly contribute to the release after the owner knew or reasonably should have known of the existence of the tank.\nThe state, an agency of the state, or a political subdivision is not responsible for a release from a tank solely as a result of actions taken to manage, sell, or transfer tax-forfeited land where the tank is located under chapter 282 and other laws applicable to tax-forfeited land. This subdivision does not relieve the state, a state agency, or a political subdivision from liability for the daily operation of a tank under its control or responsibility located on tax-forfeited land.\n(a) The Department of Transportation is not responsible for a release from a tank under this section solely as a result of the acquisition of property or as a result of providing funds for the acquisition of such property either through loan or grant, if the property was acquired by the department through exercise of the power of eminent domain, through negotiated purchase in lieu of or after filing a petition for the taking of the property through eminent domain, or after adopting a layout plan for highway development under sections 161.15 to 161.241 describing the property and stating its intended use and the necessity of its taking.\n(b) A person who acquires property from the department, other than property acquired through a land exchange, is not a responsible person under this section solely as a result of the acquisition of property if the property was acquired by the department through exercise of the power of eminent domain, by negotiated purchase after filing a petition for the taking of the property through eminent domain, or after adopting a layout plan for highway development under sections 161.15 to 161.241 describing the property and stating its intended use and the necessity of its taking.\n(a) A mortgagee is not responsible for a release from a tank solely because the mortgagee becomes an owner of real property on which the tank is located through foreclosure of the mortgage or by receipt of the deed to the mortgaged property in lieu of foreclosure.\n(b) A mortgagee of real property where a tank is located or a holder of a security interest in a tank is not an operator of the tank for the purpose of this section solely because the mortgagee or holder has a capacity to influence the operation of the tank to protect its security interest.\nA heating fuel oil vendor is not a responsible person for a heating fuel oil release at a residential location if the release was caused solely by the failure of a tank owned by the homeowner.",
	"repealed": false
}