{
	"id": "169A.70",
	"url": "https://www.revisor.mn.gov/statutes/cite/169A.70",
	"title": "169A.70 ALCOHOL SAFETY PROGRAMS; CHEMICAL USE ASSESSMENTS.",
	"text": "(a) The county board of every county shall establish an alcohol safety program designed to provide chemical use assessments of persons convicted of an offense enumerated in subdivision 2.\n(b) County boards may enter into an agreement to establish a regional alcohol safety program. County boards may contract with other counties and agencies for alcohol problem screening and chemical use assessment services.\nA chemical use assessment must be conducted and an assessment report submitted to the court and to the Department of Public Safety by the county agency administering the alcohol safety program when:\n(1) the defendant is convicted of an offense described in section 169A.20 (driving while impaired), 169A.31 (alcohol-related school bus and Head Start bus driving), or 360.0752 (impaired aircraft operation); or\n(2) the defendant is arrested for committing an offense described in clause (1) but is convicted of another offense arising out of the circumstances surrounding the arrest.\n(a) The assessment report must be on a form prescribed by the commissioner and shall contain an evaluation of the convicted defendant concerning the defendant's prior traffic and criminal record, characteristics and history of alcohol and chemical use problems, and amenability to rehabilitation through the alcohol safety program. The report is classified as private data on individuals as defined in section 13.02, subdivision 12.\n(b) The assessment report must include:\n(1) a diagnosis of the nature of the offender's chemical and alcohol involvement;\n(2) an assessment of the severity level of the involvement;\n(3) a recommended level of care for the offender identified in section 254B.19, subdivision 1;\n(4) an assessment of the offender's placement needs;\n(5) recommendations for other appropriate remedial action or care, including aftercare services in section 254B.01, subdivision 12, that may consist of educational programs, one-on-one counseling, a program or type of treatment that addresses mental health concerns, or a combination of them; and\n(6) a specific explanation why no level of care or action was recommended, if applicable.\nA chemical use assessment required by this section must be conducted by an assessor appointed by the court. The assessor must meet the training and qualification requirements of section 245G.11, subdivisions 1 and 5. Notwithstanding section 13.82 (law enforcement data), the assessor shall have access to any police reports, laboratory test results, and other law enforcement data relating to the current offense or previous offenses that are necessary to complete the evaluation. An appointment for the defendant to undergo the assessment must be made by the court, a court services probation officer, or the court administrator as soon as possible but in no case more than one week after the defendant's court appearance. The assessment must be completed no later than three weeks after the defendant's court appearance. If the assessment is not performed within this time limit, the county where the defendant is to be sentenced shall perform the assessment. The county of financial responsibility must be determined under chapter 256G.\nThis section does not apply to a person who is not a resident of the state of Minnesota at the time of the offense and at the time of the assessment.\nMS 2022 [Repealed, 2023 c 50 art 2 s 63]\n(a) The court may not accept a chemical use assessment conducted before conviction as a substitute for the assessment required by this section unless the court ensures that the preconviction assessment meets the standards described in this section.\n(b) If the commissioner of public safety is making a decision regarding reinstating a person's driver's license based on a chemical use assessment, the commissioner shall ensure that the assessment meets the standards described in this section.",
	"repealed": false
}