{
	"id": "72A.20",
	"url": "https://www.revisor.mn.gov/statutes/cite/72A.20",
	"title": "72A.20 METHODS, ACTS, AND PRACTICES WHICH ARE DEFINED AS UNFAIR OR DECEPTIVE.",
	"text": "Making, issuing, circulating, or causing to be made, issued, or circulated, any estimate, illustration, circular, or statement misrepresenting the terms of any policy issued or to be issued or the benefits or advantages promised thereby or the dividends or share of the surplus to be received thereon, or making any false or misleading statement as to the dividends or share of surplus previously paid on similar policies, or making any misleading representation or any misrepresentation as to the financial condition of any insurer, or as to the legal reserve system upon which any life insurer operates, or using any name or title of any policy or class of policies misrepresenting the true nature thereof, or making any misrepresentation to any policyholder insured in any company for the purpose of inducing or tending to induce such policyholder to lapse, forfeit, or surrender insurance, shall constitute an unfair method of competition and an unfair and deceptive act or practice in the business of insurance.\nMaking, publishing, disseminating, circulating, or placing before the public, or causing, directly or indirectly, to be made, published, disseminated, circulated, or placed before the public, in a newspaper, magazine, or other publication, or in the form of a notice, circular, pamphlet, letter, or poster, or over any radio station, or in any other way, an advertisement, announcement, or statement, containing any assertion, representation, or statement with respect to the business of insurance, or with respect to any person in the conduct of the person's insurance business, which is untrue, deceptive, or misleading, shall constitute an unfair method of competition and an unfair and deceptive act or practice.\nMaking, publishing, disseminating, or circulating, directly or indirectly, or aiding, abetting, or encouraging the making, publishing, disseminating, or circulating of any oral or written statement or any pamphlet, circular, article, or literature which is false, or maliciously critical of or derogatory to the financial condition of an insurer, and which is calculated to injure any person engaged in the business of insurance, shall constitute an unfair method of competition and an unfair and deceptive act or practice.\nEntering into any agreement to commit, or by any concerted action committing, any act of boycott, coercion, or intimidation, resulting in or tending to result in unreasonable restraint of, or monopoly in, the business of insurance, shall constitute an unfair method of competition and an unfair and deceptive act or practice.\n[Renumbered 72A.201, subd 4a]\nFiling with any supervisory or other public official, or making, publishing, disseminating, circulating, or delivering to any person, or placing before the public, or causing, directly or indirectly, to be made, published, disseminated, circulated, delivered to any person, or placed before the public, any false statement of financial condition of an insurer with intent to deceive, shall constitute an unfair method of competition and an unfair and deceptive act or practice in the insurance business.\nMaking any false entry in any book, report, or statement of any insurer with intent to deceive any agent or examiner lawfully appointed to examine into its condition or into any of its affairs, or any public official to whom such insurer is required by law to report, or who has authority by law to examine into its condition or into any of its affairs, or, with like intent, willfully omitting to make a true entry of any material fact pertaining to the business of such insurer in any book, report, or statement of such insurer, shall constitute an unfair method of competition and an unfair and deceptive act or practice.\nIssuing or delivering, or permitting agents, officers, or employees to issue or deliver, agency company stock or other capital stock, or benefit certificates or shares in any common-law corporation, or securities or any special or advisory board contracts or other contracts of any kind promising returns and profits as an inducement to insurance, shall constitute an unfair method of competition and an unfair and deceptive act or practice.\n(a) Making or permitting any unfair discrimination between individuals of the same class and equal expectation of life in the rates charged for any contract of life insurance or of annuity or in the dividends or other benefits payable thereon, or in any other of the terms and conditions of such contract or in making or permitting the rejection of an individual's application for life insurance coverage, as well as the determination of the rate class for such individual, on the basis of a disability, shall constitute an unfair method of competition and an unfair and deceptive act or practice, unless the claims experience and actuarial projections and other data establish significant and substantial differences in class rates because of the disability.\n(b) Refusing to insure or refusing to continue to insure the life of a member of a reserve component of the armed forces of the United States, or the National Guard due to that person's status as a member, or duty assignment while a member of any of these military organizations, constitutes an unfair method of competition and an unfair and deceptive act or practice unless the individual has received an order for active duty.\n(c) Refusing to reinstate coverage for the insured or any covered dependents under an individual or group life or health insurance policy or contract of a member of a reserve component of the armed forces of the United States or the National Guard whose coverage or dependent coverage was terminated, canceled, or nonrenewed while that person was on active duty constitutes an unfair method of competition and an unfair and deceptive act or practice. For purposes of paragraphs (a) to (c), \"health insurance policy or contract\" means any policy, contract, or certificate providing benefits regulated under chapter 62A, 62C, 62D, or 64B.\nFor purposes of reinstatement of an individual policy, the person shall apply for reinstatement within 90 days after removal from active duty.\nThe reinstated coverage must not contain any new preexisting condition or other exclusion or limitation, except a condition determined by the Veterans Administration to be a disability incurred or aggravated in the line of duty. The remainder of a preexisting condition limitation that was not satisfied before the coverage was terminated may be applied once the person returns and coverage is reinstated. Reinstatement is effective upon the payment of any required premiums.\n(d) Refusing to offer, sell, or renew coverage; limiting coverage; or charging a rate different from that normally charged for the same coverage under a life insurance policy or health plan because the applicant who is also the proposed insured has been or is a victim of domestic abuse is an unfair method of competition and an unfair and deceptive act or practice.\nNothing in this paragraph prevents an insurer from underwriting a risk on the basis of the physical or mental history of an individual if the insurer does not take into consideration whether the individual's condition was caused by an act of domestic abuse.\nFor purposes of this paragraph, \"domestic abuse\" has the meaning given in section 518B.01, subdivision 2; and \"health plan\" has the meaning given in section 62Q.01, subdivision 3, and includes the coverages referred to in section 62A.011, subdivision 3, clauses (1), (7), (9), and (10).\nMaking or permitting any unfair discrimination between individuals of the same class and of essentially the same hazard in the amount of premium, policy fees, or rates charged for any policy or contract of accident or health insurance or in the benefits payable thereunder, or in any of the terms or conditions of such contract, or in any other manner whatever, or in making or permitting the rejection of an individual's application for accident or health insurance coverage, as well as the determination of the rate class for such individual, on the basis of a disability, shall constitute an unfair method of competition and an unfair and deceptive act or practice, unless the claims experience and actuarial projections and other data establish significant and substantial differences in class rates because of the disability.\nMS 2020 [Repealed, 2022 c 93 art 2 s 43]\nViolating any provision of the following sections of this chapter not set forth in this section shall constitute an unfair method of competition and an unfair and deceptive act or practice: sections 72A.12, subdivisions 2, 3, and 4, 72A.16, subdivision 2, 72A.03 and 72A.04, 72A.071, 72A.201, and 72A.49 to 72A.505.\nCausing or permitting with such frequency to indicate a general business practice any unfair, deceptive, or fraudulent act concerning any claim or complaint of an insured or claimant including, but not limited to, the following practices:\n(1) misrepresenting pertinent facts or insurance policy provisions relating to coverages at issue;\n(2) failing to acknowledge and act reasonably promptly upon communications with respect to claims arising under insurance policies;\n(3) failing to adopt and implement reasonable standards for the prompt investigation of claims arising under insurance policies;\n(4) refusing to pay claims without conducting a reasonable investigation based upon all available information;\n(5) failing to affirm or deny coverage of claims within a reasonable time after proof of loss statements have been completed;\n(6) not attempting in good faith to effectuate prompt, fair, and equitable settlements of claims in which liability has become reasonably clear;\n(7) compelling insureds to institute litigation to recover amounts due under an insurance policy by offering substantially less than the amounts ultimately recovered in actions brought by the insureds;\n(8) attempting to settle a claim for less than the amount to which reasonable persons would have believed they were entitled by reference to written or printed advertising material accompanying or made part of an application;\n(9) attempting to settle claims on the basis of an application which was altered without notice to, or knowledge or consent of, the insured;\n(10) making claims payments to insureds or beneficiaries not accompanied by a statement setting forth the coverage under which the payments are being made;\n(11) making known to insureds or claimants a policy of appealing from arbitration awards in favor of insureds or claimants for the purpose of compelling them to accept settlements or compromises less than the amount awarded in arbitration;\n(12) delaying the investigation or payment of claims by requiring an insured, claimant, or the physician of either to submit a preliminary claim report and then requiring the subsequent submission of formal proof of loss forms, both of which submissions contain substantially the same information;\n(13) failing to promptly settle claims, where liability has become reasonably clear, under one portion of the insurance policy coverage in order to influence settlements under other portions of the insurance policy coverage;\n(14) failing to promptly provide a reasonable explanation of the basis in the insurance policy in relation to the facts or applicable law for denial of a claim or for the offer of a compromise settlement;\n(15) requiring an insured to provide information or documentation that is or would be dated more than five years prior to or five years after the date of a fire loss, except for proof of ownership of the damaged property;\n(16) stating or implying to an insured that filing a claim related to the I-35W bridge collapse for no-fault motor vehicle insurance benefits would or may result in cancellation or nonrenewal of the insured's policy or in a surcharge or other future increase in premium rates, when any such consequence of filing the claim would be prohibited by law;\n(17) failing to promptly inform an insured who files a claim related to the I-35W bridge collapse and described in section 65B.133, subdivision 5a, of the provisions of that law, both orally and in writing.\n[Renumbered 72A.201]\n(a) Refusing to renew, declining to offer or write, or charging differential rates for an equivalent amount of homeowner's insurance coverage, as defined by section 65A.27, for property located in a town or statutory or home rule charter city, in which the insurer offers to sell or writes homeowner's insurance, solely because:\n(1) of the geographic area in which the property is located;\n(2) of the age of the primary structure sought to be insured;\n(3) the insured or prospective insured was denied coverage of the property by another insurer, whether by cancellation, nonrenewal or declination to offer coverage, for a reason other than those specified in section 65A.01, subdivision 3a, clauses (a) to (e);\n(4) the property of the insured or prospective insured has been insured under the Minnesota FAIR Plan Act, shall constitute an unfair method of competition and an unfair and deceptive act or practice; or\n(5) the insured has inquired about coverage for a hypothetical claim or has made an inquiry to the insured's agent regarding a potential claim.\n(b) An insurer must not establish more than one geographical rating territory within the same city of the first class or city of the second class that has 60,000 or more inhabitants. For purposes of compliance with this paragraph: (1) the population of the cities subject to this paragraph is determined by the preceding United States decennial census, as reported by the Minnesota State Demographic Center; and (2) the territorial boundaries of the cities subject to this paragraph are the boundaries as the boundaries exist on December 31 in years ending in 0 or 5, whichever is more recent. Any revisions to the rating manual resulting from a change in the territorial boundaries or population must be filed with the commissioner within 120 days of the date the data are reported.\n(c) This subdivision shall not prohibit the insurer from applying underwriting or rating standards which the insurer applies generally in all other locations in the state and which are not specifically prohibited by paragraph (a), clauses (1) to (5). Such underwriting or rating standards shall specifically include but not be limited to standards based upon the proximity of the insured property to an extraordinary hazard or based upon the quality or availability of fire protection services or based upon the density or concentration of the insurer's risks. Paragraph (a), clause (2), shall not prohibit the use of rating standards based upon the age of the insured structure's plumbing, electrical, heating or cooling system or other part of the structure, the age of which affects the risk of loss. Any insurer's failure to comply with section 65A.29, subdivisions 2 to 4, either (1) by failing to give an insured or applicant the required notice or statement or (2) by failing to state specifically a bona fide underwriting or other reason for the refusal to write shall create a presumption that the insurer has violated this subdivision.\nAn insurance agent refusing to supply a requested application form for homeowner's insurance with any insurer whom the agent represents or refusing to transmit forthwith any completed application form to the insurer, shall constitute an unfair method of competition and an unfair and deceptive act or practice.\nMS 2020 [Repealed, 2022 c 93 art 2 s 43]\nRefusing to insure, refusing to continue to insure, refusing to offer or submit an application for coverage, or limiting the amount of coverage available to an individual because of the sex or marital status of the individual; however, nothing in this subsection prohibits an insurer from taking marital status into account for the purpose of defining persons eligible for dependents' benefits.\n(a) Refusing, upon surrender of an individual policy of life insurance in the case of the insured's death, or in the case of a surrender prior to death, of an individual insurance policy not covered by the standard nonforfeiture laws under section 61A.24, to refund to the owner all unearned premiums paid on the policy covering the insured as of the time of the insured's death or surrender if the unearned premium is for a period of more than one month. The return of unearned premium must be delivered to the insured within 30 days following receipt by the insurer of the insured's request for cancellation.\n(b) Refusing, upon termination or cancellation of a policy of automobile insurance under section 65B.14, subdivision 2, or a policy of homeowner's insurance under section 65A.27, subdivision 4, or a policy of accident and sickness insurance under section 62A.01, or a policy of comprehensive health insurance under chapter 62E, to refund to the insured all unearned premiums paid on the policy covering the insured as of the time of the termination or cancellation if the unearned premium is for a period of more than one month. The return of unearned premium must be delivered to the insured within 30 days following receipt by the insurer of the insured's request for cancellation.\n(c) This subdivision does not apply to policies of insurance providing coverage only for motorcycles or other seasonally rated or limited use vehicles where the rate is reduced to reflect seasonal or limited use.\n(d) For purposes of this section, a premium is unearned during the period of time the insurer has not been exposed to any risk of loss. Except for premiums for motorcycle coverage or other seasonally rated or limited use vehicles where the rate is reduced to reflect seasonal or limited use, the unearned premium is determined by multiplying the premium by the fraction that results from dividing the period of time from the date of termination to the date the next scheduled premium is due by the period of time for which the premium was paid.\n(e) The owner may cancel a policy referred to in this section at any time during the policy period. This provision supersedes any inconsistent provision of law or any inconsistent policy provision.\n(a) Improperly withholding, misappropriating, or converting any money belonging to a policyholder, beneficiary, or other person when received in the course of the insurance business; or (b) engaging in fraudulent, coercive, or dishonest practices in connection with the insurance business, shall constitute an unfair method of competition and an unfair and deceptive act or practice.\nNo life or health insurance company doing business in this state shall engage in any selection or underwriting process unless the insurance company establishes beforehand substantial data, actuarial projections, or claims experience which support the underwriting standards used by the insurance company. The data, projections, or claims experience used to support the selection or underwriting process is not limited to only that of the company. The experience, projections, or data of other companies or a rate service organization may be used as well.\nAn insurance company may not terminate or otherwise penalize an insurance agent solely because the agent contacted any government department or agency regarding a problem that the agent or an insured may be having with an insurance company. For purposes of this section, \"government department or agency\" includes the executive, legislative, and judicial branches of government as stated in article III of the constitution.\nNo insurance company doing business in this state shall engage in any selection or underwriting practice that is arbitrary, capricious, or unfairly discriminatory.\n(a) No insurer providing benefits under the Minnesota No-Fault Automobile Insurance Act or a plan authorized by sections 471.617 or 471.98 to 471.982 may limit the type of licensed health care provider who may provide treatment for covered conditions under a policy so long as the services provided are within the scope of licensure for the provider. The insurer may not exclude a specific method of treatment for a covered condition if that exclusion has the effect of excluding a specific type of licensed health care provider from treating a covered condition.\n(b) This subdivision does not limit the right of an insurer to contract with individual members of any type of licensed health care provider to the exclusion of other members of the group, nor shall it limit the right to the insurer to exclude coverage for a type of treatment if the insurer can show the treatment is not medically necessary or is not medically appropriate.\n(a) No insurer that offers an automobile insurance policy in this state shall:\n(1) use the employment status of the applicant as an underwriting standard or guideline; or\n(2) deny coverage to a policyholder for the same reason.\n(b) No insurer that offers an automobile insurance policy in this state shall:\n(1) use the applicant's status as a residential tenant, as the term is defined in section 504B.001, subdivision 12, as an underwriting standard or guideline; or\n(2) deny coverage to a policyholder for the same reason; or\n(3) make any discrimination in offering or establishing rates, premiums, dividends, or benefits of any kind, or by way of rebate, for the same reason.\n(c) No insurer that offers an automobile insurance policy in this state shall:\n(1) use the failure of the applicant to have an automobile policy in force during any period of time before the application is made as an underwriting standard or guideline; or\n(2) deny coverage to a policyholder for the same reason.\nParagraph (c) does not apply if the applicant was required by law to maintain automobile insurance coverage and failed to do so.\nAn insurer may require reasonable proof that the applicant did not fail to maintain this coverage. The insurer is not required to accept the mere lack of a conviction or citation for failure to maintain this coverage as proof of failure to maintain coverage. The insurer must provide the applicant with information identifying the documentation that is required to establish reasonable proof that the applicant did not fail to maintain the coverage.\n(d) No insurer that offers an automobile insurance policy in this state shall use an applicant's prior claims for benefits paid under section 65B.44 as an underwriting standard or guideline if the applicant was 50 percent or less negligent in the accident or accidents causing the claims.\n(e) No insurer shall refuse to issue any standard or preferred policy of motor vehicle insurance or make any discrimination in the acceptance of risks, in rates, premiums, dividends, or benefits of any kind, or by way of rebate:\n(1) between persons of the same class, or\n(2) on account of race, or\n(3) on account of physical disability if the disability is compensated for by special training, equipment, prosthetic device, corrective lenses, or medication and if the physically disabled person:\n(i) is licensed by the Department of Public Safety to operate a motor vehicle in this state, and\n(ii) operates only vehicles that are equipped with auxiliary devices and equipment necessary for safe and effective operation by the disabled person, or\n(4) on account of marital dissolution.\n(a) No insurer shall, within one year after default in the payment of any premium on an individual life insurance policy, declare the individual life insurance policy to be canceled or nonrenewed for nonpayment of premium unless it mails or delivers to the policy owner, at the policy owner's last known address, at least 30 days before lapse, final notice of the cancellation or nonrenewal and the effective date of the cancellation or nonrenewal. For purposes of this subdivision, \"individual life insurance policy\" includes policies in default on or after August 1, 2011.\n(b) No insurer on an individual health policy or on an individual nonprofit health service plan corporation subscriber contract shall cancel or fail to renew the policy or contract for nonpayment of premium unless it mails or delivers to the named policy owner or named contract owner, at the policy or subscriber contract owner's last known address, at least 30 days before lapse, final notice of the cancellation or nonrenewal. If the named insured is not the policy or subscriber contract owner of the individual health policy or the individual nonprofit health service plan subscriber contract, the notice required by this subdivision must also be sent to the named insured at the named insured's last known address.\n(c) Proof of mailing of the notice of lapse under paragraph (a) or (b) for failure to pay the premium before the expiration of the grace period is sufficient proof that notice required in this subdivision has been given.\n(d) This subdivision does not apply to a life or health insurance policy or contract upon which premiums are paid at a monthly interval or less and that contains any grace period required by statute for the payment of premiums during which time the insurance continues in force.\nNo statement of a minor or information obtained by an insurer or a representative of an insurer from a minor may be used in any manner in regard to a claim unless the parent or guardian of the minor has granted permission for the minor to be interviewed or the minor's statement to be taken.\nAn insurer shall without cost to the insured provide an insured with the loss or claims experience of that insured for the current policy period and for the two policy periods preceding the current one for which the insurer has provided coverage, within 30 days of a request for the information by the policyholder. Whenever reporting loss experience data, actual claims paid on behalf of the insured must be reported separately from claims incurred but not paid, pooling charges for catastrophic claim protection, and any other administrative fees or charges that may be charged as an incurred claim expense. Claims experience data must be provided to the insured in accordance with state and federal requirements regarding the confidentiality of medical data. The insurer shall not be responsible for providing information without cost more often than once in a 12-month period. The insurer is not required to provide the information if the policy covers the employee of more than one employer and the information is not maintained separately for each employer and not all employers request the data.\nAn insurer, health maintenance organization, or a third-party administrator may not request more than three years of loss or claims experience as a condition of submitting an application or providing coverage.\nThis subdivision only applies to group life policies and group health policies.\n(a) A loan officer, a loan representative, or other person involved in taking or processing a loan may not solicit an insurance product, except for credit life, credit disability, credit involuntary unemployment, mortgage life, mortgage accidental death, or mortgage disability, and except for life insurance when offered in lieu of credit life insurance, from the completion of the initial loan application, as defined in the federal Equal Credit Opportunity Act, United States Code, title 15, sections 1691 to 1691f, and any regulations adopted under those sections, until after the closing of the loan transaction.\n(b) This subdivision applies only to loan transactions covered by the federal Truth-in-Lending Act, United States Code, title 15, sections 1601 to 1666j, and any regulations adopted under those sections.\n(c) This subdivision does not apply to sales of title insurance, homeowner's insurance, a package homeowner's-automobile insurance product, automobile insurance, or a similar insurance product, required to perfect title to, or protect, property for which a security interest will be taken if the product is required as a condition of the loan.\n(d) Nothing in this subdivision prohibits the solicitation or sale of any insurance product by means of mass communication.\nAn issuer providing health coverage through conversion policies, plans, or contracts shall not impose a fee or charge, other than the premium, for issuing these policies, plans, or contracts.\nNo insurer regulated under chapter 61A, 62B, or 62S, or providing health, medical, hospitalization, long-term care insurance, or accident and sickness insurance regulated under chapter 62A, or nonprofit health service plan corporation regulated under chapter 62C, health maintenance organization regulated under chapter 62D, or fraternal benefit society regulated under chapter 64B, may:\n(1) use the results of a test to determine the presence of the human immunodeficiency virus (HIV) antibody performed on an offender under section 611A.19 or performed on a crime victim who was exposed to or had contact with an offender's bodily fluids during commission of a crime that was reported to law enforcement officials, in order to make an underwriting decision, cancel, fail to renew, or take any other action with respect to a policy, plan, certificate, or contract;\n(2) use the results of a test to determine the presence of a blood-borne pathogen performed on an individual according to sections 144.7401 to 144.7415, 241.33 to 241.342, or 246.71 to 246.722 in order to make an underwriting decision, cancel, fail to renew, or take any other action with respect to a policy, plan, certificate, or contract; or\n(3) ask an applicant for coverage or a person already covered whether the person has: (i) had a test performed for the reason set forth in clause (1) or (2); or (ii) been the victim of an assault or any other crime which involves bodily contact with the offender.\nThis subdivision does not affect tests conducted for purposes other than those described in clause (1) or (2), including any test to determine the presence of a blood-borne pathogen if such test was performed at the insurer's direction as part of the insurer's normal underwriting requirements.\n(a) No insurer regulated under chapter 61A or 62B, or providing health, medical, hospitalization, or accident and sickness insurance regulated under chapter 62A, or nonprofit health services corporation regulated under chapter 62C, health maintenance organization regulated under chapter 62D, or fraternal benefit society regulated under chapter 64B, may make an underwriting decision, cancel, fail to renew, or take any other action with respect to a policy, plan, certificate, or contract based solely on the fact of a person's participation in a human immunodeficiency virus (HIV) vaccine clinical trial.\n(b) If a test to determine the presence of the HIV antibody is performed at the insurer's direction, as part of the insurer's normal underwriting requirements or on any other basis, and an applicant or covered person is a participant or former participant in a vaccine clinical trial and tests positive for the HIV antibody in the insurer-directed test, the person shall disclose the person's status as a participant or former participant in a vaccine clinical trial and provide the insurance company with certification from the trial sponsor of the person's participation or former participation in the vaccine trial. Upon that notification, an insurer shall stay any adverse decision or refrain from making an underwriting decision to cancel, fail to renew, or take any other action based solely on the positive test result until the insurer obtains a confidential certificate from the sponsor of the trial verifying the person's HIV status. If the confidential certificate indicates that the person's HIV antibodies are a result of exposure to the vaccine, that the person does not have the HIV virus, and that the person did not test positive for the HIV virus in any test administered by the trial sponsor prior to entering the vaccine clinical trial, the insurer shall ignore the presence of the HIV antibody in the insurer-directed test.\n(c) This subdivision does not affect any tests to determine the presence of the HIV antibody, except as provided under paragraph (b).\n(d) This subdivision does not apply to persons who are confirmed as having the HIV virus.\n(e) For purposes of this subdivision, \"vaccine clinical trial\" means a clinical trial conducted by a sponsor under an investigational new drug application as provided by Code of Federal Regulations, title 21, section 312. \"Sponsor\" means the hospital, clinic, or health care professional that is conducting the vaccine clinical trial.\nAn insurer shall retain copies of all underwriting documents, policy forms, and applications for three years from the effective date of the policy. An insurer shall retain all claim files and documentation related to a claim for three years from the date the claim was paid or denied. This subdivision does not relieve the insurer of its obligation to produce these documents to the department after the retention period has expired in connection with an enforcement action or administrative proceeding against the insurer from whom the documents are requested, if the insurer has retained the documents. Records required to be retained by this section may be retained in paper, photograph, microprocess, magnetic, mechanical, or electronic media, or by any process which accurately reproduces or forms a durable medium for the reproduction of a record.\nPremiums charged by a health plan company, as defined in section 62Q.01, shall be reasonable, adequate, and not predatory in relation to the benefits, considering actuarial projection of the cost of providing or paying for the covered health services, considering the costs of administration, and in relation to the reserves and surplus required by law.\nNo insurer or health plan company may design a network of providers, policies on access to providers, or marketing strategy in such a way as to discourage enrollment by individuals or groups whose health care needs are perceived as likely to be more expensive than the average. This subdivision does not prohibit underwriting and rating practices that comply with Minnesota law.\nNo insurer or health plan company may give any financial incentive to a health care provider based solely on the number of services denied or referrals not authorized by the provider. This subdivision does not prohibit capitation or other compensation methods that serve to hold health care providers financially accountable for the cost of caring for a patient population.\nIn recommending or issuing life, endowment, individual accident and sickness, long-term care, annuity, life-endowment, or Medicare supplement insurance to a customer, an insurer, either directly or through its agent, must have reasonable grounds for believing that the recommendation is suitable for the customer.\nIn the case of group insurance marketed on a direct response basis without the use of direct agent contact, this subdivision is satisfied if the insurer has reasonable grounds to believe that the insurance offered is generally suitable for the group to whom the offer is made.\nAny health plan under section 62A.011, subdivision 3, that includes a specific policy limit within its insurance policy, certificate, or subscriber agreement shall calculate the policy limit by using the amount actually paid on behalf of the insured, subscriber, or dependents for services covered under the policy, subscriber agreement, or certificate unless the amount paid is greater than the billed charge. This provision does not permit the application of a specific policy limit within a health plan where the limit is prohibited under the Affordable Care Act as defined in section 62A.011, subdivision 1a.\n(a) No insurer or group of affiliated insurers may reject, cancel, or nonrenew a policy of private passenger motor vehicle insurance as defined under section 65B.01 or a policy of homeowner's insurance as defined under section 65A.27, for any person in whole or in part on the basis of credit information, including a credit reporting product known as a \"credit score\" or \"insurance score,\" without consideration and inclusion of any other applicable underwriting factor.\n(b) If credit information, credit scoring, or insurance scoring is to be used in underwriting, the insurer must disclose to the consumer that credit information will be obtained and used as part of the insurance underwriting process.\n(c) Insurance inquiries and non-consumer-initiated inquiries must not be used as part of the credit scoring or insurance scoring process.\n(d) If a credit score, insurance score, or other credit information relating to a consumer, with respect to the types of insurance referred to in paragraph (a), is adversely impacted or cannot be generated because of the absence of a credit history, the insurer must exclude the use of credit as a factor in the decision to reject, cancel, or nonrenew.\n(e) Insurers must upon the request of a policyholder reevaluate the policyholder's score. Any change in premium resulting from the reevaluation must be effective upon the renewal of the policy. An insurer is not required to reevaluate a policyholder's score pursuant to this paragraph more than twice in any given calendar year.\n(f) Insurers must upon request of the applicant or policyholder provide reasonable underwriting exceptions based upon prior credit histories for persons whose credit information is unduly influenced by expenses related to a catastrophic injury or illness, temporary loss of employment, or the death of an immediate family member. The insurer may require reasonable documentation of these events prior to granting an exception.\n(g) A credit scoring or insurance scoring methodology must not be used by an insurer if the credit scoring or insurance scoring methodology incorporates the gender, race, nationality, or religion of an insured or applicant.\n(h) Insurers that employ a credit scoring or insurance scoring system in underwriting of coverage described in paragraph (a) must have on file with the commissioner:\n(1) the insurer's credit scoring or insurance scoring methodology; and\n(2) information that supports the insurer's use of a credit score or insurance score as an underwriting criterion.\n(i) Insurers described in paragraph (h) shall file the required information with the commissioner within 120 days of August 1, 2002, or prior to implementation of a credit scoring or insurance scoring system by the insurer, if that date is later.\n(j) Information provided by, or on behalf of, an insurer to the commissioner under this subdivision is trade secret information under section 13.37.\n(a) A health carrier, as defined in section 62A.011, subdivision 2, is not in violation of this chapter for electronically transmitting or electronically making available information otherwise required to be delivered in writing under chapters 62A to 62Q and 72A to an enrollee as defined in section 62Q.01, subdivision 2b, or to a health plan as defined in paragraph (b), and with the requirements of those chapters if the following conditions are met:\n(1) the health carrier informs the group policyholder or the enrollee or both that electronic transmission or access is available and, at the discretion of the health carrier, the enrollee is given one of the following options:\n(i) electronic transmission or access will occur only if the group policyholder or the enrollee or both affirmatively requests to the health carrier that the required information be electronically transmitted or available and a record of that request is retained by the health carrier; or\n(ii) electronic transmission or access will automatically occur if the group policyholder or the enrollee or both has not opted out of that manner of transmission by request to the health carrier and requested that the information be provided in writing. If the group policyholder or the enrollee or both opts out of electronic transmission, a record of that request must be retained by the health carrier;\n(2) the group policyholder or the enrollee or both is allowed to withdraw the request at any time;\n(3) if the information transmitted electronically contains individually identifiable data, it must be transmitted to a secured mailbox. If the information made available electronically contains individually identifiable data, it must be made available at a password-protected secured website;\n(4) the group policyholder or the enrollee or both is provided a customer service number on the enrollee's member card that may be called to request a written copy of the document; and\n(5) the electronic transmission or electronic availability meets all other requirements of this chapter including, but not limited to, size of the typeface and any required time frames for distribution.\n(b) For the purpose of this section, \"health plan\" means a health plan as defined in section 62A.011 or a policy of accident and sickness insurance as defined in section 62A.01.\nNo person shall, in connection with a service contract regulated under chapter 59B:\n(1) attempt to settle claims on the basis of an application or any other material document which was altered without notice to, or knowledge or consent of, the service contract holder;\n(2) make a material misrepresentation to the service contract holder for the purpose and with the intent of effecting settlement of the claims, loss, or damage under the contract on less favorable terms than those provided in, and contemplated by, the contract; or\n(3) commit or perform with such frequency as to indicate a general business practice any of the following practices:\n(i) failure to properly investigate claims;\n(ii) misrepresentation of pertinent facts or contract provisions relating to coverages at issue;\n(iii) failure to acknowledge and act upon communications within a reasonable time with respect to claims;\n(iv) denial of claims without conducting reasonable investigations based upon available information;\n(v) failure to affirm or deny coverage of claims upon written request of the service contract holder within a reasonable time after proof-of-loss statements have been completed; or\n(vi) failure to timely provide a reasonable explanation to the service contract holder of the basis in the contract in relation to the facts or applicable law for denial of a claim or for the offer of a compromise settlement.\nAn insurer, including, but not limited to, a health plan company as defined in section 62Q.01, subdivision 4; a reparation obligor as defined in section 65B.43, subdivision 9; and a workers' compensation insurer shall not consider in determining a health care provider's usual and customary payment, standard payment, or allowable payment used as a basis for determining the provider's payment by the insurer, the following discounted payment situations:\n(1) care provided to relatives of the provider;\n(2) care for which a discount or free care is given in hardship situations; and\n(3) care for which a discount is given in exchange for cash payment.\nFor purposes of this subdivision, \"health care provider\" and \"provider\" have the meaning given in section 62J.03, subdivision 8.\nWhen determining whether to issue, renew, cancel, or modify a policy of life insurance, an insurer may not make an underwriting determination based solely on information revealing that a proposed insured has a prescription for an opiate antagonist, as defined in section 604A.04, subdivision 1.\nA life insurance, long-term care insurance, or disability insurance carrier is prohibited from declining or limiting coverage of an insured or otherwise discriminating in the premium rating, offering, issuance, cancellation, amount of coverage, or any other condition based solely upon the status of an insured as a living organ or bone marrow donor and without additional actuarial risks.",
	"repealed": false
}