{
	"id": "256B.021",
	"url": "https://www.revisor.mn.gov/statutes/cite/256B.021",
	"title": "256B.021 MEDICAL ASSISTANCE REFORM WAIVER.",
	"text": "It is the intent of the legislature to reform components of the medical assistance program for seniors and people with disabilities or other complex needs, and medical assistance enrollees in general, in order to achieve better outcomes, such as community integration and independence; improved health; reduced reliance on institutional care; maintained or obtained employment and housing; and long-term sustainability of needed services through better alignment of available services that most effectively meet people's needs, including other state agencies' services.\nThe commissioner shall develop a proposal to the United States Department of Health and Human Services, which shall include any necessary waivers, state plan amendments, requests for new funding or realignment of existing funds, and any other federal authority that may be necessary for the projects specified in subdivision 4. The commissioner shall ensure all projects are budget neutral or result in savings to the state budget, considering cost changes across all divisions and other agencies that are affected.\nThe commissioner shall report to the members of the legislative committees having jurisdiction over human services issues by January 15, 2012, regarding the progress of this waiver, and make recommendations regarding any legislative changes necessary to accomplish the projects in subdivision 4.\nThe commissioner shall request permission and funding to further the following initiatives.\n(a) Health care delivery demonstration projects. This project involves testing alternative payment and service delivery models in accordance with sections 256B.0755 and 256B.0756. These demonstrations will allow the Minnesota Department of Human Services to engage in alternative payment arrangements with provider organizations that provide services to a specified patient population for an agreed upon total cost of care or risk/gain sharing payment arrangement, but are not limited to these models of care delivery or payment. Quality of care and patient experience will be measured and incorporated into payment models alongside the cost of care. Demonstration sites should include Minnesota health care programs fee-for-services recipients and managed care enrollees and support a robust primary care model and improved care coordination for recipients.\n(b) Promote personal responsibility and encourage and reward healthy outcomes. This project provides Medicaid funding to provide individual and group incentives to encourage healthy behavior, prevent the onset of chronic disease, and reward healthy outcomes. Focus areas may include diabetes prevention and management, tobacco cessation, reducing weight, lowering cholesterol, and lowering blood pressure.\n(c) Encourage utilization of high quality, cost-effective care. This project creates incentives through Medicaid and MinnesotaCare enrollee cost-sharing and other means to encourage the utilization of high-quality, low-cost, high-value providers, as determined by the state's provider peer grouping initiative under section 62U.04.\n(d) Adults without children. This proposal includes requesting federal authority to impose a limit on assets for adults without children in medical assistance, as defined in section 256B.055, subdivision 15, who have a household income equal to or less than 75 percent of the federal poverty limit, and to impose a 180-day durational residency requirement in MinnesotaCare, consistent with section 256L.09, subdivision 4, for adults without children, regardless of income.\n(e) Empower and encourage work, housing, and independence. This project provides services and supports for individuals who have an identified health or disabling condition but are not yet certified as disabled, in order to delay or prevent permanent disability, reduce the need for intensive health care and long-term care services and supports, and to help maintain or obtain employment or assist in return to work. Benefits may include:\n(1) coordination with health care homes or health care coordinators;\n(2) assessment for wellness, housing needs, employment, planning, and goal setting;\n(3) training services;\n(4) job placement services;\n(5) career counseling;\n(6) benefit counseling;\n(7) worker supports and coaching;\n(8) assessment of workplace accommodations;\n(9) transitional housing services; and\n(10) assistance in maintaining housing.\n(f) Redesign home and community-based services. This project realigns existing funding, services, and supports for people with disabilities and older Minnesotans to ensure community integration and a more sustainable service system. This may involve changes that promote a range of services to flexibly respond to the following needs:\n(1) provide people less expensive alternatives to medical assistance services;\n(2) offer more flexible and updated community support services under the Medicaid state plan;\n(3) provide an individual budget and increased opportunity for self-direction;\n(4) strengthen family and caregiver support services;\n(5) allow persons to pool resources or save funds beyond a fiscal year to cover unexpected needs or foster development of needed services;\n(6) use of home and community-based waiver programs for people whose needs cannot be met with the expanded Medicaid state plan community support service options;\n(7) target access to residential care for those with higher needs;\n(8) develop capacity within the community for crisis intervention and prevention;\n(9) redesign case management;\n(10) offer life planning services for families to plan for the future of their child with a disability;\n(11) enhance self-advocacy and life planning for people with disabilities;\n(12) improve information and assistance to inform long-term care decisions; and\n(13) increase quality assurance, performance measurement, and outcome-based reimbursement.\nThis project may include different levels of long-term supports that allow seniors to remain in their homes and communities, and expand care transitions from acute care to community care to prevent hospitalizations and nursing home placement. The levels of support for seniors may range from basic community services for those with lower needs, access to residential services if a person has higher needs, and targets access to nursing home care to those with rehabilitation or high medical needs. This may involve the establishment of medical need thresholds to accommodate the level of support needed; provision of a long-term care consultation to persons seeking residential services, regardless of payer source; adjustment of incentives to providers and care coordination organizations to achieve desired outcomes; and a required coordination with medical assistance basic care benefit and Medicare/Medigap benefit. This proposal will improve access to housing and improve capacity to maintain individuals in their existing home; adjust screening and assessment tools, as needed; improve transition and relocation efforts; seek federal financial participation for alternative care and essential community supports; and provide Medigap coverage for people having lower needs.\n(g) Coordinate and streamline services for people with complex needs, including those with multiple diagnoses of physical, mental, and developmental conditions. This project will coordinate and streamline medical assistance benefits for people with complex needs and multiple diagnoses. It would include changes that:\n(1) develop community-based service provider capacity to serve the needs of this group;\n(2) build assessment and care coordination expertise specific to people with multiple diagnoses;\n(3) adopt service delivery models that allow coordinated access to a range of services for people with complex needs;\n(4) reduce administrative complexity;\n(5) measure the improvements in the state's ability to respond to the needs of this population; and\n(6) increase the cost-effectiveness for the state budget.\n(h) Implement nursing home level of care criteria. This project involves obtaining any necessary federal approval in order to implement the changes to the level of care criteria in section 144.0724, subdivision 11, and implement further changes necessary to achieve reform of the home and community-based service system.\n(i) Improve integration of Medicare and Medicaid. This project involves reducing fragmentation in the health care delivery system to improve care for people eligible for both Medicare and Medicaid, and to align fiscal incentives between primary, acute, and long-term care. The proposal may include:\n(1) requesting an exception to the new Medicare methodology for payment adjustment for fully integrated special needs plans for dual eligible individuals;\n(2) testing risk adjustment models that may be more favorable to capturing the needs of frail dually eligible individuals;\n(3) requesting an exemption from the Medicare bidding process for fully integrated special needs plans for the dually eligible;\n(4) modifying the Medicare bid process to recognize additional costs of health home services; and\n(5) requesting permission for risk-sharing and gain-sharing.\n(j) Intensive residential treatment services. This project would involve providing intensive residential treatment services for individuals who have serious mental illness and who have other complex needs. This proposal would allow such individuals to remain in these settings after mental health symptoms have stabilized, in order to maintain their mental health and avoid more costly or unnecessary hospital or other residential care due to their other complex conditions. The commissioner may pursue a specialized rate for projects created under this section.\n(k) Seek federal Medicaid matching funds for Anoka-Metro Regional Treatment Center (AMRTC). This project involves seeking Medicaid reimbursement for medical services provided to patients to AMRTC, including requesting a waiver of United States Code, title 42, section 1396d, which prohibits Medicaid reimbursement for expenditures for services provided by hospitals with more than 16 beds that are primarily focused on the treatment of mental illness. This waiver would allow AMRTC to serve as a statewide resource to provide diagnostics and treatment for people with the most complex conditions.\n(l) Waivers to allow Medicaid eligibility for children under age 21 receiving care in residential facilities. This proposal would seek Medicaid reimbursement for any Medicaid-covered service for children who are placed in residential settings that are determined to be \"institutions for mental diseases,\" under United States Code, title 42, section 1396d.\nThe commissioner shall evaluate the projects contained in subdivision 4, paragraphs (f), clauses (2) and (12), and (h). The evaluation must include:\n(1) an impact assessment focusing on program outcomes, especially those experienced directly by the person receiving services;\n(2) study samples drawn from the population of interest for each project; and\n(3) a time series analysis to examine aggregate trends in average monthly utilization, expenditures, and other outcomes in the targeted populations before and after implementation of the initiatives.\nThe commissioner is authorized to accept and expend federal funds that support the purposes of this section.\nAs provided under subdivision 4, paragraph (e), upon federal approval, the commissioner shall establish a demonstration project to provide navigation, employment supports, and benefits planning services to a targeted group of federally funded Medicaid recipients to begin July 1, 2014. This demonstration shall promote economic stability, increase independence, and reduce applications for disability benefits while providing a positive impact on the health and future of participants.\n[Repealed, 2014 c 275 art 1 s 139]",
	"repealed": false
}