{
	"id": "17.133",
	"url": "https://www.revisor.mn.gov/statutes/cite/17.133",
	"title": "17.133 FARM DOWN PAYMENT ASSISTANCE GRANTS.",
	"text": "(a) For purposes of this section, the following terms have the meanings given.\n(b) \"Eligible farmer\" means an individual who at the time that the grant is awarded:\n(1) is a resident of Minnesota who intends to acquire farmland located within the state and provide the majority of the day-to-day physical labor and management of the farm;\n(2) grosses no more than $250,000 per year from the sale of farm products;\n(3) has not, and whose spouse has not, at any time had a direct or indirect ownership interest in farmland; and\n(4) is not, and whose spouse is not, related by blood or marriage to an owner of the farmland that the individual intends to acquire.\n(c) \"Farm down payment\" means an initial, partial payment required by a lender or seller to purchase farmland.\n(d) \"Incubator farm\" means a farm where:\n(1) individuals are given temporary, exclusive, and affordable access to small parcels of land, infrastructure, and often training, for the purpose of honing skills and launching a farm business; and\n(2) a majority of the individuals farming the small parcels of land grow industrial hemp, cannabis, or one or more of the following specialty crops as defined by the United States Department of Agriculture for purposes of the specialty crop block grant program: fruits and vegetables, tree nuts, dried fruits, medicinal plants, culinary herbs and spices, horticulture crops, floriculture crops, and nursery crops.\n(e) \"Limited land access\" means farming without ownership of land and:\n(1) the individual or the individual's child rents or leases the land, with the term of each rental or lease agreement not exceeding three years in duration, from a person who is not related to the individual or the individual's spouse by blood or marriage; or\n(2) the individual rents the land from an incubator farm.\n(f) \"Limited market access\" means the individual has gross sales of no more than $100,000 per year from the sale of farm products.\nThe commissioner may award farm down payment assistance grants of up to $15,000 per eligible farmer. Each award must be matched with at least $8,000 of other funding. Grants under this subdivision may be awarded by a randomized selection process after applications are collected over a period of no less than 30 calendar days. An eligible farmer must commit to own and farm the land purchased with assistance provided under this section for at least five years. For each year that a grant recipient does not own and farm the land during the five-year period, the grant recipient must pay a penalty to the commissioner equal to 20 percent of the grant amount.\nNo later than December 1, 2023, and annually thereafter, the commissioner must provide a report to the chairs and ranking minority members of the legislative committees having jurisdiction over agriculture and rural development, in compliance with sections 3.195 and 3.197, on the farm down payment assistance grants under this section. The report must include:\n(1) background information on beginning farmers in Minnesota and any other information that the commissioner and authority find relevant to evaluating the effect of the grants on increasing opportunities for and the number of beginning farmers;\n(2) the number and amount of grants;\n(3) the geographic distribution of grants by county;\n(4) the number of grant recipients who are emerging farmers;\n(5) the number of grant recipients who were experiencing limited land access or limited market access when the grant was awarded;\n(6) disaggregated data regarding the gender, race, and ethnicity of grant recipients;\n(7) the number of farmers who cease to own land and are subject to payment of a penalty, along with the reasons for the land ownership cessation; and\n(8) the number and amount of grant applications that exceeded the allocation available in each year.",
	"repealed": false
}