{
	"id": "103E.715",
	"url": "https://www.revisor.mn.gov/statutes/cite/103E.715",
	"title": "103E.715 REPAIR BY PETITION.",
	"text": "An individual or an entity interested in or affected by a drainage system may file a petition to repair the drainage system. The petition must state that the drainage system needs repair. The auditor shall present the petition to the board at its next meeting or, for a joint county drainage system, to the drainage authority within ten days after the petition is filed.\nIf the drainage authority determines that the drainage system needs repair, the drainage authority shall appoint an engineer to examine the drainage system and make a repair report. The report must show the necessary repairs, the estimated cost of the repairs, and all details, plans, and specifications necessary to prepare and award a contract for the repairs. The drainage authority may give notice and order a hearing on the petition before appointing the engineer.\nWhen the repair report is filed, the auditor shall promptly notify the drainage authority. The drainage authority in consultation with the auditor shall set a time, by order, not more than 30 days after the date of the order for a hearing on the repair report. At least ten days before the hearing, the auditor shall give notice by mail of the time and location of the hearing to the petitioners, owners of property, and political subdivisions likely to be affected by the repair in the repair report.\n(a) The drainage authority shall make findings and order the repair to be made if:\n(1) the drainage authority determines from the repair report and the evidence presented that the repairs recommended are necessary for the best interests of the affected property owners; or\n(2) the repair petition is signed by the owners of at least 26 percent of the property area affected by and assessed for the original construction of the drainage system, and the drainage authority determines that the drainage system is in need of repair so that it no longer serves its original purpose and the cost of the repair will not exceed the total benefits determined in the original drainage system proceeding.\n(b) The order must direct the auditor and the chair of the board or, for a joint county drainage system, the auditors of the affected counties to proceed and prepare and award a contract for the repair of the drainage system. The contract must be for the repair described in the repair report and as determined necessary by the drainage authority, and be prepared in the manner provided in this chapter for the original drainage system construction.\nFor the repair of a joint county drainage system, the drainage authority shall, by order, apportion the repair cost among affected counties in the same manner required in the original construction of the drainage system.\n(a) For a drainage system that is to be repaired by resloping ditches, incorporating a multistage ditch cross section, leveling spoil banks, installing erosion control measures, or removing trees, before ordering the repair, the drainage authority must appoint viewers to assess and report on damages and benefits if it determines that:\n(1) the resloping, incorporation of a multistage ditch cross section, spoil bank leveling, installation of erosion control measures, or tree removal will require the taking of any property not contemplated and included in the proceeding for the establishment or subsequent improvement of the drainage system; or\n(2) any spoil bank leveling or tree removal will directly benefit property where the spoil bank leveling or tree removal is specified.\n(b) The viewers shall assess and report damages and benefits as provided by sections 103E.315 and 103E.321. The drainage authority shall hear and determine the damages and benefits as provided in sections 103E.325, 103E.335, and 103E.341. The hearing shall be held within 30 days after the property owners' report is mailed. Damages must be paid as provided by section 103E.315 as a part of the cost of the repair, and benefits must be added to the benefits previously determined as the basis for the pro rata assessment for the repair of the drainage system for the repair proceeding only.",
	"repealed": false
}