{
	"id": "80A.61",
	"url": "https://www.revisor.mn.gov/statutes/cite/80A.61",
	"title": "80A.61 SECTION 406; REGISTRATION BY BROKER-DEALER, AGENT, FUNDING PORTAL, INVESTMENT ADVISER, AND INVESTMENT ADVISER REPRESENTATIVE.",
	"text": "(a) Application for initial registration by broker-dealer, agent, investment adviser, or investment adviser representative. A person shall register as a broker-dealer, agent, investment adviser, or investment adviser representative by filing an application and a consent to service of process complying with section 80A.88, and paying the fee specified in section 80A.65 and any reasonable fees charged by the designee of the administrator for processing the filing. The application must contain:\n(1) the information or record required for the filing of a uniform application; and\n(2) upon request by the administrator, any other financial or other information or record that the administrator determines is appropriate.\n(b) Amendment. If the information or record contained in an application filed under subsection (a) is or becomes inaccurate or incomplete in a material respect, the registrant shall promptly file a correcting amendment.\n(c) Effectiveness of registration. If an order is not in effect and a proceeding is not pending under section 80A.67, registration becomes effective at noon on the 45th day after a completed application is filed, unless the registration is denied. A rule adopted or order issued under this chapter may set an earlier effective date or may defer the effective date until noon on the 45th day after the filing of any amendment completing the application.\n(d) Registration renewal. A registration is effective until midnight on December 31 of the year for which the application for registration is filed. Unless an order is in effect under section 80A.67, a registration may be automatically renewed each year by filing such records as are required by rule adopted or order issued under this chapter, by paying the fee specified in section 80A.65, and by paying costs charged by the designee of the administrator for processing the filings.\n(e) Additional conditions or waivers. A rule adopted or order issued under this chapter may impose such other conditions, not inconsistent with the National Securities Markets Improvement Act of 1996. An order issued under this chapter may waive, in whole or in part, specific requirements in connection with registration as are in the public interest and for the protection of investors.\n(f) Funding portal registration. A funding portal that has its principal place of business in the state of Minnesota shall register with the state of Minnesota by filing with the administrator a copy of the information or record required for the filing of an application for registration as a funding portal in the manner established by the Securities and Exchange Commission and/or the Financial Institutions Regulatory Authority (FINRA), along with any rule adopted or order issued, and any amendments thereto.\n(g) Application for investment adviser representative registration.\n(1) The application for initial registration as an investment adviser representative pursuant to section 80A.58 is made by completing Form U-4 (Uniform Application for Securities Industry Registration or Transfer) in accordance with the form instructions and by filing the form U-4 with the IARD. The application for initial registration must also include the following:\n(i) proof of compliance by the investment adviser representative with the examination requirements of:\n(A) the Uniform Investment Adviser Law Examination (Series 65); or\n(B) the General Securities Representative Examination (Series 7) and the Uniform Combined State Law Examination (Series 66);\n(ii) any other information the administrator may reasonably require.\n(2) The application for the annual renewal registration as an investment adviser representative shall be filed with the IARD.\n(3)(i) The investment adviser representative is under a continuing obligation to update information required by Form U-4 as changes occur;\n(ii) An investment adviser representative and the investment adviser must file promptly with the IARD any amendments to the representative's Form U-4; and\n(iii) An amendment will be considered to be filed promptly if the amendment is filed within 30 days of the event that requires the filing of the amendment.\n(4) An application for initial or renewal of registration is not considered filed for purposes of section 80A.58 until the required fee and all required submissions have been received by the administrator.\n(5) The application for withdrawal of registration as an investment adviser representative pursuant to section 80A.58 shall be completed by following the instructions on Form U-5 (Uniform Termination Notice for Securities Industry Registration) and filed upon Form U-5 with the IARD.",
	"repealed": false
}