{
	"id": "469.065",
	"url": "https://www.revisor.mn.gov/statutes/cite/469.065",
	"title": "469.065 SALE OF PROPERTY.",
	"text": "A port authority may sell and convey property owned by it within a port or industrial district if it determines that the sale and conveyance are in the best interests of the district and its people, and that the transaction furthers its general plan of port improvement, or industrial development, or both. This section is not limited by other law on powers of port authorities.\nA port authority shall hold a hearing on the sale. At the hearing a taxpayer may testify for or against the sale. At least ten, but not more than 20, days before the hearing the authority shall publish notice of the hearing on the proposed sale in a newspaper. The newspaper must be published and of general circulation in the port authority's county and port district. The notice must describe the property to be sold and state the time and place of the hearing. The notice must also state that the public may see the terms and conditions of the sale at the authority's office and that at the hearing the authority will meet to decide if the sale is advisable.\nThe port authority shall make its findings and decision on whether the sale is advisable and enter its decision on its records within 30 days of the hearing. A taxpayer may appeal the decision by filing a notice of appeal with the district court in the port or industrial district's county and serving the notice on the secretary of the port authority, within 20 days after the decision is entered. The only ground for appeal is that the action of the authority was arbitrary, capricious, or contrary to law.\nThe terms and conditions of sale of the property must include the use that the bidder will be allowed to make of it. The authority may require the purchaser to file security to assure that the property will be given that use. In deciding the sale terms and conditions the port authority may consider the nature of the proposed use and the relation of the use to the improvement of the harbor, the riverfront, and the port authority's city and the business and the facilities of the port authority in general. The sale must be made on the port authority's terms and conditions. The port authority may publish an advertisement for bids on the property at the same time and in the same manner as the notice of hearing required in this section. The authority may award the sale to the bid considered by it to be most favorable considering the price and the specified intended use. The port authority also may sell the property at private sale at a negotiated price if after its hearing the authority considers that sale to be in the public interest and to further the aims and purposes of sections 469.048 to 469.068.\nWithin one year from the date of purchase, the purchaser shall devote the property to its intended use or begin work on the improvements to the property to devote it to that use. If the purchaser fails to do so, the port authority may cancel the sale and title to the property shall return to it. The port authority may extend the time to comply with a condition if the purchaser has good cause. The terms of sale may contain other provisions that the port authority considers necessary and proper to protect the public interest. A purchaser must not transfer title to the property within one year of purchase without the consent of the port authority.\nA sale made under this section must incorporate in the deed as a covenant running with the land the conditions of sections 469.048 to 469.068 relating to the use of the land. If the covenant is violated the authority may declare a breach of the covenant and seek a judicial decree from the district court declaring a forfeiture and a cancellation of the deed.\nA conveyance must not be made until the purchaser gives the port authority plans and specifications to develop the property sold. The port authority must approve the plans and specifications in writing. The port authority may require preparation of final plans and specifications before the hearing on the sale.",
	"repealed": false
}