{
	"id": "259.57",
	"url": "https://www.revisor.mn.gov/statutes/cite/259.57",
	"title": "259.57 HEARING, DECREE.",
	"text": "Upon the hearing,\n(a) if the court finds that it is in the best interests of the person to be adopted that the petition be granted, a decree of adoption shall be made and recorded in the office of the court administrator, ordering that henceforth the person to be adopted shall be the child of the petitioner. In the decree the court may change the name of the adopted person if desired. After the decree is granted for an adopted person who is:\n(1) under the guardianship of the commissioner or a licensed child-placing agency according to section 260C.317 or 260C.515, subdivision 3;\n(2) placed by the commissioner, commissioner's agent, or licensed child-placing agency after a consent to adopt according to section 259.24 or under an agreement conferring authority to place for adoption according to section 259.25; or\n(3) adopted after a direct adoptive placement ordered by the district court under section 259.47,\nthe court administrator shall immediately mail a copy of the recorded decree to the commissioner of children, youth, and families;\n(b) if the court is not satisfied that the proposed adoption is in the best interests of the person to be adopted, the court shall deny the petition, and in the case of a child shall order the child returned to the custody of the person or agency legally vested with permanent custody or certify the case for appropriate action and disposition to the court having jurisdiction to determine the custody and guardianship of the child.\n(a) The policy of the state of Minnesota is to ensure that the best interests of children are met by requiring an individualized determination of the needs of the child and how the adoptive placement will serve the needs of the child.\n(b) Among the factors the court shall consider in determining the needs of the child are those specified under section 260C.193, subdivision 3, paragraph (b). Consistent with section 245C.33 and Public Law 109-248, a complete background study is required before the approval of an adoptive placement in a home.\n(c) In reviewing adoptive placement and in determining appropriate adoption, the court shall consider placement, consistent with the child's best interests and in the following order, with (1) a relative or relatives of the child, or (2) an important friend with whom the child has resided or had significant contact. Placement of a child cannot be delayed or denied based on race, color, or national origin of the adoptive parent or the child. Whenever possible, siblings should be placed together unless it is determined not to be in the best interests of a sibling.\n(d) If the child's birth parent or parents explicitly request that relatives and important friends not be considered, the court shall honor that request consistent with the best interests of the child.\nIf the child's birth parent or parents express a preference for placing the child in an adoptive home of the same or a similar religious background to that of the birth parent or parents, the court shall place the child with a family that also meets the birth parent's religious preference. Only if no family is available as described in paragraph (a) or (b) may the court give preference to a family described in paragraph (c) that meets the parent's religious preference.\n(e) This subdivision does not affect the Indian Child Welfare Act, United States Code, title 25, sections 1901 to 1923, and the Minnesota Indian Family Preservation Act, sections 260.751 to 260.835.\nThe provisions of this chapter must be construed consistently with the Indian Child Welfare Act of 1978, United States Code, title 25, sections 1901 to 1963.",
	"repealed": false
}