{
	"id": "290.015",
	"url": "https://www.revisor.mn.gov/statutes/cite/290.015",
	"title": "290.015 MINIMUM CONTACTS REQUIRED FOR JURISDICTION TO TAX TRADE OR BUSINESS.",
	"text": "(a) Except as provided in subdivision 3, a person that conducts a trade or business that has a place of business in this state, regularly has employees or independent contractors conducting business activities on its behalf in this state, or owns or leases real property that is located in this state or tangible personal property, including but not limited to mobile property, that is present in this state is subject to the taxes imposed by this chapter.\n(b) Except as provided in subdivision 3, a person that conducts a trade or business not described in paragraph (a) is subject to the taxes imposed by this chapter if the trade or business obtains or regularly solicits business from within this state, without regard to physical presence in this state.\n(c) For purposes of paragraph (b), business from within this state includes, but is not limited to:\n(1) sales of products or services of any kind or nature to customers in this state who receive the product or service in this state;\n(2) sales of services which are performed from outside this state but the services are received in this state;\n(3) transactions with customers in this state that involve intangible property and result in receipts attributed to this state as provided in section 290.191, subdivision 5 or 6;\n(4) leases of tangible personal property that is located in this state as defined in section 290.191, subdivision 5, paragraph (g), or 6, paragraph (e); and\n(5) sales and leases of real property located in this state.\n(d) For purposes of paragraph (b), solicitation includes, but is not limited to:\n(1) the distribution, by mail or otherwise, without regard to the state from which such distribution originated or in which the materials were prepared, of catalogs, periodicals, advertising flyers, or other written solicitations of business to customers in this state;\n(2) display of advertisements on billboards or other outdoor advertising in this state;\n(3) advertisements in newspapers published in this state;\n(4) advertisements in trade journals or other periodicals, the circulation of which is primarily within this state;\n(5) advertisements in a Minnesota edition of a national or regional publication or a limited regional edition of which this state is included of a broader regional or national publication which are not placed in other geographically defined editions of the same issue of the same publication;\n(6) advertisements in regional or national publications in an edition which is not by its contents geographically targeted to Minnesota, but which is sold over the counter in Minnesota or by subscription to Minnesota residents;\n(7) advertisements broadcast on a radio or television station located in Minnesota; or\n(8) any other solicitation by telephone, computer database, cable, optic, microwave, or other communication system.\n(a) A person is presumed, subject to rebuttal, to be obtaining or regularly soliciting business from within this state if:\n(1) it conducts activities described in subdivision 1, paragraph (b), without regard to transactions described in subdivision 3, with 20 or more persons within this state during any tax period; or\n(2) it is a financial institution as defined in section 290.01, subdivision 4a, and the sum of its assets and the absolute value of its deposits attributable to sources within this state equals or exceeds $5,000,000, with assets and deposits attributed to sources within this state by applying the principles established under section 290.191, except as provided in subdivision 3.\n(b) A financial institution that (i) is not engaged in activities within this state under subdivision 1, paragraph (a), and (ii) does not satisfy the requirements of paragraph (a) is not subject to taxes imposed by this chapter.\n(a) A person is not subject to tax under this chapter if the person is engaged in the business of selling tangible personal property and taxation of that person under this chapter is precluded by Public Law 86-272, United States Code, title 15, sections 381 to 384, or would be so precluded except for the fact that the person stored tangible personal property in a state licensed facility under chapter 231.\n(b) Ownership of an interest in the following types of property (including those contacts with this state reasonably required to evaluate and complete the acquisition or disposition of the property, the servicing of the property or the income from it, the collection of income from the property, or the acquisition or liquidation of collateral relating to the property) shall not be a factor in determining whether the owner is subject to tax under this chapter:\n(1) an interest in a real estate mortgage investment conduit, a real estate investment trust, a financial asset securitization investment trust, or a regulated investment company or a fund of a regulated investment company, as those terms are defined in the Internal Revenue Code;\n(2) an interest in money market instruments or securities as defined in section 290.191, subdivision 6, paragraphs (c) and (d);\n(3) an interest in a loan-backed, mortgage-backed, or receivable-backed security representing either: (i) ownership in a pool of promissory notes, mortgages, or receivables or certificates of interest or participation in such notes, mortgages, or receivables, or (ii) debt obligations or equity interests which provide for payments in relation to payments or reasonable projections of payments on the notes, mortgages, or receivables;\n(4) an interest acquired from a person in assets described in section 290.191, subdivision 11, paragraphs (e) to (l), subject to the provisions of paragraph (c), clause (2)(A);\n(5) an interest acquired from a person in the right to service, or collect income from any assets described in section 290.191, subdivision 11, paragraphs (e) to (l), subject to the provisions of paragraph (c), clause (2)(A);\n(6) an interest acquired from a person in a funded or unfunded agreement to extend or guarantee credit whether conditional, mandatory, temporary, standby, secured, or otherwise, subject to the provisions of paragraph (c), clause (2)(A);\n(7) an interest of a person other than an individual, estate, or trust, in any intangible, tangible, real, or personal property acquired in satisfaction, whether in whole or in part, of any asset embodying a payment obligation which is in default, whether secured or unsecured, the ownership of an interest in which would be exempt under the preceding provisions of this subdivision, provided the property is disposed of within a reasonable period of time;\n(8) amounts held in escrow or trust accounts, pursuant to and in accordance with the terms of property described in this subdivision; or\n(9) any interest in tangible personal property upon which printing will take place located at the premises of a printer that is not a member of a unitary business in this state with which the person has a contract for printing.\n(c)(1) For purposes of paragraph (b), clauses (4) to (6), an interest in the type of assets or credit agreements described is deemed to exist at the time the owner becomes legally obligated, conditionally or unconditionally, to fund, acquire, renew, extend, amend, or otherwise enter into the credit arrangement.\n(2)(A) An owner has acquired an interest from a person in paragraph (b), clauses (4) to (6), assets if:\n(i) the owner at the time of the acquisition of the asset does not own, directly or indirectly, 15 percent or more of the outstanding stock or in the case of a partnership 15 percent or more of the capital or profit interests of the person from whom it acquired the asset;\n(ii) the person from whom the owner acquired the asset regularly sells, assigns, or transfers interests in paragraph (b), clauses (4) to (6), assets during the 12 calendar months immediately preceding the month of acquisition to three or more persons; and\n(iii) the person from whom the owner acquired the asset does not sell, assign, or transfer 75 percent or more of its paragraph (b), clauses (4) to (6), assets during the 12 calendar months immediately preceding the month of acquisition to the owner.\nFor purposes of determining indirect ownership under item (i), the owner is deemed to own all stock, capital, or profit interests owned by another person if the owner directly owns 15 percent or more of the stock, capital, or profit interests in the other person. The owner is also deemed to own through any intermediary parties all stock, capital, and profit interests directly owned by a person to the extent there exists a 15 percent or more chain of ownership of stock, capital, or profit interests between the owner, intermediary parties and the person.\n(B) If the owner of the asset is a member of a unitary business, paragraph (b), clauses (4) to (8), do not apply to an interest acquired from another member of the unitary business. If the interest in the asset was originally acquired from a nonunitary member and at that time qualified as a section 290.015, subdivision 3, paragraph (b), asset, the foregoing limitation does not apply.\n(a) This section does not subject a trade or business to any regulation, including any tax, of any local unit of government or subdivision of this state if the trade or business does not own or lease tangible or real property located within this state and has no employees or independent contractors present in this state to assist in the carrying on of the business.\n(b) The purchase of tangible personal property or intangible property or services by a person that conducts a trade or business with the principal place of business outside of Minnesota, referred to as the \"non-Minnesota person\", from a person within Minnesota shall not be taken into account in determining whether the non-Minnesota person is subject to the taxes imposed by this chapter, except for services involving either the direct solicitation of Minnesota customers or relationships with Minnesota customers after sales are made. This paragraph is subject to the limitations contained in subdivision 3, paragraph (b), clauses (4) to (6).\n(c) Contact with any Minnesota financial institution by any financial institution with its principal place of business outside Minnesota with respect to transactions described in subdivision 3, or with respect to deposits received from or by a Minnesota financial institution, shall not be taken into account in determining whether such a financial institution is subject to the taxes imposed by this chapter. Participation by a Minnesota financial institution in a transaction which also involves a borrower and a financial institution that conducts a trade or business with its principal place of business outside of Minnesota shall not be a factor in determining whether such financial institution is subject to the taxes imposed by this chapter. This paragraph does not apply to transactions between or among members of the same unitary business.\nDeterminations under this section with respect to trades or businesses conducted by a partnership, trust, estate, or corporation treated as an S corporation under section 290.9725, or any other entity, the income of which is or may be taxed to its owners or beneficiaries must be made with respect to the entity carrying on the trade or business and not with respect to owners or beneficiaries of the trade or business, the taxability of which under this chapter must be determined under section 290.014.",
	"repealed": false
}