{
	"id": "383B.68",
	"url": "https://www.revisor.mn.gov/statutes/cite/383B.68",
	"title": "383B.68 BOARD OF PARK DISTRICT COMMISSIONERS.",
	"text": "Notwithstanding any provision of sections 398.02 to 398.04, or any other law to the contrary, the Board of Park District Commissioners of the Three Rivers Park District shall consist of seven commissioners appointed or elected as provided in this section.\nTwo park district commissioners shall be appointed by the Board of Commissioners of Hennepin County. An appointee must be a resident of the Three Rivers Park District in order to qualify and serve as a park district commissioner. Each park district commissioner appointed pursuant to this subdivision shall serve for a four-year term. If a vacancy occurs among the commissioners appointed pursuant to this subdivision, the Board of Commissioners of Hennepin County shall appoint a successor.\nFive park district commissioners shall be elected as provided in this subdivision to represent those portions of Hennepin County outside of the city of Minneapolis. One park district commissioner shall be elected without party designation from each of the districts established pursuant to subdivision 4. Elections under this subdivision shall be held at the same time and in the same manner as elections for the office of county commissioner beginning at the 1986 general election. Each park district commissioner elected pursuant to this subdivision shall be a resident of the district represented and shall serve for a term of four years and until a successor is elected and qualifies, except that the term of office of each park district commissioner elected at the general election held in the year of a federal census shall be only two years and until a successor is elected and qualifies. At the general election following redistricting as required in subdivision 4, the three commissioners from odd-numbered districts shall be elected for four-year terms and the two commissioners from even-numbered districts shall be elected for two-year terms. If a vacancy occurs in the office of any commissioner elected pursuant to this subdivision, the board of park district commissioners shall appoint a successor residing in that district to fill the unexpired term.\nAfter September 1, 1985, and after at least 30 days' notice and public hearing, the Board of Park District Commissioners of the Three Rivers Park District shall divide the territory of Hennepin County outside the city of Minneapolis into five districts, which constitute the Three Rivers Park District. Each district shall be composed of contiguous territory as regular and compact in form as practicable and as nearly equal in population as possible, provided that no district shall vary in population more than ten percent from the average of all the districts, unless compliance with this requirement requires division of a voting precinct. After each federal census and by the date prescribed for redistricting of election districts in section 204B.135, subdivision 2, after at least 30 days' notice and public hearing, the Board of Park District Commissioners of the Three Rivers Park District shall redistrict the territory of the Three Rivers Park District into new commissioner districts as necessary to comply with the provisions of this subdivision. The districts established pursuant to this subdivision shall remain effective until new districts are established. Any person aggrieved by a districting plan established pursuant to this subdivision may challenge the plan in the same manner as a county commissioner districting plan may be challenged pursuant to section 375.025. The district court in reviewing any challenge to a districting plan under this subdivision shall proceed in the manner prescribed by section 375.025. Each districting plan established pursuant to this subdivision shall be filed in the office of the director of finance of Hennepin County or any successor office and shall be effective 31 days after its publication in a newspaper of general circulation in the county.",
	"repealed": false
}