{
	"id": "97B.667",
	"url": "https://www.revisor.mn.gov/statutes/cite/97B.667",
	"title": "97B.667 REMOVING BEAVERS, BEAVER DAMS, AND LODGES; ROAD AUTHORITIES AND LOCAL GOVERNMENT UNITS.",
	"text": "(a) When a drainage watercourse is impaired by a beaver dam and the water damages or threatens to damage a public road, the road authority, as defined in section 160.02, subdivision 25, may remove the impairment and any associated beaver lodge within 300 feet of the road.\n(b) The road authority may kill beaver associated with the lodge or damage in any manner, except by poison or artificial lights.\n(c) The road authority may arrange to have killed any beaver associated with the lodge by trapping through a third-party contract or under subdivision 4.\n(a) Government units may, as provided in this section, kill or arrange to have killed beaver that are causing damage, including damage to silvicultural projects and drainage ditches, on property owned or managed by the government unit. Removing or destroying any associated beaver lodge is subject to section 97A.401, subdivision 5, and removing or destroying any associated beaver dam is subject to section 97B.665.\n(b) The government unit may kill beaver associated with the lodge or damage in any manner, except by poison or artificial lights.\n(c) The government unit may arrange to have killed any beaver associated with the lodge or damage by trapping through a third-party contract or under subdivision 4.\n(a) Before killing or arranging to kill a beaver under this section, the road authority or government unit must contact a conservation officer for a special beaver permit if the beaver will be killed within two weeks before or after the trapping season for beaver, and the conservation officer must issue the permit for any beaver subject to this section. A permit is not required:\n(1) for a licensed trapper during the open trapping season for beaver; or\n(2) when the trapping season for beaver is closed and it is not within two weeks before or after the trapping season for beaver.\n(b) A road authority or government unit that kills or arranges to have killed a beaver under this section must notify a conservation officer or employee of the Fish and Wildlife Division within ten days after the animal is killed.\n(c) Unless otherwise directed by a conservation officer, the road authority, local government unit, the landowner, or their agent may dispose of or retain beaver killed under this section. Human consumption of a retained beaver is prohibited.\n(a) A road authority or government unit may, after consultation with the Fish and Wildlife Division, implement a beaver control program designed to reduce the number of incidents of beaver:\n(1) interfering with or damaging a public road; or\n(2) causing damage, including damage to silvicultural projects and drainage ditches, on property owned or managed by the government unit.\n(b) The control program may include offering a bounty to lawfully take beaver.\nTraps used under subdivision 1 or 2 must be identified with tags provided by the local unit of government that include the name and telephone number of the government unit. Traps used for trapping under a third-party contract must be tagged with the contractor's information as provided in section 97B.928.",
	"repealed": false
}