{
	"id": "94.3495",
	"url": "https://www.revisor.mn.gov/statutes/cite/94.3495",
	"title": "94.3495 EXPEDITED EXCHANGES OF LAND INVOLVING STATE AND GOVERNMENTAL SUBDIVISIONS OF STATE.",
	"text": "(a) The purpose of this section is to expedite the exchange of public land ownership. Consolidation of public land reduces management costs and aids in the reduction of forest fragmentation.\n(b) This section applies to exchanges of land between the state and a governmental subdivision of the state. For land exchanges under this section, sections 94.342 to 94.347 apply only to the extent specified in this section.\n(a) The classes of public land that may be involved in an expedited exchange under this section are:\n(1) Class 1 land, which for the purpose of this section is class A land as defined in section 94.342, subdivision 1;\n(2) Class 2 land, which for the purpose of this section is class B land as defined in section 94.342, subdivision 2; and\n(3) Class 3 land, which for the purpose of this section is all land owned in fee by a governmental subdivision of the state.\n(b) \"School trust land\" has the meaning given in section 92.025.\n(c) \"University land\" means land granted to the state by acts of Congress for university purposes.\n(a) In an exchange of class 1 land for class 2 or 3 land, the value of all the land shall be determined by the commissioner of natural resources, but the county board must approve the value determined for the class 2 land, and the governmental subdivision of the state must approve the value determined for the class 3 land. In an exchange of class 2 land for class 3 land, the value of all the land shall be determined by the county board of the county in which the land lies, but the governmental subdivision of the state must approve the value determined for the class 3 land.\n(b) To determine the value of the land, the parties to the exchange may either (1) cause the land to be appraised, or (2) determine the value for each 40-acre tract or lot, or a portion thereof, using township or county assessment schedules within the preceding two years for similar land types from the county assessor of the county in which the lands are located. Merchantable timber value should be considered in finalizing valuation of the lands.\n(c) Except for school trust lands and university lands, the lands exchanged under this section shall be exchanged only for lands of at least substantially equal value. For the purposes of this subdivision, \"substantially equal value\" has the meaning given under section 94.343, subdivision 3, paragraph (b). No payment is due either party if the lands, other than school trust lands or university lands, are of substantially equal value but are not of the same value.\n(d) School trust lands and university lands exchanged under this section must be exchanged only for lands of equal or greater value.\nTitle to the land must be examined to the extent necessary for the parties to determine that the title is good, with any encumbrances identified. The parties to the exchange may utilize title insurance to aid in the determination.\nAll expedited land exchanges under this section, and the terms and conditions of the exchanges, require the unanimous approval of the Land Exchange Board.\n(a) Conveyance of class 1 land given in exchange shall be made by deed executed by the commissioner of natural resources in the name of the state. Conveyance of class 2 land given in exchange shall be by a deed executed by the commissioner of revenue in the name of the state. Conveyance of class 3 land shall be by a deed executed by the governing body in the name of the governing authority.\n(b) If class 1 land is given in exchange for class 2 or 3 land, the deed to the class 2 or 3 land shall first be delivered to the commissioner of natural resources. Following the recording of the deed, the commissioner of natural resources shall deliver the deed conveying the class 1 land.\n(c) If class 2 land is given in exchange for class 3 land, the deed to the class 3 land shall first be delivered to the county auditor. Following the recording of the deed, the commissioner of revenue shall deliver the deed conveying the class 2 land.\n(d) All deeds shall be recorded or registered in the county in which the lands lie.\nClass 1 land given in exchange is subject to the reservation provisions of section 94.343, subdivision 4. Class 2 land given in exchange is subject to the reservation provisions of section 94.344, subdivision 4. County fee land given in exchange is subject to the reservation provisions of section 373.01, subdivision 1, paragraph (g).\nLand received in exchange for class 1 land is subject to the same trust, if any, and otherwise has the same status as the land given in exchange. Land received in exchange for class 2 land is subject to a trust in favor of the governmental subdivision wherein it lies and all laws relating to tax-forfeited land. Land received in exchange for class 3 land has the same status as the land given in exchange.\n(a) When a governmental unit presents to the commissioner an offer to exchange publicly held land under this section, the governmental unit must pay to the commissioner fees of not less than one-half of the costs incurred by the commissioner for valuation expenses; survey expenses; legal and professional fees; costs of title work, advertising, and public hearings; transactional staff costs; and closing costs.\n(b) Except as provided in paragraph (c), any payment made under paragraph (a) must be credited to the account from which the expenses are paid and is appropriated to the commissioner for expenditure in the same manner as other money in the account.\n(c) The fees must be refunded if the land exchange offer is withdrawn by the governmental unit before the money is obligated to be spent.",
	"repealed": false
}