{
	"id": "354.07",
	"url": "https://www.revisor.mn.gov/statutes/cite/354.07",
	"title": "354.07 POWERS OF THE BOARD.",
	"text": "The board has the power to frame bylaws for its own government and for the management of the association not inconsistent with the laws of the state and to modify them at its pleasure; to adopt, alter, and enforce reasonable rules not inconsistent with the laws of the state for the administration and management of the association, for the payment and collection of payments from members, and for the payment of withdrawals and benefits; to pass upon and allow or disallow applications for membership in the association and for credit for teaching service; to pass upon and allow or disallow claims for withdrawals, pensions, or benefits payable by the fund; to adopt an appropriate mortality table based on experience of the association as recommended by the actuary retained under section 356.214 and using the applicable investment return assumption specified in section 356.215, subdivision 8; to approve early retirement and optional annuity factors, subject to review by the actuary retained by the Legislative Commission on Pensions and Retirement; to establish the schedule for implementation of the approved factors; to notify the Legislative Commission on Pensions and Retirement of the implementation schedule; and to provide for the payment out of the fund of necessary expenses for the administration by the association and of claims for withdrawals, pensions, or benefits allowed.\nIn passing upon all applications and claims, the board may summon, swear, hear, and examine witnesses and, in the case of claims for disability benefits, may require the claimant to submit to a medical examination by a physician of the board's choice, at the expense of the claimant, as a condition precedent to the passing on the claim, and, in the case of all applications and claims, may conduct investigations necessary to determine the validity and merit of the same.\nThe attorney general shall be legal advisor to the board and the executive director. The board may sue or be sued or petitioned under section 356.96 in the name of the board of trustees of the Teachers Retirement Association. In all actions brought by or against it the board shall be represented by the attorney general. Except as provided in section 356.96, subdivision 13, venue of all actions is in the Ramsey County District Court.\nIt is the duty of the board from time to time to certify to the State Board of Investment for investment as much of the funds in its hands as shall not be needed for current purposes. The State Board of Investment shall thereupon invest and reinvest an amount equal to the sum so certified in such securities as are now or may hereafter be duly authorized legal investments for state employees retirement fund and all such securities so transferred or purchased must be deposited with the commissioner of management and budget. All interest from these investments must be credited to the teachers retirement fund and used for current purposes or investments, except as hereinafter provided. The State Board of Investment has authority to sell, convey, and exchange such securities and invest and reinvest the funds when it deems it desirable to do so, and must sell securities upon request of the officers of the association when such officers determine funds are needed for its purposes. All of the provisions regarding accounting procedures and restrictions and conditions for the purchase and sale of securities under chapter 11A must apply to the accounting, purchase and sale of securities for the Teachers' Retirement Association.\n(a) The board shall keep a record of the receipts and disbursements of the fund and a separate account for each member of the association. The board shall also keep separate accounts for annuity payments, for employer contributions and all other necessary accounts and reserves.\n(b) It shall determine annually the annual interest earnings of the fund which shall include realized capital gains and losses.\n(c) The annual interest earnings must be apportioned and credited to the separate members' accounts except those covered under the provisions of section 354.44, subdivision 6. The rate to be used in this distribution, computed to the last full quarter percent, must be determined by dividing the interest earnings by the total invested assets of the fund. The excess of the annual interest earnings in the excess earnings reserve which was not credited to the various accounts must be credited to the gross interest earnings for the next succeeding year.\n[Repealed, 1969 c 485 s 40]\nNotwithstanding chapter 16B or 16C or any law to the contrary, the board may use the services of the Department of Administration, Information Services Division, for electronic data processing and related services or may contract for all or a portion of such services.\n[Repealed, 1984 c 564 s 51]\nAll school districts, the Minnesota State Colleges and Universities, and other employers of members of the association are obligated to distribute to their employees ballots for the election of members to the board of trustees, pamphlets, brochures, documents or any other material containing association information which are prepared by the executive director or the board and are delivered to the employers for distribution.",
	"repealed": false
}