{
	"id": "116C.835",
	"url": "https://www.revisor.mn.gov/statutes/cite/116C.835",
	"title": "116C.835 ENFORCING COMPACT AND LAWS.",
	"text": "(a) Any person who willfully or negligently violates any provision of the compact upon conviction is guilty of a misdemeanor, and is subject to a fine of not more than $2,500 in the event of a willful violation or not more than $300 in the event of a negligent violation. A second conviction of the same provision after a first conviction is punishable by a fine of not more than $50,000, or by imprisonment for not more than two years, or both.\n(b) Any person who knowingly fails to provide information requested under section 116C.840 or who knowingly makes any false statement, representation, or certification of any information requested under section 116C.840 is subject to a fine of not more than $20,000, or imprisonment for not more than six months, or both.\nAny person who violates any provision of the compact or of section 116C.834 or 116C.840 shall forfeit and pay to the state a penalty, in an amount to be determined by the court, of not more than $10,000 per day of violation. The civil penalties provided in this subdivision may be recovered by a civil action brought by the attorney general in the name of the state.\nAny violation of the provisions of the compact may be enjoined as provided by law in an action, in the name of the state, brought by the attorney general.\nIn any action to compel performance of an obligation created by the compact the court may require any person who is adjudged responsible to do and perform any and all acts and things within that person's power which are reasonably necessary to fulfill the obligation.\nIn any action brought by the attorney general, in the name of the state for civil penalties, injunctive relief, or in an action to compel compliance, if the state prevails and if the violation was willful, the state, in addition to other penalties provided in this section, may be allowed an amount determined by the court to be the reasonable value of all or a part of the litigation expenses incurred by the state. All amounts recovered by the state under the provisions of subdivisions 1 to 5 shall be deposited in the general fund.\nNothing in this section shall be construed to permit any action or remedy against the state for violation of any provision of the compact. The sole remedies for such a violation are those provided in the compact.",
	"repealed": false
}