{
	"id": "115A.94",
	"url": "https://www.revisor.mn.gov/statutes/cite/115A.94",
	"title": "115A.94 ORGANIZED COLLECTION.",
	"text": "\"Organized collection\" means a system for collecting solid waste in which a specified collector, or a member of an organization of collectors, is authorized to collect from a defined geographic service area or areas some or all of the solid waste that is released by generators for collection.\nA city or town may organize collection, after public notification and hearing as required in subdivisions 4a to 4f. A county may organize collection as provided in subdivision 5. A city or town that has organized collection as of May 1, 2013, is exempt from subdivisions 4a to 4f.\n(a) The local government unit may organize collection as a municipal service or by ordinance, franchise, license, negotiated or bidded contract, or other means, using one or more collectors or an organization of collectors.\n(b) The local government unit may not establish or administer organized collection in a manner that impairs the preservation and development of recycling and markets for recyclable materials. The local government unit shall exempt recyclable materials from organized collection upon a showing by the generator or collector that the materials are or will be separated from mixed municipal solid waste by the generator, separately collected, and delivered for reuse in their original form or for use in a manufacturing process.\n(c) The local government unit shall invite and employ the assistance of interested persons, including persons licensed to operate solid waste collection services in the local government unit, in developing plans and proposals for organized collection and in establishing the organized collection system.\n(d) Organized collection accomplished by contract or as a municipal service may include a requirement that all or any portion of the solid waste, except (1) recyclable materials and (2) materials that are processed at a resource recovery facility at the capacity in operation at the time that the requirement is imposed, be delivered to a waste facility identified by the local government unit. In a district or county where a resource recovery facility has been designated by ordinance under section 115A.86, organized collection must conform to the requirements of the designation ordinance.\n[Repealed, 2013 c 45 s 7]\n(a) Before implementing an ordinance, franchise, license, contract, or other means of organizing collection, a city or town, by resolution of the governing body, must establish a solid waste collection options committee to identify, examine, and evaluate various methods of solid waste collection. The governing body shall appoint the committee members.\n(b) The solid waste collection options committee is subject to chapter 13D.\nThe committee established under subdivision 4a shall:\n(1) determine which methods of solid waste collection to examine, which must include:\n(i) the existing system of collection;\n(ii) a system in which a single collector collects solid waste from all sections of a city or town; and\n(iii) a system in which multiple collectors, either singly or as members of an organization of collectors, collect solid waste from different sections of a city or town;\n(2) establish a list of criteria on which the solid waste collection methods selected for examination will be evaluated, which may include: costs to residential subscribers, impacts on residential subscribers' ability to choose a provider of solid waste service based on the desired level of service, costs and other factors, the impact of miles driven on city streets and alleys and the incremental impact of miles driven by collection vehicles, initial and operating costs to the city of implementing the solid waste collection system, providing incentives for waste reduction, impacts on solid waste collectors, and other physical, economic, fiscal, social, environmental, and aesthetic impacts;\n(3) collect information regarding the operation and efficacy of existing methods of solid waste collection in other cities and towns;\n(4) seek input from, at a minimum:\n(i) the governing body of the city or town;\n(ii) the local official of the city or town responsible for solid waste issues;\n(iii) persons currently licensed to operate solid waste collection and recycling services in the city or town; and\n(iv) residents of the city or town who currently pay for residential solid waste collection services; and\n(5) issue a report on the committee's research, findings, and any recommendations to the governing body of the city or town.\nThe governing body of the city or town shall consider the report and recommendations of the solid waste collection options committee. The governing body must provide public notice and hold at least one public hearing before deciding whether to implement organized collection. Organized collection may begin no sooner than six months after the effective date of the decision of the governing body of the city or town to implement organized collection.\nBefore establishing a committee under subdivision 4a to consider organizing residential solid waste collection, a city or town with more than one licensed collector must notify the public and all licensed collectors in the community. The city or town must provide a period of at least 60 days in which meetings and negotiations shall occur exclusively between licensed collectors and the city or town to develop a proposal in which interested licensed collectors, as members of an organization of collectors, collect solid waste from designated sections of the city or town. The proposal shall include identified city or town priorities, including issues related to zone creation, traffic, safety, environmental performance, service provided, and price, and shall reflect existing haulers maintaining their respective market share of business as determined by each hauler's average customer count during the six months prior to the commencement of the exclusive negotiation period. If an existing hauler opts to be excluded from the proposal, the city may allocate their customers proportionally based on market share to the participating collectors who choose to negotiate. The initial organized collection agreement executed under this subdivision must be for seven years. Upon execution of an agreement between the participating licensed collectors and city or town, the city or town shall establish organized collection through appropriate local controls and is not required to fulfill the requirements of subdivisions 4a, 4b, and 4c, except that the governing body must provide the public notification and hearing required under subdivision 4c.\nBefore the exclusive meetings and negotiations under subdivision 4d, participating licensed collectors and elected officials of the city or town must meet and confer regarding waste collection issues, including but not limited to road deterioration, public safety, pricing mechanisms, and contractual considerations unique to organized collection.\nNotwithstanding section 604.02, an organized collection agreement must not obligate a participating licensed collector for damages to third parties solely caused by another participating licensed collector. The organized collection agreement may include joint obligations for actions that are undertaken by all the participating licensed collectors under this section.\n(a) A county may by ordinance require cities and towns within the county to organize collection. Organized collection ordinances of counties may:\n(1) require cities and towns to require the separation and separate collection of recyclable materials;\n(2) specify the material to be separated; and\n(3) require cities and towns to meet any performance standards for source separation that are contained in the county solid waste plan.\n(b) A county may itself organize collection under subdivisions 4a to 4f in any city or town that does not comply with a county organized collection ordinance adopted under this subdivision, and the county may implement, as part of its organized collection, the source separation program and performance standards required by its organized collection ordinance.\n(a) The authority granted in this section to organize solid waste collection is optional and is in addition to authority to govern solid waste collection granted by other law.\n(b) Except as provided in subdivision 5, a city, town, or county is not:\n(1) required to organize collection; or\n(2) prevented from organizing collection of solid waste or recyclable material.\n(c) Except as provided in subdivision 5, a city, town, or county may exercise any authority granted by any other law, including a home rule charter, to govern collection of solid waste.\n(a) A political subdivision that organizes collection under this section is authorized to engage in anticompetitive conduct to the extent necessary to plan and implement its chosen organized collection system and is immune from liability under state laws relating to antitrust, restraint of trade, unfair trade practices, and other regulation of trade or commerce.\n(b) An organization of solid waste collectors, an individual collector, and their officers, members, employees, and agents who cooperate with a political subdivision that organizes collection under this section are authorized to engage in anticompetitive conduct to the extent necessary to plan and implement the organized collection system, provided that the political subdivision actively supervises the participation of each entity. An organization, entity, or person covered by this paragraph is immune from liability under state law relating to antitrust, restraint of trade, unfair trade practices, and other regulation of trade or commerce.",
	"repealed": false
}