{
	"id": "268B.081",
	"url": "https://www.revisor.mn.gov/statutes/cite/268B.081",
	"title": "268B.081 APPEALS.",
	"text": "(a) The commissioner may allow an appeal to be filed by electronic transmission. The commissioner may restrict the manner and format under which an appeal by electronic transmission may be filed. The notification of the determination or decision that is subject to appeal must clearly state the manner in which the determination or decision may be appealed. Subject to paragraph (b), this paragraph applies to requests for reconsideration under subdivision 6.\n(b) Except as provided in paragraph (c), the commissioner must allow an applicant to file an appeal by mail even if an appeal by electronic transmission is allowed. To be considered an appeal, a written statement delivered or mailed to the department must identify:\n(1) the determination or decision that the applicant disagrees with; and\n(2) the reason the applicant disagrees with the determination or decision.\n(c) If an agent files an appeal on behalf of an employer, the commissioner may require the appeal to be filed online. If the commissioner requires the appeal to be filed online, the appeal must be filed through the electronic address provided on the determination being appealed and use of another method of filing does not constitute an appeal. This paragraph does not apply to:\n(1) an employee filing an appeal on behalf of an employer; or\n(2) an attorney licensed to practice law who is directly representing the employer on appeal.\n(d) All information requested by the department when the appeal is filed must be supplied or the communication does not constitute an appeal.\n(e) If no appeal is filed by the deadlines listed in subdivision 2, the determination or decision is conclusive and final, unless the appealing party can demonstrate good cause for failing to file in a timely manner. For purposes of this paragraph, \"good cause\" is a reason that would have prevented a reasonable person acting with due diligence from filing in a timely manner. Unless otherwise specified, deadlines in this section may be extended up to 60 days for good cause.\n(a) An applicant may appeal to the department:\n(1) within 30 calendar days after a financial eligibility determination or amended financial eligibility determination sent by mail or electronic transmission by the department under section 268B.04 regarding:\n(i) whether services performed constitute employment;\n(ii) whether the employment is covered employment;\n(iii) whether money paid constitutes wages; or\n(iv) a denial resulting from the applicant's missing or incomplete documentation;\n(2) within 30 calendar days after an eligibility determination sent by the department related to seasonal employment status under section 268B.06, subdivision 9;\n(3) within 30 calendar days after an eligibility determination sent by the department under section 268B.07 regarding:\n(i) financial eligibility, calculations of benefit amount, work schedule, and leave balance available; or\n(ii) a denial resulting from missing or incomplete documentation;\n(4) within 30 calendar days after the denial of a good cause demonstration under subdivision 1, paragraph (e). The deadline for appeals of denials of good cause demonstration may not be extended;\n(5) within 30 calendar days after an applicant receives a decision from an insurer, approved private plan administrator, or employer under section 268B.10, subdivision 6, regarding the results of the administrative review under section 268B.10, subdivision 6, paragraph (b); and\n(6) within 30 calendar days after a determination of overpayment penalty sent by the department under section 268B.185.\n(b) A base period employer may appeal to the department:\n(1) within 30 calendar days after a denial of an application for seasonal worker status under section 268B.01, subdivision 35;\n(2) within 30 calendar days after a financial eligibility determination or amended financial eligibility determination sent by mail or electronic transmission by the department under section 268B.04 regarding:\n(i) whether services performed constitute employment;\n(ii) whether the employment is covered employment; or\n(iii) whether money paid constitutes wages;\n(3) within 30 calendar days after a denial of an application for substitution of a private plan is sent under section 268B.10;\n(4) within 30 calendar days after a notice of termination of a private plan is sent by the department under section 268B.10, subdivision 16;\n(5) within 30 calendar days after a notice of penalties is sent by the department under section 268B.10, subdivision 17;\n(6) within 30 calendar days after the notice of the determination of the calculation of premiums has been sent by the department under section 268B.14, subdivision 1;\n(7) within 30 calendar days after a determination of denial is sent by the department under section 268B.15, subdivision 7; and\n(8) within 30 calendar days after a determination of penalty is sent by the department under section 268B.19.\n(c) Notwithstanding any provision of this chapter, the commissioner or a hearing officer may, before a determination is made under this chapter, refer any issue of ineligibility, or any other issue under this chapter, directly for hearing in accordance with this section. The status of the issue is the same as if a determination had been made and an appeal filed.\n(d) The computation of time provisions of sections 645.15 and 645.151 apply to this section.\nThe notice of hearing must include materials that provide:\n(1) a statement that the purpose of the hearing is to take sworn testimony and other evidence on the issues involved, that the hearing is the only procedure available under the law at which a party may present evidence, and that further appeals consist of a review of the evidence submitted at the hearing;\n(2) a statement of the parties' right to represent themselves or to be represented by an attorney or other authorized representative;\n(3) a brief description of the procedure to be followed to request a continuance of the hearing;\n(4) a brief description of the procedure to be followed at the hearing, including the role of the hearing officer;\n(5) a statement that the parties should arrange in advance for the participation of witnesses the parties need to support their position;\n(6) a statement that a party may find out the name of the other party's attorney or other authorized representative, names of the witnesses that the other party intends to have testify at the hearing, and an explanation of the process for making the request;\n(7) a statement that subpoenas may be available to compel the participation of witnesses or the production of documents and an explanation of the process for requesting a subpoena;\n(8) a statement that documents contained in the department's records and documents submitted by the parties that will be introduced at the hearing as possible exhibits will be sent to the parties in advance of the hearing;\n(9) a statement that even if the applicant already received benefits, the applicant should participate in the hearing, because if the applicant is held ineligible, the applicant is not eligible to receive further benefits and will have to pay back the benefits already received;\n(10) a statement that the hearing officer will determine the facts based upon a preponderance of the evidence along with the statutory definition of \"preponderance of the evidence\"; and\n(11) a statement that a party who fails to participate in the hearing will not be allowed a rehearing unless the party can show good cause for failing to participate, along with the statutory definition of \"good cause.\"\n(a) Upon a timely appeal to a determination having been filed or upon a referral for direct hearing, the department must set a time and date for a de novo due process hearing and send notice to an applicant and an employer, by mail or electronic transmission, not less than ten calendar days before the date of the hearing.\n(b) The commissioner may adopt rules on procedures for hearings. The rules need not conform to common law or statutory rules of evidence and other technical rules of procedure.\n(c) The department has discretion regarding the method by which the hearing is conducted.\n(d) The department may conduct a joint hearing with the unemployment insurance division if the substance of the appeal pertains to both programs.\n(e) The department must assign a hearing officer to conduct a hearing and may transfer to another hearing officer any proceedings pending before another hearing officer.\n(f) The department has discretion regarding the method by which the hearing is conducted. The hearing must be conducted by a hearing officer as an evidence-gathering inquiry, without regard to a burden of proof. The order of presentation of evidence is determined by the hearing officer.\n(g) Each party may present and examine witnesses and offer their own documents or other exhibits. Parties have the right to examine witnesses, object to exhibits and testimony, and cross-examine the other party's witnesses. The hearing officer must assist all parties in the presentation of evidence. The hearing officer must rule upon evidentiary objections on the record. The hearing officer must permit rebuttal testimony. Parties have the right to make closing statements. Closing statements may include comments based upon the evidence and arguments of law. The hearing officer may limit repetitious testimony and arguments.\n(h) The hearing officer must exercise control over the hearing procedure in a manner that protects the parties' rights to a fair hearing, including the sequestration of witnesses to avoid prejudice or collusion. The hearing officer must ensure that all relevant facts are clearly and fully developed. The hearing officer may obtain testimony and other evidence from department employees and any other person the hearing officer believes will assist in reaching a proper result.\n(i) Before taking testimony, the hearing officer must inform the parties:\n(1) that the purpose of the hearing is to take testimony and other evidence on the issues;\n(2) that the hearing is the only opportunity available to the parties to present testimony and other evidence on the issues involved;\n(3) of an explanation of how the hearing will be conducted, including the role and obligations of the hearing officer;\n(4) that the parties have the right to request that the hearing be continued so that additional witnesses and documents can be presented, by subpoena if necessary;\n(5) that the facts will be determined upon a preponderance of the evidence, along with the statutory definition of \"preponderance of the evidence\";\n(6) of the statutory provision on burden of proof;\n(7) that certain government agencies may have access to the information provided at the hearing if allowed by statute and that the information provided may be disclosed under a district court order; and\n(8) that after the hearing is over, the hearing officer will issue a written decision, which will be sent to the parties by mail or electronic transmission.\n(a) After the conclusion of the hearing, upon the evidence obtained, the hearing officer must serve by mail or electronic transmission to all parties the decision, reasons for the decision, and written findings of fact. The hearing officer's decision is final unless a request for reconsideration is filed under subdivision 6.\n(b) If the appellant fails to participate in the hearing, the hearing officer has the discretion to dismiss the appeal by summary decision. By failing to participate, the appellant is considered to have failed to exhaust available administrative remedies unless the appellant files a request for reconsideration under subdivision 6 and establishes good cause for failing to participate in the hearing. Submission of a written statement does not constitute participation. The appellant must participate personally or through an authorized representative.\n(c) The hearing officer must issue a decision dismissing the appeal as untimely if the judge decides the appeal was not filed in accordance with the deadlines under subdivision 2 after sending the determination. The hearing officer may dismiss the appeal by summary decision or may conduct a hearing to obtain evidence on the timeliness of the appeal.\n(d) Decisions of a hearing officer are not precedential.\n(a) Any party, or the commissioner, may, within 30 calendar days after service of the hearing officer's decision, file a request for reconsideration asking the hearing officer to reconsider that decision. Upon the filing of a request for reconsideration, the division must send a notice by mail or electronic transmission to the appellant that a request for reconsideration has been filed. The notice must inform the appellant:\n(1) that reconsideration is the procedure for the hearing officer to correct any factual or legal mistake in the decision or to order an additional hearing when appropriate;\n(2) of the opportunity to provide comment on the request for reconsideration and the right to obtain a copy of any recorded testimony and exhibits offered or received into evidence at the hearing;\n(3) that providing specific comments as to a perceived factual or legal mistake in the decision, or a perceived mistake in procedure during the hearing, will assist the hearing officer in deciding the request for reconsideration;\n(4) of the right to obtain any comments and submissions provided by any other party regarding the request for reconsideration; and\n(5) of the provisions of paragraph (c) regarding additional evidence.\nThis paragraph does not apply if paragraph (d) is applicable. Sending the notice does not mean the hearing officer has decided the request for reconsideration was timely filed.\n(b) In deciding a request for reconsideration, the hearing officer must not consider evidence that was not submitted at the hearing, except for purposes of determining whether to order an additional hearing. The hearing officer must order an additional hearing if a party shows that evidence which was not submitted at the hearing:\n(1) would likely change the outcome of the decision and there was good cause for not having previously submitted that evidence; or\n(2) would show that the evidence that was submitted at the hearing was likely false and that the likely false evidence had an effect on the outcome of the decision.\nFor purposes of this paragraph, \"good cause\" is a reason that would have prevented a reasonable person acting with due diligence from submitting the evidence.\n(c) If the appellant failed to participate in the hearing, the hearing officer must issue an order setting aside the decision and ordering an additional hearing if the party who failed to participate had good cause for failing to do so. The appellant who failed to participate in the hearing must be informed of the requirement to show good cause for failing to participate. If the hearing officer determines that good cause for failure to participate has not been shown, the judge must state that determination in the decision issued under paragraph (f). Submission of a written statement at the hearing does not constitute participation for purposes of this paragraph. \"Good cause\" for purposes of this paragraph is a reason that would have prevented a reasonable person acting with due diligence from participating in the hearing.\n(d) A request for reconsideration must be decided by the hearing officer who issued the decision under subdivision 5 unless that hearing officer:\n(1) is no longer employed by the department as a hearing officer;\n(2) is on an extended or indefinite leave; or\n(3) has been removed from the proceedings by the department.\n(e) If a request for reconsideration is timely filed, the hearing officer must issue:\n(1) a decision affirming the findings of fact, reasons for the decision, and a decision issued under subdivision 5;\n(2) a decision modifying the findings of fact, reasons for the decision, and a decision issued under subdivision 5; or\n(3) an order setting aside the findings of fact, reasons for the decision, and a decision issued under subdivision 5 and ordering an additional hearing.\n(f) The hearing officer must issue a decision dismissing the request for reconsideration as untimely if the judge decides the request for reconsideration was not filed within 30 calendar days after sending the decision under subdivision 5.\n(g) The hearing officer must send to all parties by mail or electronic transmission the decision or order issued under this subdivision. A decision affirming or modifying the previously issued findings of fact, reasons for the decision, and a decision issued under subdivision 5, or a decision dismissing the request for reconsideration as untimely, is the final decision on the matter and is binding on the parties unless judicial review is sought under subdivision 9.\n(a) An appeal that is pending before a hearing officer may be withdrawn by the appealing party, or an authorized representative of that party, by filing a notice of withdrawal. A notice of withdrawal may be filed by mail or by electronic transmission.\n(b) The appeal must, by order, be dismissed if a notice of withdrawal is filed, unless a hearing officer directs that further proceedings are required. An order of dismissal issued because of a notice of withdrawal is not subject to reconsideration or appeal.\n(c) A party may file a new appeal after the order of dismissal, but the original deadline period for appeal begins from the date of issuance of the determination, and that period is not suspended or restarted by the notice of withdrawal and order of dismissal. The new appeal may only be filed by mail or facsimile transmission.\n(d) For purposes of this subdivision, \"appeals\" includes a request for reconsideration filed under subdivision 6.\n(a) If a hearing officer's decision allows benefits to an applicant, the benefits must be paid regardless of any request for reconsideration or petition to the Minnesota Court of Appeals.\n(b) If a hearing officer's decision modifies or reverses a determination that allowed benefits to be paid, or on reconsideration the decision modifies or reverses a prior decision that allowed benefits to be paid, any benefits paid are an overpayment of those benefits. A decision that results in an overpayment of benefits must set out the amount of the overpayment and the requirement under section 268B.185, subdivision 1, that the benefits must be repaid.\n(c) If a hearing officer, on reconsideration under subdivision 6, orders the taking of additional evidence, the hearing officer's prior decision must continue to be enforced until new findings of fact and decision are made by the hearing officer.\n(a) All testimony at a hearing must be recorded. A copy of recorded testimony and exhibits offered or received into evidence at the hearing must, upon request, be furnished to a party at no cost:\n(1) during the time period for filing a request for reconsideration;\n(2) while a request for reconsideration is pending;\n(3) during the time for filing a petition under subdivision 12; or\n(4) while a petition is pending.\nRegardless of any law to the contrary, recorded testimony and other evidence may later be made available only under a district court order. A subpoena is not considered a district court order.\n(b) Testimony obtained at a hearing must not be used or considered for any purpose, including impeachment, in any civil, administrative, or contractual proceeding, except by a local, state, or federal human rights agency with enforcement powers, unless the proceeding is initiated by the department. This paragraph does not apply to criminal proceedings.\nNo findings of fact, decision, or order issued by a hearing officer may be held conclusive or binding or used as evidence in any separate or subsequent action in any other forum, be it contractual, administrative, or judicial, except proceedings provided for under this chapter, regardless of whether the action involves the same or related parties or involves the same facts.\n(a) In any proceeding under subdivision 4 or 6, an applicant or employer may be self-represented or represented by an attorney or an authorized representative. Except for services provided by a licensed attorney, no person may charge an applicant a fee of any kind for advising, assisting, or representing an applicant in a hearing, on reconsideration, or in a proceeding under subdivision 12.\n(b) A hearing officer may refuse to allow a person to represent others in a hearing if that person acts in an unethical manner or repeatedly fails to follow the instructions of the hearing officer.\n(c) An applicant may not be charged fees, costs, or disbursements of any kind in a proceeding before a hearing officer, the Minnesota Court of Appeals, or the Supreme Court of Minnesota.\n(d) No attorney fees may be awarded, or costs or disbursements assessed, against the department as a result of any proceedings under this section.\n(a) Any final determination on a request for reconsideration may be appealed by any party directly to the Minnesota Court of Appeals. The Minnesota Court of Appeals must, by writ of certiorari to the department, review the hearing officer's decision on reconsideration, provided a petition for the writ is filed with the court and a copy is served upon the hearing officer or the commissioner and any other party within 30 calendar days of the sending of the hearing officer's decision on reconsideration under subdivision 6. Three days are added to the 30-calendar-day period if the decision on reconsideration was mailed to the parties.\n(b) Any employer petitioning for a writ of certiorari must pay to the court the required filing fee in accordance with the Rules of Civil Appellate Procedure. If the employer requests a written transcript of the testimony received at the hearing conducted under this section, the employer must pay to the department the cost of preparing the transcript. That money is credited to the administration account.\n(c) Upon issuance by the Minnesota Court of Appeals of a writ of certiorari as a result of an applicant's petition, the department must furnish to the applicant at no cost a written transcript of any testimony received at the hearing conducted under this section and, if requested, a copy of all exhibits entered into evidence. No filing fee or cost bond is required of an applicant petitioning the Minnesota Court of Appeals for a writ of certiorari.\n(d) The Minnesota Court of Appeals may affirm the decision of the hearing officer or remand the case for further proceedings, or it may reverse or modify the decision if the substantial rights of the petitioner may have been prejudiced because the findings, inferences, conclusion, or decision are:\n(1) in violation of constitutional provisions;\n(2) in excess of the statutory authority or jurisdiction of the department;\n(3) made upon unlawful procedure;\n(4) affected by other error of law;\n(5) unsupported by substantial evidence in view of the hearing record as submitted; or\n(6) arbitrary or capricious.\n(e) The department is the primary responding party to any judicial action involving a hearing officer's decision. The department may be represented by an attorney licensed to practice law in Minnesota.\n(a) Requests to reschedule a hearing must be addressed in a manner and form prescribed by the commissioner in advance of the regularly scheduled hearing date. A hearing must be rescheduled based on a party's good cause need for additional time to obtain necessary evidence or to obtain representation or adequately prepare, inability to participate due to illness, or other compelling reasons beyond the control of the party that prevent participation at the originally scheduled time. A hearing may be rescheduled only once by each party except in the case of an emergency. If requested, a written statement by mail or electronic transmission confirming the reasons for requesting that the case be rescheduled must be provided to the department.\n(b) The ten-calendar-day notice requirement for hearings does not apply to rescheduled hearings.\n(c) If a request for rescheduling is made because of the unavailability of a witness or the need to obtain documents, the hearing officer may direct that the hearing take place as scheduled. After obtaining the testimony and other evidence then available, the hearing officer must determine whether the hearing should be continued to obtain the testimony of the unavailable witness or the unavailable documents. The ten-calendar-day notice requirement for hearings does not apply to continued hearings. The hearing officer has the discretion to continue a hearing if the hearing officer determines that additional evidence is necessary for a proper result.\nUpon the request of a party or on the hearing officer's motion, the hearing officer may consolidate for hearing issues involving one or more of the same parties. The hearing officer may take testimony and render a decision on issues not listed on the notice of hearing if each party is notified on the record, is advised of the right to object, and does not object. If a party objects, the hearing officer must:\n(1) continue the hearing to allow the party to prepare for consideration of the issue; or\n(2) direct the department to address the issue and send to the parties a determination by mail or electronic transmission.\n(a) The department must provide an interpreter, when necessary, upon the request of a party. The requesting party must notify the department at least five calendar days before the date of the hearing that an interpreter is required. The hearing officer must continue any hearing where a witness or party needs an interpreter to be understood or to understand the proceedings.\n(b) A written statement in the five most common languages spoken in Minnesota must accompany all notices and written materials sent to the parties stating that the accompanying documents are important and that if the reader does not understand the documents the reader should seek immediate assistance.\n(a) Upon receipt of the notice of hearing, and no later than five calendar days before the scheduled date of hearing, parties may submit to the department, by electronic transmission or mail, any documents a party would like to offer as exhibits at the hearing. Copies of the documents submitted by the parties, as well as all documents that are contained in the department's records that will be introduced as exhibits, must be mailed, or sent by electronic transmission, to all parties or the parties' authorized representatives by the department in advance of the hearing.\n(b) If a party requests to introduce additional documents during the hearing, and the hearing officer rules that the documents should be considered, the requesting party must provide copies of the documents to the hearing officer and the other party. The record must be left open for sufficient time for the submission of a written response to the documents. The response may be sent by mail or electronic transmission. The hearing officer may, when appropriate, reconvene the hearing to obtain a response or permit cross-examination regarding the late filed exhibits.\nThe parties to a hearing must be allowed reasonable access to department data necessary to represent themselves in the hearing. Access to data must be consistent with all laws relating to data practices. The data must be provided by the department at no cost and mailed or sent by electronic transmission to the party or the party's authorized representative.\n(a) The hearing officer may issue subpoenas to compel the attendance of witnesses, the production of documents, or other exhibits upon a showing of necessity by the requesting party. Requests for issuance of subpoenas must be made to the department, by electronic transmission or mail, sufficiently in advance of the scheduled hearing to allow for the service of the subpoenas. The requesting party must identify the person or documents to be subpoenaed and the subject matter and necessity of the evidence requested. A request for a subpoena may be denied if the testimony or documents sought would be irrelevant, immaterial, or unduly cumulative or repetitious.\n(b) If a request for a subpoena has been denied, the hearing officer must reconsider the request during the hearing and determine whether the request was properly denied. If the hearing officer determines that the request for a subpoena was not properly denied, the hearing officer must continue the hearing to allow for service of and compliance with the subpoena. The hearing officer may issue a subpoena even if a party has not requested one.\n(c) Within five calendar days following request by another party, each party must disclose the name of the party's attorney or other authorized representative and the names of all witnesses the party intends to have testify at the hearing. The request and the response may be made by mail or by electronic transmission. Any witnesses unknown at the time of the request must be disclosed as soon as they become known. If a party fails to comply with the disclosure requirements, the hearing officer may, upon notice to the parties, continue the hearing.\n(a) A hearing officer must request to be removed from any case by the department where the hearing officer believes that presiding over the case would create the appearance of impropriety. The department must remove a hearing officer from any case if the hearing officer has a financial or personal interest in the outcome.\n(b) Any party may request the removal of a hearing officer by submitting to the department, by mail or electronic transmission, a written statement of the basis for removal. The department must decide the fitness of the hearing officer to hear the particular case.\n(a) Hearings are not public. Only parties, the parties' authorized representatives and witnesses, and authorized department personnel are permitted to participate in or listen to hearings. If any other person wishes to listen to or sit in on a hearing, the parties must provide their consent as required by section 13.05, subdivision 4.\n(b) The hearing officer must make a recording of all testimony that is the official record. No other voice recordings or pictures may be made of any party, representative, or witness during the hearing.\nA hearing officer has authority to administer oaths and affirmations. Before testifying, every witness is required to declare to testify truthfully, by oath or affirmation under sections 358.07 and 358.08.\nOnly evidence received into the record of any hearing may be considered by the hearing officer. The parties may stipulate to the existence of any fact or the authenticity of any exhibit. All competent, relevant, and material evidence, including records and documents in the possession of the parties that are offered into evidence, are part of the hearing record. A hearing officer may receive any evidence that possesses probative value, including hearsay, if it is the type of evidence on which reasonable, prudent persons are accustomed to rely in the conduct of their serious affairs. A hearing officer may exclude any evidence that is irrelevant, immaterial, unreliable, or unduly repetitious. A hearing officer is not bound by statutory and common law rules of evidence. The rules of evidence may be used as a guide in determining the quality of evidence offered. A hearing officer may draw adverse inferences from the refusal of a party or witness to testify on the basis of any privilege. A hearing officer may only use reliable, probative, and substantial evidence as a basis for decision.\nA hearing officer may take official notice of matters of common knowledge and may take notice of facts within the hearing officer's specialized knowledge in the field of paid leave. The hearing officer must state on the record any fact that is judicially noticed. The hearing officer must give the parties an opportunity to contest the noticed facts.",
	"repealed": false
}