{
	"id": "326B.99",
	"url": "https://www.revisor.mn.gov/statutes/cite/326B.99",
	"title": "326B.99 REPORT OF INSURER; EXEMPTION FROM INSPECTION.",
	"text": "Any insurance company insuring boilers and pressure vessels in this state shall inspect each insured boiler or pressure vessel. Within 21 days after the inspection, the insurance company shall file an inspection report with the commissioner. The inspection report shall be on the applicable national board form. The inspection report must indicate who is the properly licensed engineer in charge of the boiler or pressure vessel, including the engineer's license grade, class, and telephone number. Such report shall be made annually for boilers and biennially for pressure vessels and must be submitted in the format required by the department.\nEvery boiler or pressure vessel as to which any insurance company authorized to do business in this state has issued a policy of insurance, after the inspection thereof, is exempt from inspection by the department made under sections 326B.95 to 326B.998, except the initial inspection by the department under section 326B.958, subdivision 1, paragraph (b), as long as:\n(1) the boiler or pressure vessel continues to be insured;\n(2) the boiler or pressure vessel continues to be inspected in accordance with the inspection schedule in sections 326B.958 and 326B.96; and\n(3) the person owning or operating the boiler or pressure vessel has an unexpired certificate of registration.\nThe insurer shall notify the commissioner in writing of its policy to insure and inspect boilers and pressure vessels at a location within 30 days of the date coverage is provided.\nThe insurer shall notify the commissioner in writing, within 30 days of the effective date, of the discontinuation of insurance coverage of the boilers and pressure vessels at a location. This notice shall show the effective date when the discontinued policy takes effect.\nThe commissioner shall assess upon the insurer a $50 penalty, per applicable boiler and pressure vessel, for failing to submit an inspection report or notify the commissioner of insurance coverage or discontinuation of insurance coverage as set forth in this section. The commissioner shall assess upon the insurer a penalty of $100, per applicable boiler and pressure vessel, for failing to conduct the required in-service inspection within 60 days after the inspection was due, or within 60 days of the date of coverage for boilers or pressure vessels that are overdue for inspection. The penalties in this subdivision may only be assessed for notice, reports, and inspections required during the period that the insurance coverage was in effect.",
	"repealed": false
}