{
	"id": "72A.31",
	"url": "https://www.revisor.mn.gov/statutes/cite/72A.31",
	"title": "72A.31 CERTAIN ACTS DEEMED UNFAIR METHOD OF COMPETITION.",
	"text": "No person, firm or corporation engaged in the business of financing the purchase of real or personal property or of lending money on the security of real or personal property or who acts as agent or broker for one who purchases real property and borrows money on the security thereof, and no trustee, director, officer, agent or other employee of any such person, firm, or corporation shall directly or indirectly:\n(1) require, as a condition precedent to such purchase or financing the purchase of such property or to loaning money upon the security of a mortgage thereon, or as a condition prerequisite for the renewal or extension of any such loan or mortgage or for the performance of any other act in connection therewith, that the person, firm or corporation making such purchase or for whom such purchase is to be financed or to whom the money is to be loaned or for whom such extension, renewal or other act is to be granted or performed negotiate any policy of insurance or renewal thereof covering such property through a particular agent, or insurer, or\n(2) refuse to accept any policy of insurance covering such property because it was not negotiated through or with any particular agent, or insurer, or\n(3) refuse to accept any policy of insurance covering the property issued by an insurer that is a member insurer as defined by section 60C.03, subdivision 6, or\n(4) require any policy of insurance covering the property to exceed the replacement cost of the buildings on the mortgaged premises.\nThis section shall not prevent the disapproval of the insurer or a policy of insurance by any such person, firm, corporation, trustee, director, officer, agent or employee where there are reasonable grounds for believing that the insurer is insolvent or that such insurance is unsatisfactory as to placement with an unauthorized insurer, adequacy of the coverage, adequacy of the insurer to assume the risk to be insured, the assessment features to which the policy is subject, or other grounds which are based on the nature of the coverage and which are not arbitrary, unreasonable or discriminatory, nor shall this section prevent a mortgage lender or mortgage servicer from requiring that a policy of insurance or renewal thereof be in conformance with standards of the Federal National Mortgage Association or the Federal Home Loan Mortgage Corporation, nor shall this section forbid the securing of insurance or a renewal thereof at the request of the borrower or because of the borrower's failure to furnish the necessary insurance or renewal thereof. For purposes of this section, \"insurer\" includes a township mutual fire insurance company operating under sections 67A.01 to 67A.26.\nUpon notice of any such disapproval of or refusal to accept an insurer or a policy of insurance, the commissioner may order the approval of the insurer or the acceptance of the tendered policy of insurance, or both, if the commissioner determines such disapproval or refusal to accept is not in accordance with the foregoing requirements. Failure to comply with such an order of the commissioner of commerce shall be deemed a violation of this section.\nIt shall be unlawful in connection with any contract or subcontract calling for any construction work for a public agency to require, directly or indirectly, that any insurance or bond be purchased or renewed through a particular agent or insurer.",
	"repealed": false
}