{
	"id": "462C.02",
	"url": "https://www.revisor.mn.gov/statutes/cite/462C.02",
	"title": "462C.02 DEFINITIONS.",
	"text": "For the purposes of sections 462C.01 to 462C.08, the terms defined in this section have the meanings given them.\nMS 1994 [Repealed, 1995 c 167 s 16]\n\"Program\" means an individual component of a city's overall program for housing for which one or more issues of revenue bonds or obligations is proposed.\n\"Single-family housing\" means real property and improvements thereon consisting of a one, two, three or four unit dwelling, one unit of which is occupied as a principal residence by the owner of the units, or a unit or an apartment as described in chapter 515, 515A, or 515B, or any amendatory or supplemental law, which is owned or to be owned and occupied by one person or family as a principal residence, or a unit in a cooperatively owned group of dwelling units which is occupied as a principal residence. Single-family housing may include new construction, or the acquisition and rehabilitation of an existing building and site, or the rehabilitation of and discharge of any interest or lien in an existing building and site.\n\"Multifamily housing development\" or \"development\" means an apartment facility, including an apartment or unit described in chapter 515, 515A, or 515B, or a cooperative, or a group of townhouses, which include four or more dwelling units, each to be rented or sold to or occupied by a person or family for use as a residence, or a building or buildings which include one or more dwelling units, each to be rented by a person or family for use as a residence. A development may include new construction or the acquisition and rehabilitation of an existing building and site or the rehabilitation of and discharge of any interest or lien in an existing building and site.\n\"City\" means any statutory or home rule charter city, a county housing and redevelopment authority created by special law or authorized by its county to exercise its powers pursuant to section 469.004, or any public body which (a) is the housing and redevelopment authority in and for a statutory or home rule charter city, the port authority of a statutory or home rule charter city, or an economic development authority of a city established under sections 469.090 to 469.108, and (b) is authorized by ordinance to exercise, on behalf of a statutory or home rule charter city, the powers conferred by sections 462C.01 to 462C.10.\n\"Adjusted gross income\" means gross family income less $750 for each adult in the family to a maximum of two adults and less $500 for each other dependent in the family.\n\"Rehabilitation\" means the improvement of existing single family housing or an existing multifamily housing development to improve the basic livability of the housing or restore it to a decent, safe, and sanitary condition. Improvements may include, without limitation, room additions, renovation, improvement or construction of a garage, repair of sidewalks, and improvements used or useful to conserve energy or to convert or refit an existing residential building for the use of any energy source which does not depend on nuclear fuel or nonrenewable fossil fuel, or which makes available another energy source which is wasted including, without limitation, cogeneration or district heating. Improvements shall not include the construction or improvement of recreational facilities, routine or minor repairs or maintenance, or cosmetic improvements unless coupled with the cure of substantial accumulation of deferred maintenance or other permitted improvements.\n\"Targeted area\" means:\n(a) a development district established pursuant to section 469.126,\n(b) a development district established pursuant to Laws 1971, chapter 677 as amended,\n(c) a redevelopment project established pursuant to section 469.028,\n(d) an industrial development district established pursuant to section 469.058,\n(e) a census tract in which 70 percent or more of the families have income which is 80 percent or less of the statewide median family income as estimated by the United States Department of Housing and Urban Development,\n(f) an area of chronic economic distress designated by the Minnesota Housing Finance Agency, or\n(g) an economic development district established pursuant to section 469.101.\n\"Mortgage credit certificate\" means any certificate which satisfies the definition of such term as contained in section 25(c)(1) of the Internal Revenue Code of 1954, as amended through July 18, 1984.\n\"Qualified mortgage credit certificate program\" means any program which satisfies the definition of such term as contained in section 25(c)(2) of the Internal Revenue Code of 1954, as amended through July 18, 1984.\n\"Loan\" means (1) for single-family housing, any loan, mortgage, or other form of owner financing; and (2) for multifamily housing developments which are rental property, any loan, mortgage, financing lease, or revenue agreement.\n\"Revenue agreement\" has the meaning given that term in section 469.153, subdivision 10.",
	"repealed": false
}