{
	"id": "62M.03",
	"url": "https://www.revisor.mn.gov/statutes/cite/62M.03",
	"title": "62M.03 COMPLIANCE WITH STANDARDS.",
	"text": "Beginning January 1, 1993, any organization that meets the definition of utilization review organization in section 62M.02, subdivision 21, must be licensed under chapter 60A, 62C, 62D, 62N, 62T, or 64B, or registered under this chapter and must comply with this chapter and section 72A.201, subdivisions 8 and 8a. Each licensed community integrated service network or health maintenance organization that has an employed staff model of providing health care services shall comply with this chapter and section 72A.201, subdivisions 8 and 8a, for any services provided by providers under contract.\nAn organization that meets the definition of a utilization review organization under section 62M.02, subdivision 21, that is not licensed in this state that performs utilization review services for Minnesota residents must register with the commissioner of commerce and must certify compliance with this chapter.\nInitial registration must occur no later than January 1, 1993. The registration is effective for two years and may be renewed. Applications for initial and renewal registrations must be made on forms prescribed by the commissioner. Each utilization review organization registered under this chapter shall notify the commissioner of commerce within 30 days of any change in the name, address, or ownership of the organization. The organization shall pay to the commissioner of commerce a fee of $1,000 for the initial registration application and $1,000 for each two-year renewal.\nIf a utilization review organization fails to comply with this chapter, the organization may not provide utilization review services for any Minnesota resident. The commissioner of commerce may issue a cease and desist order under section 45.027, subdivision 5, to enforce this provision. The cease and desist order is subject to appeal under chapter 14. A nonlicensed utilization review organization that fails to comply with the provisions of this chapter is subject to all applicable penalty and enforcement provisions of section 72A.201. Each utilization review organization licensed under chapter 60A, 62C, 62D, 62N, 62T, or 64B shall comply with this chapter as a condition of licensure.",
	"repealed": false
}