{
	"id": "17.499",
	"url": "https://www.revisor.mn.gov/statutes/cite/17.499",
	"title": "17.499 TRANSPORTATION OR IMPORTATION OF SALTWATER AQUATIC LIFE; QUARANTINE REQUIREMENT.",
	"text": "The legislature finds that it is in the public interest to increase private saltwater aquaculture production and processing in this state under the coordination of the commissioner of agriculture. Additional private production will reduce dependence on foreign suppliers and benefit the rural economy by creating new jobs and economic activity.\n(a) Notwithstanding the requirements in section 17.4985, saltwater aquatic life transportation and importation requirements are governed by this section. A transportation permit is required before importation or intrastate transportation of saltwater aquatic life not exempted under subdivision 3. A transportation permit may be used for multiple shipments within the 30-day term of the permit if the source and the destination are the same. Transportation permits must be obtained from the commissioner before shipment of saltwater aquatic life.\n(b) An application for a transportation permit must be made in the form required by the commissioner. The commissioner may reject an incomplete application.\n(c) An application for a transportation permit must be accompanied by satisfactory evidence, as determined by the commissioner, that the shipment is free of any nonindigenous species of animal other than the saltwater aquatic species and either:\n(1) the facility from which the saltwater aquatic life originated has provided documentation of 36 or more consecutive months of negative testing by an approved laboratory as free of any disease listed by OIE - the World Organisation for Animal Health for that species following the testing guidelines outlined in the OIE Aquatic Animal Health Code for crustaceans or the AFS Fish Health Blue Book for other species, as appropriate; or\n(2) the saltwater aquatic life to be imported or transported includes documentation of negative testing for that specific lot by an approved laboratory as free of any disease listed by OIE - the World Organisation for Animal Health for crustaceans or in the AFS Fish Health Blue Book for other species, as appropriate.\nIf a shipment authorized by the commissioner under clause (1) includes saltwater aquatic life that originated in a foreign country, the shipment must be quarantined at the receiving facility according to a quarantine plan approved by the commissioner. A shipment authorized by the commissioner under clause (2) must be quarantined at the receiving facility according to a quarantine plan approved by the commissioner.\n(d) For purposes of this subdivision, \"approved laboratory\" means a laboratory approved by the commissioner or the United States Department of Agriculture, Animal and Plant Health Inspection Services.\n(e) No later than 14 calendar days after a completed transportation permit application is received, the commissioner shall approve or deny the transportation permit application.\n(f) A copy of the transportation permit must accompany a shipment of saltwater aquatic life while in transit and must be available for inspection by the commissioner.\n(g) A vehicle used by a licensee for transporting aquatic life must be identified with the license number and the licensee's name and town of residence as it appears on the license. A vehicle used by a licensee must have identification displayed so that it is readily visible from either side of the vehicle in letters and numbers not less than 2-1/2 inches high and three-eighths inch wide. Identification may be permanently affixed to vehicles or displayed on removable plates or placards placed on opposite doors of the vehicle or on the tanks carried on the vehicle.\n(h) An application to license a vehicle for brood stock or larvae transport or for use as a saltwater aquatic life vendor that is received by the commissioner is a temporary license until approved or denied by the commissioner.\n(a) A transportation permit is not required to transport or import saltwater aquatic life:\n(1) previously processed for use as food or other purposes unrelated to propagation;\n(2) transported directly to an outlet for processing as food or for other food purposes if accompanied by shipping documents;\n(3) that is being exported if accompanied by shipping documents;\n(4) that is being transported through the state if accompanied by shipping documents; or\n(5) transported intrastate within or between facilities licensed for saltwater aquaculture by the commissioner if accompanied by shipping documents.\n(b) Shipping documents required under paragraph (a) must include the place of origin, owner or consignee, destination, number, species, and satisfactory evidence, as determined by the commissioner, of the disease-free certification required under subdivision 2, paragraph (c), clauses (1) and (2).",
	"repealed": false
}