{
	"id": "116J.431",
	"url": "https://www.revisor.mn.gov/statutes/cite/116J.431",
	"title": "116J.431 GREATER MINNESOTA BUSINESS DEVELOPMENT PUBLIC INFRASTRUCTURE GRANT PROGRAM.",
	"text": "(a) The commissioner shall make grants to counties or cities to provide up to 50 percent of the capital costs of public infrastructure necessary for an eligible economic development project. The county or city receiving a grant must provide for the remainder of the costs of the project, either in cash or in kind. In-kind contributions may include the value of site preparation other than the public infrastructure needed for the project.\n(b) The purpose of the grants made under this section is to keep or enhance jobs in the area, increase the tax base, or to expand or create new economic development.\n(c) In awarding grants under this section, the commissioner must adhere to the criteria under subdivision 4.\n(d) If the commissioner awards a grant for less than 50 percent of the project, the commissioner shall provide the applicant and the chairs and ranking minority members of the senate and house of representatives committees with jurisdiction over economic development finance a written explanation of the reason less than 50 percent of the capital costs were awarded in the grant.\n(a) For purposes of this section, the following terms have the meanings given.\n(b) \"City\" means a statutory or home rule charter city located outside the metropolitan area, as defined in section 473.121, subdivision 2.\n(c) \"County\" means a county located outside the metropolitan area, as defined in section 473.121, subdivision 2.\n(d) \"Public infrastructure\" means publicly owned physical infrastructure necessary to support economic development projects, including, but not limited to, sewers, water supply systems, utility extensions, streets, wastewater treatment systems, stormwater management systems, and facilities for pretreatment of wastewater to remove phosphorus.\n(a) An economic development project for which a county or city may be eligible to receive a grant under this section includes:\n(1) manufacturing;\n(2) technology;\n(3) warehousing and distribution;\n(4) research and development;\n(5) agricultural processing, defined as transforming, packaging, sorting, or grading livestock or livestock products into goods that are used for intermediate or final consumption, including goods for nonfood use; or\n(6) industrial park development that would be used by any other business listed in this subdivision even if no business has committed to locate in the industrial park at the time the grant application is made.\n(b) Up to 15 percent of the development of a project may be for a purpose that is not included under this subdivision as an eligible project. A city or county must provide notice to the commissioner for the commissioner's approval of the proposed project.\nProjects, including but not limited to the following types, are ineligible for a grant under this section:\n(1) retail development; or\n(2) office space development, except as incidental to an eligible purpose.\nAfter ten years from the date of the grant award under this section, if an eligible project for which the public infrastructure was intended has not been developed, any other lawful project may be developed and supported by the public infrastructure. The city or county must notify the commissioner of the project.\n(a) The commissioner must develop forms and procedures for soliciting and reviewing applications for grants under this section. At a minimum, a county or city must include in its application a resolution of the county or city council certifying that the required local match is available. The commissioner must evaluate complete applications for eligible projects using the following criteria:\n(1) the project is an eligible project as defined under subdivision 2;\n(2) the project is expected to result in or will attract substantial public and private capital investment and provide substantial economic benefit to the county or city in which the project would be located;\n(3) the project is not relocating substantially the same operation from another location in the state, unless the commissioner determines the project cannot be reasonably accommodated within the county or city in which the business is currently located, or the business would otherwise relocate to another state; and\n(4) the project is expected to or will create or retain full-time jobs.\n(b) The determination of whether to make a grant for a site is within the discretion of the commissioner, subject to this section. The commissioner's decisions and application of the criteria are not subject to judicial review, except for abuse of discretion.\n[Repealed, 2009 c 78 art 2 s 44]\nA county or city may receive no more than $2,000,000 in two years for one or more projects.\nIf after five years, the commissioner determines that a project has not proceeded in a timely manner and is unlikely to be completed, the commissioner must cancel the grant and require the grantee to return all grant money awarded for that project. For industrial park development projects, if after five years the industrial park is not developed and available for business use, the commissioner must cancel the grant and require the grantee to return all grant money for that project. If the industrial park is developed and available for use within five years, but no businesses have located in the park, the grantee is not required to return any grant money.\nGrant money returned to the commissioner is appropriated to the commissioner to make additional grants under this section.",
	"repealed": false
}