{
	"id": "60A.766",
	"url": "https://www.revisor.mn.gov/statutes/cite/60A.766",
	"title": "60A.766 MINIMUM STANDARDS FOR CONTRACT RESERVES.",
	"text": "(a) Minimum standards with respect to morbidity are those set forth in section 60A.768. Valuation net premiums used under each contract must have a structure consistent with the gross premium structure at issue of the contract as this relates to advancing age of insured, contract duration, and period for which gross premiums have been calculated.\nContracts for which tabular morbidity standards are not specified in section 60A.768 must be valued using tables established for reserve purposes by a qualified actuary and acceptable to the commissioner. The morbidity tables must contain a pattern of incurred claims cost that reflects the underlying morbidity and must not be constructed for the primary purpose of minimizing reserves.\n(b) The maximum interest rate is specified in section 60A.768.\n(c) Termination rates used in the computation of reserves must be on the basis of a mortality table as specified in section 60A.768 except as noted in clauses (1) to (3):\n(1) under contracts for which premium rates are not guaranteed, and where the effects of insurer underwriting are specifically used by policy duration in the valuation morbidity standard or for return of premium or other deferred cash benefits, total termination rates may be used at ages and durations where these exceed specified mortality table rates, but not in excess of the lesser of:\n(i) 80 percent of the total termination rate used in the calculation of the gross premiums; or\n(ii) eight percent;\n(2) for long-term care individual policies or group certificates issued after January 1, 1997, the contract reserve may be established on a basis of separate:\n(i) mortality as specified in section 60A.768; and\n(ii) terminations other than mortality, where the terminations are not to exceed:\nA. for policy years one through four, the lesser of 80 percent of the voluntary lapse rate used in the calculation of gross premiums and eight percent;\nB. for policy years five and later, the lesser of 100 percent of the voluntary lapse rate used in the calculation of gross premiums and four percent;\n(3) where a morbidity standard specified in section 60A.768 is on an aggregate basis, the morbidity standard may be adjusted to reflect the effect of insurer underwriting by policy duration. The adjustments must be appropriate to the underwriting and be acceptable to the commissioner.\n(a) For insurance, except long-term care and return of premium or other deferred cash benefits, the minimum reserve is the reserve calculated on the two-year full preliminary term method; that is, under which the terminal reserve is zero at the first and also the second contract anniversary.\n(b) For long-term care insurance, the minimum reserve is the reserve calculated as follows:\n(1) for individual policies and group certificates issued on or before December 31, 1991, reserves calculated on the two-year full preliminary term methods;\n(2) for individual policies and group certificates issued on or after January 1, 1992, reserves calculated on the one-year full preliminary term method.\n(c) For return of premium or other deferred cash benefits, the minimum reserve is the reserve calculated as follows:\n(1) on the one-year preliminary term method if the benefits are provided at any time before the 20th anniversary;\n(2) on the two-year preliminary term method if the benefits are only provided on or after the 20th anniversary.\nThe preliminary term method may be applied only in relation to the date of issue of a contract. Reserve adjustments introduced later, as a result of rate increases, revisions in assumptions, for example projected inflation rates, or for other reasons, are to be applied immediately as of the effective date of adoption of the adjusted basis.\nNegative reserves on any benefit may be offset against positive reserves for other benefits in the same contract, but the total contract reserve with respect to all benefits combined may not be less than zero.\nThe contract reserve on a policy basis must not be less than the net single premium for the nonforfeiture benefits at the appropriate policy duration, where the net single premium is computed according to the specifications in this section. While the consideration for nonforfeiture benefits in this section is specific to long-term care insurance, similar consideration may be applicable for other lines of business.\nProvided the contract reserve on all contracts to which an alternative method or basis is applied is not less in the aggregate than the amount determined according to the applicable standards specified in this section, an insurer may use any reasonable assumptions as to interest rates, termination and mortality rates, and rates of morbidity or other contingency. Also, subject to the preceding condition, the insurer may employ methods other than the methods stated in this section in determining a sound value of its liabilities under such contracts, including, but not limited to, the following: the net level premium method; the one-year full preliminary term method; prospective valuation on the basis of actual gross premiums with reasonable allowance for future expenses; the use of approximations such as those involving age groupings, groupings of several years of issue, average amounts of indemnity, and grouping of similar contract forms; the computation of the reserve for one contract benefit as a percentage of, or by other relation to, the aggregate contract reserves exclusive of the benefit or benefits so valued; and the use of a composite annual claim cost for all or any combination of the benefits included in the contracts valued.\nAnnually, an appropriate review must be made of the insurer's prospective contract liabilities on contracts valued by tabular reserves, to determine the continuing adequacy and reasonableness of the tabular reserves giving consideration to future gross premiums. The insurer shall make appropriate increments to such tabular reserves if such tests indicate that the basis of such reserves is no longer adequate; subject, however, to the minimum standards of subdivisions 1 to 4.\nIn the event a company has a contract or a group of related similar contracts for which future gross premiums will be restricted by contract, department rule, or for other reasons, such that the future gross premiums reduced by expenses for administration, commissions, and taxes will be insufficient to cover future claims, the company shall establish contract reserves for such shortfall in the aggregate.",
	"repealed": false
}