{
	"id": "142G.27",
	"url": "https://www.revisor.mn.gov/statutes/cite/142G.27",
	"title": "142G.27 ORIENTATION.",
	"text": "A county agency must provide an orientation to each MFIP caregiver unless the caregiver is:\n(1) a single parent, or one parent in a two-parent family, employed at least 35 hours per week; or\n(2) a second parent in a two-parent family who is employed for 20 or more hours per week provided the first parent is employed at least 35 hours per week.\nThe county agency must inform caregivers who are not exempt under clause (1) or (2) that failure to attend the orientation is considered an occurrence of noncompliance with program requirements, and will result in the imposition of a sanction under section 142G.70. If the client complies with the orientation requirement prior to the first day of the month in which the grant reduction is proposed to occur, the orientation sanction shall be lifted.\nPregnant and parenting minors who are complying with the provisions of section 142G.57 are exempt from the requirement under subdivision 1, however, the county agency must provide information to the minor as required under section 142G.14.\nThe MFIP orientation must consist of a presentation that informs caregivers of:\n(1) the necessity to obtain immediate employment;\n(2) the work incentives under MFIP, including the availability of the federal earned income tax credit and the Minnesota working family tax credit;\n(3) the requirement to comply with the employment plan and other requirements of the employment and training services component of MFIP, including a description of the range of work and training activities that are allowable under MFIP to meet the individual needs of participants;\n(4) the consequences for failing to comply with the employment plan and other program requirements, and that the county agency may not impose a sanction when failure to comply is due to the unavailability of child care or other circumstances where the participant has good cause under subdivision 4;\n(5) the rights, responsibilities, and obligations of participants;\n(6) the types and locations of child care services available through the county agency;\n(7) the availability and the benefits of the early childhood health and developmental screening under sections 123B.02, subdivision 16; 123B.10; and 142D.09 to 142D.093;\n(8) the caregiver's eligibility for transition year child care assistance under section 142E.08;\n(9) the availability of all health care programs, including transitional medical assistance;\n(10) the caregiver's option to choose an employment and training provider and information about each provider, including but not limited to, services offered, program components, job placement rates, job placement wages, and job retention rates;\n(11) the caregiver's option to request approval of an education and training plan according to section 142G.58;\n(12) the work study programs available under the higher education system;\n(13) information about the 60-month time limit exemptions under the family violence waiver and referral information about shelters and programs for victims of family violence; and\n(14) information about the income exclusions under section 256P.06, subdivision 2.\n(a) The county agency shall not impose the sanction under section 142G.70 if it determines that the participant has good cause for failing to attend orientation. Good cause exists when:\n(1) appropriate child care is not available;\n(2) the participant is ill or injured;\n(3) a family member is ill and needs care by the participant that prevents the participant from attending orientation. For a caregiver with a child or adult in the household who meets the disability or medical criteria for home care services under section 256B.0659, or a home and community-based waiver services program under chapter 256B, or meets the criteria for severe emotional disturbance under section 245.4871, subdivision 6, or for serious and persistent mental illness under section 245.462, subdivision 20, paragraph (c), good cause also exists when an interruption in the provision of those services occurs which prevents the participant from attending orientation;\n(4) the caregiver is unable to secure necessary transportation;\n(5) the caregiver is in an emergency situation that prevents orientation attendance;\n(6) the orientation conflicts with the caregiver's work, training, or school schedule; or\n(7) the caregiver documents other verifiable impediments to orientation attendance beyond the caregiver's control.\n(b) Counties must work with clients to provide child care and transportation necessary to ensure a caregiver has every opportunity to attend orientation.",
	"repealed": false
}