{
	"id": "60A.198",
	"url": "https://www.revisor.mn.gov/statutes/cite/60A.198",
	"title": "60A.198 TRANSACTION OF NONADMITTED INSURANCE.",
	"text": "A person, as defined in section 60A.02, subdivision 7, shall not act in any other manner as an agent or broker in the transaction of nonadmitted insurance unless licensed under sections 60A.195 to 60A.209. A surplus lines license is not required for a licensed agent who assists in the placement of nonadmitted insurance with a surplus lines broker pursuant to sections 60A.195 to 60A.209. This subdivision does not apply to nonadmitted insurance procured by a surplus lines broker when an insured's home state is a state other than Minnesota.\nA person shall not offer, solicit, make a quotation on, sell, or issue a policy of insurance, binder, or any other evidence of insurance with a nonadmitted insurer, except in compliance with sections 60A.195 to 60A.209. This subdivision does not apply when an insured's home state is a state other than Minnesota.\nA person licensed as an agent in this state pursuant to other law may obtain a surplus lines license by doing the following:\n(a) filing an application in the form and with the information the commissioner may reasonably require to determine the ability of the applicant to act in accordance with sections 60A.195 to 60A.209;\n(b) maintaining an agent's license in this state;\n(c) registering with the association created pursuant to section 60A.2085;\n(d) agreeing to file with the commissioner of revenue all returns required by chapter 297I and paying to the commissioner of revenue all amounts required under chapter 297I;\n(e) agreeing to file all documents required pursuant to section 60A.2086 and to pay the stamping fee assessed pursuant to section 60A.2085, subdivision 7; and\n(f) paying a fee as prescribed by section 60K.55.\nA surplus lines broker may do any or all of the following:\n(a) place insurance on risks in this state with eligible surplus lines insurers;\n(b) place insurance on risks in this state with ineligible surplus lines insurers in strict compliance with section 60A.209. If the insurance is provided through the participation of several nonadmitted insurers and the broker has reason to believe that a substantial portion of the insurance would be assumed by eligible surplus lines insurers, then with respect to the ineligible surplus lines insurers, the insured or the insured's representative shall be informed as provided in section 60A.209, subdivision 1, clause (a); or\n(c) engage in any other acts expressly or implicitly authorized by sections 60A.195 to 60A.209 and the other insurance laws.\nBefore placement of insurance with an eligible surplus lines insurer, a surplus lines broker shall inform an insured or the insured's representative that coverage may be placed in conformance with sections 60A.195 to 60A.209 with an insurer not licensed in this state and that payment of loss is not guaranteed in the event of insolvency of the eligible surplus lines insurer.\n[Repealed, 2000 c 394 art 2 s 28]\nFor the purposes of carrying out the provisions of the Nonadmitted and Reinsurance Reform Act of 2010, the commissioner is authorized to utilize the national insurance producer database of the National Association of Insurance Commissioners, or any other equivalent uniform national database, for the licensure of surplus lines brokers and for renewal of the licenses.\nAny person, firm, or corporation whose home state is Minnesota, that procures insurance on any property, interests, or risks of any nature other than life insurance directly from a nonadmitted insurer, must agree to file with the commissioner of revenue all returns required under chapter 297I and pay to the commissioner of revenue any amounts required to be paid under chapter 297I. Upon that agreement, the commissioner of commerce shall issue a license, good for one year. Insurance procured under the license is valid and the provisions of the policies are considered to be in accordance, and construed as if identical in effect, with the standard policy prescribed by the laws of this state. The insurers may enter the state to perform any act necessary or proper in the conduct of the business.",
	"repealed": false
}