{
	"id": "62J.811",
	"url": "https://www.revisor.mn.gov/statutes/cite/62J.811",
	"title": "62J.811 PROVIDER BALANCE BILLING REQUIREMENTS.",
	"text": "(a) Each health care provider and health facility shall comply with the federal Consolidated Appropriations Act, 2021, Division BB also known as the \"No Surprises Act,\" including any federal regulations adopted under that act.\n(b) For the purposes of this section, \"provider\" or \"facility\" means any health care provider or facility pursuant to section 62A.63, subdivision 2, or 62J.03, subdivision 8, that is subject to relevant provisions of the No Surprises Act.\n(a) The commissioner shall, to the extent practicable, seek the cooperation of health care providers and facilities, and may provide any support and assistance as available, in obtaining compliance with this section.\n(b) The commissioner shall determine the manner and processes for fulfilling any responsibilities and taking any of the actions in paragraphs (c) to (f).\n(c) A person who believes a health care provider or facility has not complied with the requirements of the No Surprises Act or this section may file a complaint with the commissioner in the manner determined by the commissioner.\n(d) The commissioner shall conduct compliance reviews and investigate complaints filed under this section in the manner determined by the commissioner to ascertain whether health care providers and facilities are complying with this section.\n(e) The commissioner may report violations under this section to other relevant federal and state departments and jurisdictions as appropriate, including the attorney general and relevant licensing boards, and may also coordinate on investigations and enforcement of this section with other relevant federal and state departments and jurisdictions as appropriate, including the attorney general and relevant licensing boards.\n(f) A health care provider or facility may contest whether the finding of facts constitute a violation of this section according to the contested case proceeding in sections 14.57 to 14.62, subject to appeal according to sections 14.63 to 14.68.\n(g) Any data collected by the commissioner as part of an active investigation or active compliance review under this section are classified (1) if the data is not on individuals, it is classified as protected nonpublic data pursuant to section 13.02 subdivision 13; or (2) if the data is on individuals, it is classified as confidential pursuant to section 13.02, subdivision 3. Data describing the final disposition of an investigative or compliance review are classified as public.\n(a) The commissioner, in monitoring and enforcing this section, may levy a civil monetary penalty against each health care provider or facility found to be in violation of up to $100 for each violation, but may not exceed $25,000 for identical violations during a calendar year.\n(b) No civil monetary penalty shall be imposed under this section for violations that occur prior to January 1, 2024.",
	"repealed": false
}