{
	"id": "114C.21",
	"url": "https://www.revisor.mn.gov/statutes/cite/114C.21",
	"title": "114C.21 DEFINITIONS.",
	"text": "As used in sections 114C.20 to 114C.28, the terms defined in this section have the meanings given.\n\"Agency\" means the Pollution Control Agency.\n\"Environmental management system\" means a documented, systematic procedure or practice that reflects the regulated entity's due diligence in preventing, detecting, and correcting violations of environmental requirements. Due diligence encompasses the regulated entity's systematic efforts, appropriate to the size and nature of its business, to prevent, detect, and correct violations of environmental requirements and must be consistent with any criteria used by the United States Environmental Protection Agency to define due diligence in federal audit policies or regulations.\n\"Environmental requirement\" means a requirement in:\n(1) a law administered by the agency, a rule adopted by the agency, a permit or order issued by the agency, an agreement entered into with the agency, or a court order issued pursuant to any of the foregoing; or\n(2) an ordinance or other legally binding requirement of a local government unit under authority granted by state law relating to environmental protection, including solid and hazardous waste management.\n\"Environmental audit\" or \"audit\" means a systematic, documented, and objective review by a regulated entity of one or more facility operations and practices related to compliance with one or more environmental requirements and, if deficiencies are found, a plan for corrective action. The regulated entity may use an evaluation form developed by the regulated entity, prepared by a consultant, or prescribed or approved by the commissioner. The final audit document must be designated as an \"audit report\" and must include the date of the final written report of findings for the audit.\n\"Commissioner\" means the commissioner of the Pollution Control Agency.\n\"Facility\" means all buildings, equipment, structures, and other stationary items that are located on a single site or on contiguous or adjacent sites and that are owned or operated by the same person.\n\"Local governmental unit\" means a county, a statutory or home rule charter city, a town, a sanitary district, or the metropolitan area.\n\"Major facility\" means an industrial or municipal wastewater discharge major facility as defined in rules of the agency; a feedlot that is permitted for 1,000 or more animal units; a large quantity hazardous waste generator as defined in rules of the agency; a hazardous waste treatment, storage, or disposal facility that is required to have a permit under the federal Resource Conservation and Recovery Act, United States Code, title 42, section 6925; or a major source as defined in Minnesota Rules, parts 7007.0100, subpart 13, and 7007.0200, subpart 2.\n[Repealed, 1999 c 158 s 15]\n\"Regulated entity\" means a public or private organization that is subject to environmental requirements.\n\"Regulated material\" means the chemicals, wastes, or substances generated or released by a facility that make the facility subject to an environmental requirement.\n[Repealed, 1999 c 158 s 15]\n\"State\" means the Pollution Control Agency, the attorney general, and all local governmental units.",
	"repealed": false
}