{
	"id": "115A.1320",
	"url": "https://www.revisor.mn.gov/statutes/cite/115A.1320",
	"title": "115A.1320 AGENCY AND DEPARTMENT DUTIES.",
	"text": "(a) The agency shall administer sections 115A.1310 to 115A.1330.\n(b) The agency shall establish procedures for:\n(1) receipt and maintenance of the registration statements and certifications filed with the agency under section 115A.1312; and\n(2) making the statements and certifications easily available to manufacturers, retailers, and members of the public.\n(c) The agency shall annually review the following variables that are used to calculate a manufacturer's annual registration fee under section 115A.1314, subdivision 1:\n(1) the obligation-setting mechanism for manufacturers as specified under paragraph (g);\n(2) the estimated per-pound price of recycling covered electronic devices sold to households; and\n(3) the base registration fee.\n(d) If the agency determines that any of these values must be changed in order to improve the efficiency or effectiveness of the activities regulated under sections 115A.1312 to 115A.1330, or if the revenues exceed the amount that the agency determines is necessary, the agency shall submit recommended changes and the reasons for them to the chairs of the senate and house of representatives committees with jurisdiction over solid waste policy.\n(e) By May 1 each year, the agency shall publish a statewide recycling goal for all video display device waste that is the weight of all video display devices collected for recycling during each of the three most recently completed program years, excluding the most recently concluded program year, divided by two.\n(f) By May 1 each year, the agency shall determine each registered manufacturer's market share of video display devices to be collected and recycled based on the manufacturer's percentage share of the total weight of video display devices sold as reported to the agency under section 115A.1316, subdivision 1.\n(g) By May 1 each year, the agency shall provide each manufacturer with a determination of the manufacturer's share of video display devices to be collected and recycled. A manufacturer's market share of video display devices as specified in paragraph (f) is applied proportionally to the statewide recycling goal as specified in paragraph (e) to determine an individual manufacturer's recycling obligation. Upon request by the commissioner of revenue, the agency must provide the information submitted to manufacturers under this paragraph to the commissioner of revenue.\n(h) The agency shall provide a report to the governor and the legislature on the implementation of sections 115A.1310 to 115A.1330. For each program year, the report must discuss the total weight of covered electronic devices recycled and a summary of information in the reports submitted by manufacturers and recyclers under section 115A.1316. The report must also discuss the various collection programs used by manufacturers to collect covered electronic devices; information regarding covered electronic devices that are being collected by persons other than registered manufacturers, collectors, and recyclers; and information about covered electronic devices, if any, being disposed of in landfills in this state. The report must examine which covered electronic devices, based on economic and environmental considerations, should be subject to the obligation-setting mechanism under paragraph (g). The report must include a description of enforcement actions under sections 115A.1310 to 115A.1330. The agency may include in its report other information received by the agency regarding the implementation of sections 115A.1312 to 115A.1330. The report must be done in conjunction with the report required under section 115A.121.\n(i) The agency shall promote public participation in the activities regulated under sections 115A.1312 to 115A.1330 through public education and outreach efforts.\n(j) The agency shall enforce sections 115A.1310 to 115A.1330 in the manner provided by sections 115.071, subdivisions 1, 3, 4, 5, and 6; and 116.072, except for those provisions enforced by the department, as provided in subdivision 2. The agency may revoke a registration of a collector or recycler found to have violated sections 115A.1310 to 115A.1330.\n(k) The agency shall facilitate communication between counties, collection and recycling centers, and manufacturers to ensure that manufacturers are aware of video display devices available for recycling.\n(l) The agency shall post on its website the contact information provided by each manufacturer under section 115A.1318, subdivision 1, paragraph (e).\n(a) The agency must collect the data submitted to it annually by each manufacturer on the total weight of each specific model of video display device sold to households, if provided; the total weight of video display devices sold to households; the total weight of covered electronic devices collected from households that are recycled; and data on phase I and phase II recycling credits, as required under section 115A.1316. The department must use this data to review each manufacturer's annual registration fee submitted to the department to ensure that the fee was calculated accurately.\n(b) The agency must estimate, for each registered manufacturer, the sales of video display devices to households during the previous program year, based on:\n(1) data provided by a manufacturer on sales of video display devices to households, including documentation describing how that amount was calculated and certification that the amount is accurate; or\n(2) if a manufacturer does not provide the data specified in clause (1), national data on sales of video display devices.\nThe department must use the data specified in this subdivision to review each manufacturer's annual registration fee submitted to the department to ensure that the fee was calculated accurately according to the formula in section 115A.1314, subdivision 1.\n(c) The department must enforce section 115A.1314, subdivision 1. The audit, assessment, appeal, collection, enforcement, disclosure, and other administrative provisions of chapters 270B, 270C, and 289A that apply to the taxes imposed under chapter 297A apply to the fee imposed under section 115A.1314, subdivision 1. To enforce section 115A.1314, subdivision 1, the commissioner of revenue may grant extensions to pay, and impose and abate penalties and interest on, the fee due under section 115A.1314, subdivision 1, in the manner provided in chapters 270C and 289A as if the fee were a tax imposed under chapter 297A.\n(d) The department may disclose nonpublic data to the agency only when necessary for the efficient and effective administration of the activities regulated under sections 115A.1310 to 115A.1330. Any data disclosed by the department to the agency retains the classification it had when in the possession of the department.",
	"repealed": false
}