{
	"id": "477A.03",
	"url": "https://www.revisor.mn.gov/statutes/cite/477A.03",
	"title": "477A.03 APPROPRIATION.",
	"text": "MS 1994 [Repealed, 1994 c 587 art 3 s 21]\nMS 1983 Supp [Repealed, 1984 c 502 art 4 s 8]\nA sum sufficient to discharge the duties imposed by sections 477A.011 to 477A.014 is annually appropriated from the general fund to the commissioner of revenue.\nFor aids payable in 2021 through 2023, the total aid payable under section 477A.013, subdivision 9, is $564,398,012. For aids payable in 2024 and thereafter, the total aid payable under section 477A.013, subdivision 9, is $644,398,012.\n(a) For aids payable in 2021 through 2023, the total aid payable under section 477A.0124, subdivision 3, is $118,795,000, of which $3,000,000 shall be allocated as required under Laws 2014, chapter 150, article 4, section 6. For aids payable in 2024, the total aid payable under section 477A.0124, subdivision 3, is $154,197,053, of which $3,000,000 shall be allocated as required under Laws 2014, chapter 150, article 4, section 6. For aids payable in 2025 and thereafter, the total aid payable under section 477A.0124, subdivision 3, is $151,197,053. On or before the first installment date provided in section 477A.015, paragraph (a), $500,000 of this appropriation shall be transferred each year by the commissioner of revenue to the Board of Public Defense for the payment of services under section 611.27. Any transferred amounts not expended or encumbered in a fiscal year shall be certified by the Board of Public Defense to the commissioner of revenue on or before October 1 and shall be included in the next certification of county need aid.\n(b) For aids payable in 2021 through 2023, the total aid under section 477A.0124, subdivision 4, is $145,873,444. For aids payable in 2024 and thereafter, the total aid under section 477A.0124, subdivision 4, is $190,471,391. The commissioner of revenue shall transfer to the Legislative Budget Office $207,000 annually for the cost of preparation of local impact notes as required by section 3.987, and other local government activities. The commissioner of revenue shall transfer to the commissioner of education $7,000 annually for the cost of preparation of local impact notes for school districts as required by section 3.987. The commissioner of revenue shall deduct the amounts transferred under this paragraph from the appropriation under this paragraph. The amounts transferred are appropriated to the Legislative Coordinating Commission and the commissioner of education respectively.\nFor aids payable in 2015 and thereafter, the total aids paid under section 477A.013, subdivision 1, is limited to $10,000,000.\nMS 2002 [Repealed, 1Sp2003 c 21 art 5 s 14; art 6 s 17]\nMS 2002 [Repealed, 1Sp2003 c 21 art 5 s 14]\nMS 2009 Supp [Repealed, 2010 c 215 art 13 s 10]",
	"repealed": false
}