{
	"id": "136A.233",
	"url": "https://www.revisor.mn.gov/statutes/cite/136A.233",
	"title": "136A.233 WORK-STUDY GRANTS.",
	"text": "The office shall allocate work-study money to eligible postsecondary institutions according to the resident full-time equivalent enrollment of all eligible postsecondary institutions that apply to participate in the program, and the amount of the allocation that an institution spent during the previous academic year. Each institution wishing to participate in the work-study program must submit, in accordance with policies and procedures established by the office, an estimate of the amount of funds needed by the institution. Any funds allocated to an institution that exceed the actual need of the institution shall be reallocated by the office to other institutions. An institution may carry forward or backward the same percentage of its initial allocation that is authorized under federal work-study provisions.\nFor purposes of sections 136A.231 to 136A.233, the words defined in this subdivision have the meanings ascribed to them.\n(a) \"Eligible student\" means a Minnesota resident enrolled or intending to enroll at least half time in a degree, diploma, or certificate program in a Minnesota postsecondary institution.\n(b) \"Minnesota resident\" means a student who meets the conditions in section 136A.101, subdivision 8.\n(c) \"Financial need\" means the need for financial assistance in order to attend a postsecondary institution as determined by a postsecondary institution according to guidelines established by the office.\n(d) \"Eligible employer\" means any eligible postsecondary institution, any nonprofit, nonsectarian agency or state institution located in the state of Minnesota, a disabled person or a person over 65 who employs a student to provide personal services in or about the person's residence, or a private, for-profit employer employing a student as an intern in a position directly related to the student's field of study that will enhance the student's knowledge and skills in that field.\n(e) \"Eligible postsecondary institution\" means any postsecondary institution eligible for participation in the Minnesota state grant program as specified in section 136A.101, subdivision 4.\n(f) \"Independent student\" has the meaning given under title IV of the Higher Education Act of 1965, as amended, and applicable regulations.\n(g) \"Half time\" for undergraduates has the meaning given in section 136A.101, subdivision 7b, and for graduate students is defined by the institution.\nWork-study payments shall be made to eligible students by postsecondary institutions as provided in this subdivision.\n(a) Students shall be selected for participation in the program by the postsecondary institution on the basis of student financial need.\n(b) In selecting students for participation, priority must be given to students enrolled for at least 12 credits. In each academic year, a student may be awarded work-study payments for one period of nonenrollment or less than half-time enrollment if the student will enroll on at least a half-time basis during the following academic term.\n(c) Students will be paid for hours actually worked and the maximum hourly rate of pay shall not exceed the maximum hourly rate of pay permitted under the federal college work-study program.\n(d) Minimum pay rates will be determined by an applicable federal or state law.\n(e) The office shall annually establish a minimum percentage rate of student compensation to be paid by an eligible employer.\n(f) Each postsecondary institution receiving money for state work-study grants shall make a reasonable effort to place work-study students in employment with eligible employers outside the institution. However, a public employer other than the institution may not terminate, lay off, or reduce the working hours of a permanent employee for the purpose of hiring a work-study student, or replace a permanent employee who is on layoff from the same or substantially the same job by hiring a work-study student.\n(g) The percent of the institution's work-study allocation provided to graduate students shall not exceed the percent of graduate student enrollment at the participating institution.\n(h) An institution may use up to 30 percent of its allocation for student internships with private, for-profit employers.\nEach campus using the state work study program is encouraged to cooperate with its local public elementary and secondary schools to place college work study students in activities in the schools, such as tutoring. Students must be placed in meaningful activities that directly assist students in kindergarten through grade 12 in meeting graduation standards. College students shall work under direct supervision; therefore, school hiring authorities are not required to request criminal background checks on these students under section 123B.03.",
	"repealed": false
}