{
	"id": "400.08",
	"url": "https://www.revisor.mn.gov/statutes/cite/400.08",
	"title": "400.08 SERVICE AREAS AND CHARGES.",
	"text": "For purposes of this section, \"solid waste management services\" includes recycling and waste reduction services, collection, processing, and disposal of solid waste, closure and postclosure care of a solid waste facility, and response, as defined in section 115B.02, to releases from a solid waste facility or closed solid waste facility.\nIn addition to the power that the county may exercise under other law, and in order to provide solid waste management services to those areas needing services, the county board by resolution may establish and determine the boundaries of solid waste management service areas in the county. Before the adoption of the resolution the county board shall hold a public hearing on the question. If a service area is established, the county board may impose service charges for solid waste management services for the area and may levy a tax on all the property in the area, or any combination of charges and taxes. The county board may enlarge any existing service area following the procedures specified in this section. Upon the petition of the landowner, land may be added to the service area without a public hearing on the enlargement.\nThe county may establish by ordinance, revise when deemed advisable, and collect just and reasonable rates and charges for solid waste management services provided by the county or by others under contract with the county. The ordinance may obligate the owners, lessees, or occupants of property, or any or all of them, to pay charges for solid waste management services to their properties, including properties owned, leased, or used by the state or a political subdivision of the state, the Metropolitan Airports Commission established in section 473.603, the State Agricultural Society established in section 37.01, a local government unit, and any other political subdivision, and may obligate the user of any facility to pay a reasonable charge for the use of the facility. Rates and charges may take into account the character, kind, and quality of the service and of the solid waste, the method of disposition, the number of people served at each place of collection, and all other factors that enter into the cost of the service, including but not limited to depreciation and payment of principal and interest on money borrowed by the county for the acquisition or betterment of facilities. A notice of intention to enact an ordinance, published pursuant to section 375.51, subdivision 2, shall provide for a public hearing prior to the meeting at which the ordinance is to be considered.\n(a) The rates and charges may be billed and collected in a manner the board shall determine.\n(b) On or before October 15 in each year, the county board may certify to the county auditor all unpaid outstanding charges, and a description of the lands against which the charges arose. It shall be the duty of the county auditor, upon order of the county board, to extend the assessments, with interest not to exceed the interest rate provided for in section 279.03, subdivision 1, upon the tax rolls of the county for the taxes of the year in which the assessment is filed. For each year ending October 15 the assessment with interest shall be carried into the tax becoming due and payable in January of the following year, and shall be enforced and collected in the manner provided for the enforcement and collection of real property taxes in accordance with the provisions of the laws of the state. The charges, if not paid, shall become delinquent and be subject to the same penalties and the same rate of interest as the taxes under the general laws of the state.\n(c) In addition to any other manner of collection that may be established under paragraph (a), a county may:\n(1) require as a condition of a license issued under section 115A.93 that the licensee collect service charges established under subdivision 3 from solid waste generators for remittal to the county; and\n(2) audit a licensed collector's records of the charges collected under clause (1) and the amount of waste collected only to the extent necessary to ensure that all charges required to be collected are remitted to the county.\nData received under clause (2) are private or nonpublic data as defined in section 13.02, subdivision 9 or 12.\nA county may:\n(1) charge or may require any person who collects solid waste in the county to charge solid waste generators rates for solid waste management services that increase as the weight or volume of waste increases;\n(2) require collectors to provide financial incentives to solid waste generators who separate recyclable materials from their waste; or\n(3) require use of any other mechanism to provide encouragement or rewards to solid waste generators who reduce their waste generation or who separate recyclable materials from their waste.",
	"repealed": false
}