{
	"id": "62Q.69",
	"url": "https://www.revisor.mn.gov/statutes/cite/62Q.69",
	"title": "62Q.69 COMPLAINT RESOLUTION.",
	"text": "Each health plan company must establish and maintain an internal complaint resolution process that meets the requirements of this section to provide for the resolution of a complaint initiated by a complainant.\n(a) A complainant may submit a complaint to a health plan company either by telephone or in writing. If a complaint is submitted orally and the resolution of the complaint, as determined by the complainant, is partially or wholly adverse to the complainant, or the oral complaint is not resolved to the satisfaction of the complainant, by the health plan company within ten days of receiving the complaint, the health plan company must inform the complainant that the complaint may be submitted in writing. The health plan company must also offer to provide the complainant with any assistance needed to submit a written complaint, including an offer to complete the complaint form for a complaint that was previously submitted orally and promptly mail the completed form to the complainant for the complainant's signature. At the complainant's request, the health plan company must provide the assistance requested by the complainant. The complaint form must include the following information:\n(1) the telephone number of the health plan company member services or other departments or persons equipped to advise complainants on complaint resolution;\n(2) the address to which the form must be sent;\n(3) a description of the health plan company's internal complaint procedure and the applicable time limits; and\n(4) the toll-free telephone number of either the commissioner of health or commerce and notification that the complainant has the right to submit the complaint at any time to the appropriate commissioner for investigation.\n(b) Upon receipt of a written complaint, the health plan company must notify the complainant within ten business days that the complaint was received, unless the complaint is resolved to the satisfaction of the complainant within the ten business days.\n(c) Each health plan company must provide, in the member handbook, subscriber contract, or certification of coverage, a clear and concise description of how to submit a complaint and a statement that, upon request, assistance in submitting a written complaint is available from the health plan company.\n(a) The health plan company must notify the complainant in writing of its decision and the reasons for it as soon as practical but in no case later than 30 days after receipt of a written complaint. If the health plan company cannot make a decision within 30 days due to circumstances outside the control of the health plan company, the health plan company may take up to 14 additional days to notify the complainant of its decision. If the health plan company takes any additional days beyond the initial 30-day period to make its decision, it must inform the complainant, in advance, of the extension and the reasons for the extension.\n(b) For group health plans, if the decision is partially or wholly adverse to the complainant, the notification must inform the complainant of the right to appeal the decision to the health plan company's internal appeal process described in section 62Q.70 and the procedure for initiating an appeal.\n(c) For individual health plans, if the decision is partially or wholly adverse to the complainant, the notification must inform the complainant of the right to submit the complaint decision to the external review process described in section 62Q.73 and the procedure for initiating the external review process. Notwithstanding the provisions in this subdivision, a health plan company offering individual coverage may instead follow the process for group health plans outlined in paragraph (b).\n(d) The notification must also inform the complainant of the right to submit the complaint at any time to either the commissioner of health or commerce for investigation and the toll-free telephone number of the appropriate commissioner.",
	"repealed": false
}