{
	"id": "609.229",
	"url": "https://www.revisor.mn.gov/statutes/cite/609.229",
	"title": "609.229 CRIME COMMITTED FOR BENEFIT OF GANG.",
	"text": "As used in this section, \"criminal gang\" means any ongoing organization, association, or group of three or more persons, whether formal or informal, that:\n(1) has, as one of its primary activities, the commission of one or more of the offenses listed in section 609.11, subdivision 9;\n(2) has a common name or common identifying sign or symbol; and\n(3) includes members who individually or collectively engage in or have engaged in a pattern of criminal activity.\nA person who commits a crime for the benefit of, at the direction of, in association with, or motivated by involvement with a criminal gang, with the intent to promote, further, or assist in criminal conduct by gang members is guilty of a crime and may be sentenced as provided in subdivision 3.\n(a) If the crime committed in violation of subdivision 2 is a felony, the statutory maximum for the crime is five years longer than the statutory maximum for the underlying crime. If the crime committed in violation of subdivision 2 is a felony, and the victim of the crime is a child under the age of 18 years, the statutory maximum for the crime is ten years longer than the statutory maximum for the underlying crime.\n(b) If the crime committed in violation of subdivision 2 is a misdemeanor, the person is guilty of a gross misdemeanor.\n(c) If the crime committed in violation of subdivision 2 is a gross misdemeanor, the person is guilty of a felony and may be sentenced to imprisonment for not more than three years or to payment of a fine of not more than $15,000, or both.\n(a) Unless a longer mandatory minimum sentence is otherwise required by law, or the court imposes a longer aggravated durational departure, or a longer prison sentence is presumed under the Sentencing Guidelines and imposed by the court, a person convicted of a crime described in subdivision 3, paragraph (a), shall be committed to the custody of the commissioner of corrections for not less than one year plus one day.\n(b) Any person convicted and sentenced as required by paragraph (a) is not eligible for probation, parole, discharge, work release, or supervised release until that person has served the full term of imprisonment as provided by law, notwithstanding the provisions of sections 242.19, 243.05, 244.04, 609.12, and 609.135.",
	"repealed": false
}