{
	"id": "571.71",
	"url": "https://www.revisor.mn.gov/statutes/cite/571.71",
	"title": "571.71 GARNISHMENT; WHEN AUTHORIZED.",
	"text": "As an ancillary proceeding to a civil action for the recovery of money, a creditor may issue a garnishment summons as provided in this chapter against any third party in the following instances:\n(1) at the time the civil action is commenced or at any time after the commencement of the civil action, but before the entry of a judgment, if the court orders the issuance of the garnishment summons pursuant to section 571.93;\n(2) at any time 45 days or more after service of the summons and complaint upon the debtor in the civil action when a judgment by default could have, but has not, been entered pursuant to Rule 55.01(a) of the Minnesota Rules of Civil Procedure for the District Courts. Garnishment under this clause is effective only after the Notice of Intent to Garnish form in section 571.72, subdivision 11, and the Exemption form in section 571.72, subdivision 10, are served on the debtor at any time 20 or more days after the service of the Summons and Complaint and, in addition, the creditor does not receive an Answer from the debtor within 25 days after service of the Notice of Intent to Garnish. The Notice of Intent to Garnish form and the Exemption form must be substantially in the form set forth in section 571.72, subdivisions 10 and 11. If a creditor sends a Notice of Intent to Garnish form to a debtor under this clause, the creditor cannot obtain a default judgment against the debtor under Rule 55.01(a) of the Minnesota Rules of Civil Procedure for the District Courts until 25 days after the service of the Notice of Intent to Garnish form. No filing of a pleading or other documents by the creditor is required to issue a garnishment summons under this clause; however, the creditor must comply with the service requirement of section 571.72, subdivision 4; or\n(3) at any time after entry of a money judgment in the civil action.",
	"repealed": false
}