{
	"id": "394.22",
	"url": "https://www.revisor.mn.gov/statutes/cite/394.22",
	"title": "394.22 DEFINITIONS.",
	"text": "The words or terms as used in sections 394.21 to 394.37 have the meanings given them in these sections unless a different meaning is clearly indicated by the context.\n\"Airport safety zone\" means an area subject to land use zoning controls adopted under sections 360.061 to 360.074 if the zoning controls regulate (1) the size or location of buildings, or (2) the density of population.\n\"Board\" means the board of county commissioners.\n\"Governing body\" means a town board of supervisors, the council of a municipality, or board of county commissioners.\n\"Municipality\" means a city however organized.\nMS 1971 [Repealed, 1974 c 571 s 51]\n\"Official control\" means legislatively defined and enacted policies, standards, precise detailed maps, and other criteria, all of which control the physical development of a municipality or a county or any part thereof or any detail thereof, and are the means of translating into ordinances all or any part of the general objectives of the comprehensive plan. Such official controls may include but are not limited to ordinances establishing zoning, subdivision controls, site plan rules, sanitary codes, building codes, housing codes, and official maps.\n\"Conditional use\" means a land use or development as defined by ordinance that would not be appropriate generally but may be allowed with appropriate restrictions as provided by official controls upon a finding that (1) certain conditions as detailed in the zoning ordinance exist, and (2) the use or development conforms to the comprehensive land use plan of the county and (3) is compatible with the existing neighborhood.\n\"Nonconformity\" means any legal use, structure or parcel of land already in existence, recorded, or authorized before the adoption of official controls or amendments thereto that would not have been permitted to become established under the terms of the official controls as now written, if the official controls had been in effect prior to the date it was established, recorded or authorized.\n\"Comprehensive plan\" means the policies, statements, goals, and interrelated plans for private and public land and water use, transportation, and community facilities including recommendations for plan execution, documented in texts, ordinances and maps which constitute the guide for the future development of the county or any portion of the county.\n\"Variance\" means any modification or variation of official controls where it is determined that, by reason of exceptional circumstances, the strict enforcement of the official controls would cause unnecessary hardship.\n\"Town\" means any town, including those with the powers of a statutory city pursuant to law.\n\"Official map\" means a map adopted in accordance with section 394.361, which may show existing county roads and county state-aid highways, proposed future county roads and highways, the area needed for widening existing county roads and highways, and existing and future state trunk highway rights-of-way. An official map may also show the location of existing public land and facilities and other land needed for future public purposes, including public facilities such as parks, playgrounds, schools, and other public buildings, civic centers, airports, and travel service facilities. When requested in accordance with section 394.32, subdivision 3, an official map may include existing and planned public land uses within incorporated areas.",
	"repealed": false
}