{
	"id": "65B.84",
	"url": "https://www.revisor.mn.gov/statutes/cite/65B.84",
	"title": "65B.84 AUTOMOBILE THEFT PREVENTION PROGRAM.",
	"text": "(a) The commissioner of commerce shall:\n(1) develop and sponsor the implementation of statewide plans, programs, and strategies to combat automobile theft, improve the administration of the automobile theft laws, and provide a forum for identification of critical problems for those persons dealing with automobile theft;\n(2) coordinate the development, adoption, and implementation of plans, programs, and strategies relating to interagency and intergovernmental cooperation with respect to automobile theft enforcement;\n(3) annually audit the plans and programs that have been funded in whole or in part to evaluate the effectiveness of the plans and programs and withdraw funding should the commissioner determine that a plan or program is ineffective or is no longer in need of further financial support from the fund;\n(4) develop a plan of operation including:\n(i) an assessment of the scope of the problem of automobile theft, including areas of the state where the problem is greatest;\n(ii) an analysis of various methods of combating the problem of automobile theft;\n(iii) a plan for providing financial support to combat automobile theft;\n(iv) a plan for eliminating car hijacking; and\n(v) an estimate of the funds required to implement the plan; and\n(5) distribute money, in consultation with the commissioner of public safety, pursuant to subdivision 3 from the automobile theft prevention special revenue account for automobile theft prevention activities, including:\n(i) paying the administrative costs of the program;\n(ii) providing financial support to the State Patrol and local law enforcement agencies for automobile theft enforcement teams;\n(iii) providing financial support to state or local law enforcement agencies for programs designed to reduce the incidence of automobile theft and for improved equipment and techniques for responding to automobile thefts;\n(iv) providing financial support to local prosecutors for programs designed to reduce the incidence of automobile theft;\n(v) providing financial support to judicial agencies for programs designed to reduce the incidence of automobile theft;\n(vi) providing financial support for neighborhood or community organizations or business organizations for programs designed to reduce the incidence of automobile theft and to educate people about the common methods of automobile theft, the models of automobiles most likely to be stolen, and the times and places automobile theft is most likely to occur; and\n(vii) providing financial support for automobile theft educational and training programs for state and local law enforcement officials, driver and vehicle services exam and inspections staff, and members of the judiciary.\n(b) The commissioner may not spend in any fiscal year more than ten percent of the money in the fund for the program's administrative and operating costs. The commissioner is annually appropriated and must distribute the amount of the proceeds credited to the automobile theft prevention special revenue account each year, less the transfer of $1,300,000 each year to the insurance fraud prevention account described in section 297I.11, subdivision 2.\n(c) At the end of each fiscal year, the commissioner may transfer any unobligated balances in the auto theft prevention account to the insurance fraud prevention account under section 45.0135, subdivision 6.\n(d) The commissioner must establish a library of equipment to combat automobile-related theft offenses. The equipment must be available to all law enforcement agencies upon request to support law enforcement agency efforts to combat automobile theft.\nBy September 30 each year, the commissioner shall report to the governor and the chairs and ranking minority members of the house of representatives and senate committees having jurisdiction over the Departments of Commerce and Public Safety on the activities and expenditures in the preceding year.\n(a) A county attorney's office, law enforcement agency, neighborhood organization, community organization, or business organization may apply for a grant under this section. Multiple offices or agencies within a county may apply for a grant under this section.\n(b) The commissioner, in consultation with the commissioner of public safety, must develop criteria for the fair distribution of grants from the automobile theft prevention account that address the following factors:\n(1) the number of reported automobile thefts per capita in a city, county, or region, not merely the total number of automobile thefts;\n(2) the population of the jurisdiction of the applicant office or agency;\n(3) the total funds distributed within a county or region; and\n(4) the statewide interest in automobile theft reduction.\n(c) The commissioner may give priority to:\n(1) offices and agencies engaged in a collaborative effort to reduce automobile theft; and\n(2) counties or regions with the greatest rates of automobile theft.\n(d) The minimum amount of a grant award is $5,000. After considering the automobile theft rate and total population of an applicant's jurisdiction, if a grant award, as determined under the criteria and priorities in this subdivision, would be less than $5,000, it must not be awarded.\nAn Automobile Theft Prevention Advisory Board is established to advise the commissioner on the distribution of grants under this section. The board must consist of seven members appointed by the commissioner and must include representatives of law enforcement, prosecuting agencies, automobile insurers, and the public. The commissioner must annually select a chair from among its members.\nFor purposes of this section, \"automobile theft\" includes automobile-related theft.",
	"repealed": false
}