{
	"id": "473.255",
	"url": "https://www.revisor.mn.gov/statutes/cite/473.255",
	"title": "473.255 INCLUSIONARY HOUSING ACCOUNT.",
	"text": "(a) \"Inclusionary housing development\" means a new construction development, including owner-occupied or rental housing, or a combination of both, with a variety of prices and designs which serve families with a range of incomes and housing needs.\n(b) \"Municipality\" means a statutory or home rule charter city or town participating in the local housing incentives program under section 473.254.\n(c) \"Development authority\" means a housing and redevelopment authority, economic development authority, or port authority.\nThe Metropolitan Council must give preference to economically viable proposals to the degree that they: (1) use innovative building techniques or materials to lower construction costs while maintaining high quality construction and livability; (2) are located in communities that have demonstrated a willingness to waive local restrictions which otherwise would increase costs of construction; and (3) include units affordable to households with incomes at or below 80 percent of area median income.\nPriority shall be given to proposals where at least 15 percent of the owner-occupied units are affordable to households at or below 60 percent of the area annual median income and at least ten percent of the rental units are affordable to households at or below 30 percent of area annual median income.\nAn inclusionary housing development may include resale limitations on its affordable units. The limitations may include a minimum ownership period before a purchaser may profit on the sale of an affordable unit.\nCost savings from regulatory incentives must be reflected in the sale of all residences in an inclusionary development.\nThe Metropolitan Council may work with municipalities and developers to provide incentives to inclusionary housing developments such as waiver of service availability charges and other regulatory incentives that would result in identifiable cost avoidance or reductions for an inclusionary housing development.\nThe council shall use funds in the inclusionary housing account to make grants or loans to municipalities or development authorities to fund the production of inclusionary housing developments that are located in municipalities that offer incentives to assist in the production of inclusionary housing. Such incentives include but are not limited to: density bonuses, reduced setbacks and parking requirements, decreased road widths, flexibility in site development standards and zoning code requirements, waiver of permit or impact fees, fast-track permitting and approvals, or any other regulatory incentives that would result in identifiable cost avoidance or reductions that contribute to the economic feasibility of inclusionary housing.\nA grant application must at a minimum include the location of the inclusionary development, the type of housing to be produced, the number of affordable units to be produced, the monthly rent, or purchase price of the affordable units, and the incentives provided by the municipality to achieve development of the affordable units.",
	"repealed": false
}