{
	"id": "609.50",
	"url": "https://www.revisor.mn.gov/statutes/cite/609.50",
	"title": "609.50 OBSTRUCTING LEGAL PROCESS, ARREST, OR FIREFIGHTING.",
	"text": "Whoever intentionally does any of the following may be sentenced as provided in subdivision 2:\n(1) obstructs, hinders, or prevents the lawful execution of any legal process, civil or criminal, or apprehension of another on a charge or conviction of a criminal offense;\n(2) obstructs, resists, or interferes with a peace officer while the officer is engaged in the performance of official duties;\n(3) interferes with or obstructs a firefighter while the firefighter is engaged in the performance of official duties;\n(4) interferes with or obstructs a member of an ambulance service personnel crew, as defined in section 144E.001, subdivision 3a, who is providing, or attempting to provide, emergency care; or\n(5) by force or threat of force endeavors to obstruct any employee of the Department of Revenue, Department of Public Safety Driver and Vehicle Services Division, a driver's license agent appointed under section 171.061, or a deputy registrar appointed under section 168.33 while the employee is lawfully engaged in the performance of official duties for the purpose of deterring or interfering with the performance of those duties.\nA person convicted of violating subdivision 1 may be sentenced as follows:\n(1) if (i) the person knew or had reason to know that the act created a risk of death, substantial bodily harm, or serious property damage; or (ii) the act caused death, substantial bodily harm, or serious property damage; to imprisonment for not more than five years or to payment of a fine of not more than $10,000, or both;\n(2) if the act was accompanied by force or violence or the threat thereof, and is not otherwise covered by clause (1), to imprisonment for not more than 364 days or to payment of a fine of not more than $3,000, or both; or\n(3) in other cases, to imprisonment for not more than 90 days or to payment of a fine of not more than $1,000, or both.",
	"repealed": false
}