{
	"id": "353.6511",
	"url": "https://www.revisor.mn.gov/statutes/cite/353.6511",
	"title": "353.6511 ALTERNATIVE RETIREMENT BENEFIT COVERAGE IN CERTAIN INSTANCES.",
	"text": "The alternative benefit coverage under this section applies only to an active member of the public employees police and fire retirement plan who was an active member of the former Minneapolis Firefighters Relief Association on December 29, 2011, and who retires after December 30, 2011.\n(a) A member described in subdivision 1, if the member meets the eligibility requirements of paragraph (b), is only entitled to a retirement annuity under this subdivision.\n(b) The member, upon application, if the person is at least age 50 and has credit for at least 20 years of allowable service, is entitled to a normal retirement annuity. The normal retirement annuity is the following amount based on the service credit of the retiring member as a Minneapolis firefighter:\n(c) For a retired member who was unmarried on September 1, 1997, and also on October 25, 2001, who had 25 years of service credit as of October 25, 2001, and submitted a valid application for the alternative service pension under Minnesota Statutes 2010, section 423C.05, subdivision 9, the retirement annuity amount is 43.3 units.\nA member described in subdivision 1, if the member is disabled under section 353.01, subdivision 41 or 46, is entitled to a disability benefit equal to 41 units.\nA surviving spouse under section 353.01, subdivision 20, of a deceased member described in subdivision 1 is entitled to a surviving spouse benefit equal to 23 units.\nA surviving dependent child under section 353.01, subdivision 15, of a deceased member described in subdivision 1 is entitled to a surviving child benefit equal to eight units.\nThe surviving spouse and surviving dependent child under subdivisions 4 and 5 are entitled to a combined family benefit under subdivisions 4 and 5 of 43 units.\nEffective January 1, 2012, service pensions and survivor benefits in force are entitled to be recomputed with the number of units specified in subdivision 2, subdivision 4, and subdivision 6. Optional annuities under Minnesota Statutes 2010, section 423C.05, subdivision 8, also are entitled to be recomputed as the actuarial equivalent of the service pensions and survivor benefits with the number of units specified in subdivision 2, subdivision 4, and subdivision 6. Retirement annuities, service pensions, disability benefits, and survivor benefits after December 31, 2015, are eligible for postretirement adjustments under section 356.415, subdivision 1c. The unit value for the calculation of a retirement annuity first payable after December 31, 2015, is the calendar year 2015 unit value, plus any annual postretirement adjustment percentage amount payable after December 31, 2015, under section 356.415, subdivision 1c, paragraph (a), clause (1).\nIn the event of any dispute by or on behalf of any former member of the consolidating relief association after the effective date of consolidation over the amount of a benefit to which the person may be entitled, the proper interpretation of a provision of Laws 2011, First Special Session chapter 8, article 6, or the conformity of the provisions of Laws 2011, First Special Session chapter 8, article 6, to the provisions of the benefit plan of the consolidating relief association in effect immediately before the date of the consolidation, the dispute shall be submitted in writing to the Legislative Commission on Pensions and Retirement by the person who is a party to the dispute, by the fraternal organization related to the former relief association, or by the executive director of the Public Employees Retirement Association. The Legislative Commission on Pensions and Retirement shall review the dispute as part of its deliberations on proposed or pending retirement legislation and shall make its recommendation on the resolution of the dispute, if any, to the appropriate committees of the senate and house of representatives with jurisdiction over public employee pension matters in the form of the necessary legislation amending the provisions of Laws 2011, First Special Session chapter 8, article 6, which proposed legislation must include retroactivity of any increase in a benefit amount to the date on which the benefit subject to dispute accrued or would have accrued.",
	"repealed": false
}