{
	"id": "115A.24",
	"url": "https://www.revisor.mn.gov/statutes/cite/115A.24",
	"title": "115A.24 STABILIZATION AND CONTAINMENT FACILITIES; ESTIMATE OF NEED; ANALYSIS OF ECONOMIC FEASIBILITY.",
	"text": "(a) The agency shall develop an estimate of the number, types, capacity, and function or use of any hazardous waste stabilization and containment facilities needed in the state.\n(b) In developing its estimate the agency shall:\n(1) prepare a preliminary estimate of the types and quantities of waste generated in the state for which stabilization and containment will be needed through the year 2000 based to the extent practical on data obtained from generators who are likely to use the facility;\n(2) estimate the disposal capacity located outside of the state, taking into account the status of facility permits, current and planned capacity, and prospective restrictions on expansion of capacity;\n(3) estimate the prospects for the continued availability of capacity outside of the state for disposal of waste generated in the state;\n(4) estimate the types and quantities of waste likely to be generated as residuals of the commercial hazardous waste processing facilities recommended by the agency for development in the state and for which stabilization and containment will be needed, taking into account the likely users of the facilities; and\n(5) compare the indirect costs and benefits of developing stabilization and containment facilities in the state or relying on facilities outside the state to dispose of hazardous waste generated in the state, taking into account the effects on business, employment, economic development, public health and safety, the environment, and the development of collection and processing facilities and services in the state.\n(c) In preparing the estimate, the agency may identify need for stabilization and containment only to the extent that the agency has determined that there are no feasible and prudent alternatives, including waste reduction, separation, pretreatment, processing, and resource recovery, which would minimize adverse impact upon air, water, land and all other natural resources. Economic considerations alone may not justify an estimate of need for stabilization and containment nor the rejection of alternatives. Alternatives that are speculative and conjectural are not feasible and prudent. The agency shall consider all technologies being developed in other countries as well as in the United States when it considers the alternatives to hazardous waste stabilization and containment.\n[Repealed, 1983 c 121 s 33]\nThe agency's estimate of need shall not allow the use of a facility for stabilization and containment of radioactive waste, as defined by section 116C.71, subdivision 6.\nThe agency shall prepare an economic feasibility analysis for stabilization and containment facilities of the type, capacity, and function or use estimated by the agency to be needed in the state under subdivision 1. The analysis must be specific to the sites where the facilities are proposed to be located. The analysis must include at least the following elements:\n(1) an estimate of the capital, operating, and other direct costs of the facilities and the fee schedules and user charges necessary to make the facilities economically viable;\n(2) an assessment of the other costs of using the stabilization and containment facilities, such as transportation costs and stabilization and containment surcharges;\n(3) an assessment of the market for the facility for waste generated in the state, that identifies the generators that would use the facility under existing and likely future market conditions, describes the methods otherwise available to those generators to manage their wastes and the costs of using those methods, and establishes the level at which the cost of using the proposed facilities would be competitive with the cost of using other available methods of waste management;\n(4) an estimate of the subsidy, if any, needed to make the facility competitive for Minnesota generators under existing market conditions and the changes in market conditions that would increase or lower any subsidy.",
	"repealed": false
}