{
	"id": "256.044",
	"url": "https://www.revisor.mn.gov/statutes/cite/256.044",
	"title": "256.044 HUMAN SERVICES RESPONSE CONTINGENCY ACCOUNT.",
	"text": "A human services response contingency account is created in the special revenue fund in the state treasury. Money in the human services response contingency account does not cancel and is appropriated to the commissioner of human services for the purposes specified in this section.\nFor purposes of this section, \"human services response\" means activities deemed necessary by the commissioner of human services to respond to emerging or immediate needs related to supporting the health, welfare, or safety of people.\n(a) The commissioner may make expenditures from the human services response contingency account to respond to needs as defined in subdivision 2 and for which no other funding or insufficient funding is available.\n(b) When the commissioner determines that a human services response is needed, the commissioner may make expenditures from the human services response contingency account for the following uses to implement the human services response:\n(1) services, supplies, and equipment to support the health, welfare, or safety of people;\n(2) training and coordination with service providers, Tribal Nations, and local government entities;\n(3) communication with and outreach to impacted people;\n(4) informational technology; and\n(5) staffing.\n(c) The commissioner may transfer money within the Department of Human Services and to the Department of Children, Youth, and Families for eligible uses under paragraph (b) as necessary to implement a human services response.\n(d) Notwithstanding any other law or rule to the contrary, when implementing a human services response, the commissioner may allocate funds from the human services response contingency account to programs, providers, and organizations for eligible uses under paragraph (b) through one or more fiscal agents chosen by the commissioner. In contracting with a fiscal agent, the commissioner may use a sole-source contract and is not subject to the solicitation requirements of chapter 16B or 16C.\n(e) Programs, providers, and organizations receiving funds from the human services response contingency account under paragraph (d) must describe how the money will be used. If a program, provider, or organization receiving money from the human services response contingency account receives money from a nonstate source other than a local unit of government or Tribe for the same human services response, the entity must notify the commissioner of the amount received from the nonstate source. If the commissioner determines that the total amount received under this section and from the nonstate source exceeds the entity's total costs for the human services response, the entity must pay the commissioner the amount that exceeds the costs up to the amount of funding provided to the entity under this section. All money paid to the commissioner under this paragraph must be deposited in the human services response contingency account.\n(a) As a condition of making expenditures from the human services response contingency account, the commissioner must seek any appropriate assistance from other available sources, including the federal government, to assist with costs attributable to the human services response.\n(b) If the commissioner recovers eligible costs for the human services response from a nonstate source after making expenditures from the human services response contingency account, the commissioner shall reimburse the human services response contingency account for those costs up to the amount recovered for eligible costs from the nonstate source.\nThe commissioner must develop required reporting for entities receiving human services response contingency account money. Entities receiving money from the commissioner of human services from the human services response contingency account must submit reports to the commissioner of human services with detailed information in a manner determined by the commissioner, including but not limited to:\n(1) amounts expended by category of expenditure;\n(2) outcomes achieved, including estimated individuals served;\n(3) documentation necessary to verify that funds were spent in compliance with this section;\n(4) expenditure reports for the purpose of requesting reimbursement from other available sources; and\n(5) data necessary to comply with an audit of human services response contingency account expenditures.\nBy March 1 of each year, the commissioner shall submit a report to the chairs and ranking minority members of the house of representatives and senate committees with jurisdiction over human services finance and health and human services finance detailing expenditures made in the previous calendar year from the human services response contingency account. This report is exempt from section 256.01, subdivision 42.",
	"repealed": false
}