{
	"id": "297I.85",
	"url": "https://www.revisor.mn.gov/statutes/cite/297I.85",
	"title": "297I.85 CIVIL PENALTIES.",
	"text": "If a taxpayer fails to file a return within the time prescribed, a penalty of five percent of the amount of tax or surcharge not timely paid is added to the tax or surcharge.\nIf a taxpayer fails to pay a tax or surcharge within the time specified for payment, a penalty must be added to the amount required to be shown as tax or surcharge. The penalty is five percent of the tax or surcharge not paid on or before the date specified for payment of the tax or surcharge if the failure is for not more than 30 days, with an additional penalty of five percent of the amount of tax or surcharge remaining unpaid during each additional 30 days or fraction of 30 days during which the failure continues, not exceeding 15 percent in the aggregate.\nIf a taxpayer, with intent to evade the tax or surcharge imposed by this chapter, fails to file any return required by this chapter, or with such intent files a false or fraudulent return, a penalty is imposed on the taxpayer. The penalty is equal to 50 percent of the tax or surcharge, less amounts paid by the taxpayer on the basis of the false or fraudulent return and is due for the period to which the return related.\nIf any part of an additional assessment is due to negligence or intentional disregard of the statute or a rule but without intent to defraud, there is added to the tax or surcharge a penalty equal to ten percent of the additional assessment.\nThe penalties imposed by this section must be collected and paid in the same manner as taxes.\nThe civil penalties imposed by this section are in addition to the criminal penalties imposed by this chapter.\nIn addition to other applicable penalties imposed by this section, if the commissioner notifies the taxpayer that payments are required to be made by electronic means, and the payments are made by some other means, a penalty is imposed. The amount of the penalty is equal to five percent of each payment that should have been paid electronically. After the commissioner's initial notification to the taxpayer that payments are required to be made by electronic means, the commissioner is not required to notify the taxpayer in subsequent periods if the initial notification specified the amount of tax liability at which a taxpayer is required to remit payments by electronic means. The penalty may be abated under the abatement procedures prescribed in section 270C.34, subdivision 2, if the failure to pay electronically is due to reasonable cause.",
	"repealed": false
}