{
	"id": "256B.0622",
	"url": "https://www.revisor.mn.gov/statutes/cite/256B.0622",
	"title": "256B.0622 ASSERTIVE COMMUNITY TREATMENT AND INTENSIVE RESIDENTIAL TREATMENT SERVICES.",
	"text": "(a) Subject to federal approval, medical assistance covers medically necessary, assertive community treatment when the services are provided by an entity certified under and meeting the standards in this section.\n(b) Subject to federal approval, medical assistance covers medically necessary, intensive residential treatment services when the services are provided by an entity licensed under and meeting the standards in section 245I.23.\n(c) The provider entity must make reasonable and good faith efforts to report individual client outcomes to the commissioner, using instruments and protocols approved by the commissioner.\n(a) For purposes of this section, the following terms have the meanings given them.\n(b) \"ACT team\" means the group of interdisciplinary mental health staff who work as a team to provide assertive community treatment.\n(c) \"Assertive community treatment\" means intensive nonresidential treatment and rehabilitative mental health services provided according to the assertive community treatment model. Assertive community treatment provides a single, fixed point of responsibility for treatment, rehabilitation, and support needs for clients. Services are offered 24 hours per day, seven days per week, in a community-based setting.\n(d) \"Individual treatment plan\" means a plan described by section 245I.10, subdivisions 7 and 8.\n(e) \"Crisis assessment and intervention\" means mobile crisis response services under section 256B.0624.\n(f) \"Individual treatment team\" means a minimum of three members of the ACT team who are responsible for consistently carrying out most of a client's assertive community treatment services.\n(g) \"Primary team member\" means the person who leads and coordinates the activities of the individual treatment team and is the individual treatment team member who has primary responsibility for establishing and maintaining a therapeutic relationship with the client on a continuing basis.\n(h) \"Certified rehabilitation specialist\" means a staff person who is qualified according to section 245I.04, subdivision 8.\n(i) \"Clinical trainee\" means a staff person who is qualified according to section 245I.04, subdivision 6.\n(j) \"Mental health certified peer specialist\" means a staff person who is qualified according to section 245I.04, subdivision 10.\n(k) \"Mental health practitioner\" means a staff person who is qualified according to section 245I.04, subdivision 4.\n(l) \"Mental health professional\" means a staff person who is qualified according to section 245I.04, subdivision 2.\n(m) \"Mental health rehabilitation worker\" means a staff person who is qualified according to section 245I.04, subdivision 14.\n(a) An eligible client for assertive community treatment is an individual who meets the following criteria as assessed by an ACT team:\n(1) is age 18 or older. Individuals ages 16 and 17 may be eligible upon approval by the commissioner;\n(2) has a primary diagnosis of schizophrenia, schizoaffective disorder, major depressive disorder with psychotic features, other psychotic disorders, or bipolar disorder. Individuals with other psychiatric illnesses may qualify for assertive community treatment if they have a serious mental illness and meet the criteria outlined in clauses (3) and (4), but no more than ten percent of an ACT team's clients may be eligible based on this criteria. Individuals with a primary diagnosis of a substance use disorder, intellectual developmental disabilities, borderline personality disorder, antisocial personality disorder, traumatic brain injury, or an autism spectrum disorder are not eligible for assertive community treatment;\n(3) has significant functional impairment as demonstrated by at least one of the following conditions:\n(i) significant difficulty consistently performing the range of routine tasks required for basic adult functioning in the community or persistent difficulty performing daily living tasks without significant support or assistance;\n(ii) significant difficulty maintaining employment at a self-sustaining level or significant difficulty consistently carrying out the head-of-household responsibilities; or\n(iii) significant difficulty maintaining a safe living situation;\n(4) has a need for continuous high-intensity services as evidenced by at least two of the following:\n(i) two or more psychiatric hospitalizations or residential crisis stabilization services in the previous 12 months;\n(ii) frequent utilization of mental health crisis services in the previous six months;\n(iii) 30 or more consecutive days of psychiatric hospitalization in the previous 24 months;\n(iv) intractable, persistent, or prolonged severe psychiatric symptoms;\n(v) coexisting mental health and substance use disorders lasting at least six months;\n(vi) recent history of involvement with the criminal justice system or demonstrated risk of future involvement;\n(vii) significant difficulty meeting basic survival needs;\n(viii) residing in substandard housing, experiencing homelessness, or facing imminent risk of homelessness;\n(ix) significant impairment with social and interpersonal functioning such that basic needs are in jeopardy;\n(x) coexisting mental health and physical health disorders lasting at least six months;\n(xi) residing in an inpatient or supervised community residence but clinically assessed to be able to live in a more independent living situation if intensive services are provided;\n(xii) requiring a residential placement if more intensive services are not available; or\n(xiii) difficulty effectively using traditional office-based outpatient services;\n(5) there are no indications that other available community-based services would be equally or more effective as evidenced by consistent and extensive efforts to treat the individual; and\n(6) in the written opinion of a licensed mental health professional, has the need for mental health services that cannot be met with other available community-based services, or is likely to experience a mental health crisis or require a more restrictive setting if assertive community treatment is not provided.\n(b) An individual meets the criteria for assertive community treatment under this section if they have participated within the last year or are currently participating in a first episode of psychosis program if the individual:\n(1) meets the eligibility requirements outlined in paragraph (a), clauses (1), (2), (5), and (6); and\n(2) needs the level of intensity provided by an ACT team, in the opinion of the individual's first episode of psychosis program, in order to prevent crisis services use, hospitalization, homelessness, and involvement with the criminal justice system.\n(a) A client receiving assertive community treatment is eligible to continue receiving services if:\n(1) the client has not achieved the desired outcomes of their individual treatment plan;\n(2) the client's level of functioning has not been restored, improved, or sustained over the time frame outlined in the individual treatment plan;\n(3) the client continues to be at risk for relapse based on current clinical assessment, history, or the tenuous nature of the functional gains; or\n(4) the client is functioning effectively with this service and discharge would otherwise be indicated but without continued services the client's functioning would decline; and\n(5) one of the following must also apply:\n(i) the client has achieved current individual treatment plan goals but additional goals are indicated as evidenced by documented symptoms;\n(ii) the client is making satisfactory progress toward meeting goals and there is documentation that supports that continuation of this service shall be effective in addressing the goals outlined in the individual treatment plan;\n(iii) the client is making progress, but the specific interventions in the individual treatment plan need to be modified so that greater gains, which are consistent with the client's potential level of functioning, are possible; or\n(iv) the client fails to make progress or demonstrates regression in meeting goals through the interventions outlined in the individual treatment plan.\n(b) Clients receiving assertive community treatment are eligible to be discharged if they meet at least one of the following criteria:\n(1) the client and the ACT team determine that assertive community treatment services are no longer needed based on the attainment of goals as identified in the individual treatment plan and a less intensive level of care would adequately address current goals;\n(2) the client moves out of the ACT team's service area and the ACT team has facilitated the referral to either a new ACT team or other appropriate mental health service and has assisted the individual in the transition process;\n(3) the client, or the client's legal guardian when applicable, chooses to withdraw from assertive community treatment services and documented attempts by the ACT team to re-engage the client with the service have not been successful;\n(4) the client has a demonstrated need for a medical nursing home placement lasting more than three months, as determined by a physician, advanced practice registered nurse, or physician assistant;\n(5) the client is hospitalized, in residential treatment, or in jail for a period of greater than three months. However, the ACT team must make provisions for the client to return to the ACT team upon their discharge or release from the hospital or jail if the client still meets eligibility criteria for assertive community treatment and the team is not at full capacity;\n(6) the ACT team is unable to locate, contact, and engage the client for a period of greater than three months after persistent efforts by the ACT team to locate the client; or\n(7) the client requests a discharge, despite repeated and proactive efforts by the ACT team to engage the client in service planning. The ACT team must develop a transition plan to arrange for alternate treatment for clients in this situation who have a history of suicide attempts, assault, or forensic involvement.\n(c) For all clients who are discharged from assertive community treatment to another service provider within the ACT team's service area there is a three-month transfer period, from the date of discharge, during which a client who does not adjust well to the new service, may voluntarily return to the ACT team. During this period, the ACT team must maintain contact with the client's new service provider.\nMS 2020 [Repealed, 2021 c 30 art 17 s 113]\n(a) The assertive community treatment provider must have each ACT team be certified by the state following the certification process and procedures developed by the commissioner. The certification process determines whether the ACT team meets the standards for assertive community treatment under this section, the standards in chapter 245I as required in section 245I.011, subdivision 5, and minimum program fidelity standards as measured by a nationally recognized fidelity tool approved by the commissioner. Recertification must occur at least every three years.\n(b) An ACT team certified under this subdivision must meet the following standards:\n(1) have capacity to recruit, hire, manage, and train required ACT team members;\n(2) have adequate administrative ability to ensure availability of services;\n(3) ensure flexibility in service delivery to respond to the changing and intermittent care needs of a client as identified by the client and the individual treatment plan;\n(4) keep all necessary records required by law;\n(5) be an enrolled Medicaid provider; and\n(6) establish and maintain a quality assurance plan to determine specific service outcomes and the client's satisfaction with services.\n(c) The commissioner may intervene at any time and decertify an ACT team with cause. The commissioner shall establish a process for decertification of an ACT team and shall require corrective action, medical assistance repayment, or decertification of an ACT team that no longer meets the requirements in this section or that fails to meet the clinical quality standards or administrative standards provided by the commissioner in the application and certification process. The decertification is subject to appeal to the state.\n(a) The commissioner shall develop procedures for counties and providers to submit other documentation as needed to allow the commissioner to determine whether the standards in this section are met.\n(b) A provider entity must specify in the provider entity's application what geographic area and populations will be served by the proposed program. A provider entity must document that the capacity or program specialties of existing programs are not sufficient to meet the service needs of the target population. A provider entity must submit evidence of ongoing relationships with other providers and levels of care to facilitate referrals to and from the proposed program.\n(c) A provider entity must submit documentation that the provider entity requested a statement of need from each county board and tribal authority that serves as a local mental health authority in the proposed service area. The statement of need must specify if the local mental health authority supports or does not support the need for the proposed program and the basis for this determination. If a local mental health authority does not respond within 60 days of the receipt of the request, the commissioner shall determine the need for the program based on the documentation submitted by the provider entity.\n[Repealed by amendment, 2016 c 163 art 2 s 5]\nMS 2020 [Repealed, 2021 c 30 art 17 s 113]\n[Repealed by amendment, 2016 c 163 art 2 s 5]\n(a) ACT teams must offer and have the capacity to directly provide the following services:\n(1) assertive engagement using collaborative strategies to encourage clients to receive services;\n(2) benefits and finance support that assists clients to capably manage financial affairs. Services include but are not limited to assisting clients in applying for benefits, assisting with redetermination of benefits, providing financial crisis management, teaching and supporting budgeting skills and asset development, and coordinating with a client's representative payee, if applicable;\n(3) co-occurring substance use disorder treatment as defined in section 245I.02, subdivision 11;\n(4) crisis assessment and intervention;\n(5) employment services that assist clients to work at jobs of the clients' choosing. Services must follow the principles of the individual placement and support employment model, including focusing on competitive employment, emphasizing individual client preferences and strengths, ensuring employment services are integrated with mental health services, conducting rapid job searches and systematic job development according to client preferences and choices, providing benefits counseling, and offering all services in an individualized and time-unlimited manner. Services must also include educating clients about opportunities and benefits of work and school and assisting the client in learning job skills, navigating the workplace, workplace accommodations, and managing work relationships;\n(6) family psychoeducation and support provided to the client's family and other natural supports to restore and strengthen the client's unique social and family relationships. Services include but are not limited to individualized psychoeducation about the client's illness and the role of the family and other significant people in the therapeutic process; family intervention to restore contact, resolve conflict, and maintain relationships with family and other significant people in the client's life; ongoing communication and collaboration between the ACT team and the family; introduction and referral to family self-help programs and advocacy organizations that promote recovery and family engagement, individual supportive counseling, parenting training, and service coordination to help clients fulfill parenting responsibilities; coordinating services for the child and restoring relationships with children who are not in the client's custody; and coordinating with child welfare and family agencies, if applicable. These services must be provided with the client's agreement and consent;\n(7) housing access support that assists clients to find, obtain, retain, and move to safe and adequate housing of their choice. Housing access support includes but is not limited to locating housing options with a focus on integrated independent settings; applying for housing subsidies, programs, or resources; assisting the client in developing relationships with local landlords; providing tenancy support and advocacy for the individual's tenancy rights at the client's home; and assisting with relocation;\n(8) medication assistance and support that assists clients in accessing medication, developing the ability to take medications with greater independence, and providing medication setup. Medication assistance and support includes assisting the client with the prescription, administration, and ordering of medication by appropriate medical staff;\n(9) medication education that educates clients on the role and effects of medications in treating symptoms of mental illness and the side effects of medications;\n(10) mental health certified peer specialists services according to section 256B.0615;\n(11) physical health services to meet the physical health needs of the client to support the client's mental health recovery. Services include but are not limited to education on primary health and wellness issues, medication administration and monitoring, providing and coordinating medical screening and follow-up, scheduling routine and acute medical and dental care visits, tobacco cessation strategies, assisting clients in attending appointments, communicating with other providers, and integrating all physical and mental health treatment;\n(12) rehabilitative mental health services as defined in section 245I.02, subdivision 33;\n(13) symptom management that supports clients in identifying and targeting the symptoms and occurrence patterns of their mental illness and developing strategies to reduce the impact of those symptoms;\n(14) therapeutic interventions to address specific symptoms and behaviors such as anxiety, psychotic symptoms, emotional dysregulation, and trauma symptoms. Interventions include empirically supported psychotherapies including but not limited to cognitive behavioral therapy, exposure therapy, acceptance and commitment therapy, interpersonal therapy, and motivational interviewing;\n(15) wellness self-management and prevention that includes a combination of approaches to working with the client to build and apply skills related to recovery, and to support the client in participating in leisure and recreational activities, civic participation, and meaningful structure; and\n(16) other services based on client needs as identified in a client's assertive community treatment individual treatment plan.\n(b) ACT teams must ensure the provision of all services necessary to meet a client's needs as identified in the client's individual treatment plan.\n(a) The required treatment staff qualifications and roles for an ACT team are:\n(1) the team leader:\n(i) shall be a mental health professional. Individuals who are not licensed but who are eligible for licensure and are otherwise qualified may also fulfill this role;\n(ii) must be an active member of the ACT team and provide some direct services to clients;\n(iii) must be a single full-time staff member, dedicated to the ACT team, who is responsible for overseeing the administrative operations of the team and supervising team members to ensure delivery of best and ethical practices; and\n(iv) must be available to ensure that overall treatment supervision to the ACT team is available after regular business hours and on weekends and holidays and is provided by a qualified member of the ACT team;\n(2) the psychiatric care provider:\n(i) must be a mental health professional permitted to prescribe psychiatric medications as part of the mental health professional's scope of practice. The psychiatric care provider must have demonstrated clinical experience working with individuals with serious and persistent mental illness;\n(ii) shall collaborate with the team leader in sharing overall clinical responsibility for screening and admitting clients; monitoring clients' treatment and team member service delivery; educating staff on psychiatric and nonpsychiatric medications, their side effects, and health-related conditions; actively collaborating with nurses; and helping provide treatment supervision to the team;\n(iii) shall fulfill the following functions for assertive community treatment clients: provide assessment and treatment of clients' symptoms and response to medications, including side effects; provide brief therapy to clients; provide diagnostic and medication education to clients, with medication decisions based on shared decision making; monitor clients' nonpsychiatric medical conditions and nonpsychiatric medications; and conduct home and community visits;\n(iv) shall serve as the point of contact for psychiatric treatment if a client is hospitalized for mental health treatment and shall communicate directly with the client's inpatient psychiatric care providers to ensure continuity of care;\n(v) shall have a minimum full-time equivalency that is prorated at a rate of 16 hours per 50 clients. Part-time psychiatric care providers shall have designated hours to work on the team, with sufficient blocks of time on consistent days to carry out the provider's clinical, supervisory, and administrative responsibilities. No more than two psychiatric care providers may share this role; and\n(vi) shall provide psychiatric backup to the program after regular business hours and on weekends and holidays. The psychiatric care provider may delegate this duty to another qualified psychiatric provider;\n(3) the nursing staff:\n(i) shall consist of one to three registered nurses or advanced practice registered nurses, of whom at least one has a minimum of one-year experience working with adults with serious mental illness and a working knowledge of psychiatric medications. No more than two individuals can share a full-time equivalent position;\n(ii) are responsible for managing medication, administering and documenting medication treatment, and managing a secure medication room; and\n(iii) shall develop strategies, in collaboration with clients, to maximize taking medications as prescribed; screen and monitor clients' mental and physical health conditions and medication side effects; engage in health promotion, prevention, and education activities; communicate and coordinate services with other medical providers; facilitate the development of the individual treatment plan for clients assigned; and educate the ACT team in monitoring psychiatric and physical health symptoms and medication side effects;\n(4) the co-occurring disorder specialist:\n(i) shall be a full-time equivalent co-occurring disorder specialist who has received specific training on co-occurring disorders that is consistent with national evidence-based practices. The training must include practical knowledge of common substances and how they affect mental illnesses, the ability to assess substance use disorders and the client's stage of treatment, motivational interviewing, and skills necessary to provide counseling to clients at all different stages of change and treatment. The co-occurring disorder specialist may also be an individual who is a licensed alcohol and drug counselor as described in section 148F.01, subdivision 5, or a counselor who otherwise meets the training, experience, and other requirements in section 245G.11, subdivision 5. No more than two co-occurring disorder specialists may occupy this role; and\n(ii) shall provide or facilitate the provision of co-occurring disorder treatment to clients. The co-occurring disorder specialist shall serve as a consultant and educator to fellow ACT team members on co-occurring disorders;\n(5) the vocational specialist:\n(i) shall be a full-time vocational specialist who has at least one-year experience providing employment services or advanced education that involved field training in vocational services to individuals with mental illness. An individual who does not meet these qualifications may also serve as the vocational specialist upon completing a training plan approved by the commissioner;\n(ii) shall provide or facilitate the provision of vocational services to clients. The vocational specialist serves as a consultant and educator to fellow ACT team members on these services; and\n(iii) must not refer individuals to receive any type of vocational services or linkage by providers outside of the ACT team;\n(6) the mental health certified peer specialist:\n(i) shall be a full-time equivalent. No more than two individuals can share this position. The mental health certified peer specialist is a fully integrated team member who provides highly individualized services in the community and promotes the self-determination and shared decision-making abilities of clients. This requirement may be waived due to workforce shortages upon approval of the commissioner;\n(ii) must provide coaching, mentoring, and consultation to the clients to promote recovery, self-advocacy, and self-direction, promote wellness management strategies, and assist clients in developing advance directives; and\n(iii) must model recovery values, attitudes, beliefs, and personal action to encourage wellness and resilience, provide consultation to team members, promote a culture where the clients' points of view and preferences are recognized, understood, respected, and integrated into treatment, and serve in a manner equivalent to other team members;\n(7) the program administrative assistant shall be a full-time office-based program administrative assistant position assigned to solely work with the ACT team, providing a range of supports to the team, clients, and families; and\n(8) additional staff:\n(i) shall be based on team size. Additional treatment team staff may include mental health professionals; clinical trainees; certified rehabilitation specialists; mental health practitioners; or mental health rehabilitation workers. These individuals shall have the knowledge, skills, and abilities required by the population served to carry out rehabilitation and support functions; and\n(ii) shall be selected based on specific program needs or the population served.\n(b) Each ACT team must clearly document schedules for all ACT team members.\n(c) Each ACT team member must serve as a primary team member for clients assigned by the team leader and are responsible for facilitating the individual treatment plan process for those clients. The primary team member for a client is the responsible team member knowledgeable about the client's life and circumstances and writes the individual treatment plan. The primary team member provides individual supportive therapy or counseling, and provides primary support and education to the client's family and support system.\n(d) Members of the ACT team must have strong clinical skills, professional qualifications, experience, and competency to provide a full breadth of rehabilitation services. Each staff member shall be proficient in their respective discipline and be able to work collaboratively as a member of a multidisciplinary team to deliver the majority of the treatment, rehabilitation, and support services clients require to fully benefit from receiving assertive community treatment.\n(e) Each ACT team member must fulfill training requirements established by the commissioner.\nEach ACT team must demonstrate that the team attained a passing score according to the most recently issued Tool for Measurement of Assertive Community Treatment (TMACT).\n(a) An ACT team shall provide at least 75 percent of all services in the community in non-office-based or non-facility-based settings.\n(b) ACT team members must know all clients receiving services, and interventions must be carried out with consistency and follow empirically supported practice.\n(c) Each ACT team client shall be assigned an individual treatment team that is determined by a variety of factors, including team members' expertise and skills, rapport, and other factors specific to the individual's preferences. The majority of clients shall see at least three ACT team members in a given month.\n(d) The ACT team shall have the capacity to rapidly increase service intensity to a client when the client's status requires it, regardless of geography, and provide flexible service in an individualized manner at a frequency that meets the client's needs. Services must be available at times that meet client needs.\n(e) ACT teams shall make deliberate efforts to assertively engage clients in services. Input of family members, natural supports, and previous and subsequent treatment providers is required in developing engagement strategies. ACT teams shall include the client, identified family, and other support persons in the admission, initial assessment, and planning process as primary stakeholders, meet with the client in the client's environment at times of the day and week that honor the client's preferences, and meet clients at home and in jails or prisons, streets, homeless shelters, or hospitals.\n(f) ACT teams shall ensure that a process is in place for identifying individuals in need of more or less assertive engagement. Interventions are monitored to determine the success of these techniques and the need to adapt the techniques or approach accordingly.\n(g) ACT teams shall conduct daily team meetings to systematically update clinically relevant information, briefly discuss the status of assertive community treatment clients over the past 24 hours, problem solve emerging issues, plan approaches to address and prevent crises, and plan the service contacts for the following 24-hour period or weekend. All team members scheduled to work shall attend this meeting.\n(h) ACT teams shall maintain a clinical log that succinctly documents important clinical information and develop a daily team schedule for the day's contacts based on a central file of the clients' weekly or monthly schedules, which are derived from interventions specified within the individual treatment plan. The team leader must have a record to ensure that all assigned contacts are completed.\n(a) An initial assessment shall be completed the day of the client's admission to assertive community treatment by the ACT team leader or the psychiatric care provider, with participation by designated ACT team members and the client. The initial assessment must include obtaining or completing a standard diagnostic assessment according to section 245I.10, subdivision 6, and completing a 30-day individual treatment plan. The team leader, psychiatric care provider, or other mental health professional designated by the team leader or psychiatric care provider, must update the client's diagnostic assessment as required under section 245I.10, subdivision 2, paragraphs (f) and (g).\n(b) A functional assessment must be completed according to section 245I.10, subdivision 9. Each part of the functional assessment areas shall be completed by each respective team specialist or an ACT team member with skill and knowledge in the area being assessed.\n(c) Between 30 and 45 days after the client's admission to assertive community treatment, the entire ACT team must hold a comprehensive case conference, where all team members, including the psychiatric provider, present information discovered from the completed assessments and provide treatment recommendations. The conference must serve as the basis for the first individual treatment plan, which must be written by the primary team member.\n(d) The client's psychiatric care provider, primary team member, and individual treatment team members shall assume responsibility for preparing the written narrative of the results from the psychiatric and social functioning history timeline and the comprehensive assessment.\n(e) The primary team member and individual treatment team members shall be assigned by the team leader in collaboration with the psychiatric care provider by the time of the first treatment planning meeting or 30 days after admission, whichever occurs first.\n(f) Individual treatment plans must be developed through the following treatment planning process:\n(1) The individual treatment plan shall be developed in collaboration with the client and the client's preferred natural supports, and guardian, if applicable and appropriate. The ACT team shall evaluate, together with each client, the client's needs, strengths, and preferences and develop the individual treatment plan collaboratively. The ACT team shall make every effort to ensure that the client and the client's family and natural supports, with the client's consent, are in attendance at the treatment planning meeting, are involved in ongoing meetings related to treatment, and have the necessary supports to fully participate. The client's participation in the development of the individual treatment plan shall be documented.\n(2) The client and the ACT team shall work together to formulate and prioritize the issues, set goals, research approaches and interventions, and establish the plan. The plan is individually tailored so that the treatment, rehabilitation, and support approaches and interventions achieve optimum symptom reduction, help fulfill the personal needs and aspirations of the client, take into account the cultural beliefs and realities of the individual, and improve all the aspects of psychosocial functioning that are important to the client. The process supports strengths, rehabilitation, and recovery.\n(3) Each client's individual treatment plan shall identify service needs, strengths and capacities, and barriers, and set specific and measurable short- and long-term goals for each service need. The individual treatment plan must clearly specify the approaches and interventions necessary for the client to achieve the individual goals, when the interventions shall happen, and identify which ACT team member shall carry out the approaches and interventions.\n(4) The primary team member and the individual treatment team, together with the client and the client's family and natural supports with the client's consent, are responsible for reviewing and rewriting the treatment goals and individual treatment plan whenever there is a major decision point in the client's course of treatment or at least every six months.\n(5) The primary team member shall prepare a summary that thoroughly describes in writing the client's and the individual treatment team's evaluation of the client's progress and goal attainment, the effectiveness of the interventions, and the satisfaction with services since the last individual treatment plan. The client's most recent diagnostic assessment must be included with the treatment plan summary.\n(6) The individual treatment plan and review must be approved or acknowledged by the client, the primary team member, the team leader, the psychiatric care provider, and all individual treatment team members. A copy of the approved individual treatment plan must be made available to the client.\nThe commissioner may grant a variance to specific requirements under subdivision 2a, 7a, 7b, or 7c for an ACT team when the ACT team demonstrates an inability to meet the specific requirement and how the team shall ensure the variance shall not negatively impact outcomes for clients. The commissioner may require a plan of action for the ACT team to come into compliance with the specific requirement being varied and establish specific time limits for the variance. A decision to grant or deny a variance request is final and not subject to appeal.\n(a) Payment for intensive residential treatment services and assertive community treatment in this section shall be based on one daily rate per provider inclusive of the following services received by an eligible client in a given calendar day: all rehabilitative services under this section, staff travel time to provide rehabilitative services under this section, and nonresidential crisis stabilization services under section 256B.0624.\n(b) Except as indicated in paragraph (d), payment will not be made to more than one entity for each client for services provided under this section on a given day. If services under this section are provided by a team that includes staff from more than one entity, the team must determine how to distribute the payment among the members.\n(c) Payment must not be made based solely on a court order to participate in intensive residential treatment services. If a client has a court order to participate in the program or to obtain assessment for treatment and follow treatment recommendations, payment under this section must only be provided if the client is eligible for the service and the service is determined to be medically necessary.\n(d) The commissioner shall determine one rate for each provider that will bill medical assistance for residential services under this section and one rate for each assertive community treatment provider. If a single entity provides both services, one rate is established for the entity's residential services and another rate for the entity's nonresidential services under this section. A provider is not eligible for payment under this section without authorization from the commissioner. The commissioner shall develop rates using the following criteria:\n(1) the provider's cost for services shall include direct services costs, other program costs, and other costs determined as follows:\n(i) the direct services costs must be determined using actual costs of salaries, benefits, payroll taxes, and training of direct service staff and service-related transportation;\n(ii) other program costs not included in item (i) must be determined as a specified percentage of the direct services costs as determined by item (i). The percentage used shall be determined by the commissioner based upon the average of percentages that represent the relationship of other program costs to direct services costs among the entities that provide similar services;\n(iii) physical plant costs calculated based on the percentage of space within the program that is entirely devoted to treatment and programming. This does not include administrative or residential space;\n(iv) assertive community treatment physical plant costs must be reimbursed as part of the costs described in item (ii); and\n(v) subject to federal approval, up to an additional five percent of the total rate may be added to the program rate as a quality incentive based upon the entity meeting performance criteria specified by the commissioner;\n(2) actual cost is defined as costs which are allowable, allocable, and reasonable, and consistent with federal reimbursement requirements under Code of Federal Regulations, title 48, chapter 1, part 31, relating to for-profit entities, and Office of Management and Budget Circular Number A-122, relating to nonprofit entities;\n(3) the number of service units;\n(4) the degree to which clients will receive services other than services under this section; and\n(5) the costs of other services that will be separately reimbursed.\n(e) The rate for intensive residential treatment services and assertive community treatment must exclude the medical assistance room and board rate, as defined in section 256B.056, subdivision 5d, and services not covered under this section, such as partial hospitalization, home care, and inpatient services.\n(f) Physician services that are not separately billed may be included in the rate to the extent that a psychiatrist, or other health care professional providing physician services within their scope of practice, is a member of the intensive residential treatment services treatment team. Physician services, whether billed separately or included in the rate, may be delivered by telehealth. For purposes of this paragraph, \"telehealth\" has the meaning given to \"mental health telehealth\" in section 256B.0625, subdivision 46, when telehealth is used to provide intensive residential treatment services.\n(g) When services under this section are provided by an assertive community treatment provider, case management functions must be an integral part of the team.\n(h) The rate for a provider must not exceed the rate charged by that provider for the same service to other payors.\n(i) The rates for existing programs must be established prospectively based upon the expenditures and utilization over a prior 12-month period using the criteria established in paragraph (d). The rates for new programs must be established based upon estimated expenditures and estimated utilization using the criteria established in paragraph (d).\n(j) Effective for the rate years beginning on and after January 1, 2024, rates for assertive community treatment, adult residential crisis stabilization services, and intensive residential treatment services must be annually adjusted for inflation using the Centers for Medicare and Medicaid Services Medicare Economic Index, as forecasted in the third quarter of the calendar year before the rate year. The inflation adjustment must be based on the 12-month period from the midpoint of the previous rate year to the midpoint of the rate year for which the rate is being determined.\n(k) Entities who discontinue providing services must be subject to a settle-up process whereby actual costs and reimbursement for the previous 12 months are compared. In the event that the entity was paid more than the entity's actual costs plus any applicable performance-related funding due the provider, the excess payment must be reimbursed to the department. If a provider's revenue is less than actual allowed costs due to lower utilization than projected, the commissioner may reimburse the provider to recover its actual allowable costs. The resulting adjustments by the commissioner must be proportional to the percent of total units of service reimbursed by the commissioner and must reflect a difference of greater than five percent.\n(l) A provider may request of the commissioner a review of any rate-setting decision made under this subdivision.\n[See Note.]\n[Repealed, 2011 c 86 s 23]\nCounties that employ their own staff to provide services under this section shall apply directly to the commissioner for enrollment and rate setting. In this case, a county contract is not required.\nA county contract is not required for a provider proposing to serve a subpopulation of eligible clients under the following circumstances:\n(1) the provider demonstrates that the subpopulation to be served requires a specialized program which is not available from county-approved entities; and\n(2) the subpopulation to be served is of such a low incidence that it is not feasible to develop a program serving a single county or regional group of counties.\nThe commissioner may disburse grant funds directly to intensive residential treatment services providers and assertive community treatment providers to maintain access to these services.\nThe commissioner may, within available appropriations, disburse grant funding to counties, Indian tribes, or mental health service providers to establish additional assertive community treatment teams, intensive residential treatment services, or crisis residential services.",
	"repealed": false
}