{
	"id": "486.10",
	"url": "https://www.revisor.mn.gov/statutes/cite/486.10",
	"title": "486.10 FREELANCE COURT REPORTERS; DISCLOSURE OF FINANCIAL ARRANGEMENTS.",
	"text": "(a) The definitions in this subdivision apply to this section.\n(b) \"Court reporting firm\" means a business that provides services of freelance court reporters.\n(c) \"Freelance court reporter\" means an officer who captures and transcribes verbatim legal proceedings and who is authorized to administer oaths to witnesses. Freelance court reporter does not include a court reporter while working in a courtroom setting as an employee of the court.\n(d) \"Contract or agreement\" means a contract or agreement, whether oral or written, for court reporting services between a freelance court reporter or court reporting firm and an attorney, law firm, party to a legal proceeding, or party having a financial interest in a legal proceeding that provides for ongoing court reporting services not limited to a particular case or reporting incident.\n(a) The existence of a contract or an exclusive agreement with a court reporter or court reporting firm for court reporting services must be disclosed as provided by this paragraph. Written notice of a contract or agreement must be included in the notice of taking deposition or the notice of legal proceeding before commencement of a legal proceeding at which court reporting services are being provided. Oral disclosure of a contract or agreement must be made on the record by the court reporter at the commencement of the legal proceeding.\n(b) A freelance court reporter or court reporting firm:\n(1) shall treat all parties to an action equally, providing comparable services to all parties;\n(2) shall charge the same rate for copies of the same transcript to all parties according to Minnesota Rules of Civil Procedure, rule 30.06;\n(3) may not act as an advocate for any party or act partially to any party to an action; and\n(4) shall comply with all state and federal court rules that govern the activities of court reporters.\n(c) An attorney shall state the reason for the objection to the provision of court reporting services by a freelance court reporter or court reporting firm and shall note the objection and the reason on the record.\nThrough objection by a party to the proceedings and upon the court's or presiding officer's determination of a violation of subdivision 2, paragraph (a), the court or presiding officer may: (1) declare that the record for which the court reporting services were provided is void and may order that the legal proceeding be reconducted; or (2) impose sanctions against the party violating subdivision 2, paragraph (a), including civil contempt of court, costs, and reasonable attorney fees resulting from the violation. If the legal proceedings are reconducted, the parties who violated subdivision 2, paragraph (a), are jointly and severally liable for costs associated with reconducting the legal proceeding and preparing the new record. Costs include, but are not limited to, attorney, witness, and freelance court reporter appearance and transcript fees.",
	"repealed": false
}