{
	"id": "5.305",
	"url": "https://www.revisor.mn.gov/statutes/cite/5.305",
	"title": "5.305 VOTING OPERATIONS, TECHNOLOGY, AND ELECTION RESOURCES ACCOUNT.",
	"text": "For purposes of this section, the following terms have the meanings given:\n(1) \"account\" means the voting operations, technology, and election resources account;\n(2) \"city\" means a statutory or home rule charter city; and\n(3) \"local unit of government\" means a county, city, or town.\nThe voting operations, technology, and election resources account is established in the special revenue fund. Money in the account is appropriated annually to the secretary of state for distribution as provided in this section.\n(a) The secretary of state must distribute the balance in the account annually as follows:\n(1) 20 percent of the total balance is for allocation to each county in equal amounts; and\n(2) 80 percent of the total balance is for allocation to each county in proportion to its share of registered voters on May 1 for the most recent statewide general election, as determined by the secretary of state.\n(b) The secretary of state must distribute funds under this section no later than July 20 of each year.\n(a) Upon receipt of funds, each county must segregate the funds in a county election funding account. The money in the account remains in the account until spent for any of the authorized purposes set forth in this section. The county and the local units of government located within the county must agree on a distribution plan for allocating funds from the account. If the county and a local unit of government do not agree on a distribution plan, the county must allocate the funds to that unit of local government as follows:\n(1) 50 percent is retained by the county;\n(2) 25 percent is allocated to each local unit of government responsible for administering absentee voting or mail voting in proportion to that unit of government's share of the county's registered voters on May 1 for the most recent statewide general election; and\n(3) 25 percent is allocated to cities and townships in proportion to each city and township's share of registered voters in the county on May 1 for the most recent statewide general election.\nThe county must make distributions to cities and towns by December 31 each year.\n(b) A city or township that is allocated funds under this subdivision must segregate the funds in an election funding account. The money in the account remains in the account until spent for any of the authorized purposes set forth in this section.\nA local unit of government may use the funds allocated pursuant to this section for the following purposes, provided the expenditures are directly related to election administration:\n(1) equipment;\n(2) hardware or software;\n(3) cybersecurity;\n(4) security-related infrastructure;\n(5) capital improvements to government-owned property to improve access to polling places for individuals with disabilities;\n(6) staff costs for election administrators, election judges, and other election officials;\n(7) printing and publication;\n(8) postage;\n(9) programming;\n(10) transitioning to a .gov domain;\n(11) local match for state or federal funds; and\n(12) any other purpose directly related to election administration.\n(a) Annually by December 31, each county auditor must report to the secretary of state with an explanation of how the funds received pursuant to this section during the previous fiscal year were spent and a certification that they were spent in accordance with subdivisions 4 and 5. The county auditor's report must include the following: an itemized description of each actual expenditure listed by the general categories of expenditures identified in subdivision 5, the local unit of government making the expenditure, the balance in the county's election funding account, and the balance of any city's or town's election funding account. The county auditor's report must also include any other information required by the secretary of state.\n(b) Each city and town receiving an allocation of funds under this section must provide the county auditor with the data necessary to submit this report no later than December 15 of each year.\n(c) No later than January 31 of each year, the secretary of state must compile the reports received from each county auditor and submit a summary report on the expenditure of funds to the chairs and ranking minority members of the legislative committees with jurisdiction over elections policy and finance. At a minimum, the summary report must identify expenditures by county, city, and town and the purposes of each expenditure.",
	"repealed": false
}