{
	"id": "41A.20",
	"url": "https://www.revisor.mn.gov/statutes/cite/41A.20",
	"title": "41A.20 SIDING PRODUCTION INCENTIVE.",
	"text": "(a) For the purposes of this section, the terms defined in this subdivision have the meanings given them.\n(b) \"Commissioner\" means the commissioner of agriculture.\n(c) \"Forest resources\" means raw wood logs and material primarily made up of cellulose, hemicellulose, or lignin, or a combination of those ingredients.\n(a) A facility eligible for payment under this section must source at least 80 percent raw materials from Minnesota. If a facility is sited 50 miles or less from the state border, raw materials may be sourced from within a 100-mile radius. Raw materials must be from forest resources. The facility must be located in Minnesota, must begin production at a specific location by June 30, 2025, and must not begin operating before July 1, 2019. Eligible facilities include existing companies and facilities that are adding siding production capacity, or retrofitting existing capacity, as well as new companies and facilities. Eligible siding production facilities must produce at least 200,000,000 siding square feet on a 3/8 inch nominal basis of siding each year.\n(b) No payments shall be made for siding production that occurs after June 30, 2035, for those eligible producers under paragraph (a).\n(c) An eligible producer of siding shall not transfer the producer's eligibility for payments under this section to a facility at a different location.\n(d) A producer that ceases production for any reason is ineligible to receive payments under this section until the producer resumes production.\n(a) The commissioner shall make payments to eligible producers of siding. The amount of the payment for each eligible producer's annual production is $7.50 per 1,000 siding square feet on a 3/8 inch nominal basis of siding produced at a specific location for ten years after the start of production.\n(b) Total payments under this section to an eligible siding producer in a fiscal year may not exceed the amount necessary for 400,000,000 siding square feet on a 3/8 inch nominal basis of siding produced. Total payments under this section to all eligible siding producers in a fiscal year may not exceed the amount necessary for 400,000,000 siding square feet on a 3/8 inch nominal basis of siding produced. The commissioner shall award payments on a first-come, first-served basis within the limits of available funding.\n(c) For purposes of this section, an entity that holds a controlling interest in more than one siding facility is considered a single eligible producer.\nForest resources that come from land parcels greater than 160 acres must be certified by the Forest Stewardship Council, Sustainable Forestry Initiative, or American Tree Farm System. Uncertified land from parcels of 160 acres or less and federal land must be harvested by a logger who has completed training from the Minnesota logger education program or the equivalent, and have a forest stewardship plan.\n(a) By the last day of October, January, April, and July, each eligible siding producer shall file a claim for payment for siding production during the preceding three calendar months. An eligible siding producer that files a claim under this subdivision shall include a statement of the eligible producer's total board feet of siding produced during the quarter covered by the claim. For each claim and statement of total board feet of siding filed under this subdivision, the board feet of siding produced must be examined by a certified public accounting firm with a valid permit to practice under chapter 326A, in accordance with Statements on Standards for Attestation Engagements established by the American Institute of Certified Public Accountants.\n(b) The commissioner must issue payments by November 15, February 15, May 15, and August 15. A separate payment must be made for each claim filed.\n[Repealed, 2017 c 88 art 2 s 93]",
	"repealed": false
}