{
	"id": "56.09",
	"url": "https://www.revisor.mn.gov/statutes/cite/56.09",
	"title": "56.09 SUSPENSION OR REVOCATION OF LICENSE.",
	"text": "The commissioner shall, upon ten days' notice to the licensee stating the contemplated action and in general the grounds therefor, and upon reasonable opportunity to be heard, revoke any license issued hereunder if the commissioner shall find that:\n(1) The licensee has failed to pay the annual license fee required under the provisions of this chapter, or to comply with any demand, ruling, or requirement of the commissioner lawfully made pursuant to and within the authority of this chapter; or that\n(2) The licensee has violated any material provision of this chapter or any rule lawfully made by the commissioner under and within the authority of this chapter; or that\n(3) Any fact or condition exists which, if it had existed at the time of the original application for the license, clearly would have warranted the commissioner in refusing originally to issue the license.\nThe commissioner may, upon three days' notice and a hearing, suspend any license for a period not exceeding 30 days, pending investigation.\nThe commissioner may revoke or suspend only the particular license with respect to which grounds for revocation or suspension may occur or exist, or, if the commissioner shall find that the grounds for revocation or suspension are of general application to all offices, or to more than one office, operated by the licensee, the commissioner shall revoke or suspend all of the licenses issued to the licensee or the licenses as the grounds apply to, as the case may be.\nAny licensee may surrender any license by delivering to the commissioner written notice that the licensee thereby surrenders the license, but the surrender shall not affect the licensee's civil or criminal liability for acts committed prior to the surrender.\nNo revocation or suspension or surrender of any license shall impair or affect the obligation of any preexisting lawful contract between the licensee and any borrower.\nEvery license issued hereunder shall remain in force and effect until the same shall have been surrendered, revoked, or suspended in accordance with the provisions of this chapter, but the commissioner shall have authority, on the commissioner's own initiative, to reinstate suspended licenses or to issue new licenses to a licensee whose license or licenses shall have been revoked if no fact or condition then exists which clearly would have warranted the commissioner in refusing originally to issue the license under this chapter.\nWhen the commissioner shall revoke or suspend a license issued pursuant to this chapter, a written order to that effect and findings with respect thereto containing the evidence and the reasons supporting the revocation or suspension shall be filed in the commissioner's office, and a copy thereof forthwith served upon the licensee.",
	"repealed": false
}