{
	"id": "576.38",
	"url": "https://www.revisor.mn.gov/statutes/cite/576.38",
	"title": "576.38 TERMINATION OF RECEIVERSHIPS; FINAL REPORT.",
	"text": "The court may discharge a receiver and terminate the receivership. If the court determines that the appointment of the receiver was procured in bad faith, the court may assess against the person who procured the receiver's appointment:\n(1) all of the receiver's fees and expenses and other costs of the receivership; and\n(2) any other sanctions the court deems appropriate.\nUpon distribution or disposition of all receivership property, or the completion of the receiver's duties, the receiver shall file a final report and shall request that the court approve the final report and discharge the receiver.\nThe final report, which may incorporate by reference interim reports, shall include, in addition to any matters required by the court in the case:\n(1) a description of the activities of the receiver in the conduct of the receivership;\n(2) a schedule of all receivership property at the commencement of the receivership and any receivership property added thereafter;\n(3) a list of expenditures, including all payments to professionals retained by the receiver;\n(4) a list of any unpaid expenses incurred during the receivership;\n(5) a list of all dispositions of receivership property;\n(6) a list of all distributions made or proposed to be made; and\n(7) if not done separately, a motion or application for approval of the payment of fees and expenses of the receiver.\nThe receiver shall give notice of the filing of the final report and request for discharge to all persons who have filed notices of appearance. If there is no objection within 21 days, the court may enter an order approving the final report and discharging the receiver without the necessity of a hearing.\nA discharge removes all authority of the receiver, excuses the receiver from further performance of any duties, and discharges any lis pendens recorded by the receiver.",
	"repealed": false
}