{
	"id": "341.321",
	"url": "https://www.revisor.mn.gov/statutes/cite/341.321",
	"title": "341.321 FEE SCHEDULE.",
	"text": "(a) The fee schedule for professional and amateur licenses issued by the commissioner is as follows:\n(1) referees, $25;\n(2) promoters, $700;\n(3) judges and knockdown judges, $25;\n(4) trainers and seconds, $40;\n(5) timekeepers, $25;\n(6) professional combatants, $70;\n(7) amateur combatants, $35; and\n(8) ringside physicians, $25.\nAll license fees shall be paid no later than the weigh-in prior to the contest. No license may be issued until all prelicensure requirements in section 341.30 are satisfied and fees are paid.\n(b) A promoter or event organizer of an event regulated by the Department of Labor and Industry must pay, per event, a combative sport contest fee.\n(c) If the promoter sells tickets for the event, the event fee is $1,500 or four percent of the gross ticket sales, whichever is greater. The fee must be paid as follows:\n(1) $500 at the time the combative sport contest is scheduled, which is nonrefundable;\n(2) $1,000 at the weigh-in prior to the contest;\n(3) if four percent of the gross ticket sales is greater than $1,500, the balance is due to the commissioner within 14 days of the completed contest; and\n(4) the value of all complimentary tickets distributed for an event, to the extent they exceed five percent of total event attendance, counts toward gross tickets sales for the purposes of determining a combative sports contest fee. For purposes of this clause, the lowest advertised ticket price shall be used to calculate the value of complimentary tickets.\n(d) If the promoter does not sell tickets and receives only a flat payment from a venue to administer the event, the event fee is $1,500 per event or four percent of the flat payment, whichever is greater. The fee must be paid as follows:\n(1) $500 at the time the combative sport contest is scheduled, which is nonrefundable;\n(2) $1,000 at the weigh-in prior to the contest; and\n(3) if four percent of the flat payment is greater than $1,500, the balance is due to the commissioner within 14 days of the completed contest.\n(e) All fees and penalties collected by the commissioner must be deposited in the commissioner account in the special revenue fund.",
	"repealed": false
}