{
	"id": "97A.451",
	"url": "https://www.revisor.mn.gov/statutes/cite/97A.451",
	"title": "97A.451 LICENSE REQUIREMENTS AND EXEMPTIONS RELATING TO AGE.",
	"text": "[Repealed, 1988 c 437 s 6]\n(a) A resident under the age of 16 years may take fish without a license.\n(b) A resident under the age of 16 may net ciscoes and whitefish for personal consumption without the license required under section 97A.475, subdivision 13. A resident netting ciscoes and whitefish under this paragraph must follow all other applicable requirements for netting ciscoes and whitefish for personal consumption.\nResidents age 16 or over and under age 18 may take fish by spearing without a spearing license but must possess a fishing license under section 97A.475, subdivision 6, clause (7).\n(a) A resident or nonresident under age 16 may not obtain a small-game license but may take small game by firearms or bow and arrow without a license if the resident or nonresident is:\n(1) age 14 or 15 and possesses a firearms safety certificate;\n(2) age 13, possesses a firearms safety certificate, and is accompanied by a parent or guardian;\n(3) age 13, 14, or 15, and possesses an apprentice-hunter validation as provided under section 97B.022; or\n(4) age 12 or under and is accompanied by a parent or guardian.\n(b) A resident under age 16 may take small game, other than wolves, by trapping without a small-game license, but a resident 13 years of age or older must have a trapping license. A resident under age 13 may trap small game, other than wolves, without a trapping license, but may not register fisher, otter, bobcat, or pine marten unless the resident is at least age five. Any fisher, otter, bobcat, or pine marten taken by a resident under age five must be included in the limit of the accompanying parent or guardian.\n(c) A resident or nonresident under age 13 must obtain a free turkey license to take turkey and may take a turkey without a firearms safety certificate if the resident or nonresident is accompanied by an adult parent or guardian who has a firearms safety certificate.\n(d) A resident under age 13 may apply for a prairie-chicken license and may take a prairie chicken without a firearms safety certificate if the resident is accompanied by an adult parent or guardian who has a firearms safety certificate.\n[Repealed, 2012 c 277 art 2 s 37]\nA nonresident age 16 or over and under age 18 may take small game by firearms or archery and may obtain a small-game license at the youth fee under section 97A.475, subdivision 3, paragraph (a), clause (14), if the nonresident possesses a firearms safety certificate or an apprentice-hunter validation as provided under section 97B.022.\n(a) A resident or nonresident age 12, 13, 14, or 15 may not obtain a license to take big game unless the person possesses a firearms safety certificate or an apprentice-hunter validation as provided under section 97B.022. A nonresident age 12 or 13 must be accompanied by a parent or guardian to hunt big game.\n(b) A resident or nonresident age ten or 11 must obtain a license under paragraph (c) and may take big game, provided the person is under the direct supervision of a parent or guardian where the parent or guardian is within immediate reach.\n(c) A resident or nonresident age ten, 11, or 12 must obtain a license to take big game under section 97A.475, subdivision 2 or 3.\n[Repealed, 2013 c 121 s 59]\n(a) A nonresident under age 16 may:\n(1) take fish by angling without a license if a parent or guardian has a fishing license. Fish taken by a nonresident under age 16 without a license must be included in the limit of the parent or guardian;\n(2) purchase a youth fishing license under section 97A.475, subdivision 7, paragraph (a), clause (8), and possess a limit of fish; or\n(3) be included under a nonresident family angling license and possess a limit of fish.\n(b) A nonresident age 16 or over and under age 18 must purchase a youth license to angle under section 97A.475, subdivision 7, paragraph (a), clause (8).\n(c) Nonresidents age 16 or over and under age 18 may take fish by spearing without a spearing license but must possess a fishing license under section 97A.475, subdivision 7, paragraph (a), clause (8).\n(d) Nonresidents under age 16 may take fish by spearing without a spearing or angling license.\n(e) Limits for fish taken by spearing must comply with one of the options listed under paragraph (a).\nA nonresident under the age of 16 that is attending a camp conducted by a nonprofit organization may take fish by angling in adjacent and connected public waters without a license. The organization must have a certificate from the commissioner that describes the public waters where the fishing is allowed. The nonresident must possess a document, prescribed by the commissioner, for identification of the nonresident and the authorized fishing waters. The document must be signed and dated within the current calendar year by the person in charge of the camp.\n[Repealed, 2012 c 277 art 2 s 37]\nA resident age 90 or older may take fish without a license.",
	"repealed": false
}