{
	"id": "93.46",
	"url": "https://www.revisor.mn.gov/statutes/cite/93.46",
	"title": "93.46 DEFINITIONS.",
	"text": "For the purposes of sections 93.46 to 93.51, the terms defined in this section have the meanings given to them.\n\"Mining area\" or \"area subjected to mining\" means any area of land from which material is hereafter removed in connection with the production or extraction of metallic minerals or peat, the lands upon which material from such mining is hereafter deposited, the lands upon which beneficiating plants and auxiliary facilities are hereafter located, the lands upon which the water reservoirs used in the mining process are hereafter located, and auxiliary lands which are hereafter used or intended to be used in a particular mining operation.\n\"Mine waste\" means any material, including but not limited to surface overburden, rock, lean ore, or tailings which in the process of mining and beneficiation has been removed from the earth and stored elsewhere on the surface.\n[Repealed, 1973 c 526 s 8]\n\"Department\" means the Department of Natural Resources.\n\"Operator\" means any owner or lessee of mineral rights or peat rights engaged in or preparing to engage in mining operations with respect thereto.\n\"Person\" includes firms, partnerships, corporations, and other groups.\n\"Commissioner\" means the commissioner of natural resources.\n\"Lean ore stockpile removal\" means the mining and processing of low-grade mineralized material from stockpiles for the purpose of extracting iron.\n\"Scram mining\" means a mining operation that produces natural iron ore, natural iron ore concentrates, or taconite ore as described in section 93.20, subdivisions 12 to 18, from previously developed stockpiles, tailing basins, underground mine workings, or open pits and that involves no more than 80 acres of land not previously affected by mining, or more than 80 acres of land not previously affected by mining if the operator can demonstrate that impacts would be substantially the same as other scram operations. \"Land not previously affected by mining\" means land upon which mine wastes have not been deposited and land from which materials have not been removed in connection with the production or extraction of metallic minerals.",
	"repealed": false
}