{
	"id": "21.89",
	"url": "https://www.revisor.mn.gov/statutes/cite/21.89",
	"title": "21.89 SEED FEE PERMITS.",
	"text": "In order to pay for administering and enforcing sections 21.80 to 21.92, the commissioner shall establish the fees charged for various seeds and shall collect the fees on all seeds covered by sections 21.82 to 21.92.\nThe commissioner shall issue a permit to the labeler of agricultural, vegetable, flower, and wildflower seeds which are sold for use in Minnesota and which conform to and are labeled under sections 21.80 to 21.92. Permit fees are determined based on the first sale in the state. Any sale after the first sale does not increase the permit fee. The categories of permits are as follows:\n(1) for labelers who sell 50,000 pounds or less of agricultural, native grasses, or wildflower seed each calendar year, an annual permit issued for a fee established in section 21.891, subdivision 2, paragraph (b);\n(2) for labelers who sell vegetable, flower, and wildflower seed packed for use in home gardens or household plantings, an annual permit issued for a fee established in section 21.891, subdivision 2, paragraph (c), based upon the gross sales from the previous year; and\n(3) for labelers who sell more than 50,000 pounds of agricultural, native grasses, or wildflower seed each calendar year, a permanent permit issued for a fee established in section 21.891, subdivision 2, paragraph (d).\nIn addition, the person shall furnish to the commissioner an itemized statement of all seeds sold in Minnesota for the periods established by the commissioner. This statement shall be delivered, along with the payment of the fee, based upon the amount and type of seed sold, to the commissioner no later than 30 days after the end of each reporting period. Any person holding a permit shall show as part of the analysis labels or invoices on all agricultural, vegetable, flower, wildflower, tree, or shrub seeds all information the commissioner requires. The commissioner may revoke any permit in the event of failure to comply with applicable laws and rules.\nA penalty fee established by the commissioner shall be assessed any permit holder who fails to submit a statement and pay the fee due within the 30 days following the end of each reporting period.\nA labeler who sells for use in Minnesota agricultural, vegetable, or flower seeds must have a seed fee permit unless the agricultural, vegetable, or flower seeds are of the breeder or foundation seed classes of varieties developed by publicly financed research agencies intended for the purpose of increasing the quantity of seed available.",
	"repealed": false
}