{
	"id": "86A.05",
	"url": "https://www.revisor.mn.gov/statutes/cite/86A.05",
	"title": "86A.05 CLASSIFICATION AND PURPOSES.",
	"text": "The outdoor recreation system shall be comprised of units classified as follows, and each unit shall be authorized, established, and administered to accomplish the purpose and objectives of its classification.\n(a) A state park shall be established to protect and perpetuate extensive areas of the state possessing those resources which illustrate and exemplify Minnesota's natural phenomena and to provide for the use, enjoyment, and understanding of such resources without impairment for the enjoyment and recreation of future generations.\n(b) No unit shall be authorized as a state park unless its proposed location substantially satisfies the following criteria:\n(1) exemplifies the natural characteristics of the major landscape regions of the state, as shown by accepted classifications, in an essentially unspoiled or restored condition or in a condition that will permit restoration in the foreseeable future; or contains essentially unspoiled natural resources of sufficient extent and importance to meaningfully contribute to the broad illustration of the state's natural phenomena;\n(2) contains natural resources, sufficiently diverse and interesting to attract people from throughout the state; and\n(3) is sufficiently large to permit protection of the plant and animal life and other natural resources which give the park its qualities and provide for a broad range of opportunities for human enjoyment of these qualities.\n(c) State parks shall be administered by the commissioner of natural resources in a manner which is consistent with the purposes of this subdivision to preserve, perpetuate, and interpret natural features that existed in the area of the park prior to settlement and other significant natural, scenic, scientific, or historic features that are present. Management shall seek to maintain a balance among the plant and animal life of the park and to reestablish desirable plants and animals that were formerly indigenous to the park area but are now missing. Programs to interpret the natural features of the park shall be provided. Outdoor recreation activities to utilize the natural features of the park that can be accommodated without material disturbance of the natural features of the park or the introduction of undue artificiality into the natural scene may be permitted. Park use shall be primarily for aesthetic, cultural, and educational purposes, and shall not be designed to accommodate all forms or unlimited volumes of recreational use. Physical development shall be limited to those facilities necessary to complement the natural features and the values being preserved.\n(a) A state recreation area shall be established to provide a broad selection of outdoor recreation opportunities in a natural setting which may be used by large numbers of people.\n(b) No unit shall be authorized as a state recreation area unless its proposed location substantially satisfies the following criteria:\n(1) contains natural or artificial resources which provide outstanding outdoor recreational opportunities that will attract visitors from beyond the local area;\n(2) contains resources which permit intensive recreational use by large numbers of people; and\n(3) may be located in areas which have serious deficiencies in public outdoor recreation facilities, provided that state recreation areas should not be provided in lieu of municipal, county, or regional facilities.\n(c) State recreation areas shall be administered by the commissioner of natural resources in a manner which is consistent with the purposes of this subdivision primarily to provide as broad a selection of opportunities for outdoor recreation as is consistent with maintaining a pleasing natural environment. Scenic, historic, scientific, scarce, or disappearing resources within state recreation areas shall be recommended for authorization as historic sites or designated scientific and natural areas pursuant to section 86A.08 to preserve and protect them. Physical development shall enhance and promote the use and enjoyment of the natural recreational resources of the area.\n(a) A state trail shall be established to provide a recreational travel route which connects units of the outdoor recreation system or the national trail system, provides access to or passage through other areas which have significant scenic, historic, scientific, or recreational qualities or reestablishes or permits travel along an historically prominent travel route or which provides commuter transportation.\n(b) No unit shall be authorized as a state trail unless its proposed location substantially satisfies the following criteria:\n(1) permits travel in an appropriate manner along a route which provides at least one of the following recreational opportunities:\n(i) travel along a route which connects areas or points of natural, scientific, cultural, and historic interest;\n(ii) travel through an area which possesses outstanding scenic beauty;\n(iii) travel over a route designed to enhance and utilize the unique qualities of a particular manner of travel in harmony with the natural environment;\n(iv) travel along a route which is historically significant as a route of migration, commerce, or communication; or\n(v) travel between units of the state outdoor recreation system or the national trail system;\n(2) utilizes, to the greatest extent possible consistent with the purposes of this subdivision, public lands, rights-of-way, and the like;\n(3) provides maximum potential for the appreciation, conservation, and enjoyment of significant scenic, historical, natural, or cultural qualities of the areas through which the trail may pass; and\n(4) takes into consideration predicted public demand and future use.\n(c) State trails shall be administered by the commissioners of transportation or natural resources as specified by law in a manner which is consistent with the purposes of this subdivision. State trails established by the commissioner of natural resources shall be managed to provide a travel route through an area with a minimum disturbance of the natural environment and recognizing other multiple land use activities. Trail markers shall be limited to those providing safety information and interpretation.\n(d) Facilities for the rest and comfort of trail users shall be provided primarily within units of the outdoor recreation system through which the trail passes. When additional facilities are required to insure the rest and comfort of the traveler, the managing agency may develop such facilities along the trail and shall designate the facilities as trail waysides. In addition to the foregoing purpose, trail waysides shall be developed for the preservation and interpretation of the trail's natural, historic, or scenic values, and may include facilities for primitive camping, picnicking, sanitation, and parking for access to the trail.\n(a) A state scientific and natural area shall be established to protect and perpetuate in an undisturbed natural state those natural features which possess exceptional scientific or educational value.\n(b) No unit shall be authorized as a scientific and natural area unless its proposed location substantially satisfies the following criteria:\n(1) embraces natural features of exceptional scientific and educational value, including but not limited to any of the following:\n(i) natural formations or features which significantly illustrate geological processes;\n(ii) significant fossil evidence of the development of life on earth;\n(iii) an undisturbed plant community maintaining itself under prevailing natural conditions typical of Minnesota;\n(iv) an ecological community significantly illustrating the process of succession and restoration to natural condition following disruptive change;\n(v) a habitat supporting a vanishing, rare, endangered, or restricted species of plant or animal;\n(vi) a relict flora or fauna persisting from an earlier period; or\n(vii) a seasonal haven for concentrations of birds and animals, or a vantage point for observing concentrated populations, such as a constricted migration route; and\n(2) embraces an area large enough to permit effective research or educational functions and to preserve the inherent natural values of the area.\n(c) State scientific and natural areas shall be administered by the commissioner of natural resources, in consultation with qualified persons, in a manner which is consistent with the purposes of this subdivision to preserve, perpetuate and protect from unnatural influences the scientific and educational resources within them. Interpretive studies may be provided for the general public. Physical development shall be limited to the facilities absolutely necessary for protection, research, and educational projects, and, where appropriate, for interpretive services.\n(d) An area designated as a state scientific and natural area shall not be altered in designation or use without holding a public hearing on the matter at a time and place designated in the notice of the hearing, which shall be published once in a legal newspaper in each county in which the lands are situated at least seven days in advance of the hearing. At the hearing the commissioner shall provide an opportunity for any person to be heard. The commissioner may designate these areas by written order published in the State Register. Designations are not subject to the rulemaking provisions of chapter 14 and section 14.386 does not apply.\n(e) At the discretion of the managing agency, each scientific and natural area shall be designated as one of the following types:\n(i) Research unit. Use is limited to programs conducted by qualified scientists and college graduate and postgraduate students.\n(ii) Educational unit. Permitted uses include all activities specified in paragraph (i) above and primary, secondary, and college undergraduate programs.\n(iii) Public use unit. Permitted uses include all uses permitted in paragraphs (i) and (ii) above and interpretive programs for the benefit of the general public.\n(a) A state wilderness area shall be established to preserve, in a natural wild and undeveloped condition, areas which offer outstanding opportunities for solitude and primitive types of outdoor recreation.\n(b) No unit shall be authorized as a state wilderness area unless its proposed location substantially satisfies the following criteria: appears to have been primarily affected by the forces of nature, with the evidence of humanity being substantially unnoticeable or where the evidence of humanity may be eliminated by restoration.\n(c) State wilderness areas shall be administered by the commissioner of natural resources in a manner which is consistent with the purposes of this subdivision, and shall be managed only to the extent necessary to control fire, insects, and disease, and to preserve existing wilderness or reestablish wilderness conditions. There shall be no development of public roads, permanent dwellings, or recreational facilities except trails for nonmotorized traffic. Motorized traffic shall not be allowed. No commercial utilization of timber or minerals shall be allowed. Facilities existing at the time of establishment shall be removed.\n(a) A state forest, as established by section 89.021, shall be administered to accomplish the purposes set forth in that section, and a state forest subarea shall be established to permit development and management of specialized outdoor recreation at locations and in a manner consistent with the primary purpose of the forest.\n(b) No unit shall be authorized as a state forest subarea unless it is located within a state forest and contains suitable natural resources to accommodate any of the following uses:\n(1) Day use areas. Areas which permit recreational use of the forest in its natural state, not requiring an overnight stay, including but not limited to picnicking, fishing, swimming, boat launching, hiking, interpretation, and nature observation.\n(2) Campground. Provide minimum facilities to accommodate overnight camping.\n(c) Outdoor recreation subareas located within state forests shall be administered by the commissioner of natural resources in a manner which is consistent with the purposes of this subdivision.\n(a) A state wildlife management area shall be established to protect those lands and waters which have a high potential for wildlife production and to develop and manage these lands and waters for the production of wildlife, for public hunting, fishing, and trapping, and for other compatible outdoor recreational uses.\n(b) No unit shall be authorized as a state wildlife management area unless its proposed location substantially satisfies the following criteria:\n(1) includes appropriate wildlife lands and habitat, including but not limited to marsh or wetlands and the margins thereof, ponds, lakes, stream bottomlands, and uplands, which permit the propagation and management of a substantial population of the desired wildlife species; and\n(2) includes an area large enough to ensure adequate wildlife management and regulation of the permitted recreational uses.\n(c) State wildlife management areas shall be administered by the commissioner of natural resources in a manner which is consistent with the purposes of this subdivision to perpetuate, and if necessary, reestablish quality wildlife habitat for maximum production of a variety of wildlife species. Public hunting, fishing, trapping, and other uses shall be consistent with the limitations of the resource, including the need to preserve an adequate brood stock and prevent long-term habitat injury or excessive wildlife population reduction or increase. Physical development may provide access to the area, but shall be so developed as to minimize intrusion on the natural environment.\n(a) A state water-access site shall be established to provide public access to rivers and lakes which are suitable for outdoor water recreation and where the access is necessary to permit public use.\n(b) No unit shall be authorized as a state water-access site unless its proposed location substantially satisfies the following criteria:\n(1) the body of water to which access is being provided and surrounding lands can withstand additional recreational use without undue damage to the environment or undue risks to the health and safety of water users; and\n(2) public access to the body of water is either nonexistent or inadequate.\n(c) State water-access sites shall be administered by the commissioner of natural resources or the commissioner of transportation in a manner which is consistent with the purposes of this subdivision to provide public access to water. Access roads, off-road parking areas, refuse containers, sanitary facilities, and facilities for limited picnicking and primitive camping may be provided when the commissioner determines that these activities are justifiable and are compatible with the resource and the natural environment.\n(a) State wild, scenic, and recreational rivers shall be established to protect and maintain the natural characteristics of all or a portion of a river or stream, or its tributaries, or lake through which the river or stream flows which together with adjacent lands possesses outstanding scenic, scientific, historical, or recreational value, as provided by sections 103F.301 to 103F.345.\n(b) State wild, scenic, and recreational rivers shall be administered by the commissioner of natural resources in a manner which is consistent with the purposes of this subdivision and sections 103F.301 to 103F.345.\n(a) A state historic site shall be established to preserve, restore, and interpret buildings and other structures, locales, sites, antiquities, and related lands which aptly illustrate significant events, personalities, and features of the history and archaeology of the state or nation.\n(b) No unit shall be authorized as a state historic site unless it is historically important for any of the following reasons:\n(1) is the site of or directly associated with a significant historical event;\n(2) is associated with persons whose lives and accomplishments are historically unique or important;\n(3) embodies the distinctive characteristics of an architectural style or method of construction which represents a particular and significant historical period, or the work of a master builder, designer, or architect;\n(4) has yielded, or is likely to yield, historical or archaeological artifacts, records, or other original data or information; or\n(5) is a geographical feature of outstanding significance and includes, by way of example, the highest point in the state, the continental divide, and the source of the Mississippi River.\n(c) State historic sites shall be administered by the commissioner of natural resources, the Minnesota Historical Society, the Board of Regents of the University of Minnesota, governmental subdivisions of the state, or by county historical societies jointly or independently as designated by law in a manner which is consistent with the purposes of this subdivision to maintain and, if necessary, restore the historical integrity of the site to commemorate or illustrate its historical importance. Ancient features of significance shall be protected from disturbance until archaeological research has been completed. Interpretive programs for visitors shall be provided including, where practicable, interpretation of research programs under supervised conditions. Recreational use of natural features shall be permitted only where this can be accomplished without detriment to historical values. Physical development shall be limited to those facilities necessary to achieve the management and use objectives.\n(a) A state rest area shall be established to promote a safe, pleasurable, and informative travel experience along Minnesota highways by providing areas and facilities at reasonable intervals for information, emergencies, or the rest and comfort of travelers.\n(b) No unit shall be authorized as a state rest area unless its proposed location substantially satisfies the following criteria:\n(1) is adjacent to or in near proximity to a trunk or interstate highway;\n(2) is developed at appropriate intervals based on the type of road system, traffic and traffic projections and known or projected usage of the proposed development; and\n(3) may be near or associated with a place or area of natural, scientific, cultural, or historic interest.\n(c) Rest areas shall be administered by the commissioner of transportation in cooperation with other agencies as appropriate in a manner which is consistent with the purposes of this subdivision. State rest areas may be managed to provide parking, resting, restroom, picnicking, orientation, travel information, and other facilities for the convenience of the traveling public. Where located in conjunction with features of interest, state rest areas shall provide interpretive exhibits or other facilities if appropriate to promote understanding and enjoyment of the features.\nAll other state parks which, though not meeting the resource and site qualifications contained in subdivisions 2 and 3, were in existence on January 1, 1984, shall be administered by the commissioner of natural resources as units of the outdoor recreation system.\n(a) Aquatic management areas may be established to protect, develop, and manage lakes, rivers, streams, and adjacent wetlands and lands that are critical for fish and other aquatic life, for water quality, and for their intrinsic biological value, public fishing, or other compatible outdoor recreational uses.\n(b) Aquatic management areas may be established to protect wetland areas under ten acres that are donated to the Department of Natural Resources.\n(c) No unit may be authorized unless it meets one or more of the following criteria:\n(1) provides angler or management access;\n(2) protects fish spawning, rearing, or other unique habitat;\n(3) protects aquatic wildlife feeding and nesting areas;\n(4) protects critical shoreline habitat; or\n(5) provides a site for research on natural history.\n(d) Aquatic management areas must be administered by the commissioner of natural resources in a manner consistent with the purposes of this subdivision to perpetuate and, if necessary, reestablish high quality aquatic habitat for production of fish, wildlife, and other aquatic species. Public fishing and other uses shall be consistent with the limitations of the resource, including the need to preserve adequate populations and prevent long-term habitat injury or excessive fish population reduction or increase. Public access to aquatic management areas may be closed during certain time periods.\n(e) State-owned lands or waters, or any state-owned interests in lands or waters, acquired before August 1, 2000, that meet the criteria of this subdivision and that have been administered by the commissioner of natural resources as fish management areas or other areas of fishery interest are authorized as units of the outdoor recreation system upon designation by the commissioner of natural resources as aquatic management areas.\n(a) Boater waysides may be established to provide for public use.\n(b) No unit shall be authorized as a state boater wayside unless its proposed location substantially satisfies the following criteria:\n(1) contains resources that are desirable for use by boaters;\n(2) is accessible by persons traveling by boat, canoe, or kayak; and\n(3) may be near, associated with, or located within a unit of the outdoor recreation system under this section.\n(c) State boater waysides shall be administered by the commissioner of natural resources in a manner that is consistent with the purpose of this subdivision. Facilities for sanitation, picnicking, overnight mooring, camping, fishing, and swimming may be provided when the commissioner determines that these activities are justifiable and compatible with the resources and the natural environment.",
	"repealed": false
}