{
	"id": "93.481",
	"url": "https://www.revisor.mn.gov/statutes/cite/93.481",
	"title": "93.481 PERMIT TO MINE.",
	"text": "Except as provided in this subdivision, after June 30, 1975, no person shall engage in or carry out a mining operation for metallic minerals within the state unless the person has first obtained a permit to mine from the commissioner. Any person engaging in or carrying out a mining operation as of the effective date of the rules adopted under section 93.47 shall apply for a permit to mine within 180 days after the effective date of such rules. Any such existing mining operation may continue during the pendency of the application for the permit to mine. The person applying for a permit shall apply on forms prescribed by the commissioner and shall submit such information as the commissioner may require, including but not limited to the following:\n(1) a proposed plan for the reclamation or restoration, or both, of any mining area affected by mining operations to be conducted on and after the date on which permits are required for mining under this section;\n(2) a certificate issued by an insurance company authorized to do business in the United States that the applicant has a public liability insurance policy in force for the mining operation for which the permit is sought, or evidence that the applicant has satisfied other state or federal self-insurance requirements, to provide personal injury and property damage protection in an amount adequate to compensate any persons who might be damaged as a result of the mining operation or any reclamation or restoration operations connected with the mining operation;\n(3) an application fee of:\n(i) $25,000 for a permit to mine for a taconite mining operation;\n(ii) $50,000 for a permit to mine for a nonferrous metallic minerals operation;\n(iii) $10,000 for a permit to mine for a scram mining operation; or\n(iv) $5,000 for a permit to mine for a peat operation;\n(4) a bond which may be required pursuant to section 93.49; and\n(5) a copy of the applicant's advertisement of the ownership, location, and boundaries of the proposed mining area and reclamation or restoration operations, which advertisement shall be published in a legal newspaper in the locality of the proposed site at least once a week for four successive weeks before the application is filed, except that if the application is for a permit to conduct lean ore stockpile removal the advertisement need be published only once.\nWithin 120 days after receiving an application the commissioner has deemed complete and filed, the commissioner shall grant the permit applied for, with or without modifications or conditions, or deny the application unless a contested case hearing is requested or ordered under section 93.483. The commissioner's decision to grant the permit, with or without modifications, or deny the application constitutes a final order for purposes of section 93.50. The commissioner in granting a permit with or without modifications shall determine that the reclamation or restoration planned for the operation complies with lawful requirements and can be accomplished under available technology and that a proposed reclamation or restoration technique is practical and workable under available technology. The commissioner may hold public meetings on the application.\n(a) A permit issued by the commissioner pursuant to this section shall be granted for the term determined necessary by the commissioner for the completion of the proposed mining operation, including reclamation or restoration. The term of a scram mining permit for iron ore or taconite shall be determined in the same manner as a permit to mine for an iron ore or taconite mining operation.\n(b) A permit may be amended upon written application to the commissioner. A permit amendment application fee must be submitted with the written application. The permit amendment application fee is ten percent of the amount provided for in subdivision 1, clause (3), for an application for the applicable permit to mine. If the commissioner determines that the proposed amendment constitutes a substantial change to the permit, the person applying for the amendment shall publish notice in the same manner as for a new permit, and a hearing shall be held if written objections are received in the same manner as for a new permit. An amendment may be granted by the commissioner if the commissioner determines that lawful requirements have been met.\nA permit is irrevocable during its term except as follows:\n(1) The permittee has not commenced substantial construction of plant facilities or actual mining and reclamation or restoration operations covered by the permit within three years of issuance of the permit.\n(2) A permit may be canceled at the request or with the consent of the permittee upon such conditions as the commissioner determines necessary for the protection of the public interests.\n(3) Subject to the rights of the permittee to contest the commissioner's action under sections 14.57 to 14.59 and related sections, a permit may be modified or revoked by the commissioner in case of any breach of the terms or conditions thereof or in case of violation of law pertaining thereto by the permittee, or agents, or servants of the permittee, or in case the commissioner finds such modification or cancellation necessary to protect the public health or safety, or to protect the public interests in lands or waters against injury resulting in any manner or to any extent not expressly authorized by the permit, or to prevent injury to persons or property resulting in any manner or to any extent not so authorized, upon at least 30 days' written notice to the permittee, stating the grounds of the proposed modification or revocation or providing a reasonable time of not less than 15 days in which to take corrective action and giving the permittee an opportunity to be heard thereon.\n(4) By written order to the permittee the commissioner may forthwith suspend operations under a permit if the commissioner finds it necessary in an emergency to protect the public health or safety or to protect public interests in lands or waters against imminent danger of substantial injury in any manner or to any extent not expressly authorized by the permit, or to protect persons or property against such danger, and may require the permittee to take any measures necessary to prevent or remedy such injury. No suspension order under this clause shall be in effect more than 30 days from the date thereof without giving the permittee at least ten days' written notice of the order and an opportunity to be heard thereon.\nA permit may not be assigned or otherwise transferred without the written approval of the commissioner. A permit assignment application fee must be submitted with the written application. The permit assignment application fee is ten percent of the amount provided for in subdivision 1, clause (3), for an application for the applicable permit to mine.\nExcept for taconite and iron ore mining permits, no permit to mine metallic minerals may be issued by the commissioner until rules relating to reclamation of metallic mineral mine lands have been amended, or new rules adopted, under sections 93.44 to 93.51 and in the manner provided in chapter 14, for the reclamation of mine lands of the class for which the permit application is submitted. This section does not apply to metallic minerals which are mined incidentally to the mining of a mineral included in any mine land reclamation rule and covered by the permit to mine which has been issued for the mining project.\nThe mining administration account is established as an account in the natural resources fund. Fees charged to owners, operators, or managers of mines under this section and section 93.482 shall be credited to the account and are appropriated to the commissioner to cover the costs of providing and monitoring permits to mine. Earnings accruing from investment of the account remain with the account until appropriated.",
	"repealed": false
}