{
	"id": "3.195",
	"url": "https://www.revisor.mn.gov/statutes/cite/3.195",
	"title": "3.195 REPORTS TO THE LEGISLATURE.",
	"text": "(a) Except as provided in subdivision 4, a report to the legislature required of a department or agency shall be made, unless otherwise specifically required by law, by filing one copy with the Legislative Reference Library, and by making the report available electronically to the Legislative Reference Library. The same distribution procedure shall be followed for other reports and publications unless otherwise requested by a legislator or the Legislative Reference Library.\n(b) A public entity as defined in section 16C.073 shall not distribute a report or publication to a member or employee of the legislature, except the Legislative Reference Library, unless the entity has determined that the member or employee wants the reports or publications published by that entity or the member or employee has requested the report or publication. This prohibition applies to both mandatory and voluntary reports and publications. A report or publication may be summarized in an executive summary and distributed as the entity chooses. Distribution of a report to legislative committee or commission members during a committee or commission hearing is not prohibited by this section.\n(c) A report or publication produced by a public entity may not be sent to both the home address and the office address of a representative or senator unless mailing to both addresses is requested by the representative or senator.\n(d) Reports, publications, periodicals, and summaries under this subdivision must be printed in a manner consistent with section 16C.073.\nWhen a report or publication as defined in section 3.302, subdivision 3, is submitted by a department or agency to the Legislative Reference Library, the department or agency shall supply to the library the information necessary to identify the document as required by section 3.302, subdivision 3a.\nThe Legislative Reference Library shall monthly publish on its website a checklist of state documents.\n(a) As used in this subdivision, \"criminal justice agency\" means the Departments of Corrections, Public Safety, and Human Rights; the Boards of Public Defense, Peace Officer Standards and Training, Private Detective and Protective Agent Services, and Judicial Standards; the Sentencing Guidelines and Uniform Laws Commissions; and the courts.\n(b) A criminal justice agency that submits a report to the legislature under this section shall do so by submitting an electronic version rather than a printed one. Notwithstanding subdivision 1, paragraph (a), and section 15.18, the agency need submit only one electronic copy to the Legislative Reference Library, the State Library, and the Minnesota Historical Society. In addition, the agency shall submit one printed copy to the Legislative Reference Library.",
	"repealed": false
}