{
	"id": "383B.917",
	"url": "https://www.revisor.mn.gov/statutes/cite/383B.917",
	"title": "383B.917 OPEN MEETING LAW; GOVERNMENT DATA PRACTICES ACT.",
	"text": "(a) The corporation is subject to chapter 13, the Minnesota Government Data Practices Act.\n(b) \"Competitive data,\" as defined in this subdivision, are nonpublic data pursuant to section 13.02, subdivision 9, or private data on individuals pursuant to section 13.02, subdivision 12. Competitive data are any type of data that the corporation, in its discretion, determines that if disclosed could cause competitive disadvantage to the corporation, including causing adverse effects on the current or future competitive position of the corporation or the entities, facilities, and operations for which it is responsible. Data discussed at an open meeting of the corporation retains the data's original classification, including classification as competitive data, as provided in section 13D.05, subdivision 1, paragraph (c). Any data disseminated by the corporation to the county shall retain the same classification in the hands of the county, including the classification as competitive data, as provided in section 13.03, subdivision 4.\n(c) A subsidiary, joint venture, association, partnership, or other entity that is formed by the corporation is not subject to chapter 13, except that if the corporation enters into a contract with such an entity to perform any functions of the corporation, the corporation shall include in the contract terms that make it clear that data created, collected, received, stored, used, maintained, or disseminated by the contracting entity in performing those functions is subject to the same requirements under chapter 13 as the corporation under this subdivision. However, this section does not create a duty on the part of the contracting entity to provide access to public data to the public if the public data are available from the corporation, except as required by the terms of the contract. Any entity contracting to perform functions of the corporation may classify data as competitive data as defined in paragraph (b).\n(d) Notwithstanding section 13.384, the corporation, a nonprofit corporation providing physician services to the corporation and participating in an electronic exchange of health records with the corporation, and other persons under contract with Hennepin County who participate in the electronic exchange may share medical data for purposes of treatment, payment, or health care operations. The nonprofit corporation and other participants in the electronic exchange are considered to be related health care entities solely for purposes of section 144.293, subdivision 5, clause (2), and are not outside of the corporation's facility for purposes of section 144.651, subdivision 16. This paragraph does not otherwise limit the provisions of sections 144.291 to 144.298.\n(a) The board of directors of the corporation is subject to chapter 13D, the Minnesota Open Meeting Law.\n(b) The board may close all or part of a board meeting when discussing competitive data or considering strategic, business, planning, or operational issues the disclosure of which, in its discretion, it determines could cause competitive disadvantage to the corporation, including causing adverse effects on the current or future competitive position of the corporation or the entities, facilities, and operations for which it is responsible. Meetings of committees of the board of directors may, at the discretion of the board, be closed to the public.\n(c) In addition, the following meetings of the corporation shall be held and shall be open meetings: (1) an annual public meeting to report on the affairs of the corporation and the goals for the future, including a report on the health services plan specified in section 383B.918; (2) meetings of the corporation held during the development and implementation phase of the health services plan for the purpose of informing the public and receiving public comment; and (3) that portion of a meeting at which the board of the corporation approves the annual budget prior to submission to the county board for approval. Meetings held under clause (1) or (2) may be chaired by a member of the board of directors or a member of the administration as designated by the board of directors. Except as provided in paragraphs (a), (b), and (c), other meetings of the corporation are not subject to chapter 13D.\n(d) Chapter 13D does not apply to a subsidiary, joint venture, association, or partnership of the corporation unless such entity has been organized to assume management of the corporation.",
	"repealed": false
}