{
	"id": "135A.153",
	"url": "https://www.revisor.mn.gov/statutes/cite/135A.153",
	"title": "135A.153 HIGHER EDUCATION CENTER ON VIOLENCE AND ABUSE.",
	"text": "The Higher Education Center on Violence and Abuse is created. The Higher Education Center on Violence and Abuse shall be located at and managed by a public or private postsecondary institution in Minnesota.\n[Repealed, 1995 c 212 art 3 s 60]\nThe Higher Education Center on Violence and Abuse shall:\n(1) serve as a clearinghouse of information on curriculum models and other resources for professional education and for education of faculty, students, and staff about violence and harassment required under Laws 1992, chapter 571, article 16, section 1;\n(2) sponsor conferences and research to assist higher education institutions in developing curricula about violence and abuse;\n(3) fund pilot projects to stimulate multidisciplinary curricula about violence and abuse; and\n(4) coordinate policies to ensure that professions and occupations with responsibilities toward victims and offenders have the knowledge and skills needed to prevent and respond appropriately to the problems of violence and abuse.\nThe center shall convene task forces for professions that work with victims and perpetrators of violence. Task forces must be formed for the following professions: teachers, school administrators, guidance counselors, law enforcement officers, lawyers, physicians, nurses, psychologists, and social workers. Each task force must include representatives of the licensing agency, higher education systems offering programs in the profession, appropriate professional associations, students or recent graduates, representatives of communities served by the profession, and employers or experienced professionals. The center must establish guidelines for the work of the task forces. Each task force must review current programs, licensing regulations and examinations, and accreditation standards to identify specific needs and plans for ensuring that professionals are adequately prepared and updated on violence and abuse issues.\n[Repealed, 2007 c 13 art 2 s 9]",
	"repealed": false
}