{
	"id": "518.157",
	"url": "https://www.revisor.mn.gov/statutes/cite/518.157",
	"title": "518.157 PARENT EDUCATION PROGRAM IN PROCEEDINGS INVOLVING CHILDREN.",
	"text": "(a) By January 1, 1998, the chief judge of each judicial district or a designee shall implement one or more parent education programs within the judicial district for the purpose of educating parents about the impact that divorce, the restructuring of families, and judicial proceedings have upon children and families; methods for preventing parenting time conflicts; and dispute resolution options. The chief judge of each judicial district or a designee may require that children attend a separate education program designed to deal with the impact of divorce upon children as part of the parent education program. Each parent education program must enable persons to have timely and reasonable access to education sessions.\n(b) The chief judge of each judicial district shall ensure that the judicial district's website includes information on the parent education program or programs required under this section.\nThe Minnesota Supreme Court should promulgate minimum standards for the implementation and administration of a parent education program.\n(a) In a proceeding under this chapter where the parties have not agreed to custody or a parenting time schedule, the court shall order the parents of a minor child to attend or take online a minimum of eight hours in an orientation and education program that meets the minimum standards promulgated by the Minnesota Supreme Court.\n(b) In all other proceedings involving custody, support, or parenting time the court may order the parents of a minor child to attend a parent education program.\n(c) The program shall provide the court with names of persons who fail to attend the parent education program as ordered by the court. Persons who are separated or contemplating involvement in a dissolution, paternity, custody, or parenting time proceeding may attend a parent education program without a court order.\n(d) Unless otherwise ordered by the court, participation in a parent education program must begin before an initial case management conference and within 30 days after the first filing with the court or as soon as practicable after that time based on the reasonable availability of classes for the program for the parent. Parent education programs must offer an opportunity to participate at all phases of a pending or postdecree proceeding.\n(e) Upon request of a party and a showing of good cause, the court may excuse the party from attending the program. If past or present domestic abuse, as defined in chapter 518B, is alleged, the court shall not require the parties to attend the same parent education sessions and shall enter an order setting forth the manner in which the parties may safely participate in the program.\n(f) Before an initial case management conference for a proceeding under this chapter where the parties have not agreed to custody or parenting time, the court shall notify the parties of their option to resolve disagreements, including the development of a parenting plan, through the use of private mediation.\nThe court may impose sanctions upon a parent for failure to attend or complete a parent education program as ordered.\nUnless all parties agree in writing, statements made by a party during participation in a parent education program are inadmissible as evidence for any purpose, including impeachment. No record may be made regarding a party's participation in a parent education program, except a record of attendance at and completion of the program as required under this section. Instructors shall not disclose information regarding an individual participant obtained as a result of participation in a parent education program. Parent education instructors may not be subpoenaed or called as witnesses in court proceedings.\nExcept as provided in this subdivision, each person who attends a parent education program shall pay a fee to defray the cost of the program. A party who qualifies for waiver of filing fees under section 563.01 is exempt from paying the parent education program fee and the court shall waive the fee or direct its payment under section 563.01. Program providers shall implement a sliding fee scale.",
	"repealed": false
}