{
	"id": "116J.5492",
	"url": "https://www.revisor.mn.gov/statutes/cite/116J.5492",
	"title": "116J.5492 ENERGY TRANSITION ADVISORY COMMITTEE.",
	"text": "The Energy Transition Advisory Committee is established to develop a statewide energy transition plan and to advise the governor, the commissioner, and the legislature on transition issues, established transition programs, economic initiatives, and transition policy.\n(a) The advisory committee consists of 19 voting members and eight ex officio nonvoting members.\n(b) The voting members of the advisory committee are appointed by the commissioner of employment and economic development, except as specified below:\n(1) two members of the senate, one appointed by the majority leader of the senate and one appointed by the minority leader of the senate;\n(2) two members of the house of representatives, one appointed by the speaker of the house of representatives and one appointed by the minority leader of the house of representatives;\n(3) one representative of the Prairie Island Indian community;\n(4) four representatives of impacted communities, of which two must represent counties and two must represent municipalities, and, to the extent possible, of the impacted facilities in those communities, at least one must be a coal plant, at least one must be a nuclear plant, and at least one must be a natural gas plant;\n(5) three representatives of impacted workers at impacted facilities;\n(6) one representative of impacted workers employed by companies that, under contract, regularly perform construction, maintenance, or repair work at an impacted facility;\n(7) one representative with professional economic development or workforce retraining experience;\n(8) two representatives of utilities that operate an impacted facility;\n(9) one representative from a nonprofit organization with expertise and experience delivering energy efficiency and conservation programs;\n(10) one representative of a school district facing revenue loss due to energy transition; and\n(11) one representative from the Coalition of Utility Cities.\n(c) The ex officio nonvoting members of the advisory committee consist of:\n(1) the governor or the governor's designee;\n(2) the commissioner of employment and economic development or the commissioner's designee;\n(3) the commissioner of commerce or the commissioner's designee;\n(4) the commissioner of labor and industry or the commissioner's designee;\n(5) the commissioner of revenue or the commissioner's designee;\n(6) the executive secretary of the Public Utilities Commission or the secretary's designee;\n(7) the commissioner of the Pollution Control Agency or the commissioner's designee; and\n(8) the chancellor of the Minnesota State Colleges and Universities or the chancellor's designee.\nThe appointing authorities must appoint the members of the advisory committee by August 1, 2021. The commissioner of employment and economic development must convene the first meeting by September 1, 2021, and must act as chair until the advisory committee elects a chair at the first meeting.\nThe committee must elect a chair and vice-chair from among the voting members for terms of two years.\nAdvisory committee meetings are subject to chapter 13D.\nAn advisory committee member is prohibited from discussing or voting on issues relating to an organization in which the member has either a direct or indirect financial interest.\nThe advisory committee may accept gifts and grants on behalf of the state and that constitute donations to the state. Funds received under this subdivision are appropriated to the commissioner of employment and economic development to support the activities of the advisory committee.\nThe advisory committee must meet quarterly and submit an updated energy transition plan annually to the governor and the legislature. Once submitted, the committee shall develop a regular meeting schedule as needed. The chair may call additional meetings as necessary.\nThe Department of Employment and Economic Development shall serve as staff for the advisory committee.\nThis section expires on June 30, 2027.",
	"repealed": false
}