{
	"id": "609.5316",
	"url": "https://www.revisor.mn.gov/statutes/cite/609.5316",
	"title": "609.5316 SUMMARY FORFEITURES.",
	"text": "(a) Except as otherwise provided in this subdivision, if the property is contraband, the property must be summarily forfeited and either destroyed or used by the appropriate agency for law enforcement purposes. Upon summary forfeiture, weapons used must be destroyed by the appropriate agency unless the agency decides to use the weapons for law enforcement purposes or sell the weapons in a commercially reasonable manner to federally licensed firearms dealers, as defined in section 624.7161, subdivision 1. If a weapon is sold under this subdivision, the proceeds must be distributed under section 609.5315, subdivision 5 or 5b.\n(b) If the contraband property is a catalytic converter, the appropriate agency shall sell it to a scrap metal dealer or other business that may lawfully possess it under section 325E.21. The agency shall make reasonable efforts to determine whether the person from whom it was stolen can be identified. If able to do this, the agency shall forward the proceeds to that person. If unable to do this, the agency may keep 70 percent of the proceeds from the sale and forward the remaining 30 percent to the prosecutorial office that prosecuted the case resulting in the forfeiture. If the catalytic converter is not marked as required in section 325E.21, the agency shall mark it in a permanent manner, including but not limited to an engraving or permanent ink, indicating that the converter is recovered contraband.\n(a) Controlled substances listed in Schedule I that are possessed, transferred, sold, or offered for sale in violation of chapter 152 or 342, are contraband and must be seized and summarily forfeited. Controlled substances listed in Schedule I that are seized or come into the possession of peace officers, the owners of which are unknown, are contraband and must be summarily forfeited.\n(b) Species of plants from which controlled substances in Schedules I and II may be derived that have been planted or cultivated in violation of chapter 152 or of which the owners or cultivators are unknown, or that are wild growths, may be seized and summarily forfeited to the state. The appropriate agency or its authorized agent may seize the plants if the person in occupancy or in control of land or premises where the plants are growing or being stored fails to produce an appropriate registration or proof that the person is the holder of appropriate registration.\nWeapons used are contraband and must be summarily forfeited to the appropriate agency upon conviction of the weapon's owner or possessor for a controlled substance crime; for any offense of this chapter or chapter 624, or for a violation of an order for protection under section 518B.01, subdivision 14. Bullet-resistant vests, as defined in section 609.486, worn or possessed during the commission or attempted commission of a crime are contraband and must be summarily forfeited to the appropriate agency upon conviction of the owner or possessor for a controlled substance crime or for any offense of this chapter. Telephone cloning paraphernalia used in a violation of section 609.894, and automated sales suppression devices, phantom-ware, and other devices containing an automated sales suppression or phantom-ware device or software used in violation of section 289A.63, subdivision 12, are contraband and must be summarily forfeited to the appropriate agency upon a conviction. A catalytic converter possessed in violation of section 325E.21 is contraband and must be summarily forfeited to the appropriate agency upon a conviction.",
	"repealed": false
}