{
	"id": "626.8474",
	"url": "https://www.revisor.mn.gov/statutes/cite/626.8474",
	"title": "626.8474 AUTISM TRAINING.",
	"text": "(a) By January 1, 2021, the board shall prepare learning objectives for preservice and in-service training on ensuring safer interactions between peace officers and persons with autism. At a minimum, the objectives must address the following:\n(1) autism overview and behavioral understanding;\n(2) best practices for interventions and de-escalation strategies;\n(3) prevention and crisis reduction models; and\n(4) objective review of tools and technology available.\n(b) In developing the learning objectives, the board shall consult with, at a minimum:\n(1) individuals with autism;\n(2) family members of individuals with autism;\n(3) autism experts; and\n(4) peace officers.\n(a) The learning objectives developed pursuant to subdivision 1 must be included in the required curriculum of professional peace officer educational programs.\n(b) A person is not eligible to take the peace officer licensing examination after July 1, 2022, unless the individual has received the training described in paragraph (a).\nBeginning July 1, 2021, the chief law enforcement officer of every state and local law enforcement agency shall provide in-service autism training to every peace officer and part-time peace officer employed by the agency. The training must comply with the learning objectives developed and approved by the board and must meet board requirements for board-approved continuing education credit. The training must consist of at least four continuing education credits of the credits required under section 626.8469 within an officer's three-year licensing cycle. Each peace officer with a license renewal date after June 30, 2021, is not required to complete this training until the officer's next full three-year licensing cycle.\nThe head of every local and state law enforcement agency shall maintain written records of the agency's compliance with the requirements of subdivision 3. The documentation is subject to periodic review by the board, and must be made available to the board at its request.\nThe board may impose licensing sanctions and seek injunctive relief under section 214.11 for failure to comply with the requirements of this section.",
	"repealed": false
}