{
	"id": "319B.12",
	"url": "https://www.revisor.mn.gov/statutes/cite/319B.12",
	"title": "319B.12 TRANSITION PROVISIONS.",
	"text": "As used in this section:\n(1) \"professional corporation\" has the meaning given in section 319A.02, subdivision 4;\n(2) \"foreign professional corporation\" has the meaning given in 319A.02, subdivision 5; and\n(3) \"corporation\" has the meaning given in section 319A.02, subdivision 7.\nBeginning July 1, 1997, no Minnesota firm may organize under chapter 319A and no foreign firm may begin to operate under chapter 319A.\n(a) At any time before January 1, 1999, a professional corporation organized under chapter 319A and a foreign professional corporation governed by chapter 319A may elect to be governed by sections 319B.01 to 319B.12. To make that election, the professional corporation or foreign professional corporation must:\n(1) comply with section 319B.03, subdivision 2, or 319B.04, subdivision 2, whichever is applicable; and\n(2) amend, to the extent necessary to comply with sections 319B.01 to 319B.12, its organizational document, certificate of authority, or statement of qualification, as well as any agreements and other documents controlling the corporation's structure, governance, operations, and internal affairs.\n(b) Regardless of the date an electing professional corporation or foreign professional corporation actually makes its election under this subdivision, the electing professional corporation or foreign professional corporation may make the election effective as of January 1, 1997. Except as allowed by this paragraph, an election under this subdivision is effective on the date the electing professional corporation or foreign professional corporation complies with paragraph (a).\n(c) The law and documents that govern the structure, governance, operations, and other internal affairs of a professional corporation or foreign professional corporation when the corporation is deciding whether, when, and as of when to make an election under this subdivision control the manner of making those decisions.\n(a) Beginning January 1, 1999:\n(1) no professional corporation may operate under chapter 319A and no foreign professional corporation may operate under chapter 319A; and\n(2) chapter 319A ceases to apply to professional corporations and foreign professional corporations.\n(b) On January 1, 1999, a Minnesota professional corporation that has not elected to be governed by sections 319B.01 to 319B.12 will be considered to have made that election, and the professional corporation's purposes, as stated under section 319A.03, clause (2), will be considered to be the specification required by section 319B.03, subdivision 2, clause (3).\nThe continuation or completion of an act by a professional firm that had been a professional corporation or foreign professional corporation but elected to become a professional firm governed by this chapter and the continuation or performance of any executed or wholly or partially executory contract, conveyance, or transfer to or by the professional firm shall, if otherwise lawful before the professional firm became governed by this chapter, remain valid, and may be continued, completed, consummated, enforced, or terminated as required or as permitted by a statute applicable to the contract, conveyance, or transfer before January 1, 1997.",
	"repealed": false
}