{
	"id": "16A.695",
	"url": "https://www.revisor.mn.gov/statutes/cite/16A.695",
	"title": "16A.695 STATE BOND FINANCED PROPERTY.",
	"text": "(a) The definitions in this subdivision apply to this section.\n(b) \"State bond financed property\" means property acquired or bettered in whole or in part with the proceeds of state general obligation bonds authorized to be issued under article XI, section 5, clause (a), of the Minnesota Constitution.\n(c) \"Public officer or agency\" means a state officer or agency, the University of Minnesota, the Minnesota Historical Society, and any county, home rule charter or statutory city, school district, special purpose district, or other public entity, or any officer or employee thereof.\n(d) \"Fair market value\" means, with respect to the sale of state bond financed property, the price that would be paid by a willing and qualified buyer to a willing and qualified seller as determined by an appraisal of the property, or the price bid by a purchaser under a public bid procedure after reasonable public notice.\n(e) \"Outstanding state bonds\" means the dollar amount certified by the commissioner, upon the request of a public officer or agency, to be the principal amount of state bonds, including any refunding bonds, issued with respect to the state bond financed property, less the principal amount of state bonds paid or defeased before the date of the request.\n(a) A public officer or agency that is authorized by law to lease or enter into a management contract with respect to state bond financed property shall comply with this subdivision. A reference to a lease or management contract in this subdivision includes any amendments, modifications, or alterations to the referenced lease or management contract and refers to the lease wherein the public officer or agency is the lessor of the state bond financed property and the other contracting party is the lessee.\n(b) The lease or management contract may be entered into for the express purpose of carrying out a governmental program established or authorized by law and established by official action of the contracting public officer or agency, in accordance with orders of the commissioner intended to ensure the legality and tax-exempt status of bonds issued to finance the property, and with the approval of the commissioner. A lease or management contract must be for a term substantially less than the useful life of the property, but may allow renewal beyond that term upon a determination by the lessor that the lessee has demonstrated that the use continues to carry out the governmental program. If the lessor and lessee do not renew the lease or management contract and if the lessee has contributed to the land and the capital improvements on the state bond financed property, the lessor may agree to reimburse the lessee for its investment in the land and capital improvements. The reimbursement may be paid, at the option of the lessor and lessee, at the time of nonrenewal without a requirement for a prior escrow of funds or at a later date and on additional terms agreed to by the lessor and the lessee. A lease or management contract must be terminable by the contracting public officer or agency if the other contracting party defaults under the contract or if the governmental program is terminated or changed, and must provide for program oversight by the contracting public officer or agency. The expiration or termination of a lease or management agreement does not require that the state bond proceeds be repaid or that the property be sold, so long as the property continues to be operated by, or on behalf of, the public officer or agency for the intended governmental program. Money received by the public officer or agency under the lease or management contract that is not needed to pay and not authorized to be used to pay operating costs of the property, or to pay the principal, interest, redemption premiums, and other expenses when due on debt related to the property other than state bonds, must be:\n(1) paid to the commissioner in the same proportion as the state bond financing is to the total public debt financing for the property, excluding debt issued by a unit of government for which it has no financial liability;\n(2) deposited in the state bond fund; and\n(3) used to pay or redeem or defease bonds issued to finance the property in accordance with the commissioner's order authorizing their issuance.\nThe money paid to the commissioner is appropriated for this purpose.\n(c) With the approval of the commissioner, a lease or management contract between a city and a nonprofit corporation under section 471.191, subdivision 1, need not require the lessee to pay rentals sufficient to pay the principal, interest, redemption premiums, and other expenses when due with respect to state bonds issued to acquire and better the facilities.\nA public officer or agency shall not sell any state bond financed property unless the public officer or agency determines by official action that the property is no longer usable or needed by the public officer or agency to carry out the governmental program for which it was acquired or constructed, the sale is made as authorized by law, the sale is made for fair market value, and the sale is approved by the commissioner. If any state bonds issued to purchase or better the state bond financed property that is sold remain outstanding on the date of sale, the net proceeds of sale must be applied as follows:\n(1) if the state bond financed property was acquired and bettered solely with state bond proceeds, the net proceeds of sale must be paid to the commissioner and deposited in the state treasury; or\n(2) if the state bond financed property was acquired or bettered partly with state bond proceeds and partly with other money, the net proceeds of sale must be used: first, to pay to the state the amount of state bond proceeds used to acquire or better the property; second, to pay in full any outstanding public or private debt incurred to acquire or better the property; third, to pay interested public and private entities, other than any public officer or agency or any private lender already paid in full, the amount of money contributed to the acquisition or betterment of the property; and fourth, any excess over the amount needed for those purposes must be divided in proportion to the shares contributed to the acquisition or betterment of the property and paid to the interested public and private entities, other than any private lender already paid in full, and the proceeds are appropriated for this purpose. In calculating the share contributed by each entity, the amount to be attributed to the owner of the property shall be the fair market value of the property that was bettered by state bond proceeds at the time the betterment began.\nWhen all of the net proceeds of sale have been applied as provided in this subdivision, this section no longer applies to the property.\nNotwithstanding subdivision 3, this subdivision applies to the sale of state bond financed property by a lender that has provided money to acquire or better the property. Purchase by the lender in a foreclosure sale, acceptance of a deed in lieu of foreclosure, or enforcement of a security interest in personal property, by the lender, is not a sale. Following purchase by the lender, the lender shall not operate the property in a manner inconsistent with the governmental program established as provided in subdivision 2, paragraph (b). The lender shall exercise its best efforts to sell the property to a third party as soon as feasible following acquisition of marketable title to the property by the lender. A sale by the lender must be made as authorized by law and must be made for fair market value.\nThis section applies to all state bond financed property unless otherwise provided by law.\nRecipients of grants from money appropriated from the bond proceeds fund must demonstrate to the commissioner of the agency making the grant that the recipient has the ability and a plan to fund the program intended for the facility. A private nonprofit organization that leases or manages a facility acquired or bettered with grant money appropriated from the bond proceeds fund must demonstrate to the commissioner of the agency making the grant that the organization has the ability and a plan to fund the program intended for the facility.\nRecipients of grants from money appropriated from the bond proceeds fund may be required to demonstrate a commitment of money from nonstate sources. This matching money may be pledged payments that have been deposited into a segregated account or multiyear pledges that are converted into cash or cash equivalent through a loan or irrevocable letter of credit from a financial institution. The loan or irrevocable letter of credit may be secured by a lien on the state bond financed property.\nA public officer or agency, as lessee, may lease real property and improvements that are to be acquired or improved with state bond proceeds. The lease must be for a term equal to or longer than 125 percent of the useful life of the property. The expiration of the lease upon the end of its term does not require that the state be repaid or that the property be sold and upon the expiration the real property and improvements are no longer state bond financed property.\n(a) This section establishes requirements for the receipt and use of general obligation grants and the ownership and operation of state bond-financed property. General obligation grants may only be issued and used to finance the acquisition and betterment of public lands and buildings and other public improvements of a capital nature that are used to operate a governmental program, and for predesign and design activities for specifically identified projects that involve the operation of a governmental program or activity. A general obligation grant may not be used for general operating expenses, staffing, or general master planning. A public officer or agency that is the recipient of a general obligation grant must comply with this section in its use of the general obligation grant and operation, management, lease, and sale of state bond-financed property. A public officer or agency that uses the proceeds of a general obligation grant for any unauthorized purpose or in violation of this section must immediately repay the outstanding balance of the grant to the commissioner, and a failure to comply authorizes the commissioner to recover the outstanding balance as a setoff against any state aid provided to the public officer or agency.\n(b) This section does not create any new authority regarding the ownership, construction, rehabilitation, use, operation, lease management, or sale of state bond-financed property, or the operation of the governmental program that will be operated on the property. Any authority that is needed to enter into a management contract or lease of property, to sell property, or to operate a governmental program or carry out any activity contained in the law that appropriates money for a general obligation grant must be provided by as contained in some other law.\nAll general obligation grants must be evidenced by a grant agreement that specifies:\n(1) how the general obligation grant will be used;\n(2) the governmental program that will be operated on the state bond-financed property; and\n(3) that the state bond-financed property must be operated in compliance with this section, all state and federal laws, and in a manner that will not cause the interest on the state general obligation bonds to be or become subject to federal income taxation for any reason. A grant agreement must comply with this section, the Minnesota Constitution, and all commissioner's orders, and also contain other provisions the commissioner of the agency making the grant deems appropriate. The commissioner shall draft and make available forms for grant agreements that satisfy the requirements of this subdivision.",
	"repealed": false
}