{
	"id": "60K.44",
	"url": "https://www.revisor.mn.gov/statutes/cite/60K.44",
	"title": "60K.44 TAX CLEARANCE CERTIFICATE.",
	"text": "In addition to the provisions of section 60K.43, the commissioner may not issue or renew a license if the commissioner of revenue notifies the commissioner and the licensee or applicant for a license that the licensee or applicant owes the state delinquent taxes in the amount of $500 or more. The commissioner may issue or renew the license only if:\n(1) the commissioner of revenue issues a tax clearance certificate; and\n(2) the commissioner of revenue or the licensee or applicant forwards a copy of the clearance certificate to the commissioner.\nThe commissioner of revenue may issue a clearance certificate only if the licensee or applicant does not owe the state any uncontested delinquent taxes.\nFor purposes of this section, the following terms have the meanings given them:\n(1) \"taxes\" are all taxes payable to the commissioner of revenue, including penalties and interest due on those taxes; and\n(2) \"delinquent taxes\" do not include a tax liability if (i) an administrative or court action that contests the amount or validity of the liability has been filed or served, (ii) the appeal period to contest the tax liability has not expired, or (iii) the licensee or applicant has entered into a payment agreement to pay the liability and is current with the payments.\nIn lieu of the notice and hearing requirements of section 60K.43, when a licensee or applicant is required to obtain a clearance certificate under this section, a contested case hearing must be held if the licensee or applicant requests a hearing in writing to the commissioner of revenue within 30 days of the date of the notice provided in subdivision 1. The hearing must be held within 45 days of the date the commissioner of revenue refers the case to the Office of Administrative Hearings. Notwithstanding any law to the contrary, the licensee or applicant must be served with 20 days' notice in writing specifying the time and place of the hearing and the allegations against the licensee or applicant. The notice may be served personally or by mail.\nThe commissioner shall require all licensees or applicants to provide their Social Security number and Minnesota business identification number on all license applications. Upon request of the commissioner of revenue, the commissioner must provide to the commissioner of revenue a list of all licensees and applicants, including the name and address, Social Security number, and business identification number. The commissioner of revenue may request a list of the licensees and applicants no more than once each calendar year.",
	"repealed": false
}