{
	"id": "383B.117",
	"url": "https://www.revisor.mn.gov/statutes/cite/383B.117",
	"title": "383B.117 CERTIFICATES OF INDEBTEDNESS.",
	"text": "At any time after the first day of the year following the making of an annual tax levy, the county board may, by resolution and without public referendum, issue certificates of indebtedness in anticipation of the collection of taxes levied for any fund and not yet collected. The total of all certificates issued against any fund for any year with interest thereon until maturity, together with all orders outstanding against the fund, shall not exceed the total current taxes for the fund uncollected at the time of issuance plus the cash currently in the fund. If certificates are issued against the anticipated tax levy for any fund, any unpaid orders outstanding against the fund shall be redeemed from the proceeds of the certificates. All tax anticipation certificates shall be negotiable and shall be payable to the order of the payee and shall have a definite due date but may be payable on or before that date. No certificate shall be issued to become due and payable later than the first day of April of the year following the year of issuance. Certificates shall be sold for not less than par and accrued interest and shall bear interest at a rate that conforms to section 475.55, payable at maturity or at such earlier times as the board may determine. Each certificate shall state upon its face the fund for which the proceeds of the certificate shall be used, the total amount of the certificates so issued against the fund and the total amount embraced in the tax levy for that fund. They shall otherwise be issued on terms and conditions as the board may determine. The proceeds of the taxes assessed on account of the fund against which tax anticipation certificates are issued and the full faith and credit of the county shall be irrevocably pledged for the redemption of the certificate in the order of issuance against the fund.\nThe board may, by resolution and without public referendum, issue capital notes within existing debt limits for the purpose of purchasing ambulance and other medical equipment, road construction or maintenance equipment, public safety equipment, including projects that eliminate R-22, as defined in section 240A.09, paragraph (b), clause (2), and other capital equipment having an expected useful life at least equal to the term of the notes issued. The notes shall be payable in not more than 20 years and shall be issued on the terms and in the manner determined by the board. The total principal amount of the notes issued for any fiscal year shall not exceed one percent of the total annual budget for that year and shall be issued solely for the purchases authorized in this subdivision. A tax levy shall be made for the payment of the principal and interest on such notes as in the case of bonds. For purposes of this subdivision, \"equipment\" includes computer hardware and software, whether bundled with machinery or equipment or unbundled. For purposes of this subdivision, the term \"medical equipment\" includes computer hardware and software and other intellectual property for use in medical diagnosis, medical procedures, research, record keeping, billing, and other hospital applications, together with application development services and training related to the use of the computer hardware and software and other intellectual property, all without regard to their useful life. For purposes of determining the amount of capital notes which the county may issue in any year, the budget of the county and Hennepin Healthcare System, Inc. shall be combined and the notes issuable under this subdivision shall be in addition to obligations issuable under section 373.01, subdivision 3.\nThe board may, by resolution and without public referendum, issue certificates of indebtedness pursuant to section 475.754, to meet expenses incurred or to be incurred by reason of any natural disaster or other public emergency requiring the making of extraordinary expenditures.",
	"repealed": false
}