{
	"id": "524.5-411",
	"url": "https://www.revisor.mn.gov/statutes/cite/524.5-411",
	"title": "524.5-411 REQUIRED COURT APPROVAL.",
	"text": "(a) After notice to affected persons as provided in this section, and after hearing, and upon express authorization of the court, a conservator may:\n(1) make gifts;\n(2) convey, release, or disclaim contingent and expectant interests in property, including marital property rights and any right of survivorship incident to joint tenancy or tenancy by the entireties;\n(3) exercise or release a power of appointment;\n(4) create a revocable or irrevocable trust of property of the estate, whether or not the trust extends beyond the duration of the conservatorship, or to revoke or amend a trust revocable by the person subject to conservatorship;\n(5) subject to the terms of the plan document, contract, or agreement, exercise rights to elect options and change beneficiaries under insurance policies and annuities or surrender the policies and annuities for their cash value, and any change pursuant to this clause, shall invalidate the existing elections and beneficiary designations;\n(6) exercise any right to exempt property and an elective share in the estate of the deceased spouse of the person subject to conservatorship and to renounce or disclaim any interest by testate or intestate succession or by transfer inter vivos;\n(7) subject to the terms of the plan document, contract, or agreement, exercise rights to elect options and change beneficiaries under any qualified or nonqualified retirement plan including, but not limited to, defined benefit plans, defined contribution plans, plans governed by sections 401(k), 403, 408, or 457 of the Internal Revenue Code and the regulations thereto, and the right to exercise the options provided a plan participant or beneficiary under section 401 and related provisions of the Internal Revenue Code and the regulations thereto, and any change pursuant to this clause, shall invalidate the existing elections and beneficiary designations;\n(8) exercise the power to create, terminate, or alter the beneficial interests and beneficiaries of, a payable on death (POD) account, a transfer on death (TOD) security registration or account, or joint tenancy interests with rights of survivorship; and\n(9) make, amend, or revoke the will of the person subject to conservatorship.\n(b) Notice of any hearing pursuant to this section shall not be given pursuant to section 524.5-113. Notice of any hearing under this section shall be given to all affected persons, in plain language, and shall provide the time and place of the hearing and be given by mail postmarked at least 14 days before the hearing. Proof of notice must be made before or at the hearing and filed in the proceeding. For purposes of this section, notice to \"affected persons\":\n(1) shall always include (i) the person subject to conservatorship, (ii) the duly appointed conservator, (iii) the heirs-at-law of the person subject to conservatorship, (iv) any state agency or county social services agency paying benefits to or for the benefit of the person subject to conservatorship, (v) any state agency to which an application for benefits has been submitted and any state or county agency that has prepared an asset assessment or could prepare an asset assessment under section 256B.059, subdivision 2, for the person subject to conservatorship or spouse, and (vi) subject to the limitations of paragraph (c), all beneficiaries of the existing will or revocable trust of the person subject to conservatorship;\n(2) shall also include, subject to the limitations of paragraph (c), any person who has a beneficial vested or contingent interest that may be affected by the exercise of the power under this section; and\n(3) shall also include any other persons designated by the court.\n(c) For purposes of this section, when giving notice, or for purposes of giving consent or approval, or objecting with regard to any proceedings under this section, the sole holder or all coholders of a presently exercisable or testamentary general power of appointment, power of revocation, or unlimited power of withdrawal, under an existing will or trust, are deemed to represent and act for beneficiaries to the extent that their interests as objects, takers in default, or otherwise, are subject to the power.\n(d) A conservator, in making, amending, or revoking the will of the person subject to conservatorship, shall comply with sections 524.2-501 to 524.2-517 acting on behalf of the person subject to conservatorship.\n(e) The court, in exercising or in approving a conservator's exercise of the powers listed in paragraph (a), shall consider primarily the decision that the person subject to conservatorship would have made, to the extent that the decision can be ascertained. The court shall also consider:\n(1) the financial needs of the person subject to conservatorship and the needs of individuals who are dependent on the person subject to conservatorship for support and the interests of creditors;\n(2) possible effect on income, estate, gift, inheritance, or other tax liabilities;\n(3) eligibility for governmental assistance with the goal of avoiding reliance on such programs;\n(4) the previous pattern of giving or level of support of the person subject to conservatorship;\n(5) the existing estate plan;\n(6) the life expectancy of the person subject to conservatorship and the probability that the conservatorship will terminate before the death of the person subject to conservatorship;\n(7) whether the needs of the person subject to conservatorship can be met from the person's remaining assets after any transfer is made, taking into account the effect of any transfer on eligibility for medical assistance long-term care services; and\n(8) any other factors the court considers relevant.\n(f) If an affected person, as defined in this article, is a minor or an incapacitated person as defined by this article and has no guardian or conservator within the state, or if an affected person is unborn, unascertained, or a person whose identity or address is unknown to the petitioner, the court shall represent that person, unless the court, upon the application of the guardian, conservator, or any other affected person, appoints a guardian ad litem to represent the affected person.\n(g) Notwithstanding the power granted to the conservator by the court under this section, the conservator owes no duty to any person other than the person subject to conservatorship. The conservator shall not be held liable for the exercise or the failure to exercise, or the decision to exercise or the decision to decline to exercise, the powers granted by this section. The conservator, however, may be held liable to the estate of the person subject to conservatorship for gross negligence related to the implementation of any action approved by the court under this section.\n(h) The Uniform Guardianship and Protective Proceedings Act does not repeal section 524.2-215 as it applies to persons subject to guardianship, persons subject to conservatorship, or respondents, expressly or by implication. If there is a conflict between the act and section 524.2-215, section 524.2-215 controls and the guardian or conservator shall exercise the rights of the person subject to guardianship, person subject to conservatorship, or respondent under section 524.2-215 without the need for any court order.\n(i) Any documents or information disclosing or pertaining to health or financial information shall be filed as confidential documents, consistent with the bill of particulars under section 524.5-121.",
	"repealed": false
}