{
	"id": "471.656",
	"url": "https://www.revisor.mn.gov/statutes/cite/471.656",
	"title": "471.656 LIMITS ON BOND ISSUANCE FOR EXTRATERRITORIAL PROJECTS.",
	"text": "Notwithstanding any law to the contrary, neither a municipality nor an authority may issue obligations to finance the acquisition or improvement of real property located outside of the corporate boundaries of the issuer.\nSubdivision 1 does not apply if:\n(1) the issuing governmental unit is the owner of the property to be financed; or\n(2) for property or two or more properties constituting a single project located in a city, the governing body of the city consents, by resolution, to issuance of the obligations; or\n(3) for property or two or more properties constituting a single project located outside of a city or in two or more cities or towns, the governing body of the county in which the property is located consents, by resolution, to issuance of the obligations; or\n(4) the obligations are issued under a joint powers agreement, whether issued by a joint powers board or by one or more of the parties to the joint powers agreement, and the property is located entirely within the boundaries of one or more of the parties to the joint powers agreement; or\n(5) the issuer is a municipality or municipalities acting under a joint powers agreement and the financing is for the acquisition or improvement of property, facilities, or rights of use or access thereto which are necessary or useful in the operation of municipal public utilities; or\n(6) the issuer is a municipal power agency established under chapter 453 or a municipal gas agency established under chapter 453A.\n(a) The definitions in section 475.51 apply to this section and the following terms have the meanings given in this subdivision.\n(b) \"Authority\" means, whether created under general or special law:\n(1) a housing and redevelopment authority;\n(2) an economic development authority;\n(3) a port authority;\n(4) a rural development financing authority; or\n(5) other similar local government entities that are authorized by law to issue obligations.\n(c) \"Municipal public utilities\" means the provision by a municipality of electricity, natural gas, water, wastewater removal and treatment, telecommunications, district heating, or cable television and related services.\n(d) \"Owner of the property\" means the entity or entities that are the fee or equitable owners and that are economically at risk with regard to the property.\n(e) \"Real property\" includes an easement and improvements made to a leasehold of real property.",
	"repealed": false
}