{
	"id": "122A.07",
	"url": "https://www.revisor.mn.gov/statutes/cite/122A.07",
	"title": "122A.07 PROFESSIONAL EDUCATOR LICENSING AND STANDARDS BOARD MEMBERSHIP.",
	"text": "The Professional Educator Licensing and Standards Board consists of 13 members appointed by the governor, with the advice and consent of the senate. Membership terms, removal of members, the filling of membership vacancies, and fiscal year and reporting requirements are as provided in sections 214.07 to 214.09. No member may be reappointed for more than one additional term.\nEach appointee, other than a public nominee, must be selected on the basis of professional experience and knowledge of teacher education, accreditation, and licensure. The board must be composed of:\n(1) seven teachers who are currently teaching in a Minnesota school, have at least five years of teaching experience, and are not serving in a position requiring an administrative license, pursuant to section 122A.14. The seven teachers must include the following:\n(i) one teacher in a charter school;\n(ii) two teachers from a school located in the seven-county metropolitan area, as defined in section 473.121, subdivision 2;\n(iii) two teachers from a school located outside the seven-county metropolitan area;\n(iv) one teacher from a related service category licensed by the board; and\n(v) one special education teacher;\n(2) two teachers currently teaching in a board-approved teacher preparation program;\n(3) one superintendent, alternating each term between a superintendent from a school district in the seven-county metropolitan area, as defined in section 473.121, subdivision 2, and a superintendent from a school district outside the metropolitan area;\n(4) one educator who oversees a special education program and who works closely with a cooperative unit under section 123A.24, subdivision 2;\n(5) one principal, alternating each term between an elementary and a secondary school principal; and\n(6) one member of the public that may be a current or former school board member.\nMS 2022 [Repealed, 2023 c 55 art 5 s 67]\nWith the exception of a teacher who retires from teaching during the course of completing a board term, the position of a member who leaves Minnesota or whose employment status changes to a category different from that from which appointed is deemed vacant.\n(a) The review and processing of complaints; the setting of fees; the selection and duties of an executive director to serve the board; and other provisions relating to board operations not provided in this chapter are as provided in chapter 214. Membership terms, except as provided in subdivision 2a, removal of members, the filling of membership vacancies, and fiscal year and reporting requirements are as provided in sections 214.07 to 214.09.\n(b) Board members must receive a stipend of up to $4,800 annually, prorated monthly, during each year of service on the board.\n(a) The executive director of the board shall be the chief administrative officer for the board but shall not be a member of the board. The executive director shall maintain the records of the board, account for all fees received by the board, supervise and direct employees servicing the board, and perform other services as directed by the board.\n(b) The Department of Administration must provide administrative support in accordance with section 16B.371. The commissioner of administration must assess the board for services it provides under this section.\nThe Professional Educator Licensing and Standards Board must reimburse local school districts for the costs of substitute teachers employed when regular teachers are providing professional assistance to the state by serving on the board or on a committee or task force appointed by the board and charged to make recommendations concerning standards for teacher licensure in this state.\n(a) The public employer of a member must not reduce the member's compensation or benefits because of the member's absence from employment when engaging in the business of the board.\n(b) The public employer of a member must grant the member time off to join board meetings, committee meetings, and board retreats.",
	"repealed": false
}