{
	"id": "56.12",
	"url": "https://www.revisor.mn.gov/statutes/cite/56.12",
	"title": "56.12 ADVERTISING; TAKING OF SECURITY; PLACE OF BUSINESS.",
	"text": "No licensee shall advertise, print, display, publish, distribute, or broadcast, or cause or permit to be advertised, printed, displayed, published, distributed, or broadcast, in any manner any statement or representation with regard to the rates, terms, or conditions for the lending of money, credit, goods, or things in action which is false, misleading, or deceptive. The commissioner may order any licensee to desist from any conduct which the commissioner shall find to be a violation of the foregoing provisions.\nThe commissioner may require that rates of charge, if stated by a licensee, be stated fully and clearly in such manner as the commissioner may deem necessary to prevent misunderstanding thereof by prospective borrowers. In lieu of the disclosure requirements of this section and section 56.14, a licensee may give the disclosures required by the federal Truth-in-Lending Act.\nA licensee may take a lien upon real estate as security for any loan exceeding $8,208 in principal amount made under this chapter. The provisions of sections 47.20 and 47.21 do not apply to loans made under this chapter, except as provided in this section. No loan secured by a first lien on a borrower's primary residence shall be made pursuant to this section if the proceeds of the loan are used to finance the purchase of the borrower's primary residence, unless:\n(1) the proceeds of the loan are used to finance the purchase of a manufactured home or a prefabricated building; or\n(2) the proceeds of the loan are used in whole or in part to satisfy the balance owed on a contract for deed.\nIf the proceeds of the loan are used to finance the purchase of the borrower's primary residence, the licensee shall consent to the subsequent transfer of the real estate if the existing borrower continues after transfer to be obligated for repayment of the entire remaining indebtedness. The licensee shall release the existing borrower from all obligations under the loan instruments, if the transferee (1) meets the standards of credit worthiness normally used by persons in the business of making loans, including but not limited to the ability of the transferee to make the loan payments and satisfactorily maintain the property used as collateral, and (2) executes an agreement in writing with the licensee whereby the transferee assumes the obligations of the existing borrower under the loan instruments. Any such agreement shall not affect the priority, validity or enforceability of any loan instrument. A licensee may charge a fee not in excess of one-tenth of one percent of the remaining unpaid principal balance in the event the loan is assumed by the transferee and the existing borrower continues after the transfer to be obligated for repayment of the entire assumed indebtedness. A licensee may charge a fee not in excess of one percent of the remaining unpaid principal balance in the event the remaining indebtedness is assumed by the transferee and the existing borrower is released from all obligations under the loan instruments, but in no event shall the fee exceed $456.\nA licensee making a loan under this chapter secured by a lien on real estate shall comply with the requirements of section 47.20, subdivision 8.\nNo licensee shall conduct the business of making loans under this chapter within any office, room, or place of business in which any other business is solicited or engaged in, or in association or conjunction therewith, if the commissioner finds that the character of the other business is such that it would facilitate evasions of this chapter or of the rules lawfully made hereunder. The commissioner may promulgate rules dealing with such other businesses.\nNo licensee shall transact the business or make any loan provided for by this chapter under any other name or at any other place of business than that named in the license. No licensee shall take any confession of judgment or any power of attorney. No licensee shall take any note or promise to pay that does not accurately disclose the principal amount of the loan, the time for which it is made, and the agreed rate or amount of charge, nor any instrument in which blanks are left to be filled in after execution. Nothing herein is deemed to prohibit the making of loans by mail or arranging for settlement and closing of real estate secured loans by an unrelated qualified closing agent at a location other than the licensed location.",
	"repealed": false
}