{
	"id": "169.306",
	"url": "https://www.revisor.mn.gov/statutes/cite/169.306",
	"title": "169.306 USE OF SHOULDERS BY BUSES.",
	"text": "(a) A road authority, as defined in section 160.02, subdivision 25, is authorized to permit transit buses and Metro Mobility buses use of a shoulder, as designated by the road authority, of a freeway or expressway, as defined in section 160.02, in Minnesota.\n(b) If a road authority permits the use of a freeway or expressway shoulder by transit buses, the road authority shall permit the use on that shoulder of a bus (1) with a seating capacity of 40 passengers or more operated by a motor carrier of passengers, as defined in section 221.012, subdivision 26, while operating in intrastate commerce or (2) providing regular route transit service, as defined in section 174.22, subdivision 8, or Metro Mobility services, and operated by or under contract with the Metropolitan Council, a local transit authority, or a transit authority created by the legislature. Drivers of these buses must have adequate training in the requirements of paragraph (c), as determined by the commissioner.\n(c) Buses authorized to use the shoulder under this section may be operated on the shoulder only when main-line traffic speeds are less than 35 miles per hour, except as provided for in paragraph (f). Drivers of buses being operated on the shoulder may not exceed the speed of main-line traffic by more than 15 miles per hour and may never exceed 35 miles per hour, except as provided for in paragraph (f). Drivers of buses being operated on the shoulder must yield to merging, entering, and exiting traffic and must yield to other vehicles on the shoulder. Buses operated on the shoulder must be registered with the Department of Transportation.\n(d) For the purposes of this section, the term \"Metro Mobility bus\" means a motor vehicle of not less than 20 feet in length engaged in providing special transportation services under section 473.386 that is:\n(1) operated by or under contract with a public or private entity receiving financial assistance to provide transit services from the Metropolitan Council or the commissioner of transportation; and\n(2) authorized by a road authority to use freeway or expressway shoulders.\n(e) This section does not apply to the operation of buses on dynamic shoulder lanes.\n(f) The commissioner may authorize different operating conditions and maximum speeds, not to exceed the posted speed limit, based upon an engineering study and recommendation by the road authority. The engineering study must be conducted by the road authority and must conform with the manual and specifications adopted under section 169.06, subdivision 1, and applicable state and federal standards. The road authority shall consult the public transit operator before recommending operating conditions different from those authorized by law.",
	"repealed": false
}