{
	"id": "245.4682",
	"url": "https://www.revisor.mn.gov/statutes/cite/245.4682",
	"title": "245.4682 MENTAL HEALTH SERVICE DELIVERY AND FINANCE REFORM.",
	"text": "The commissioner of human services shall undertake a series of reforms to address the underlying structural, financial, and organizational problems in Minnesota's mental health system with the goal of improving the availability, quality, and accountability of mental health care within the state.\n(a) In the design and implementation of reforms to the mental health system, the commissioner shall:\n(1) consult with consumers, families, counties, tribes, advocates, providers, and other stakeholders;\n(2) bring to the legislature, and the State Advisory Council on Mental Health, by January 15, 2008, recommendations for legislation to update the role of counties and to clarify the case management roles, functions, and decision-making authority of health plans and counties, and to clarify county retention of the responsibility for the delivery of social services as required under subdivision 3, paragraph (a);\n(3) withhold implementation of any recommended changes in case management roles, functions, and decision-making authority until after the release of the report due January 15, 2008;\n(4) ensure continuity of care for persons affected by these reforms including ensuring client choice of provider by requiring broad provider networks and developing mechanisms to facilitate a smooth transition of service responsibilities;\n(5) provide accountability for the efficient and effective use of public and private resources in achieving positive outcomes for consumers;\n(6) ensure client access to applicable protections and appeals; and\n(7) make budget transfers necessary to implement the reallocation of services and client responsibilities between counties and health care programs that do not increase the state and county costs and efficiently allocate state funds.\n(b) When making transfers under paragraph (a) necessary to implement movement of responsibility for clients and services between counties and health care programs, the commissioner, in consultation with counties, shall ensure that any transfer of state grants to health care programs, including the value of case management transfer grants under section 256B.0625, subdivision 20, does not exceed the value of the services being transferred for the latest 12-month period for which data is available. The commissioner may make quarterly adjustments based on the availability of additional data during the first four quarters after the transfers first occur. If case management transfer grants under section 256B.0625, subdivision 20, are repealed and the value, based on the last year prior to repeal, exceeds the value of the services being transferred, the difference becomes an ongoing part of each county's adult mental health grants under sections 245.4661 and 256K.10.\n(c) This appropriation is not authorized to be expended after December 31, 2010, unless approved by the legislature.\n(a) Consistent with section 256B.69 and chapter 256L, the commissioner is authorized to solicit, approve, and implement up to three projects to demonstrate the integration of physical and mental health services within prepaid health plans and their coordination with social services. The commissioner shall require that each project be based on locally defined partnerships that include at least one health maintenance organization, community integrated service network, or accountable provider network authorized and operating under chapter 62D, 62N, or 62T, or county-based purchasing entity under section 256B.692 that is eligible to contract with the commissioner as a prepaid health plan, and the county or counties within the service area. Counties shall retain responsibility and authority for social services in these locally defined partnerships.\n(b) The commissioner, in consultation with consumers, families, and their representatives, shall:\n(1) determine criteria for approving the projects and use those criteria to solicit proposals for preferred integrated networks. The commissioner must develop criteria to evaluate the partnership proposed by the county and prepaid health plan to coordinate access and delivery of services. The proposal must at a minimum address how the partnership will coordinate the provision of:\n(i) client outreach and identification of health and social service needs paired with expedited access to appropriate resources;\n(ii) activities to maintain continuity of health care coverage;\n(iii) children's residential mental health treatment and treatment foster care;\n(iv) court-ordered assessments and treatments;\n(v) prepetition screening and commitments under chapter 253B;\n(vi) assessment and treatment of children identified through mental health screening of child welfare and juvenile corrections cases;\n(vii) home and community-based waiver services;\n(viii) assistance with finding and maintaining employment;\n(ix) housing; and\n(x) transportation;\n(2) determine specifications for contracts with prepaid health plans to improve the plan's ability to serve persons with mental health conditions, including specifications addressing:\n(i) early identification and intervention of physical and behavioral health problems;\n(ii) communication between the enrollee and the health plan;\n(iii) facilitation of enrollment for persons who are also eligible for a Medicare special needs plan offered by the health plan;\n(iv) risk screening procedures;\n(v) health care coordination;\n(vi) member services and access to applicable protections and appeal processes;\n(vii) specialty provider networks;\n(viii) transportation services;\n(ix) treatment planning; and\n(x) administrative simplification for providers;\n(3) begin implementation of the projects no earlier than January 1, 2009, with not more than 40 percent of the statewide population included during calendar year 2009 and additional counties included in subsequent years;\n(4) waive any administrative rule not consistent with the implementation of the projects;\n(5) allow potential bidders at least 90 days to respond to the request for proposals; and\n(6) conduct an independent evaluation to determine if mental health outcomes have improved in that county or counties according to measurable standards designed in consultation with the advisory body established under this subdivision and reviewed by the State Advisory Council on Mental Health.\n(c) Notwithstanding any statute or administrative rule to the contrary, the commissioner may enroll all persons eligible for medical assistance with serious mental illness or emotional disturbance in the prepaid plan of their choice within the project service area unless:\n(1) the individual is eligible for home and community-based services for persons with developmental disabilities and related conditions under section 256B.092; or\n(2) the individual has a basis for exclusion from the prepaid plan under section 256B.69, subdivision 4, other than disability, mental illness, or emotional disturbance.\n(d) The commissioner shall involve organizations representing persons with mental illness and their families in the development and distribution of information used to educate potential enrollees regarding their options for health care and mental health service delivery under this subdivision.\n(e) If the person described in paragraph (c) does not elect to remain in fee-for-service medical assistance, or declines to choose a plan, the commissioner may preferentially assign that person to the prepaid plan participating in the preferred integrated network. The commissioner shall implement the enrollment changes within a project's service area on the timeline specified in that project's approved application.\n(f) A person enrolled in a prepaid health plan under paragraphs (c) and (d) may disenroll from the plan at any time.\n(g) The commissioner, in consultation with consumers, families, and their representatives, shall evaluate the projects begun in 2009, and shall refine the design of the service integration projects before expanding the projects. The commissioner shall report to the chairs of the legislative committees with jurisdiction over mental health services by March 1, 2008, on plans for evaluation of preferred integrated networks established under this subdivision.\n(h) The commissioner shall apply for any federal waivers necessary to implement these changes.\n(i) Payment for Medicaid service providers under this subdivision for the months of May and June will be made no earlier than July 1 of the same calendar year.",
	"repealed": false
}