{
	"id": "12A.07",
	"url": "https://www.revisor.mn.gov/statutes/cite/12A.07",
	"title": "12A.07 EMPLOYMENT AND ECONOMIC DEVELOPMENT.",
	"text": "As used in this section, \"commissioner\" means the commissioner of employment and economic development. The commissioner may use state appropriations for grants to local units of government for locally administered grants or loan programs as provided in this section for assistance to eligible organizations directly and adversely affected by the disaster. Funds may be used only to address physical damage to buildings and such personal property as machinery, equipment, fixtures, and furniture. A loan may not duplicate or replace equivalent assistance available from insurance, other organizations, or government agencies.\nCriteria and requirements must be locally established with the approval of the commissioner. Local plans must specify the type of assistance to be provided to eligible organizations. Within the limits of the available grant amounts, assistance may be provided as loans with or without interest and as forgivable loans. The criteria must, at a minimum, specify that an organization receiving a forgivable loan must remain in the local community a minimum of five years after the date of the loan, after which the amount of loan forgiveness must follow a schedule provided by the commissioner for an additional five years. Loans made under this section must not be used to refinance debt that existed on the date of the disaster. Repayment of loan amounts is made to the local community consistent with subdivision 6. All assistance awards under this section must meet the requirements of section 116J.8731, subdivision 9.\nAssistance through a local grant agreement may be provided to businesses, cooperatives, utilities, and nonprofit organizations including, but not limited to, those that provide residential, health care, child care, social, or other services on behalf of the Department of Human Services to residents of the disaster area.\nThe expenditure of any national emergency grant from the United States Department of Labor for a disaster is approved and the amount of the grant is appropriated to the commissioner for the purposes for which it was received.\nTo ensure the efficient use of disaster money, the commissioner must encourage contractors working on projects funded under this chapter to hire employees who are available through a grant under this subdivision, to the extent practicable.\nFor the purposes of subdivisions 1 to 4, sections 116J.8731, subdivisions 3, 4, 5, and 7; 116J.993; 116J.994; and 116J.995 are waived. Businesses that receive grants or loans under this subdivision must set goals for jobs retained and wages paid within the disaster area.\nAny repayments of loans to the local government unit under this section shall be forwarded to the commissioner and deposited in the disaster contingency account in section 116J.8731, subdivision 8.",
	"repealed": false
}