{
	"id": "137.022",
	"url": "https://www.revisor.mn.gov/statutes/cite/137.022",
	"title": "137.022 PERMANENT UNIVERSITY FUND.",
	"text": "The investment management of the permanent university fund shall be under the jurisdiction of the Board of Regents of the University of Minnesota, subject to any limitations imposed by the Constitution of the state of Minnesota, article XI, section 9. All securities and cash held in the state treasury credited to the permanent university fund that are unappropriated or unencumbered are transferred and appropriated to the Board of Regents of the University of Minnesota solely for the purpose of investment by them. The investments are restricted to those the State Board of Investment may invest in under section 11A.24.\nAll income from the permanent university fund is appropriated annually to the Board of Regents. Authority over this income is vested solely in the board but must be used by the board directly to enhance the mission of the university. This appropriation of income must not be used to reduce other appropriations made to the Board of Regents. The determination of this income shall be based on the procedures detailed in section 11A.16, subdivision 5, or 11A.12.\n(a) For purposes of this section, the permanent university fund has three accounts. The sources of the money in the endowed mineral research and scholarship accounts are set out in paragraph (b) and subdivision 4. All money in the fund that is not otherwise allocated is in the endowed chair account. The income from the endowed chair account must be used, and capital gains allocated to that account may be used, to provide endowment support for professorial chairs in academic disciplines. The endowment support for the chairs from the income and the capital gains must not total more than six percent per year of the 36-month trailing average market value of the endowed chair account of the fund, as computed quarterly or otherwise as directed by the regents. The endowment support from the income and the capital gains must not provide more than half the sum of the endowment support for all university chairs and professorships endowed, with nonstate sources providing the remainder. The endowment support from the income and the capital gains may provide more than half the endowment support of an individual chair.\n(b) If any portion of the annual appropriation of the income is not used for the purposes specified in paragraph (a) or subdivision 4, that portion lapses and must be added to the principal of the three accounts of the permanent university fund in proportion to the market value of each account.\n(a) All income credited after July 1, 1992, to the permanent university fund from royalties for mining under state mineral leases from and after July 1, 1991, must be allocated as provided in this subdivision.\n(b)(1) Beginning January 1, 2013, 50 percent of the income must be allocated according to this paragraph. One-half of the income under this paragraph, up to $50,000,000, must be credited to the mineral research account of the fund to be allocated for the Natural Resources Research Institute-Duluth and Coleraine facilities, for mineral and mineral-related research including mineral-related environmental research. The other one-half of the income under this paragraph, up to $25,000,000, is credited to an endowment for the costs of operating mining, mineral, mineral-related, or science, technology, engineering, and mathematics (STEM) degree programs offered through the University of Minnesota at Minnesota North College and the Swenson College of Science and Engineering at Duluth to support workforce development and collaborations benefiting regional academics, industry, and natural resources on the Iron Range in northeast Minnesota and for scholarships for Minnesota students, prioritizing students in the Minnesota Economic Development Region 3, to attend the mining, mineral, mineral-related, or STEM programs. The maximum scholarship awarded to attend the degree programs funded under this paragraph cannot exceed 75 percent of current resident tuition rates per academic year and may be awarded a maximum of four academic years.\n(2) The remainder of the income under paragraph (a) plus the amount of any income under clause (1) after $50,000,000 has been credited to the mineral research account for the Natural Resources Research Institute and the amount of any income over the $25,000,000 for the programming in clause (1) must be credited to the endowed scholarship account of the fund for distribution annually for scholastic achievement as provided by the Board of Regents to undergraduates enrolled at the University of Minnesota who are resident students as defined in section 136A.101, subdivision 8.\n(c) The annual distribution from the endowed scholarship account must be allocated to the various campuses of the University of Minnesota in proportion to the number of undergraduate resident students enrolled on each campus.\n(d) The Board of Regents must report to the education committees of the legislature biennially at the time of the submission of its budget request on the disbursement of money from the endowed scholarship account and to the environment and natural resources committees on the use of the mineral research account.\n(e) Capital gains and losses and portfolio income of the permanent university fund must be credited to its three accounts in proportion to the market value of each account.\n(f) The endowment support from the income and capital gains of the endowed mineral research and endowed scholarship accounts of the fund must not total more than six percent per year of the 36-month trailing average market value of the account from which the support is derived.",
	"repealed": false
}