{
	"id": "469.057",
	"url": "https://www.revisor.mn.gov/statutes/cite/469.057",
	"title": "469.057 PORT CONTROL BY OTHERS; PETITION; INTERVENTION.",
	"text": "Unless otherwise provided by law, all laws now or hereafter vesting jurisdiction or control in the Department of Public Service or a successor agency of the state of Minnesota, in the Interstate Commerce Commission or a successor agency, if any, or Department of Defense of the United States, or in similar regulatory bodies shall apply to any transportation, terminal, or other facility owned, operated, leased, or controlled by the port authority with the same force and effect as if the transportation, terminal, or other facility were owned, operated, leased, or controlled by a private corporation.\nNeither the Department of Public Service nor a successor agency, if any, has jurisdiction over a seaway port authority for the following matters to the extent they are connected with handling interstate commerce:\n(1) charges for stevedoring of vessels;\n(2) receiving and delivering cargo for vessels;\n(3) car and truck unloading and loading cargo for vessels;\n(4) watching cargo for vessels;\n(5) charges to vessels for use of facilities;\n(6) charges against railroad, trucking companies or shippers for use of facilities; and\n(7) delivery and warehouse charges for cargo to and from and in warehouses on seaway port authority property.\nA port authority may petition a public body of any kind or level having jurisdiction of the matter, for any relief, rates, rule, or action that the port authority believes will improve the handling of commerce in and through the port or improve terminal and transportation facilities in the port. The port authority may join with another authority sharing its port in making the petition. A port authority also may intervene before any public body in a proceeding affecting the commerce of the port. In the proceeding, the port authority is one of the official representatives of the port district along with other interested persons.",
	"repealed": false
}