{
	"id": "16C.054",
	"url": "https://www.revisor.mn.gov/statutes/cite/16C.054",
	"title": "16C.054 ACCOMMODATION FOR HARD-OF-HEARING IN STATE-FUNDED CAPITAL PROJECTS.",
	"text": "For purposes of this section, \"public gathering space\" means a space that is constructed or renovated as part of the project: (1) that accommodates and is intended to be used for gatherings of 15 or more people; and (2) in which audible communications are integral to a use of the space.\nNo commissioner or agency head may approve a contract or grant state funds for a capital improvement project to construct or renovate a public gathering space in a building unless:\n(1) the project includes equipping the public gathering space, if the public gathering space has or will have a permanent audio-amplification system, with audio-induction loops to provide an electromagnetic signal for hearing aids and cochlear implants; and\n(2) the project includes meeting the American National Standards Institute Acoustical Performance Criteria, Design Requirements and Guidelines for Schools on maximum background noise level and reverberation times in the public gathering space.\nA commissioner or agency head may approve a contract or grant state funds for a capital improvement project to construct or renovate a building that does not meet a requirement of subdivision 2, when the commissioner or agency head determines that meeting that requirement is not feasible, is in conflict with other requirements in law, is in conflict with other project requirements, or that costs outweigh the benefits. The commissioner must consult with the Commission of the Deaf, DeafBlind and Hard of Hearing before making the determination.\nA commissioner or agency head who determines a contract is exempt under subdivision 3 must report the exemption to the Commission of the Deaf, DeafBlind and Hard of Hearing within three months of making the determination. The chair of the Commission of the Deaf, DeafBlind and Hard of Hearing shall submit a report to the chairs and ranking minority members of the committees in the house of representatives and senate with jurisdiction over state contracting by January 30 of even-numbered years beginning in 2020 identifying each exemption reported in the previous two calendar years.",
	"repealed": false
}