{
	"id": "60A.123",
	"url": "https://www.revisor.mn.gov/statutes/cite/60A.123",
	"title": "60A.123 VALUATION PROCEDURE.",
	"text": "An insurer shall value its commercial mortgage loans and real estate acquired through foreclosure of commercial mortgage loans as provided in this section for the purpose of establishing a valuation allowance or fair values of the investments and for statutory accounting purposes.\nA performing mortgage loan must be carried at its amortized acquisition cost.\n(a) The insurer shall make an evaluation of the appropriate fair value of its commercial mortgage loans which it classifies as distressed mortgage loans. The fair value must be based upon one or more of the following procedures:\n(1) an internal appraisal;\n(2) an appraisal made by an independent appraiser;\n(3) the value of guarantees or other credit enhancements related to the loan.\n(b) The insurer will determine the fair value of its distressed mortgage loans through an evaluation of each specific distressed mortgage loan. The fair value must be based upon an internal appraisal or an appraisal conducted by an independent appraiser.\n(c) For distressed mortgage loans, the insurer shall measure impairment based on the fair value of the collateral less estimated costs to obtain and sell. A valuation allowance should be established for the difference between the adjusted fair value of the collateral and the amortized acquisition cost of its distressed mortgage loans.\n(a) The insurer shall make an evaluation of the appropriate fair value of each delinquent mortgage loan. The fair value must be based upon one or more of the following procedures:\n(1) an internal appraisal;\n(2) an appraisal by an independent appraiser;\n(3) the value of guarantees or other credit enhancements related to the loan.\n(b) The insurer shall either take a charge against its surplus or establish a reserve for the difference between the fair value and the amortized acquisition cost of its delinquent mortgage loans.\n(a) The insurer shall make an evaluation of the appropriate fair value of each restructured mortgage loan. The fair value must be based upon one or more of the following procedures:\n(1) an internal appraisal;\n(2) an appraisal by an independent appraiser;\n(3) the value of guarantees or other credit enhancements related to the loan.\n(b) The insurer shall measure impairment based on the fair value of the collateral less estimated costs to obtain and sell. The difference between the adjusted fair value of the collateral and other assets received and the amortized acquisition cost of its restructured mortgage loans must be recorded as a direct write-down and a new cost basis established.\n(a) The insurer shall make an evaluation of the appropriate fair value of each mortgage loan in foreclosure. The fair value must be based upon an appraisal made by an independent appraiser and must be adjusted for additional expenses, such as insurance, taxes, and legal fees that have been imposed to protect the investment or to obtain clear title to the property to the extent these amounts are expected to be recoverable from the disposition of the property.\n(b) The insurer shall record as a direct write-down the difference between the fair value and the amortized acquisition cost of its mortgage loans in the process of foreclosure.\n(a) The insurer shall make an evaluation of the appropriate fair value of real estate owned. The fair value must be based upon an appraisal made by an independent appraiser and must be adjusted for additional expenses, such as insurance, taxes, and legal fees that have been imposed to protect the investment or to obtain clear title to the property to the extent these amounts are expected to be recoverable from the disposition of the property.\n(b) The insurer shall record as a direct write-down the difference between the fair value and the amortized acquisition cost of real estate owned.",
	"repealed": false
}