{
	"id": "144.4172",
	"url": "https://www.revisor.mn.gov/statutes/cite/144.4172",
	"title": "144.4172 DEFINITIONS.",
	"text": "\"Carrier\" means a person who serves as a potential source of infection and who harbors or who the commissioner reasonably believes to be harboring a specific infectious agent whether or not there is present discernible clinical disease. In the absence of a medically accepted test, the commissioner may reasonably believe an individual to be a carrier only when a determination based upon specific facts justifies an inference that the individual harbors a specific infectious agent.\n\"Communicable disease\" means a disease or condition that causes serious illness, serious disability, or death, the infectious agent of which may pass or be carried, directly or indirectly, from the body of one person to the body of another.\n\"Commissioner\" means the commissioner of health.\n\"Contact notification program\" means an ongoing program established by the commissioner to encourage carriers of a communicable disease whose primary route of transmission is through an exchange of blood, semen, or vaginal secretions, such as treponema pallidum, neisseria gonorrhea, chlamydia trachomatis, and human immunodeficiency virus, to identify others who may be at risk by virtue of contact with the carrier.\n\"Directly transmitted\" means predominately:\n(1) sexually transmitted;\n(2) bloodborne; or\n(3) transmitted through direct or intimate skin contact.\n\"Health directive\" means a written statement, or, in urgent circumstances, an oral statement followed by a written statement within three days, from the commissioner, or community health board as defined in section 145A.02, subdivision 5, with delegated authority from the commissioner, issued to a carrier who constitutes a health threat to others. A health directive must be individual, specific, and cannot be issued to a class of persons. The directive may require a carrier to cooperate with health authorities in efforts to prevent or control transmission of communicable disease, including participation in education, counseling, or treatment programs, and undergoing medical tests necessary to verify the person's carrier status. The written directive shall be served in the same manner as a summons and complaint under the Minnesota Rules of Civil Procedure.\n\"Licensed health professional\" means a person licensed in Minnesota to practice those professions described in section 214.01, subdivision 2.\n\"Health threat to others\" means that a carrier demonstrates an inability or unwillingness to act in such a manner as to not place others at risk of exposure to infection that causes serious illness, serious disability, or death. It includes one or more of the following:\n(1) With respect to an indirectly transmitted communicable disease:\n(i) behavior by a carrier which has been demonstrated epidemiologically to transmit or which evidences a careless disregard for the transmission of the disease to others; or\n(ii) a substantial likelihood that a carrier will transmit a communicable disease to others as is evidenced by a carrier's past behavior, or by statements of a carrier that are credible indicators of a carrier's intention.\n(2) With respect to a directly transmitted communicable disease:\n(i) repeated behavior by a carrier which has been demonstrated epidemiologically to transmit or which evidences a careless disregard for the transmission of the disease to others;\n(ii) a substantial likelihood that a carrier will repeatedly transmit a communicable disease to others as is evidenced by a carrier's past behavior, or by statements of a carrier that are credible indicators of a carrier's intention;\n(iii) affirmative misrepresentation by a carrier of the carrier's status prior to engaging in any behavior which has been demonstrated epidemiologically to transmit the disease; or\n(iv) the activities referenced in clause (1) if the person whom the carrier places at risk is: (A) a minor; (B) of diminished capacity by reason of mood altering chemicals, including alcohol; (C) has been diagnosed as having significantly subaverage intellectual functioning; (D) has an organic disorder of the brain or a psychiatric disorder of thought, mood, perception, orientation, or memory which substantially impairs judgment, behavior, reasoning, or understanding; (E) adjudicated as an incompetent; or (F) a vulnerable adult as defined in section 626.5572.\n(3) Violation by a carrier of any part of a court order issued pursuant to this chapter.\n\"Indirectly transmitted\" means any transmission not defined by subdivision 5.\n\"Noncompliant behavior\" means a failure or refusal by a carrier to comply with a health directive.\n\"Respondent\" means any person against whom an action is commenced under sections 144.4171 to 144.4186.",
	"repealed": false
}