{
	"id": "123B.49",
	"url": "https://www.revisor.mn.gov/statutes/cite/123B.49",
	"title": "123B.49 EXTRACURRICULAR ACTIVITIES; INSURANCE.",
	"text": "Whenever it appears to be beneficial and for the best interest of the district and the pupils of the district to carry on any school sport activities or educational activities connected with their studies outside of the territorial limits of the district, the board may authorize such activities to be conducted under such rules and regulations as the board deems sufficient. The district may pay all necessary costs therefor including transportation from the district funds available.\nThe board must take charge of and control all cocurricular school activities of the teachers and children of the public schools in that district held in the school building or school grounds or under the supervision or direction of the school board. The board must adopt rules and regulations for the conduct of cocurricular activities in which the schools of the district or any class or pupils therein may participate. All money received on account of such activities must be turned over to the district treasurer, who shall keep the same in the general fund, to be disbursed for expenses and salaries connected with the activities, or otherwise, by the board upon properly allowed itemized claims.\nTeachers or pupils in the public schools of such district must not participate in cocurricular activities, nor shall the school name or any allied name be used in connection therewith, except by consent and direction of the board.\nCocurricular activities means school sponsored and directed activities designed to provide opportunities for pupils to participate, on an individual or group basis, in school and public events for the improvement of skills. Cocurricular activities are not offered for school credit, cannot be counted toward graduation and have one or more of the following characteristics:\n(a) They are conducted at regular and uniform times during school hours, or at times established by school authorities;\n(b) Although not offered for credit, they are directed or supervised by instructional staff in a learning environment similar to that found in courses offered for credit;\n(c) They are partially funded by public moneys for general instructional purposes under direction and control of the board.\n(a) The board must take charge of and control all extracurricular activities of the teachers and children of the public schools in the district. Extracurricular activities means all direct and personal services for pupils for their enjoyment that are managed and operated under the guidance of an adult or staff member. The board shall allow all resident pupils receiving instruction in a home school as defined in section 123B.36, subdivision 1, paragraph (a), to be eligible to fully participate in extracurricular activities on the same basis as public school students.\n(b) Extracurricular activities have all of the following characteristics:\n(1) they are not offered for school credit nor required for graduation;\n(2) they are generally conducted outside school hours, or if partly during school hours, at times agreed by the participants, and approved by school authorities;\n(3) the content of the activities is determined primarily by the pupil participants under the guidance of a staff member or other adult.\n(c) Any or all costs of these activities may be provided from school revenues and all revenues and expenditures for these activities shall be recorded in the same manner as other revenues and expenditures of the district.\n(d) The teachers or pupils in the district must not participate in such activity, nor shall the school name or any allied name be used in connection therewith, except by consent and direction of the board.\n(e) A school district must reserve revenue raised for extracurricular activities and spend the revenue only for extracurricular activities.\nThe board may enter into a contract providing for the payment of cash benefits or the rendering or payment of hospital and medical benefits, or both to school children injured while participating in activities of the school. The contract entered into by the board may make the payment of such benefits or the rendering thereof the direct and sole obligation of the association or company entering into such contract with the district.\nIf the board deems it advisable, it may authorize employees to collect fees from the pupils enrolled in said school who are to be or are covered by such contract, and to make payment of the premium or other charge for such contract or protection. The payment of such premium or other charge may be made from funds received from the federal government or from the state or any governmental subdivision thereof, or from funds derived by a tax levy or the issuance of bonds.\nThe child's payment of any fees, premium or other charge shall not thereby make the district liable for any injuries incurred from such school activities.\nThe commissioner of education may purchase medical insurance coverage for the benefit of students of the Minnesota State Academy for the Deaf or the Minnesota State Academy for the Blind in the same manner and with the same effect as a school district board may do for its students under this subdivision.\nThe insurance laws of this state shall not apply to nonprofit benefit and relief associations formed by public schools or officers of public schools or the Minnesota State High School League, the privileges of which and applications for membership in which are confined to pupils of the schools, and the benefits and relief to be derived therefrom are limited to pupils injured or disabled from participation in school athletics or any supervised school activity.",
	"repealed": false
}