{
	"id": "326B.0981",
	"url": "https://www.revisor.mn.gov/statutes/cite/326B.0981",
	"title": "326B.0981 CONTINUING EDUCATION; NONDEPARTMENT SEMINARS.",
	"text": "This section applies to seminars that are offered by an entity other than the department for the purpose of enabling licensees to meet continuing education requirements for license renewal.\nContinuing education courses must be approved in advance by the commissioner of labor and industry.\n(a) Continuing education consists of approved courses that impart appropriate and related knowledge in the regulated industries pursuant to this chapter and other applicable federal and state laws, rules, and regulations. Courses may include relevant materials that are included in licensing exams subject to the limitations imposed in subdivision 11. The burden of demonstrating that courses impart appropriate and related knowledge is upon the person seeking approval or credit.\n(b) Except as required for Internet continuing education, course examinations will not be required for continuing education courses.\n(c) If textbooks are not used as part of the course, the sponsor must provide students with a syllabus containing the course title; the times and dates of the course offering; the name, address, and telephone number of the course sponsor; the name and affiliation of the instructor; and a detailed outline of the subject materials to be covered. Any written or printed material given to students must be of readable quality and contain accurate and current information.\n(d) Upon completion of an approved course, licensees shall earn one hour of continuing education credit for each classroom hour approved by the commissioner. Each continuing education course must be attended in its entirety in order to receive credit for the number of approved hours. Courses may be approved for full or partial credit, and for more than one regulated industry.\n(e) Continuing education credit in an approved course shall be awarded to presenting instructors on the basis of one credit for each hour of the initial presentation. Continuing education credits for completion of an approved course may only be used once for renewal of a specific license.\n(f) Courses will be approved using the following guidelines:\n(1) course content must demonstrate significant intellectual or practical content and deal with matters directly related to the practice in the regulated industry, workforce safety, or the business of running a company in the regulated industry. Courses may also address the professional responsibility or ethical obligations of a licensee related to work in the regulated industry;\n(2) the following courses may be approved if they are specifically designed for the regulated industry and are in compliance with paragraph (g):\n(i) courses approved by the Minnesota Board of Continuing Legal Education; or\n(ii) courses approved by the International Code Council, National Association of Home Building, or other nationally recognized professional organization of the regulated industry; and\n(3) courses must be presented and attended in a suitable classroom or construction setting, except for Internet education courses which must meet the requirements of subdivision 4. Courses presented via video recording, simultaneous broadcast, or teleconference may be approved provided the sponsor is available at all times during the presentation, except for Internet education courses which must meet the requirements of subdivision 4.\n(g) The following courses will not be approved for credit:\n(1) courses designed solely to prepare students for a license examination;\n(2) courses in mechanical office skills, including typing, speed reading, or other machines or equipment. Computer courses are allowed, if appropriate and related to the regulated industry;\n(3) courses in sales promotion, including meetings held in conjunction with the general business of the licensee;\n(4) courses in motivation, salesmanship, psychology, or personal time management;\n(5) courses that are primarily intended to impart knowledge of specific products of specific companies, if the use of the product or products relates to the sales promotion or marketing of one or more of the products discussed; or\n(6) courses where any of the educational content of the course is the State Building Code that include code provisions that have not been adopted into the State Building Code unless the course materials clarify that the code provisions have been officially adopted into a future version of the State Building Code and the effective date of enforcement.\n(h) Nothing in this subdivision shall limit an authority expressly granted to the Board of Electricity, Board of High Pressure Piping Systems, or Plumbing Board.\n(a) The design and delivery of an Internet continuing education course must be approved by the International Distance Education Certification Center (IDECC) or the International Association for Continuing Education and Training (IACET) before the course is submitted for the commissioner's approval. The approval must accompany the course submitted.\n(b) Paragraphs (a) and (d) do not apply to approval of an Internet continuing education course for manufactured home installers. An Internet continuing education course for manufactured home installers must be approved by the United States Department of Housing and Urban Development or by the commissioner of labor and industry. The approval must accompany the course completion certificate issued to each student by the course sponsor.\n(c) Paragraph (a) does not apply to approval of an Internet continuing education course for elevator constructors. An Internet continuing education course for elevator constructors must be approved by the commissioner of labor and industry. The approval must accompany the course completion certificate issued to each student by the course sponsor.\n(d) An Internet continuing education course must:\n(1) specify the minimum computer system requirements;\n(2) provide encryption that ensures that all personal information, including the student's name, address, and credit card number, cannot be read as it passes across the Internet;\n(3) include technology to guarantee seat time;\n(4) include a high level of interactivity;\n(5) include graphics that reinforce the content;\n(6) include the ability for the student to contact an instructor or course sponsor within a reasonable amount of time;\n(7) include the ability for the student to get technical support within a reasonable amount of time;\n(8) include a statement that the student's information will not be sold or distributed to any third party without prior written consent of the student. Taking the course does not constitute consent;\n(9) be available 24 hours a day, seven days a week, excluding minimal downtime for updating and administration, except that this provision does not apply to live courses taught by an actual instructor and delivered over the Internet;\n(10) provide viewing access to the online course at all times to the commissioner, excluding minimal downtime for updating and administration;\n(11) include a process to authenticate the student's identity;\n(12) inform the student and the commissioner how long after its purchase a course will be accessible;\n(13) inform the student that license education credit will not be awarded for taking the course after it loses its status as an approved course;\n(14) provide clear instructions on how to navigate through the course;\n(15) provide automatic bookmarking at any point in the course;\n(16) provide questions after each unit or chapter that must be answered before the student can proceed to the next unit or chapter;\n(17) include a reinforcement response when a quiz question is answered correctly;\n(18) include a response when a quiz question is answered incorrectly;\n(19) include a final examination in which the student must correctly answer 70 percent of the questions;\n(20) allow the student to go back and review any unit at any time, except during the final examination;\n(21) provide a course evaluation at the end of the course. At a minimum, the evaluation must ask the student to report any difficulties caused by the online education delivery method;\n(22) provide a completion certificate when the course and exam have been completed and the provider has verified the completion. Electronic certificates are sufficient and shall include the name of the provider, date and location of the course, educational program identification that was provided by the department, hours of instruction or continuing education hours, and licensee's or attendee's name and license, certification, or registration number or the last four digits of the licensee's or attendee's Social Security number; and\n(23) allow the commissioner the ability to electronically review the class to determine if credit can be approved.\n(e) The final examination must be either an encrypted online examination or a paper examination that is monitored by a proctor who certifies that the student took the examination.\n(a) Courses must be approved by the commissioner in advance and will be approved on the basis of the applicant's compliance with the provisions of this section relating to continuing education in the regulated industries. The commissioner shall make the final determination as to the approval and assignment of credit hours for courses. Courses must be at least one hour in length.\nLicensees requesting credit for continuing education courses that have not been previously approved by the commissioner shall, on a form prescribed by the commissioner, submit an application for approval of continuing education credit accompanied by a nonrefundable fee of $20 for each course to be reviewed. To be approved, courses must be in compliance with the provisions of this section governing the types of courses that will and will not be approved.\nApproval will not be granted for time spent on meals or other unrelated activities. Breaks may not be accumulated in order to dismiss the class early. Classes shall not be offered by a provider to any one student for longer than eight hours in one day, excluding meal breaks.\n(b) Application for course approval must be submitted on a form approved by the commissioner at least 30 days before the course offering.\n(c) Approval must be granted for a subsequent offering of identical continuing education courses without requiring a new application if a notice of the subsequent offering is filed with the commissioner at least 30 days in advance of the date the course is to be held. The commissioner shall deny future offerings of courses if they are found not to be in compliance with the laws relating to course approval.\nAll course offerings must be open to any interested individuals. Access may be restricted by the sponsor based on class size only. Courses shall not be approved if attendance is restricted to any particular group of people, except for company-sponsored courses allowed by applicable law.\nTuition for an approved course of study and related materials must be clearly identified to students. In the event that a course is canceled for any reason, all tuition must be returned within 15 days from the date of cancellation. In the event that a course is postponed for any reason, students shall be given the choice of attending the course at a later date or having their tuition refunded in full within 15 days from the date of postponement. If a student is unable to attend a course or cancels the registration in a course, sponsor policies regarding refunds shall govern.\nExcept for Internet education offered pursuant to subdivision 4, each course of study must be conducted in a classroom or other facility that is adequate to comfortably accommodate the instructors and the number of students enrolled. The sponsor may limit the number of students enrolled in a course.\nAn adequate supply of supplementary materials to be used or distributed in connection with an approved course must be available at the time and place of the course offering in order to ensure that each student receives all of the necessary materials. Outlines and any other materials that are reproduced must be of readable quality.\n(a) Paragraphs (b) to (g) govern the advertising of continuing education courses.\n(b) Advertising must be truthful and not deceptive or misleading. Courses may not be advertised as approved for continuing education credit unless approval has been granted in writing by the commissioner.\n(c) Once a course is approved, all advertisement, pamphlet, circular, or other similar materials pertaining to an approved course circulated or distributed in this state, must prominently display the following statement:\n\"This course has been approved by the Minnesota Department of Labor and Industry for ....... (approved number of hours) hours for ....... (regulated industry) continuing education.\"\n(d) Advertising of approved courses must be clearly distinguishable from the advertisement of other nonapproved courses and services.\n(e) Continuing education courses may not be advertised before approval unless the course is described in any advertising as \"approval pending.\" The sponsor must verbally notify students before commencement of the course if the course has been denied credit, has not been approved for credit, or has only been approved for partial credit by the commissioner.\n(f) The number of hours for which a course has been approved must be prominently displayed on an advertisement for the course. If the course offering is longer than the number of hours of credit to be given, it must be clear that credit is not earned for the entire course.\n(g) The course approval number must not be included in any advertisement.\nAt the beginning of each approved offering, the following notice must be handed out in printed form or must be read to students:\n\"This educational offering is recognized by the Minnesota Department of Labor and Industry as satisfying ....... (insert number of hours approved) hours of credit toward (insert regulated industry) continuing education requirements.\"\nA licensee, its qualifying individual, or an applicant found to have falsified an education report or certificate to the commissioner shall be considered to have violated the laws relating to the regulated industry for which the person has a license and shall be subject to the enforcement provisions of section 326B.082.\nThe commissioner reserves the right to audit a licensee's continuing education records.\nUpon written proof demonstrating a medical hardship, the commissioner shall extend, for up to 90 days, the time period during which the continuing education must be successfully completed. Requests for extensions must be submitted to the commissioner in writing no later than 60 days before the education is due and must include an explanation with verification of the hardship, plus verification of enrollment at an approved course of study on or before the extension period expires.\nContinuing education credits must be reported by the sponsor in a manner prescribed by the commissioner. Licensees are responsible for maintaining copies of course completion certificates.\nThe following fees shall be paid to the commissioner:\n(1) initial course approval, $20 for each hour or fraction of one hour of continuing education course approval sought. Initial course approval expires on the last day of the 36th month after the course is approved;\n(2) initial sponsor approval, $100. Initial sponsor approval expires on the last day of the 24th month after the sponsor is approved; and\n(3) renewal of sponsor approval, $100. Renewal of sponsor approval expires on the last day of the 24th month after the sponsor is renewed.\nAll fees paid to the commissioner under this section are nonrefundable, except that an overpayment of a fee shall be returned upon proper application.\nThe commissioner is authorized to establish a procedure for renewal of course approval.",
	"repealed": false
}