{
	"id": "253B.10",
	"url": "https://www.revisor.mn.gov/statutes/cite/253B.10",
	"title": "253B.10 PROCEDURES UPON COMMITMENT.",
	"text": "(a) When a person is committed, the court shall issue a warrant or an order committing the patient to the custody of the head of the treatment facility, state-operated treatment program, or community-based treatment program. The warrant or order shall state that the patient meets the statutory criteria for civil commitment.\n(b) The executive board shall prioritize civilly committed patients being admitted from jail or a correctional institution or who are referred to a state-operated treatment facility for competency attainment or a competency examination under sections 611.40 to 611.59 for admission to a medically appropriate state-operated direct care and treatment bed based on the decisions of physicians in the executive medical director's office, using a priority admissions framework. The framework must account for a range of factors for priority admission, including but not limited to:\n(1) the length of time the person has been on a waiting list for admission to a state-operated direct care and treatment program since the date of the order under paragraph (a), or the date of an order issued under sections 611.40 to 611.59;\n(2) the intensity of the treatment the person needs, based on medical acuity;\n(3) the person's revoked provisional discharge status;\n(4) the person's safety and safety of others in the person's current environment;\n(5) whether the person has access to necessary or court-ordered treatment;\n(6) distinct and articulable negative impacts of an admission delay on the facility referring the individual for treatment; and\n(7) any relevant federal prioritization requirements.\nPatients described in this paragraph must be admitted to a state-operated treatment program within 48 hours. The commitment must be ordered by the court as provided in section 253B.09, subdivision 1, paragraph (d). Patients committed to a secure treatment facility or less restrictive setting as ordered by the court under section 253B.18, subdivisions 1 and 2, must be prioritized for admission to a state-operated treatment program using the priority admissions framework in this paragraph.\n(c) Upon the arrival of a patient at the designated treatment facility, state-operated treatment program, or community-based treatment program, the head of the facility or program shall retain the duplicate of the warrant and endorse receipt upon the original warrant or acknowledge receipt of the order. The endorsed receipt or acknowledgment must be filed in the court of commitment. After arrival, the patient shall be under the control and custody of the head of the facility or program.\n(d) Copies of the petition for commitment, the court's findings of fact and conclusions of law, the court order committing the patient, the report of the court examiners, and the prepetition report, and any medical and behavioral information available shall be provided at the time of admission of a patient to the designated treatment facility or program to which the patient is committed. Upon a patient's referral to the executive board for admission pursuant to subdivision 1, paragraph (b), any inpatient hospital, treatment facility, jail, or correctional facility that has provided care or supervision to the patient in the previous two years shall, when requested by the treatment facility or executive board, provide copies of the patient's medical and behavioral records to the executive board for purposes of preadmission planning. This information shall be provided by the head of the treatment facility to treatment facility staff in a consistent and timely manner and pursuant to all applicable laws.\n(e) Patients described in paragraph (b) must be admitted to a state-operated treatment program within 48 hours of the Office of Executive Medical Director, under section 246C.09, or a designee determining that a medically appropriate bed is available. This paragraph expires on June 30, 2025.\n(f) Within four business days of determining which state-operated direct care and treatment program or programs are appropriate for an individual, the executive medical director's office or a designee must notify the source of the referral and the responsible county human services agency, the individual being ordered to direct care and treatment, and the district court that issued the order of the determination. The notice shall include which program or programs are appropriate for the person's priority status. Any interested person may provide additional information or request updated priority status about the individual to the executive medical director's office or a designee while the individual is awaiting admission. Updated priority status of an individual will only be disclosed to interested persons who are legally authorized to receive private information about the individual. When an available bed has been identified, the executive medical director's office or a designee must notify the designated agency and the facility where the individual is awaiting admission that the individual has been accepted for admission to a particular state-operated direct care and treatment program and the earliest possible date the admission can occur. The designated agency or facility where the individual is awaiting admission must transport the individual to the admitting state-operated direct care and treatment program no more than 48 hours after the offered admission date.\n(a) When a patient is about to be placed in a treatment facility, state-operated treatment program, or community-based treatment program, the court may order the designated agency, treatment facility, state-operated treatment program, or community-based treatment program, or any responsible adult to transport the patient. A protected transport provider may transport the patient according to section 256B.0625, subdivision 17. Whenever possible, a peace officer who provides the transportation shall not be in uniform and shall not use a vehicle visibly marked as a law enforcement vehicle. The proposed patient may be accompanied by one or more interested persons.\n(b) When a patient who is at a state-operated treatment program requests a hearing for adjudication of a patient's status pursuant to section 253B.17, the executive board shall provide transportation.\nWhenever a committed person has been admitted to a treatment facility, state-operated treatment program, or community-based treatment program under the provisions of section 253B.09 or 253B.18, the head of the facility or program shall immediately notify the patient's spouse, health care agent, or parent and the county of financial responsibility if the county may be liable for a portion of the cost of treatment. If the committed person was admitted upon the petition of a spouse, health care agent, or parent, the head of the treatment facility, state-operated treatment program, or community-based treatment program shall notify an interested person other than the petitioner.\nWhen the patient is present in a treatment facility or state-operated treatment program at the time of the court's commitment order, unless the court orders otherwise, the commitment order constitutes authority for that facility or program to confine and provide treatment to the patient until the patient is transferred to the facility or program to which the patient has been committed.\nPatients or other responsible persons are required to pay the necessary charges for patients committed or transferred to treatment facilities or community-based treatment programs. Treatment facilities or community-based treatment programs may not refuse to accept a committed person solely based on the person's court-ordered status. Insurers must provide treatment and services as ordered by the court under section 253B.045, subdivision 6, or as required under chapter 62M.\nAt any time prior to the expiration of the initial commitment period, a patient who has not been committed as a person who has a mental illness and is dangerous to the public or a sexually dangerous person or a sexual psychopathic personality may be transferred to voluntary status upon the patient's application in writing with the consent of the head of the facility or program to which the person is committed. Upon transfer, the head of the treatment facility, state-operated treatment program, or community-based treatment program shall immediately notify the court in writing and the court shall terminate the proceedings.\nThe executive board shall determine to which state-operated services facility persons with mental illness from each county shall be committed and notify the judges exercising probate jurisdiction over each county of the commitment. The executive board shall also notify judges of any changes made by the executive board to the commitment location.",
	"repealed": false
}