{
	"id": "504B.266",
	"url": "https://www.revisor.mn.gov/statutes/cite/504B.266",
	"title": "504B.266 TERMINATION OF LEASE UPON INFIRMITY OF TENANT.",
	"text": "(a) For the purposes of this section, the following terms have the meanings given them.\n(b) \"Authorized representative\" means a person acting as an attorney-in-fact under a power of attorney under section 523.24 or a court-appointed conservator or guardian under chapter 524.\n(c) \"Disability\" means any condition or characteristic that is a physical, sensory, or mental impairment that materially limits at least one major life activity.\n(d) \"Medical care facility\" means:\n(1) a nursing home, as defined in section 144A.01, subdivision 5;\n(2) hospice care, as defined in section 144A.75, subdivision 8;\n(3) residential hospice facility, as defined in section 144A.75, subdivision 13;\n(4) boarding care home, as licensed under chapter 144 and regulated by the Department of Health under Minnesota Rules, chapter 4655;\n(5) supervised living facility, as licensed under chapter 144;\n(6) a facility providing assisted living, as defined in section 144G.08, subdivision 7;\n(7) an accessible unit, as defined in section 363A.40, subdivision 1, paragraph (b);\n(8) a state facility as defined in section 246.50, subdivision 3;\n(9) a facility providing a foster care for adults program as defined in section 245A.02, subdivision 6c; or\n(10) a facility providing intensive residential treatment services as defined in section 245I.23.\n(e) \"Medical professional\" means:\n(1) a physician who is currently licensed to practice medicine under section 147.02, subdivision 1;\n(2) an advanced practice registered nurse, as defined in section 148.171, subdivision 3; or\n(3) a mental health professional as defined in section 245I.04, subdivision 2.\n(a) A tenant or the authorized representative of the tenant may terminate the lease prior to the expiration of the lease in the manner provided in subdivision 3 if the tenant has or, if there is more than one tenant, one of the tenants has, been found by a medical professional to need to move into a medical care facility and:\n(1) require assistance with instrumental activities of daily living or personal activities of daily living due to medical reasons or a disability;\n(2) meet one of the nursing facility level of care criteria under section 144.0724, subdivision 11; or\n(3) have a disability or functional impairment in three or more of the areas listed in section 245.462, subdivision 11a, so that self-sufficiency is markedly reduced because of a mental illness.\n(b) When a tenant requires an accessible unit as defined in section 363A.40, subdivision 1, and the landlord can provide an accessible unit in the same complex where the tenant currently resides that is available within two months of the request, then the provisions of this section do not apply and the tenant may not terminate the lease.\nWhen the conditions in subdivision 2 have been met, the tenant or the tenant's authorized representative may terminate the lease by providing at least two months' written notice to be effective on the last day of a calendar month. The notice must be either hand-delivered or mailed by postage prepaid, first class United States mail. The notice must include: (1) a copy of the medical professional's written documentation of the infirmity; and (2) documentation showing that the tenant has been accepted as a resident or has a pending application at a location where the medical professional has indicated that the tenant needs to move. The termination of a lease under this section shall not relieve the eligible tenant from liability either for the payment of rent or other sums owed prior to or during the notice period, or for the payment of amounts necessary to restore the premises to their condition at the commencement of the tenancy, ordinary wear and tear excepted.\nAny waiver of the rights of termination provided by this section, including lease provisions or other agreements that require a longer notice period than those provided for in this section, shall be void and unenforceable.\nNothing in this section affects the rights or remedies available in this chapter or other law, including but not limited to chapter 363A.",
	"repealed": false
}