{
	"id": "323A.0101",
	"url": "https://www.revisor.mn.gov/statutes/cite/323A.0101",
	"title": "323A.0101 DEFINITIONS.",
	"text": "In this chapter:\n(1) \"Business\" includes every trade, occupation, and profession.\n(2) \"Debtor in bankruptcy\" means a person who is the subject of:\n(i) an order for relief under title 11 of the United States Code or a comparable order under a successor statute of general application; or\n(ii) a comparable order under federal, state, or foreign law governing insolvency.\n(3) \"Distribution\" means a transfer of money or other property from a partnership to a partner in the partner's capacity as a partner or to the partner's transferee.\n(4) \"Executed\" means signed.\n(5) \"Filed\" or \"filed with the secretary of state\" means that a document meeting the applicable requirements of this chapter, signed, and accompanied by a filing fee of $135, has been delivered to the secretary of state. The secretary of state shall endorse on the document the word \"Filed\" and the month, day, and year of filing; record the document in the Office of the Secretary of State; and return a document to the person who delivered it for filing.\n(6) \"Foreign limited liability partnership\" means a partnership that:\n(i) is formed under laws other than the laws of this state; and\n(ii) has the status of a limited liability partnership under those laws.\n(7) \"Limited liability partnership\" means a partnership that has filed a statement of qualification under section 323A.1001 and does not have a similar statement in effect in any other jurisdiction.\n(8) \"Partnership\" means an association of two or more persons to carry on as co-owners a business for profit, including a limited liability partnership, formed under section 323A.0202, predecessor law, or comparable law of another jurisdiction.\n(9) \"Partnership agreement\" means the agreement, whether written, oral, or implied, among the partners concerning the partnership, including amendments to the partnership agreement.\n(10) \"Partnership at will\" means a partnership in which the partners have not agreed to remain partners until the expiration of a definite term or the completion of a particular undertaking.\n(11) \"Partnership interest\" or \"partner's interest in the partnership\" means all of a partner's interests in the partnership, including the partner's transferable interest and all management and other rights.\n(12) \"Person\" means an individual, corporation, business trust, estate, trust, partnership, association, joint venture, government, governmental subdivision, agency, or instrumentality, or any other legal or commercial entity.\n(13) \"Property\" means all property, real, personal, or mixed, tangible or intangible, or any interest in property.\n(14) \"Record,\" \"recorded,\" and \"recording\" mean that a certified copy of a statement meeting the applicable requirements of this chapter as filed with the secretary of state has been recorded in the office of the county recorder in the county in which the real property affected by the statement is located or, if the real property is registered under chapter 508 or 508A, memorialized on the certificate of title for that property.\n(15) \"Signed\" means that:\n(i) the signature of a person has been written on a document, as provided in section 645.44, subdivision 14; and\n(ii) with respect to a document that may be filed with the secretary of state, the document has been signed by a person authorized to do so by this chapter, by the partnership agreement, or by a resolution approved as provided in the partnership agreement.\nA signature on a document may be a facsimile affixed, engraved, printed, placed, stamped with indelible ink, transmitted by facsimile or electronically, or in any other manner reproduced on the document.\n(16) \"State\" means a state of the United States, the District of Columbia, the Commonwealth of Puerto Rico, or any territory or insular possession subject to the jurisdiction of the United States.\n(17) \"Statement\" means a statement of partnership authority under section 323A.0303, a statement of denial under section 323A.0304, a statement of dissociation under section 323A.0704, a statement of dissolution under section 323A.0805, a statement of merger under section 323A.0907, a statement of qualification under section 323A.1001, a statement of foreign qualification under section 323A.1102, or an amendment or cancellation of any of the foregoing.\n(18) \"Transfer\" includes an assignment, conveyance, lease, mortgage, deed, and encumbrance.",
	"repealed": false
}