{
	"id": "256B.771",
	"url": "https://www.revisor.mn.gov/statutes/cite/256B.771",
	"title": "256B.771 COMPLEMENTARY AND ALTERNATIVE MEDICINE DEMONSTRATION PROJECT.",
	"text": "The commissioner of human services shall contract with a Minnesota-based academic or clinical research institution or institutions specializing in providing complementary and alternative medicine education and clinical services to establish and implement a five-year demonstration project in conjunction with federally qualified health centers or federally qualified health center \"look-alikes\" as defined in section 145.9269, to improve the quality and cost-effectiveness of care provided under medical assistance to enrollees with neck and back problems. The demonstration project must maximize the use of complementary and alternative medicine-oriented primary care providers, including but not limited to physicians and chiropractors. The demonstration project must be designed to significantly improve physical and mental health for enrollees who present with neck and back problems while decreasing medical treatment costs. The commissioner, in consultation with the commissioner of health, shall deliver services through the demonstration project beginning January 1, 2012, or upon federal approval, whichever is later.\nThe commissioner shall develop and issue a request for proposal (RFP) for the demonstration project. The RFP must require the academic or clinical research institution or institutions selected to demonstrate a proven track record over at least five years of conducting high-quality, federally funded clinical research. The RFP shall specify the state costs directly related to the requirements of this section and shall require that the selected institution pay those costs to the state. The institution and the federally qualified health centers and federally qualified health center \"look-alikes\" shall also:\n(1) provide patient education, provider education, and enrollment training components on health and lifestyle issues in order to promote enrollee responsibility for health care decisions, enhance productivity, prepare enrollees to reenter the workforce, and reduce future health care expenditures;\n(2) use high-quality and cost-effective integrated disease management that includes the best practices of traditional and complementary and alternative medicine;\n(3) incorporate holistic medical care, appropriate nutrition, exercise, medications, and conflict resolution techniques;\n(4) include a provider education component that makes use of professional organizations representing chiropractors, nurses, and other primary care providers and provides appropriate educational materials and activities in order to improve the integration of traditional medical care with licensed chiropractic services and other alternative health care services and achieve program enrollment objectives; and\n(5) provide to the commissioner the information and data necessary for the commissioner to prepare the annual reports required under subdivision 6.\nEnrollees from the program shall be selected by the commissioner from current enrollees in the prepaid medical assistance program who have, or are determined to be at significant risk of developing, neck and back problems. Participation in the demonstration project shall be voluntary. The commissioner shall seek to enroll, over the term of the demonstration project, ten percent of current and future medical assistance enrollees who have, or are determined to be at significant risk of developing, neck and back problems.\nThe commissioner shall seek any federal waivers and approvals necessary to implement the demonstration project.\nThe commissioner shall require the academic or clinical research institution or institutions selected, federally qualified health centers, and federally qualified health center \"look-alikes\" to fund all costs of the demonstration project. Amounts received under subdivision 2 are appropriated to the commissioner for the purposes of this section.\nThe commissioner, beginning December 15, 2012, and each December 15 thereafter through December 15, 2015, shall report annually to the legislature on the functional and mental improvements of the populations served by the demonstration project, patient satisfaction, and the cost-effectiveness of the program. The reports must also include data on hospital admissions, days in hospital, rates of outpatient surgery and other services, and drug utilization. The report, due December 15, 2015, must include recommendations on whether the demonstration project should be continued and expanded.",
	"repealed": false
}