{
	"id": "197.133",
	"url": "https://www.revisor.mn.gov/statutes/cite/197.133",
	"title": "197.133 DISPOSAL OF PROPERTY AND EXPIRATION OF BOARD OF GOVERNORS.",
	"text": "(a) If a majority of the board determines that the disposal of the Big Island Veterans camp or a portion of the camp is in the best interests of Minnesota veterans, or if the camp is not used solely as a camp for and by disabled and other veterans and their families and operated and maintained in compliance with all state, federal, and local laws, the board may dispose of the property at market value as provided in this section. Before disposing of the property, the board shall give notice by certified mail to the commissioner of veterans affairs of its decision to dispose of the property. The commissioner shall publish the notice in the State Register. Interested governmental agencies have until the end of the next legislative session after the notice to appropriate money to purchase the property.\n(b) Proceeds realized from the disposal of the property and any assets on hand at the time of the disposal of the property, must be placed in an irrevocable trust to be used for the initiation or maintenance of veterans programs in the state of Minnesota. Trustees must be appointed in the same manner as provided for under Minnesota Statutes 2014, section 197.131. The trustees shall consult with the commissioner of veterans affairs to determine the needs of Minnesota veterans and provide the commissioner with an annual written report on the trust. The commissioner must approve all expenditures from the trust. A certified audit of all assets, expenditures, and property must be conducted prior to any disposition of any assets under the control of the board. Any board member who would benefit directly or indirectly financially from the sale of this property must be removed by the board and a successor appointed as provided by Minnesota Statutes 2014, section 197.131. Upon final disposition of all assets to the trust, the board must disband. Should the assets of the trust be exhausted, the trust must be terminated.\n(c) The trustees appointed under paragraph (b) shall have the exclusive authority to remove a trustee of the trust established under paragraph (b). A trustee may be removed at any time without cause upon a majority vote of the trustees with consent of the commissioner of veterans affairs.\n(d) A vacancy in a trusteeship of the trust established under paragraph (b) must be filled for the remainder of the unexpired term in the same manner as the original appointment.",
	"repealed": false
}