{
	"id": "609.527",
	"url": "https://www.revisor.mn.gov/statutes/cite/609.527",
	"title": "609.527 IDENTITY THEFT.",
	"text": "(a) As used in this section, the following terms have the meanings given them in this subdivision.\n(b) \"Direct victim\" means any person or entity described in section 611A.01, paragraph (b), whose identity has been transferred, used, or possessed in violation of this section.\n(c) \"False pretense\" means any false, fictitious, misleading, or fraudulent information or pretense or pretext depicting or including or deceptively similar to the name, logo, website address, email address, postal address, telephone number, or any other identifying information of a for-profit or not-for-profit business or organization or of a government agency, to which the user has no legitimate claim of right.\n(d) \"Financial institution\" has the meaning given in section 13A.01, subdivision 2.\n(e) \"Identity\" means any name, number, or data transmission that may be used, alone or in conjunction with any other information, to identify a specific individual or entity, including any of the following:\n(1) a name, Social Security number, date of birth, official government-issued driver's license or identification number, government passport number, or employer or taxpayer identification number;\n(2) unique electronic identification number, address, account number, or routing code; or\n(3) telecommunication identification information or access device.\n(f) \"Indirect victim\" means any person or entity described in section 611A.01, paragraph (b), other than a direct victim.\n(g) \"Loss\" means value obtained, as defined in section 609.52, subdivision 1, clause (3), and expenses incurred by a direct or indirect victim as a result of a violation of this section.\n(h) \"Unlawful activity\" means:\n(1) any felony violation of the laws of this state or any felony violation of a similar law of another state or the United States; and\n(2) any nonfelony violation of the laws of this state involving theft, theft by swindle, forgery, fraud, or giving false information to a public official, or any nonfelony violation of a similar law of another state or the United States.\n(i) \"Scanning device\" means a scanner, reader, or any other electronic device that is used to access, read, scan, obtain, memorize, or store, temporarily or permanently, information encoded on a computer chip or magnetic strip or stripe of a payment card, driver's license, or state-issued identification card.\n(j) \"Reencoder\" means an electronic device that places encoded information from the computer chip or magnetic strip or stripe of a payment card, driver's license, or state-issued identification card, onto the computer chip or magnetic strip or stripe of a different payment card, driver's license, or state-issued identification card, or any electronic medium that allows an authorized transaction to occur.\n(k) \"Payment card\" means a credit card, charge card, debit card, or any other card that:\n(1) is issued to an authorized card user; and\n(2) allows the user to obtain, purchase, or receive credit, money, a good, a service, or anything of value.\nA person who transfers, possesses, or uses an identity that is not the person's own, with the intent to commit, aid, or abet any unlawful activity is guilty of identity theft and may be punished as provided in subdivision 3.\nA person who violates subdivision 2 may be sentenced as follows:\n(1) if the offense involves a single direct victim and the total, combined loss to the direct victim and any indirect victims is $250 or less, the person may be sentenced as provided in section 609.52, subdivision 3, clause (5);\n(2) if the offense involves a single direct victim and the total, combined loss to the direct victim and any indirect victims is more than $250 but not more than $500, the person may be sentenced as provided in section 609.52, subdivision 3, clause (4);\n(3) if the offense involves two or three direct victims or the total, combined loss to the direct and indirect victims is more than $500 but not more than $2,500, the person may be sentenced as provided in section 609.52, subdivision 3, clause (3);\n(4) if the offense involves more than three but not more than seven direct victims, or if the total combined loss to the direct and indirect victims is more than $2,500, the person may be sentenced as provided in section 609.52, subdivision 3, clause (2);\n(5) if the offense involves eight or more direct victims, or if the total, combined loss to the direct and indirect victims is more than $35,000, the person may be sentenced as provided in section 609.52, subdivision 3, clause (1); and\n(6) if the offense is related to possession or distribution of pornographic work in violation of section 617.246 or 617.247, the person may be sentenced as provided in section 609.52, subdivision 3, clause (1).\n(a) A direct or indirect victim of an identity theft crime shall be considered a victim for all purposes, including any rights that accrue under chapter 611A and rights to court-ordered restitution.\n(b) The court shall order a person convicted of violating subdivision 2 to pay restitution of not less than $1,000 to each direct victim of the offense.\n(c) Upon the written request of a direct victim or the prosecutor setting forth with specificity the facts and circumstances of the offense in a proposed order, the court shall provide to the victim, without cost, a certified copy of the complaint filed in the matter, the judgment of conviction, and an order setting forth the facts and circumstances of the offense.\n(a) A person who has learned or reasonably suspects that a person is a direct victim of a crime under subdivision 2 may initiate a law enforcement investigation by contacting the local law enforcement agency that has jurisdiction where the person resides, regardless of where the crime may have occurred. The agency must prepare a police report of the matter, provide the complainant with a copy of that report, and may begin an investigation of the facts, or, if the suspected crime was committed in a different jurisdiction, refer the matter to the law enforcement agency where the suspected crime was committed for an investigation of the facts.\n(b) If a law enforcement agency refers a report to the law enforcement agency where the crime was committed, it need not include the report as a crime committed in its jurisdiction for purposes of information that the agency is required to provide to the commissioner of public safety pursuant to section 299C.06.\n(a) A person who, with intent to obtain the identity of another, uses a false pretense in an email to another person or in a web page, electronic communication, advertisement, or any other communication on the Internet, is guilty of a crime.\n(b) Whoever commits such offense may be sentenced to imprisonment for not more than five years or to payment of a fine of not more than $10,000, or both.\n(c) In a prosecution under this subdivision, it is not a defense that:\n(1) the person committing the offense did not obtain the identity of another;\n(2) the person committing the offense did not use the identity; or\n(3) the offense did not result in financial loss or any other loss to any person.\n(a) A person who uses a scanning device or reencoder without permission of the cardholder of the card from which the information is being scanned or reencoded, with the intent to commit, aid, or abet any unlawful activity, is guilty of a crime.\n(b) A person who possesses, with the intent to commit, aid, or abet any unlawful activity, any device, apparatus, equipment, software, material, good, property, or supply that is designed or adapted for use as a scanning device or a reencoder is guilty of a crime.\n(c) Whoever commits an offense under paragraph (a) or (b) may be sentenced to imprisonment for not more than five years or to payment of a fine of not more than $10,000, or both.\nNotwithstanding anything to the contrary in section 627.01, an offense committed under subdivision 2, 5a, or 5b may be prosecuted in:\n(1) the county where the offense occurred;\n(2) the county of residence or place of business of the direct victim or indirect victim; or\n(3) in the case of a violation of subdivision 5a or 5b, the county of residence of the person whose identity was obtained or sought.\nIn any prosecution under subdivision 2, the value of the money or property or services the defendant receives or the number of direct or indirect victims within any six-month period may be aggregated and the defendant charged accordingly in applying the provisions of subdivision 3; provided that when two or more offenses are committed by the same person in two or more counties, the accused may be prosecuted in any county in which one of the offenses was committed for all of the offenses aggregated under this subdivision.\n(a) A financial institution may release the information described in paragraph (b) to a law enforcement or prosecuting authority that certifies in writing that it is investigating or prosecuting a crime of identity theft under this section. The certification must describe with reasonable specificity the nature of the suspected identity theft that is being investigated or prosecuted, including the dates of the suspected criminal activity.\n(b) This subdivision applies to requests for the following information relating to a potential victim's account:\n(1) the name of the account holder or holders; and\n(2) the last known home address and telephone numbers of the account holder or holders.\n(c) A financial institution may release the information requested under this subdivision that it possesses within a reasonable time after the request. The financial institution may not impose a fee for furnishing the information.\n(d) A financial institution is not liable in a criminal or civil proceeding for releasing information in accordance with this subdivision.\n(e) Release of limited account information to a law enforcement agency under this subdivision is criminal investigative data under section 13.82, subdivision 7, except that when the investigation becomes inactive the account information remains confidential data on individuals or protected nonpublic data.",
	"repealed": false
}