{
	"id": "342.66",
	"url": "https://www.revisor.mn.gov/statutes/cite/342.66",
	"title": "342.66 HEMP-DERIVED TOPICAL PRODUCTS.",
	"text": "This section applies to the manufacture, marketing, distribution, and sale of hemp-derived topical products.\nNo license is required to manufacture, market, distribute, or sell hemp-derived topical products.\n(a) Products manufactured, marketed, distributed, and sold under this section may contain cannabidiol or cannabigerol. Except as provided in paragraph (c), products may not contain any other cannabinoid unless approved by the office.\n(b) The office may approve any cannabinoid, other than any tetrahydrocannabinol, and authorize its use in manufacturing, marketing, distribution, and sales under this section if the office determines that the cannabinoid is a nonintoxicating cannabinoid.\n(c) A product manufactured, marketed, distributed, and sold under this section may contain cannabinoids other than cannabidiol, cannabigerol, or any other cannabinoid approved by the office provided that the cannabinoids are naturally occurring in hemp plants or hemp plant parts and the total of all other cannabinoids present in a product does not exceed one milligram per package.\nProducts sold to consumers under this section may only be manufactured, marketed, distributed, intended, or generally expected to be used by applying the product externally to a part of the body of a human or animal.\nHemp-derived topical products must meet the labeling requirements in section 342.63, subdivision 5.\n(a) A product sold to consumers under this section must not be manufactured, marketed, distributed, or intended:\n(1) for external or internal use in the diagnosis, cure, mitigation, treatment, or prevention of disease in humans or other animals;\n(2) to affect the structure or any function of the bodies of humans or other animals;\n(3) to be consumed by combustion or vaporization of the product and inhalation of smoke, aerosol, or vapor from the product;\n(4) to be consumed through chewing; or\n(5) to be consumed through injection or application to a mucous membrane or nonintact skin.\n(b) A product manufactured, marketed, distributed, or sold to consumers under this section must not:\n(1) consist, in whole or in part, of any filthy, putrid, or decomposed substance;\n(2) have been produced, prepared, packed, or held under unsanitary conditions where the product may have been rendered injurious to health, or where the product may have been contaminated with filth;\n(3) be packaged in a container that is composed, in whole or in part, of any poisonous or deleterious substance that may render the contents injurious to health;\n(4) contain any additives or excipients that have been found by the United States Food and Drug Administration to be unsafe for human or animal consumption;\n(5) contain a cannabinoid or an amount or percentage of cannabinoids that is different than the information stated on the label;\n(6) contain a cannabinoid, other than cannabidiol, cannabigerol, or a cannabinoid approved by the office, in an amount that exceeds the standard established in subdivision 2, paragraph (c); or\n(7) contain any contaminants for which testing is required by the office in amounts that exceed the acceptable minimum standards established by the office.\n(c) No product containing any cannabinoid may be sold to any individual who is under 21 years of age.\nThe office may enforce this section under the relevant provisions of section 342.19, including but not limited to issuing administrative orders, embargoing products, and imposing civil penalties.",
	"repealed": false
}