{
	"id": "161.24",
	"url": "https://www.revisor.mn.gov/statutes/cite/161.24",
	"title": "161.24 CHANGES REQUIRED BY CONSTRUCTION OF TRUNK HIGHWAY.",
	"text": "When the construction or reconstruction of a trunk highway results in a change of grade which necessitates a change of grade in intersecting or connecting highways or streets, including city streets, the cost of making the grade changes and any damages occasioned thereby shall be paid out of the trunk highway fund.\nWhen in the judgment of the commissioner, the establishment, construction, or reconstruction of a trunk highway requires, in the interest of safety or convenient public travel, a change in the location of any highway or street, including a city street, the commissioner may make the needed change in location after obtaining the approval of the road authority having jurisdiction over such highway or street. The cost of the change in location and any damages occasioned thereby shall be paid out of the trunk highway fund. All lands necessary therefor may be acquired by purchase, gift or condemnation. The highway or street as changed shall be the legally designated location thereof until otherwise changed as provided by law, and the maintenance and care of the highway or street shall be the responsibility of the road authority having jurisdiction thereof.\nOn determining, during construction, reconstruction, or maintenance of a trunk highway, that it is impractical to provide crossovers within the trunk highway limits for local highways or city streets designated for and carrying traffic of five tons or more per axle, and that it is necessary to provide a detour outside the limits of the trunk highway for traffic using such local highways or streets to meet local traffic needs, the commissioner may, upon request of the local road authority, expend trunk highway funds on the most practical detour to the extent necessary to provide a route reasonably adequate to carry such detoured traffic. The commissioner may provide temporary traffic-control devices on such detours as the commissioner deems necessary.\nWhen the establishment, construction, or reconstruction of a trunk highway closes off any other highway or street, including a city street, private road, or entrance at the boundary of the trunk highway, the commissioner may, in mitigation of damages or in the interest of safety and convenient public travel, construct a road either within or outside the limits of the trunk highway, connecting the closed-off highway, street, private road, or entrance with another public highway. In determining whether to build the road within or outside the limits of the trunk highway, the commissioner may take into consideration economy to the state and local traffic needs. The commissioner, in mitigation of damages, may connect the closed-off private road with the remaining portion of the private road or with another private road. All lands necessary for connecting a highway, street, private road, or entrance to another public highway or for connecting a closed-off private road to the remaining portion of a private road or to another private road, may be acquired by purchase, gift, or condemnation. Notwithstanding section 161.23, 161.43, 161.431, or 161.44, the commissioner may convey and quitclaim a fee title or easement held or owned by the state in land used to construct a road to connect the closed-off highway, street, entrance, or private road with another public highway or to reconnect the private road to the property served by the road.\nAny road so constructed outside the limits of the trunk highway shall be maintained by the road authority having jurisdiction over the highway or street closed off. Any private road constructed outside the limits of the trunk highway connecting the private road with a public highway shall be the responsibility of the property owners or owners served thereby.\nThe commissioner and the road authority affected may enter into agreements upon such terms as may be agreed upon, to provide for the construction of such grade changes, changes in location, detours, or connecting roads.",
	"repealed": false
}