{
	"id": "152.33",
	"url": "https://www.revisor.mn.gov/statutes/cite/152.33",
	"title": "152.33 VIOLATIONS.",
	"text": "In addition to any other applicable penalty in law, a manufacturer or an agent of a manufacturer who intentionally transfers medical cannabis to a person other than another registered manufacturer, a patient, a Tribal medical cannabis program patient, a registered designated caregiver or, if listed on the registry verification, a parent, legal guardian, or spouse of a patient is guilty of a felony punishable by imprisonment for not more than two years or by payment of a fine of not more than $3,000, or both. A person convicted under this subdivision may not continue to be affiliated with the manufacturer and is disqualified from further participation under sections 152.22 to 152.37.\n(a) In addition to any other applicable penalty in law, the commissioner may levy a fine of $250,000 against a manufacturer and may immediately initiate proceedings to revoke the manufacturer's registration, using the procedure in section 152.25, if:\n(1) an officer, director, or controlling person of the manufacturer pleads or is found guilty under subdivision 1 of intentionally transferring medical cannabis, while the person was an officer, director, or controlling person of the manufacturer, to a person other than allowed by law; and\n(2) in intentionally transferring medical cannabis to a person other than allowed by law, the officer, director, or controlling person transported or directed the transport of medical cannabis outside of Minnesota.\n(b) All fines collected under this subdivision shall be deposited in the state government special revenue fund.\nIn addition to any other applicable penalty in law, a patient, registered designated caregiver or, if listed on the registry verification, a parent, legal guardian, or spouse of a patient who intentionally sells or otherwise transfers medical cannabis to a person other than a patient, designated registered caregiver or, if listed on the registry verification, a parent, legal guardian, or spouse of a patient is guilty of a felony punishable by imprisonment for not more than two years or by payment of a fine of not more than $3,000, or both.\nA person who intentionally makes a false statement to a law enforcement official about any fact or circumstance relating to the medical use of cannabis to avoid arrest or prosecution is guilty of a misdemeanor punishable by imprisonment for not more than 90 days or by payment of a fine of not more than $1,000, or both. The penalty is in addition to any other penalties that may apply for making a false statement or for the possession, cultivation, or sale of cannabis not protected by sections 152.22 to 152.37. If a person convicted of violating this subdivision is a patient or a registered designated caregiver, the person is disqualified from further participation under sections 152.22 to 152.37.\nA person who knowingly submits false records or documentation required by the commissioner to register as a manufacturer of medical cannabis under sections 152.22 to 152.37 is guilty of a felony and may be sentenced to imprisonment for not more than two years or by payment of a fine of not more than $3,000, or both.\nA health care practitioner who knowingly refers patients to a manufacturer or to a designated caregiver, who advertises as a manufacturer, or who issues certifications while holding a financial interest in a manufacturer is guilty of a misdemeanor and may be sentenced to imprisonment for not more than 90 days or by payment of a fine of not more than $1,000, or both.\nA manufacturer shall be fined up to $1,000 for any violation of sections 152.22 to 152.37, or the regulations issued pursuant to them, where no penalty has been specified. This penalty is in addition to any other applicable penalties in law.",
	"repealed": false
}