{
	"id": "245G.08",
	"url": "https://www.revisor.mn.gov/statutes/cite/245G.08",
	"title": "245G.08 MEDICAL SERVICES.",
	"text": "An applicant or license holder must maintain a complete description of the health care services, nursing services, dietary services, and emergency physician services offered by the applicant or license holder.\nThe applicant or license holder must have written procedures for obtaining a medical intervention for a client, that are approved in writing by a physician who is licensed under chapter 147, advanced practice registered nurse who is licensed under chapter 148, or physician assistant who is licensed under chapter 147A, unless:\n(1) the license holder does not provide a service under section 245G.21; and\n(2) a medical intervention is referred to 911, the emergency telephone number, or the client's physician, advanced practice registered nurse, or physician assistant.\nA license holder must follow the emergency overdose treatment requirements in section 245A.242.\nThe license holder must have access to and document the availability of a licensed mental health professional to provide diagnostic assessment and treatment planning assistance.\n(a) A license holder must meet the requirements in this subdivision if a service provided includes the administration of medication.\n(b) A staff member, other than a licensed practitioner or nurse, who is delegated by a licensed practitioner or a registered nurse the task of administration of medication or assisting with self-medication, must:\n(1) successfully complete a medication administration training program for unlicensed personnel through an accredited Minnesota postsecondary educational institution. A staff member's completion of the course must be documented in writing and placed in the staff member's personnel file;\n(2) be trained according to a formalized training program that is taught by a registered nurse and offered by the license holder. A staff member's completion of the training must be documented in writing and placed in the staff member's personnel records; or\n(3) demonstrate to a registered nurse competency to perform the delegated activity. A registered nurse must be employed or contracted to develop the policies and procedures for administration of medication or assisting with self-administration of medication, or both.\n(c) A registered nurse must provide supervision as defined in section 148.171, subdivision 23. The registered nurse's supervision must include, at a minimum, monthly on-site supervision or more often if warranted by a client's health needs. The policies and procedures must include:\n(1) a provision that a delegation of administration of medication is limited to a method a staff member has been trained to administer and limited to:\n(i) a medication that is administered orally, topically, or as a suppository, an eye drop, an ear drop, an inhalant, or an intranasal; and\n(ii) an intramuscular injection of an opiate antagonist as defined in section 604A.04, subdivision 1, or epinephrine;\n(2) a provision that each client's file must include documentation indicating whether staff must conduct the administration of medication or the client must self-administer medication, or both;\n(3) a provision that a client may carry emergency medication such as nitroglycerin as instructed by the client's physician, advanced practice registered nurse, or physician assistant;\n(4) a provision for the client to self-administer medication when a client is scheduled to be away from the facility;\n(5) a provision that if a client self-administers medication when the client is present in the facility, the client must self-administer medication under the observation of a trained staff member;\n(6) a provision that when a license holder serves a client who is a parent with a child, the parent may only administer medication to the child under a staff member's supervision;\n(7) requirements for recording the client's use of medication, including staff signatures with date and time;\n(8) guidelines for when to inform a nurse of problems with self-administration of medication, including a client's failure to administer, refusal of a medication, adverse reaction, or error; and\n(9) procedures for acceptance, documentation, and implementation of a prescription, whether written, verbal, telephonic, or electronic.\nA license holder must have and implement written policies and procedures developed by a registered nurse that contain:\n(1) a requirement that each drug must be stored in a locked compartment. A Schedule II drug, as defined by section 152.02, subdivision 3, must be stored in a separately locked compartment, permanently affixed to the physical plant or medication cart;\n(2) a system which accounts for all scheduled drugs each shift;\n(3) a procedure for recording the client's use of medication, including the signature of the staff member who completed the administration of the medication with the time and date;\n(4) a procedure to destroy a discontinued, outdated, or deteriorated medication;\n(5) a statement that only authorized personnel are permitted access to the keys to a locked compartment;\n(6) a statement that no legend drug supply for one client shall be given to another client; and\n(7) a procedure for monitoring the available supply of an opiate antagonist as defined in section 604A.04, subdivision 1, on site and replenishing the supply when needed.",
	"repealed": false
}