{
	"id": "176.021",
	"url": "https://www.revisor.mn.gov/statutes/cite/176.021",
	"title": "176.021 APPLICATION TO EMPLOYERS AND EMPLOYEES.",
	"text": "Except as excluded by this chapter all employers and employees are subject to the provisions of this chapter.\nEvery employer is liable for compensation according to the provisions of this chapter and is liable to pay compensation in every case of personal injury or death of an employee arising out of and in the course of employment without regard to the question of negligence. The burden of proof of these facts is upon the employee.\nIf the injury was intentionally self-inflicted or the intoxication of the employee is the proximate cause of the injury, then the employer is not liable for compensation. The burden of proof of these facts is upon the employer.\nAll disputed issues of fact arising under this chapter shall be determined by a preponderance of the evidence, and in accordance with the principles laid down in section 176.001. Preponderance of the evidence means evidence produced in substantiation of a fact which, when weighed against the evidence opposing the fact, has more convincing force and greater probability of truth.\nQuestions of law arising under chapter 176 shall be determined on an even-handed basis in accordance with the principles laid down in section 176.001.\nThe liability imposed by subdivision 1 upon the employer extends to and binds those conducting the employer's business during insolvency, assignment for the benefit of creditors, and insofar as agreeable with the controlling federal law during bankruptcy.\nAll employers shall commence payment of compensation at the time and in the manner prescribed by this chapter without the necessity of any agreement or any order of the division. Except for medical, burial, and other nonperiodic benefits, payments shall be made as nearly as possible at the intervals when the wage was payable, provided, however, that payments for permanent partial disability shall be governed by section 176.101. If doubt exists as to the eventual permanent partial disability, payment shall be then made when due for the minimum permanent partial disability ascertainable, and further payment shall be made upon any later ascertainment of greater permanent partial disability. Prior to or at the time of commencement of the payment of permanent partial compensation, the employee and employer shall be furnished with a copy of the medical report upon which the payment is based and all other medical reports which the insurer has that indicate a permanent partial disability rating, together with a statement by the insurer as to whether the tendered payment is for minimum permanent partial disability or final and eventual disability. After receipt of all reports available to the insurer that indicate a permanent partial disability rating, the employee shall make available or permit the insurer to obtain any medical report that the employee has or has knowledge of that contains a permanent partial disability rating which the insurer does not already have. Permanent partial compensation pursuant to section 176.101 is payable in addition to but not concurrently with compensation for temporary total disability but is payable pursuant to section 176.101. Impairment compensation is payable concurrently and in addition to compensation for permanent total disability pursuant to section 176.101. Permanent partial compensation pursuant to section 176.101 shall be withheld pending completion of payment for temporary total disability, and no credit shall be taken for payment of permanent partial compensation against liability for temporary total or future permanent total disability. Liability on the part of an employer or the insurer for disability of a temporary total, temporary partial, and permanent total nature shall be considered as a continuing product and part of the employee's inability to earn or reduction in earning capacity due to injury or occupational disease and compensation is payable accordingly, subject to section 176.101. Permanent partial compensation is payable for functional loss of use or impairment of function, permanent in nature, and payment therefore shall be separate, distinct, and in addition to payment for any other compensation, subject to section 176.101. The right to receive temporary total, temporary partial, or permanent total disability payments vests in the injured employee or the employee's dependents under this chapter or, if none, in the employee's legal heirs at the time the disability can be ascertained and the right is not abrogated by the employee's death prior to the making of the payment.\nThe right to receive permanent partial compensation vests in an injured employee at the time the disability can be ascertained provided that the employee lives for at least 30 days beyond the date of the injury. Upon the death of an employee who is receiving economic recovery compensation or impairment compensation, further compensation is payable pursuant to section 176.101. Impairment compensation is payable under this paragraph if vesting has occurred, the employee dies prior to reaching maximum medical improvement, and the requirements and conditions under section 176.101, subdivision 3e, are not met.\nDisability ratings for permanent partial disability shall be based on objective medical evidence.\nPayments for permanent partial disability as provided in section 176.101, subdivision 2a, shall be made in the following manner:\n(a) If the employee returns to work, payment shall be made at the same intervals as temporary total payments were made;\n(b) If temporary total payments have ceased, but the employee has not returned to work, payment shall be made at the same intervals as temporary total payments were made;\n(c) If temporary total disability payments cease because the employee is receiving payments for permanent total disability or because the employee is retiring or has retired from the work force, then payment shall be made at the same intervals as temporary total payments were made;\n(d) If the employee completes a rehabilitation plan pursuant to section 176.102, but the employer does not furnish the employee with work the employee can do in a permanently partially disabled condition, and the employee is unable to procure such work with another employer, then payment shall be made at the same intervals as temporary total payments were made.\nIf an employee has returned to work for at least six months and has, if applicable, completed a rehabilitation plan, this section does not prevent the payment of compensation for permanent partial disability because the employee is receiving compensation for temporary partial disability. This subdivision is procedural and applies regardless of the date of injury.\nAny agreement by any employee or dependent to take as compensation an amount less than that prescribed by this chapter is void.\nIf employees of the state or a county, city or other political subdivision of the state who are entitled to the benefits of the workers' compensation law have, at the time of compensable injury, accumulated credits under a vacation, sick leave or overtime plan or system maintained by the governmental agency by which they are employed, the appointing authority may provide for the payment of additional benefits to such employees from their accumulated vacation, sick leave or overtime credits. Such additional payments to an employee may not exceed the amount of the total sick leave, vacation or overtime credits accumulated by the employee and shall not result in the payment of a total weekly rate of compensation that exceeds the weekly wage of the employee. Such additional payments to any employee shall be charged against the sick leave, vacation and overtime credits accumulated by such employee. Employees of a county, city or other political subdivision entitled to the benefits of the workers' compensation law may receive additional benefits pursuant to a collective bargaining agreement or other plan, entered into or in effect on or after January 1, 1980, providing payments by or on behalf of the employer and these additional benefits may be unrelated to any accumulated sick leave, holiday or overtime credits and need not be charged against any accumulation; provided that the additional payments shall not result in the payment of a total weekly rate of compensation that exceeds the weekly wage of the employee. The commissioner of the Department of Labor and Industry for the state or the governing body of any county, city or other political subdivision to which the provisions of this chapter apply, may adopt rules not inconsistent with this chapter for carrying out the provisions hereof relating to payment of additional benefits to employees from accumulated sick leave, vacation, overtime credits or other sources.\nWhere, in any city operating under a home rule charter, a mode and manner of compensation is provided by the charter which is different from that provided by this chapter, and the amount of compensation provided by the charter would, if taken thereunder, exceed the amount the employee is entitled to under this chapter for the same period, the employee shall, in addition to compensation under this chapter, receive under the charter an amount equal to the excess in compensation provided by the charter over what the employee is entitled to by this chapter; if the amount of compensation provided by the charter would, if taken thereunder, be equal to or less than the amount of compensation the employee is entitled to under this chapter for the same period, the employee shall take only under this chapter.\nIf an employee who is a public officer of the state or governmental subdivision continues to receive the compensation of office during a period when receiving benefits under the workers' compensation law for temporary total or temporary partial disability or permanent total disability and the compensation of office exceeds $100 a year, the amount of that compensation attributable to the period for which benefits under the workers' compensation law are paid shall be deducted from such benefits. If an employee covered by the Minnesota State Retirement System receives total and permanent disability benefits pursuant to section 352.113 or disability benefits pursuant to sections 352.95 and 352B.10, the amount of disability benefits shall be deducted from workers' compensation benefits otherwise payable. If an employee covered by the teachers retirement fund receives total and permanent disability benefits pursuant to section 354.48, the amount of disability benefits must be deducted from workers' compensation benefits otherwise payable. Notwithstanding the provisions of Minnesota Statutes 1994, section 176.132, a deduction under this subdivision does not entitle an employee to supplemental benefits under section 176.132.\nAmounts of compensation payable by an employer or an employer's insurer under this chapter may be rounded to the nearest dollar amount. An employer or insurer who elects to make such adjustments shall do so for all compensation payments under this chapter.\nInjuries incurred while participating in voluntary recreational programs sponsored by the employer, including health promotion programs, athletic events, parties, and picnics, do not arise out of and in the course of the employment even though the employer pays some or all of the cost of the program. This exclusion does not apply in the event that the injured employee was ordered or assigned by the employer to participate in the program.",
	"repealed": false
}