{
	"id": "169.09",
	"url": "https://www.revisor.mn.gov/statutes/cite/169.09",
	"title": "169.09 COLLISIONS.",
	"text": "The driver of any motor vehicle involved in a collision shall immediately stop the vehicle at the scene of the collision, or as close to the scene as possible, and reasonably investigate what was struck. If the driver knows or has reason to know the collision resulted in injury to or death of another, the driver in every event shall remain at the scene of the collision until the driver has fulfilled the requirements of this section as to the giving of information. The stop must be made without unnecessarily obstructing traffic.\nThe driver of any motor vehicle involved in a collision shall immediately stop the motor vehicle at the scene of the collision, or as close to the collision as possible, and reasonably investigate what was struck. If the driver knows or has reason to know the collision involves damage to a vehicle driven or attended by another, the driver in every event shall remain at the scene of the collision until the driver has fulfilled the requirements of this section as to the giving of information. The stop must be made without unnecessarily obstructing traffic.\n(a) The driver of any motor vehicle involved in a collision the driver knows or has reason to know results in bodily injury to or death of another, or damage to any vehicle driven or attended by another, shall give the driver's name, date of birth, mailing address or email address, and the registration plate number of the vehicle being driven. The driver shall, upon request and if available, exhibit the driver's license or permit to drive to any peace officer at the scene of the collision or who is investigating the collision. The driver shall render reasonable assistance to any individual injured in the collision.\n(b) If not given at the scene of the collision, the driver, within 72 hours after the accident, shall give, on request to any individual involved in the collision or to a peace officer investigating the collision, the name and address of the insurer providing vehicle liability insurance coverage, and the local insurance agent for the insurer.\nThe driver of any motor vehicle involved in a collision shall immediately stop the vehicle at the scene of the collision, or as close to the scene as possible, and reasonably investigate what was struck. If the driver knows or has reason to know the collision resulted in damage to any unattended vehicle, the driver must either locate and notify the driver or owner of the vehicle of the name and address of the driver and registered owner of the vehicle striking the unattended vehicle, report this same information to a peace officer, or leave in a conspicuous place in or secured to the vehicle struck, a written notice giving the name and address of the driver and of the registered owner of the vehicle doing the striking. The stop must be made without unnecessarily obstructing traffic.\nIf the driver of any vehicle involved in a collision knows or has reason to know the collision resulted only in damage to fixtures legally upon or adjacent to a highway, the driver must:\n(1) take reasonable steps to locate and notify the owner or person in charge of the property of the collision, the driver's name and address, and the license plate number of the vehicle being driven and must, upon request and if available, exhibit the driver's license; and\n(2) report the information required in clause (1) to a peace officer.\nWhenever any motor vehicle shall be operated within this state, by any person other than the owner, with the consent of the owner, express or implied, the operator thereof shall in case of accident, be deemed the agent of the owner of such motor vehicle in the operation thereof.\n[See Note.]\nThe driver of a vehicle involved in a collision resulting in bodily injury to or death of another shall, after compliance with this section and by the quickest means of communication, give notice of the collision to the local police department if the collision occurs within a municipality, to a State Patrol officer if the collision occurs on a trunk highway, or to the office of the sheriff of the county.\nMS 2020 [Repealed, 1Sp2021 c 5 art 4 s 151]\n(a) A peace officer who investigates in the regular course of duty an accident that is required to be reported under this section must submit an electronic or written report of the accident to the commissioner of public safety within ten days after the date of the accident. Within two business days after identification of a fatality that resulted from an accident, the reporting agency must notify the commissioner of the basic circumstances of the accident. A report or notification under this subdivision must be in the format as prescribed in subdivision 9.\n(b) Accidents on streets, highways, roadways, sidewalks, shoulders, shared use paths, or any other portion of a public right-of-way must be reported under the requirements of this section if the accident results in:\n(1) a fatality;\n(2) bodily injury to a person who, because of the injury, immediately receives medical treatment away from or at the scene of the accident;\n(3) one or more of the motor vehicles incurring disabling damage that requires a vehicle to be transported away from the scene of the accident by tow truck or other vehicle; or\n(4) damage to fixtures, infrastructure, or any other property alongside or on a highway.\n(c) An accident involving a school bus, as defined in section 169.011, subdivision 71, must be reported under the requirements of this section and section 169.4511.\n(d) An accident involving a commercial motor vehicle, as defined in section 169.781, subdivision 1, paragraph (a), must be reported under the requirements of this section and section 169.783.\n(e) Accidents occurring on public lands or trail systems that result in the circumstances specified in paragraph (b) must be reported under the requirements of this section.\nThe commissioner of public safety shall prescribe the format for the accident reports required under this section. Upon request the commissioner shall make available the format to police departments, coroners, sheriffs, garages, and other suitable agencies or individuals. The electronic or written report to be completed by individuals involved in accidents and by investigating peace officers must disclose the causes, existing conditions, and the individuals and vehicles involved.\n[Repealed, 2005 c 163 s 89]\nEvery coroner or other official performing like functions shall report in writing to the commissioner of public safety the death of any individual within the coroner's jurisdiction as the result of an accident involving a vehicle and the circumstances of the accident. The report must be made within 15 days after the death.\nIn the case of drivers killed in vehicle accidents and of the death of pedestrians 16 years of age or older, who die within four hours after an accident, the coroner or other official performing like functions shall examine the body and shall make tests as are necessary to determine the presence and percentage concentration of alcohol, and drugs if feasible, in the blood of the victim. This information must be included in each report submitted pursuant to the provisions of this subdivision and shall be tabulated on a monthly basis by the commissioner of public safety. This information may be used only for statistical purposes that do not reveal the identity of the deceased.\nThe individual in charge of any garage or repair shop to which is brought any vehicle that shows evidence of having been struck by any bullet shall immediately report to the local police or sheriff and to the commissioner of public safety within 24 hours after the vehicle is received, giving the engine number if any, registration plate number, and the name and address of the registered owner or operator of the vehicle.\n(a) All reports and supplemental information required under this section must be for the use of the commissioner of public safety and other appropriate state, federal, county, and municipal governmental agencies for accident analysis purposes, except:\n(1) upon written request, the commissioner of public safety, a full-service provider as defined in section 171.01, subdivision 33a, or any law enforcement agency must disclose the report required under subdivision 8 to:\n(i) any individual involved in the accident, the representative of the individual's estate, or the surviving spouse, or one or more surviving next of kin, or a trustee appointed under section 573.02;\n(ii) any other person injured in person, property, or means of support, or who incurs other pecuniary loss by virtue of the accident;\n(iii) legal counsel of a person described in item (i) or (ii);\n(iv) a representative of the insurer of any person described in item (i) or (ii); or\n(v) a city or county attorney or an attorney representing the state in an implied consent action who is charged with the prosecution of a traffic or criminal offense that is the result of a traffic crash investigation conducted by law enforcement;\n(2) the commissioner of public safety may verify with insurance companies vehicle insurance information to enforce sections 65B.48, 169.792, 169.793, 169.796, and 169.797;\n(3) the commissioner of public safety must provide the commissioner of transportation the information obtained for each traffic accident involving a commercial motor vehicle, for purposes of administering commercial vehicle safety regulations;\n(4) upon specific request, the commissioner of public safety must provide the commissioner of transportation the information obtained regarding each traffic accident involving damage to identified state-owned infrastructure, for purposes of debt collection under section 161.20, subdivision 4; and\n(5) the commissioner of public safety may give to the United States Department of Transportation commercial vehicle accident information in connection with federal grant programs relating to safety.\n(b) Accident reports and data contained in the reports are not discoverable under any provision of law or rule of court. A report must not be used as evidence in any trial, civil or criminal, or any action for damages or criminal proceedings arising out of an accident. However, the commissioner of public safety must furnish, upon the demand of any person who has or claims to have made a report or upon demand of any court, a certificate showing that a specified accident report has or has not been made to the commissioner solely to prove compliance or failure to comply with the requirements that the report be made to the commissioner.\n(c) Nothing in this subdivision prevents any individual who has made a report under this section from providing information to any individuals involved in an accident or their representatives or from testifying in any trial, civil or criminal, arising out of an accident, as to facts within the individual's knowledge. It is intended by this subdivision to render privileged the reports required, but it is not intended to prohibit proof of the facts to which the reports relate.\n(d) Disclosing any information contained in any accident report, except as provided in this subdivision, section 13.82, subdivision 3 or 6, or other statutes, is a misdemeanor.\n(e) The commissioner of public safety or full-service provider as defined in section 171.01, subdivision 33a, must charge authorized persons as described in paragraph (a) a $5 fee for a copy of an accident report. Of the $5 fee collected by the commissioner under this paragraph, 90 percent must be deposited in the driver and vehicle services operating account under section 299A.705 and ten percent must be deposited in the general fund. Of the $5 fee collected by a full-service provider, the provider must transmit 50 cents to the commissioner for deposit in the general fund, and the provider must retain the remainder. The commissioner may also furnish an electronic copy of the database of accident records, which must not contain personal or private data on an individual, to private agencies as provided in paragraph (g), for not less than the cost of preparing the copies on a bulk basis as provided in section 13.03, subdivision 3.\n(f) The fees specified in paragraph (e) notwithstanding, the commissioner and law enforcement agencies must charge commercial users who request access to response or incident data relating to accidents a fee not to exceed 50 cents per record. \"Commercial user\" is a user who in one location requests access to data in more than five accident reports per month, unless the user establishes that access is not for a commercial purpose. Of the money collected by the commissioner under this paragraph, 90 percent must be deposited in the driver and vehicle services operating account under section 299A.705 and ten percent must be deposited in the general fund.\n(g) The fees in paragraphs (e) and (f) notwithstanding, the commissioner must provide an electronic copy of the accident records database to the public on a case-by-case basis using the cost-recovery charges provided for under section 13.03, subdivision 3. The database provided must not contain personal or private data on an individual. However, unless the accident records database includes the vehicle identification number, the commissioner must include the vehicle registration plate number if a private agency certifies and agrees that the agency:\n(1) is in the business of collecting accident and damage information on vehicles;\n(2) will use the vehicle registration plate number only for identifying vehicles that have been involved in accidents or damaged, to provide this information to persons seeking access to a vehicle's history and not for identifying individuals or for any other purpose; and\n(3) will be subject to the penalties and remedies under sections 13.08 and 13.09.\n(a) The driver of any vehicle who violates subdivision 1 or 6 and who did not cause the collision is punishable as follows:\n(1) if the collision results in the death of another, the driver is guilty of a felony and may be sentenced to imprisonment for not more than three years, or to payment of a fine of not more than $5,000, or both;\n(2) if the collision results in great bodily harm to another, as defined in section 609.02, subdivision 8, the driver is guilty of a felony and may be sentenced to imprisonment for not more than two years, or to payment of a fine of not more than $4,000, or both; or\n(3) if the collision results in substantial bodily harm to another, as defined in section 609.02, subdivision 7a, the driver may be sentenced to imprisonment for not more than 364 days, or to payment of a fine of not more than $3,000, or both.\n(b) The driver of any vehicle involved in a collision resulting in bodily harm to another who violates subdivision 1 or 6 may be sentenced to imprisonment for not more than 364 days, or to payment of a fine of not more than $3,000, or both.\n(c) Any person who violates subdivision 3, 5, 8, 11, or 12 is guilty of a misdemeanor.\n(d) The driver of any vehicle involved in a collision resulting in damage to an attended vehicle who violates subdivision 2 is guilty of a misdemeanor.\n(e) The driver of any vehicle involved in a collision resulting in damage to an unattended vehicle who violates subdivision 4 is guilty of a misdemeanor.\n(f) The attorney in the jurisdiction in which the violation occurred who is responsible for prosecution of misdemeanor violations of this section shall also be responsible for prosecution of gross misdemeanor violations of this section.\nThe commissioner may suspend the license, or any nonresident's operating privilege, of any driver who willfully fails, refuses, or neglects to make report of a traffic accident as required under this section. A license suspension under this section is subject to the notice requirements of section 171.18, subdivision 2.\nIt is an affirmative defense to prosecution under subdivisions 1, 2, and 6 that the driver left the scene of the collision to take any individual suffering immediately demonstrable bodily injury in the collision to receive emergency medical care if the driver of the involved vehicle gives notice to a law enforcement agency as required by subdivision 6 as soon as reasonably feasible after the emergency medical care has been undertaken.\nThe use and operation by a resident of this state or the resident's agent, or by a nonresident or the nonresident's agent, of a motor vehicle within the state of Minnesota, is deemed an irrevocable appointment by the resident if absent from this state continuously for six months or more following an accident, or by the nonresident at any time, of the commissioner of public safety to be the resident's or nonresident's true and lawful attorney upon whom may be served all legal process in any action or proceeding against the resident or nonresident or the executor, administrator, or personal representative of the resident or nonresident growing out of the use and operation of a motor vehicle within this state, resulting in damages or loss to person or property, whether the damage or loss occurs on a highway or on abutting public or private property. This appointment is binding upon the nonresident's executor, administrator, or personal representative. The use or operation of a motor vehicle by the resident or nonresident is a signification of agreement that any process in any action against the resident or nonresident or executor, administrator, or personal representative of the resident or nonresident that is so served has the same legal force and validity as if served upon the resident or nonresident personally or on the executor, administrator, or personal representative of the resident or nonresident. Service of process must be made by serving a copy thereof upon the commissioner or by filing a copy in the commissioner's office, together with payment of a fee of $20, and is deemed sufficient service upon the absent resident or the nonresident or the executor, administrator, or personal representative of the resident or nonresident; provided that notice of service and a copy of the process are sent by mail by the plaintiff within ten days to the defendant at the defendant's last known address and that the plaintiff's affidavit of compliance with the provisions of this chapter is attached to the summons.\nIf an accident report has been prepared by a person involved in an accident and no report has been prepared by a law enforcement officer, the owners of the vehicles involved in an accident shall have the same access to information maintained by the Department of Public Safety, Driver and Vehicle Services Division, about the vehicles, their owners, and their drivers that would have been available to a law enforcement officer reporting on the accident.\nThe court in which the action is pending may order a continuance as may be necessary to afford the defendant reasonable opportunity to defend the action, not exceeding 90 days from the date of filing of the action in that court. The fee of $20 paid by the plaintiff to the commissioner at the time of service of the proceedings must be taxed in the plaintiff's cost if the plaintiff prevails in the suit. The commissioner shall keep a record of all processes so served, which must show the day and hour of service.\n(a) The provisions of this section apply equally whether the term \"accident\" or \"collision\" is used. The term \"accident\" or \"collision\" does not include:\n(1) an occurrence involving only boarding and alighting from a stationary motor vehicle;\n(2) an occurrence involving only the loading or unloading of cargo; or\n(3) intentional vehicle-to-vehicle contact when initiated by a peace officer:\n(i) to stop a perpetrator from fleeing in a motor vehicle, as defined in section 609.487, subdivision 3; or\n(ii) as an authorized use of force, as defined in section 609.06, subdivision 1; 609.065; or 609.066.\n(b) For purposes of this section, \"disabling damage\" means damage that prevents a motor vehicle from departing the scene of the accident in its usual manner in daylight after simple repairs. Disabling damage includes damage to a motor vehicle that could be driven from the scene of the accident but would be further damaged if so driven. Disabling damage does not include:\n(1) damage that can be remedied temporarily at the scene of the accident without special tools or parts;\n(2) tire disablement without other damage, even if no spare tire is available;\n(3) headlamp or taillight damage; or\n(4) damage that makes the turn signals, horn, or windshield wipers inoperable.\n(c) For purposes of this section, motor vehicle includes off-highway vehicles, as defined in section 84.771, and snowmobiles, as defined in section 84.81.\nThe commissioner must monitor and audit the furnishing of records by full-service providers under this section to ensure full-service providers are complying with this section, chapter 13, and United States Code, title 18, section 2721, et seq.",
	"repealed": false
}