{
	"id": "201.091",
	"url": "https://www.revisor.mn.gov/statutes/cite/201.091",
	"title": "201.091 REGISTERED VOTER LISTS; REPORTS; REGISTRATION PLACES.",
	"text": "Each county auditor shall prepare and maintain a current list of registered voters in each precinct in the county which is known as the master list. The master list must be created by entering each completed voter registration application received by the county auditor into the statewide registration system. It must show the name, residence address, and date of birth of each voter registered in the precinct. The information contained in the master list may only be made available to public officials for purposes related to election administration, jury selection, and in response to a law enforcement inquiry concerning a violation of or failure to comply with any criminal statute or state or local tax statute.\nBy February 15 of each year, the secretary of state shall prepare the master list for each county auditor. The records in the statewide registration system must be periodically corrected and updated by the county auditor. An updated master list for each precinct must be available for absentee voting at least 46 days before each election. A final corrected master list must be available seven days before each election.\n[Repealed, 1990 c 585 s 34]\n(a) The county auditor shall make available for inspection a public information list which must contain the name, address, year of birth, and voting history of each registered voter in the county. Data on applicants submitted pursuant to section 201.061, subdivision 1b, are not part of the public information list until the voter is registered or has voting history. The list must not include the party choice of any voter who voted in a presidential nomination primary. The telephone number must be included on the list if provided by the voter. The public information list may also include information on voting districts. The county auditor may adopt reasonable rules governing access to the list.\n(b) No individual inspecting the public information list shall tamper with or alter it in any manner. No individual who inspects the public information list or who acquires a list of registered voters prepared from the public information list may use any information contained in the list for purposes unrelated to elections, political activities, or law enforcement. The secretary of state may provide copies of the public information lists and other information from the statewide registration system for uses related to elections, political activities, or in response to a law enforcement inquiry from a public official concerning a failure to comply with any criminal statute or any state or local tax statute.\n(c) Before inspecting the public information list or obtaining a list of voters or other information from the list, the individual shall provide identification to the public official having custody of the public information list and shall state in writing that any information obtained from the list will not be used for purposes unrelated to elections, political activities, or law enforcement. Requests to examine or obtain information from the public information lists or the statewide registration system must be made and processed in the manner provided in the rules of the secretary of state.\n(d) Upon receipt of a statement signed by the voter that withholding the voter's name from the public information list is required for the safety of the voter or the voter's family, the secretary of state and county auditor must withhold from the public information list the name of a registered voter.\n(e) Notwithstanding paragraphs (b) and (c) and regardless of the purpose of the publication, a recipient of a public information list must not:\n(1) publish any of the information from the list on the Internet on any list, database, or other similar searchable format; or\n(2) sell, loan, provide access to, or otherwise surrender any information obtained from the list to any person or entity, except that an individual who obtains the public information list on behalf of an organization, entity, or political subdivision may distribute the information to the organization's, entity's, or political subdivision's volunteers or employees for purposes related to elections, political activities, or law enforcement in the case where the information is provided in response to a law enforcement inquiry from a public official concerning a failure to comply with any criminal statute or any state or local tax statute. Nothing in this section prohibits the preparation, use, or transfer, for purposes related to elections or political activities, of a database that includes data obtained from the public information list which is aggregated with data obtained from other sources provided that such database is used exclusively for purposes related to elections or political activities and no information from the list is published on the Internet. The prohibitions of this paragraph do not apply if the subject of the information provides express written permission to use the subject's data in a manner otherwise prohibited by this paragraph. For purposes of this paragraph, \"publish\" means information is made available to the general public.\nThe secretary of state must maintain a list of the voters who voted in a presidential nomination primary and the political party each voter selected. Information maintained on the list is private data on individuals as defined under section 13.02, subdivision 12, except that the secretary of state must provide to the chair of each major political party the list of voters who selected that party.\nThe county auditors and the secretary of state shall provide copies of the public information lists in electronic or other media to any voter registered in Minnesota within ten days of receiving a written or electronic request accompanied by payment of the cost of reproduction. The county auditors and the secretary of state shall make a copy of the list available for public inspection without cost. An individual who inspects or acquires a copy of a public information list may not use any information contained in it for purposes unrelated to elections, political activities, or law enforcement.\n[Repealed, 1983 c 303 s 24]\n[Repealed, 1983 c 303 s 24]\nEach county auditor shall designate a number of public buildings in those political subdivisions of the county where preregistration of voters is allowed as provided in section 201.061, subdivision 1, where eligible voters may register to vote.\nAn adequate supply of registration applications and instructions must be maintained at each designated location, and a designated individual must be available there to accept registration applications and transmit them to the county auditor.\nA person who, because of disability, needs assistance in order to determine eligibility or to register must be assisted by a designated individual. Assistance includes but is not limited to reading the registration form and instructions and filling out the registration form as directed by the eligible voter.\nA list provided for public inspection or purchase, or in response to a law enforcement inquiry, must not include a voter's date of birth or any part of a voter's Social Security number, driver's license number, identification card number, military identification card number, or passport number.",
	"repealed": false
}