{
	"id": "296A.03",
	"url": "https://www.revisor.mn.gov/statutes/cite/296A.03",
	"title": "296A.03 DISTRIBUTOR'S LICENSE.",
	"text": "No person shall produce, manufacture, or refine petroleum products in this state, or receive, distribute, sell, or use in this state petroleum products which have not been received in this state by a licensed distributor, or in any manner act as a distributor as defined in section 296A.01 without having been licensed by the commissioner as a distributor.\n(a) A distributor's license shall be issued to any responsible person who applies and qualifies as a distributor.\n(b) Upon application to the commissioner, the commissioner must issue a distributor's license to any person who:\n(1) receives petroleum products in this state for bulk storage and subsequent distribution by tank truck;\n(2) produces, manufactures, or refines petroleum products in this state;\n(3) imports petroleum products into this state via boat, barge, or pipeline for storage and subsequent delivery at or further transportation from boat, barge, or pipeline terminals in this state; or\n(4) holds a license and performs a function under the motor fuel tax law of an adjoining state equivalent to that of a distributor under this chapter, who desires to ship or deliver petroleum products from that state to persons in this state not licensed as distributors in this state and who agrees to assume with respect to all petroleum products so shipped or delivered the liabilities of a distributor receiving petroleum products in this state; provided, however, that any such license shall be issued only for the purpose of permitting such person to receive in this state the petroleum products so shipped or delivered. Except as herein provided, all persons licensed as distributors under this clause shall have the same rights and privileges and be subject to the same duties, requirements, and penalties as other licensed distributors.\n(c) The commissioner shall not issue or renew a license to a person otherwise eligible under this subdivision if the person:\n(1) has unpaid tax due under this chapter;\n(2) has unfiled tax returns or reports due under this chapter;\n(3) has had a license issued pursuant to this chapter revoked within the last five years; or\n(4) has had an equivalent license issued by another state or Canadian province revoked within the last five years for failure to pay a tax or file a tax return or report.\nAn application for a distributor's license must be accompanied by an initial fee of $25. Once licensed, a distributor must remit a $25 fee annually to maintain the license.\nEach license period shall be for one year ending each June 30.\nMS 2018 [Repealed, 1Sp2019 c 6 art 11 s 20]\nWhen the licensee shall voluntarily or involuntarily sell, dispose of, or discontinue business during the term of a license, the licensee shall immediately notify the commissioner in writing and shall within ten days surrender the license at the commissioner's office in St. Paul, Minnesota.",
	"repealed": false
}