{
	"id": "412.861",
	"url": "https://www.revisor.mn.gov/statutes/cite/412.861",
	"title": "412.861 PROSECUTIONS, VIOLATIONS OF ORDINANCES.",
	"text": "All prosecutions for violation of ordinances shall be brought in the name of the city upon complaint and warrant as in other criminal cases. If the accused be arrested without a warrant, a written complaint shall thereafter be made, to which the accused shall be required to plead, and a warrant shall issue thereon. The warrant and all other process in such cases shall be directed for service to any police officer, process officer, or court officer of any town or city in the county, to the sheriff of the county, or all of them.\nIt shall be a sufficient pleading of the ordinances or resolutions of the city to refer to them by section and number or chapter. They shall have the effect of general laws within the city and need not be given in evidence upon the trial of civil or criminal actions. Judgment shall be given, if for the plaintiff, for the amount of fine, penalty, or forfeiture imposed, with costs; and the judgment shall direct that, in default of payment, the defendant be committed to the county jail for such time, not exceeding 90 days, as the court shall see fit. The commitment shall state the amount of judgment, the costs, and the period of commitment. Every person so committed shall be received by the keeper of the jail and kept, at the expense of the county, until lawfully discharged. The committing court may release the defendant at any time upon payment of the fine and costs.\nAppeals may be taken to the court of appeals in the manner prescribed by court rule. On appealing, the defendant shall give bond to the city, to be approved by the court, conditioned that, if the judgment be affirmed in whole or in part, the defendant will pay the judgment, and all costs and damages awarded against the defendant on the appeal. In case of affirmance, execution may issue against both defendant and the defendant's sureties. Upon perfection of the appeal, defendant shall be discharged from custody.",
	"repealed": false
}