{
	"id": "116J.9926",
	"url": "https://www.revisor.mn.gov/statutes/cite/116J.9926",
	"title": "116J.9926 EMERGING DEVELOPER FUND PROGRAM.",
	"text": "(a) For the purposes of this section, the following terms have the meanings given.\n(b) \"Commissioner\" means the commissioner of employment and economic development.\n(c) \"Disadvantaged community\" means a community where the median household income is less than 80 percent of the area median income.\n(d) \"Eligible project\" means a project that is based in Minnesota and meets one or more of the following criteria:\n(1) it will stimulate community stabilization or revitalization;\n(2) it will be located within a census tract identified as a disadvantaged community or low-income community;\n(3) it will directly benefit residents of a low-income household;\n(4) it will increase the supply and improve the condition of affordable housing and homeownership;\n(5) it will support the growth needs of new and existing community-based enterprises that promote economic stability or improve the supply or quality of job opportunities; or\n(6) it will promote wealth creation, including by being a project in a neighborhood traditionally not served by real estate developers.\n(e) \"Emerging developer\" means a developer who:\n(1) has limited access to loans from traditional financial institutions; or\n(2) is a new or smaller developer who has engaged in educational training in real estate development; and\n(3) is either a:\n(i) minority as defined in section 116M.14, subdivision 6;\n(ii) woman;\n(iii) person with a disability, as defined in section 116M.14, subdivision 9; or\n(iv) low-income person.\n(f) \"Low-income person\" means a person who:\n(1) has a household income at or below 200 percent of the federal poverty level; or\n(2) has a family income that does not exceed 60 percent of the area median income as determined by the United States Department of Housing and Urban Development.\n(g) \"Partner organization\" means a community development financial institution or a similarly qualified nonprofit corporation, as determined by the commissioner.\n(h) \"Program\" means the emerging developer fund program created under this section.\nThe commissioner shall establish an emerging developer fund program to make grants to partner organizations to make grants and loans to emerging developers for eligible projects to transform neighborhoods statewide and promote economic development and the creation and retention of jobs in Minnesota. The program must also reduce racial and socioeconomic disparities by growing the financial capacity of emerging developers.\n(a) The commissioner shall design a competitive process to award grants to partner organizations to make grants and loans to emerging developers under subdivision 4.\n(b) A partner organization may use up to ten percent of grant funds for the administrative costs of the program.\n(a) Through the program, partner organizations shall offer emerging developers predevelopment grants and predevelopment, construction, and bridge loans for eligible projects according to a plan submitted to and approved by the commissioner.\n(b) Predevelopment grants must be for no more than $100,000. All loans must be for no more than $1,000,000.\n(c) Loans must be for a term set by the partner organization and approved by the commissioner of no less than six months and no more than eight years, depending on the use of loan proceeds.\n(d) Loans must be for zero interest or an interest rate of no more than the Wall Street Journal prime rate, as determined by the partner organization and approved by the commissioner based on the individual project risk and type of loan sought.\n(e) Loans must have flexible collateral requirements compared to traditional loans, but may require a personal guaranty from the emerging developer and may be largely unsecured when the appraised value of the real estate is low.\n(f) Loans must have no prepayment penalties and are expected to be repaid from permanent financing or a conventional loan, once that is secured.\n(g) Loans must have the ability to bridge many types of receivables, such as tax credits, grants, developer fees, and other forms of long-term financing.\n(h) At the partner organization's request and the commissioner's discretion, an emerging developer may be required to work with an experienced developer or professional services consultant who can offer expertise and advice throughout the development of the project.\n(i) All loan repayments must be paid into the emerging developer fund account created in this section to fund additional loans.\n(a) The following are eligible expenses for a predevelopment grant or loan under the program:\n(1) earnest money or purchase deposit;\n(2) building inspection fees and environmental reviews;\n(3) appraisal and surveying;\n(4) design and tax credit application fees;\n(5) title and recording fees;\n(6) site preparation, demolition, and stabilization;\n(7) interim maintenance and project overhead;\n(8) property taxes and insurance;\n(9) construction bonds or letters of credit;\n(10) market and feasibility studies; and\n(11) professional fees.\n(b) The following are eligible expenses for a construction or bridge loan under the program:\n(1) land or building acquisition;\n(2) construction-related expenses;\n(3) developer and contractor fees;\n(4) site preparation, environmental cleanup, and demolition;\n(5) financing fees, including title and recording;\n(6) professional fees;\n(7) carrying costs;\n(8) construction period interest;\n(9) project reserves; and\n(10) leasehold improvements and equipment purchase.\nAn emerging developer fund account is created in the special revenue fund in the state treasury. Money in the account is appropriated to the commissioner for grants to partner organizations to make loans under this section.\n(a) By January 15 of each year, beginning in 2025, each partner organization shall submit a report to the commissioner on the use of program funds and program outcomes.\n(b) By March 15 of each year, beginning in 2025, the commissioner shall submit a report to the chairs of the house of representatives and senate committees with jurisdiction over economic development on the use of program funds and program outcomes.",
	"repealed": false
}