{
	"id": "147A.09",
	"url": "https://www.revisor.mn.gov/statutes/cite/147A.09",
	"title": "147A.09 SCOPE OF PRACTICE.",
	"text": "Physician assistants shall practice medicine only under an established practice agreement.\nA physician assistant's scope of practice includes:\n(1) services within the training and experience of the physician assistant;\n(2) patient services customary to the practice of the physician assistant and the practice agreement; and\n(3) services within the parameters of the laws, rules, and standards of the facilities in which the physician assistant practices.\nPatient services may include, but are not limited to, the following:\n(1) taking patient histories and developing medical status reports;\n(2) performing physical examinations;\n(3) interpreting and evaluating patient data;\n(4) ordering, performing, or reviewing diagnostic procedures, including the use of radiographic imaging systems in compliance with Minnesota Rules 2007, chapter 4732, but excluding interpreting computed tomography scans, magnetic resonance imaging scans, positron emission tomography scans, nuclear scans, and mammography;\n(5) ordering or performing therapeutic procedures including the use of ionizing radiation in compliance with Minnesota Rules 2007, chapter 4732;\n(6) providing instructions regarding patient care, disease prevention, and health promotion;\n(7) providing patient care in the home and in health care facilities;\n(8) creating and maintaining appropriate patient records;\n(9) transmitting or executing specific orders;\n(10) prescribing, administering, and dispensing drugs, controlled substances, and medical devices, including administering local anesthetics, but excluding anesthetics injected in connection with an operating room procedure, inhaled anesthesia, and spinal anesthesia;\n(11) functioning as an emergency medical technician with permission of the ambulance service and in compliance with section 144E.127, and ambulance service rules adopted by the commissioner of health;\n(12) initiating evaluation and treatment procedures essential to providing an appropriate response to emergency situations;\n(13) certifying a patient's eligibility for a disability parking certificate under section 169.345, subdivision 2;\n(14) assisting at surgery; and\n(15) providing medical authorization for admission for emergency care and treatment of a patient under section 253B.051, subdivision 1.\nA physician assistant shall have a practice agreement at the practice level that describes the practice of the physician assistant. The practice agreement must be reviewed on an annual basis by a licensed physician within the same clinic, hospital, health system, or other facility as the physician assistant and has knowledge of the physician assistant's practice to ensure that the physician assistant's medical practice is consistent with the practice agreement. A document stating that the review occurred must be maintained at the practice level and made available to the board, upon request.\nNotwithstanding subdivision 1, a physician assistant may only perform spinal injections to address acute and chronic pain symptoms upon referral and in collaboration with a physician licensed under chapter 147. For purposes of performing spinal injections for acute or chronic pain symptoms, the physician assistant and one or more physicians licensed under chapter 147 must have a mutually agreed upon plan that designates the scope of collaboration necessary for treating patients with acute and chronic pain.\nMS 2022 [Repealed, 2024 c 127 art 22 s 1]",
	"repealed": false
}