{
	"id": "12.27",
	"url": "https://www.revisor.mn.gov/statutes/cite/12.27",
	"title": "12.27 MUTUAL AID, ARRANGEMENTS.",
	"text": "The director of each local organization for emergency management may, in collaboration with other public and private agencies within this state, develop or cause to be developed mutual aid arrangements for reciprocal emergency management aid and assistance in an emergency or disaster too great to be dealt with unassisted. These arrangements must be consistent with the local emergency operations plan and, in time of emergency, each local organization for emergency management and its members shall render assistance in accordance with the provisions of the mutual aid arrangements.\nThe state director or the director of each local organization for emergency management may, subject to the approval of the governor, enter into mutual aid arrangements with emergency management agencies or organizations in other states for reciprocal emergency management aid and assistance in case of disaster too great to be dealt with unassisted.\nSubject to the approval of the governor, the state director may enter into mutual aid agreements with emergency management agencies or organizations in Canadian provinces for reciprocal emergency management aid and assistance in case of disaster too great to be dealt with unassisted.\n(a) The governing body of a political subdivision shall designate a city administrator or manager, public safety director, police chief, fire chief, public works director, or other officer who, exercising discretion and considering the needs of the political subdivision and its inhabitants, may dispatch equipment and personnel as considered necessary if a danger of fire, hazard, casualty, or another similar occurrence exists outside the political subdivision and by its suddenness it would be impractical for the governing body itself to authorize the dispatch of equipment and personnel to combat that emergency or disaster.\n(b) Action under this subdivision is an act of the political subdivision. All provisions for compensation of personnel, rental of equipment, liability insurance coverage, workers' compensation insurance, and other matters pertaining to the political subdivision, its equipment, and personnel, apply in each case as if specifically authorized and directed.\n(c) The officer shall end the use of equipment and personnel when the need no longer exists or earlier at the officer's discretion if it appears to be in the best interest of the political subdivision.\nAt the request of another state, the governor, exercising discretion and considering the needs of this state and its inhabitants, may dispatch state equipment and personnel as deemed necessary if there is an emergency or disaster outside of this state.\nThe governor shall end the use of equipment and personnel when the need no longer exists or earlier at the governor's discretion if it appears to be in the best interest of the state.",
	"repealed": false
}