{
	"id": "626.92",
	"url": "https://www.revisor.mn.gov/statutes/cite/626.92",
	"title": "626.92 ENFORCEMENT AUTHORITY; FOND DU LAC BAND OF LAKE SUPERIOR CHIPPEWA.",
	"text": "As used in this section, \"band\" means the Fond du Lac Band of Lake Superior Chippewa, a federally recognized Indian tribe organized pursuant to the Indian Reorganization Act of 1934, United States Code, title 25, section 476, and which occupies the Fond du Lac Reservation pursuant to the Treaty of LaPointe, 10 Stat. 1109.\n(a) The band has the powers of a law enforcement agency, as defined in section 626.84, subdivision 1, paragraph (f), if all of the requirements of clauses (1) to (4) and paragraph (b) are met:\n(1) the band agrees to be subject to liability for its torts and those of its officers, employees, and agents acting within the scope of their employment or duties arising out of the law enforcement agency powers conferred by this section to the same extent as a municipality under chapter 466, and the band further agrees, notwithstanding section 16C.05, subdivision 7, to waive its sovereign immunity for purposes of claims arising out of this liability;\n(2) the band files with the Board of Peace Officer Standards and Training a bond or certificate of insurance for liability coverage with the maximum single occurrence amounts set forth in section 466.04 and an annual cap for all occurrences within a year of three times the single occurrence amount or establishes that liability coverage exists under the Federal Torts Claims Act, United States Code, title 28, section 1346(b), et al., as extended to the band pursuant to the Indian Self-Determination and Education Assistance Act of 1975, United States Code, title 25, section 450f(c);\n(3) the band files with the Board of Peace Officer Standards and Training a certificate of insurance for liability of its law enforcement officers, employees, and agents for lawsuits under the United States Constitution or establishes that liability coverage exists under the Federal Torts Claims Act, United States Code, title 28, section 1346(b) et al., as extended to the band pursuant to the Indian Self-Determination and Education Assistance Act of 1975, United States Code, title 25, section 450F(c); and\n(4) the band agrees to be subject to section 13.82 and any other laws of the state relating to data practices of law enforcement agencies.\n(b) The band may enter into written mutual aid or cooperative agreements with the Carlton County sheriff, the St. Louis County sheriff, and the city of Cloquet under section 471.59 to define and regulate the provision of law enforcement services under this section. If entered, the agreements must define the following:\n(1) the trust property involved in the joint powers agreement;\n(2) the responsibilities of the county sheriffs;\n(3) the responsibilities of the county attorneys; and\n(4) the responsibilities of the city of Cloquet city attorney and police department.\nThe band shall have concurrent jurisdictional authority under this section with the Carlton County and St. Louis County Sheriffs' Departments over crimes committed within the boundaries of the Fond du Lac Reservation if the requirements of subdivision 2, paragraph (a), are met, regardless of whether a cooperative agreement pursuant to subdivision 2, paragraph (b), is entered into.\nIf the band complies with the requirements set forth in subdivision 2, the band is authorized to appoint peace officers, as defined in section 626.84, subdivision 1, paragraph (c), who have the same powers as peace officers employed by local units of government.\nNothing in this section shall be construed to restrict the band's authority under federal law.\nThis section is limited to law enforcement authority only, and nothing in this section shall affect any other jurisdictional relationships or disputes involving the band.",
	"repealed": false
}