{
	"id": "82.66",
	"url": "https://www.revisor.mn.gov/statutes/cite/82.66",
	"title": "82.66 CONTRACTS.",
	"text": "(a) Requirement. Licensees shall obtain a signed listing agreement or other signed written authorization from the owner of real property or from another person authorized to offer the property for sale or lease before advertising to the general public that the real property is available for sale or lease.\nFor the purposes of this section \"advertising\" includes placing a sign on the owner's property that indicates that the property is being offered for sale or lease.\n(b) Contents. All listing agreements must be in writing and must include:\n(1) a definite expiration date;\n(2) a description of the real property involved;\n(3) the list price and any terms required by the seller;\n(4) the amount of any compensation or commission or the basis for computing the commission;\n(5) a clear statement explaining the events or conditions that will entitle a broker to a commission;\n(6) a clear statement explaining if the agreement may be canceled and the terms under which the agreement may be canceled;\n(7) information regarding an override clause, if applicable, including a statement to the effect that the override clause will not be effective unless the licensee supplies the seller with a protective list within 72 hours after the expiration of the listing agreement;\n(8) the following notice in not less than ten-point boldface type immediately preceding any provision of the listing agreement relating to compensation of the licensee:\n\"NOTICE: THE COMPENSATION FOR THE SALE, LEASE, RENTAL, OR MANAGEMENT OF REAL PROPERTY SHALL BE DETERMINED BETWEEN EACH INDIVIDUAL BROKER AND THE BROKER'S CLIENT.\";\n(9) for residential property listings, the following \"dual agency\" disclosure statement:\nIf a buyer represented by broker wishes to buy the seller's property, a dual agency will be created. This means that broker will represent both the seller(s) and the buyer(s), and owe the same duties to the buyer(s) that broker owes to the seller(s). This conflict of interest will prohibit broker from advocating exclusively on the seller's behalf. Dual agency will limit the level of representation broker can provide. If a dual agency should arise, the seller(s) will need to agree that confidential information about price, terms, and motivation will still be kept confidential unless the seller(s) instruct broker in writing to disclose specific information about the seller(s). All other information will be shared. Broker cannot act as a dual agent unless both the seller(s) and the buyer(s) agree to it. By agreeing to a possible dual agency, the seller(s) will be giving up the right to exclusive representation in an in-house transaction. However, if the seller(s) should decide not to agree to a possible dual agency, and the seller(s) want broker to represent the seller(s), the seller(s) may give up the opportunity to sell the property to buyers represented by broker.\nSeller's Instructions to Broker\nHaving read and understood this information about dual agency, seller(s) now instructs broker as follows:\n(10) a notice requiring the seller to indicate in writing whether it is acceptable to the seller to have the licensee arrange for closing services or whether the seller wishes to arrange for others to conduct the closing; and\n(11) for residential listings, a notice stating that after the expiration of the listing agreement, the seller will not be obligated to pay the licensee a fee or commission if the seller has executed another valid listing agreement pursuant to which the seller is obligated to pay a fee or commission to another licensee for the sale, lease, or exchange of the real property in question. This notice may be used in the listing agreement for any other type of real estate.\n(c) Prohibited provisions. Except as otherwise provided in paragraph (d), clause (2), licensees shall not include in a listing agreement a holdover clause, automatic extension, or any similar provision, or an override clause the length of which is more than six months after the expiration of the listing agreement.\n(d) Override clauses. (1) Licensees shall not seek to enforce an override clause unless a protective list has been furnished to the seller within 72 hours after the expiration of the listing agreement.\n(2) A listing agreement may contain an override clause of up to two years in length when used in conjunction with the purchase or sale of a business. The length of the override clause must be negotiable between the licensee and the seller of the business. The protective list provided in connection with the override clause must include the written acknowledgment of each party named on the protective list, that the business which is the subject of the listing agreement was presented to that party by the licensee.\n(e) Protective lists. A broker or salesperson has the burden of demonstrating that each person on the protective list has, during the period of the listing agreement, either made an affirmative showing of interest in the property by responding to an advertisement or by contacting the broker or salesperson involved or has been physically shown the property by the broker or salesperson. For the purpose of this section, the mere mailing or other distribution by a licensee of literature setting forth information about the property in question does not, of itself, constitute an affirmative showing of interest in the property on the part of a subsequent purchaser.\nFor listings of nonresidential real property which do not contain the notice described in paragraph (b), clause (11), the protective list must contain the following notice in boldface type:\n\"IF YOU RELIST WITH ANOTHER BROKER WITHIN THE OVERRIDE PERIOD AND THEN SELL YOUR PROPERTY TO ANYONE WHOSE NAME APPEARS ON THIS LIST, YOU COULD BE LIABLE FOR FULL COMMISSIONS TO BOTH BROKERS. IF THIS NOTICE IS NOT FULLY UNDERSTOOD, SEEK COMPETENT ADVICE.\"\n(a) Requirements. Licensees shall obtain a signed buyer's broker agreement from a buyer before performing any acts as a buyer's representative.\n(b) Contents. All buyer's broker agreements must be in writing and must include:\n(1) a definite expiration date;\n(2) the amount of any compensation or commission, or the basis for computing the commission;\n(3) a clear statement explaining the services to be provided to the buyer by the broker, and the events or conditions that will entitle a broker to a commission or other compensation;\n(4) a clear statement explaining if the agreement may be canceled and the terms under which the agreement may be canceled;\n(5) information regarding an override clause, if applicable, including a statement to the effect that the override clause will not be effective unless the licensee supplies the buyer with a protective list within 72 hours after the expiration of the buyer's broker agreement;\n(6) the following notice in not less than ten-point boldface type immediately preceding any provision of the buyer's broker agreement relating to compensation of the licensee:\n\"NOTICE: THE COMPENSATION FOR THE PURCHASE, LEASE, RENTAL, OR MANAGEMENT OF REAL PROPERTY SHALL BE DETERMINED BETWEEN EACH INDIVIDUAL BROKER AND THE BROKER'S CLIENT.\";\n(7) the following \"dual agency\" disclosure statement:\nIf the buyer(s) choose(s) to purchase a property listed by broker, a dual agency will be created. This means that broker will represent both the buyer(s) and the seller(s), and owe the same duties to the seller(s) that broker owes to the buyer(s). This conflict of interest will prohibit broker from advocating exclusively on the buyer's behalf. Dual agency will limit the level of representation broker can provide. If a dual agency should arise, the buyer(s) will need to agree that confidential information about price, terms, and motivation will still be kept confidential unless the buyer(s) instruct broker in writing to disclose specific information about the buyer(s). All other information will be shared. Broker cannot act as a dual agent unless both the buyer(s) and the seller(s) agree to it. By agreeing to a possible dual agency, the buyer(s) will be giving up the right to exclusive representation in an in-house transaction. However, if the buyer(s) should decide not to agree to a possible dual agency, and the buyer(s) want(s) broker to represent the buyer(s), the buyer(s) may give up the opportunity to purchase the properties listed by broker.\nBuyer's Instructions to Broker\n(8) for buyer's broker agreements which involve residential real property, a notice stating that after the expiration of the buyer's broker agreement, the buyer will not be obligated to pay the licensee a fee or commission if the buyer has executed another valid buyer's broker agreement pursuant to which the buyer is obligated to pay a fee or commission to another licensee for the purchase, lease, or exchange of real property.\n(c) Prohibited provisions. Licensees shall not include in a buyer's broker agreement a holdover clause, automatic extension, or any other similar provision, or an override clause the length of which is more than six months after the expiration of the buyer's broker agreement.\n(d) Override clauses. (1) Licensees shall not seek to enforce an override clause unless a protective list has been furnished to the buyer within 72 hours after the expiration of the buyer's broker agreement.\n(2) A buyer's broker agreement may contain an override clause of up to two years in length when used in conjunction with the purchase or sale of a business. The length of the override clause must be negotiable between the licensee and the buyer of the business. The protective list provided in connection with the override clause must include the written acknowledgement of each party named on the protective list, that the business that is the subject of the buyer's broker agreement was presented to that party by the licensee.\n(e) Protective lists. A licensee has the burden of demonstrating that each property on the protective list has been shown to the buyer, or specifically brought to the attention of the buyer, during the time the buyer's broker agreement was in effect.\n(f) Application. This section applies only to residential real property transactions.",
	"repealed": false
}